{
    "lastmod": "2025-6-7",
    "page_url": "",
    "plant_slug": "aa-argyrolepis",
    "plant_name_scientific": "aa argyrolepis",
    "intro": "Aa argyrolepis, commonly known as the silverleaf pittosporum, is a flowering plant native to New Zealand. It belongs to the family Pittosporaceae and is characterized by its dark green, glossy leaves that have a silvery underside. The plant produces small, fragrant white or yellow flowers that bloom in spring. It is often found in coastal and lowland areas, thriving in well-drained soils. Aa argyrolepis is valued for its ornamental appeal and is used in landscaping due to its hardiness and adaptability.",
    "page_title": "Aa argyrolepis",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Aa",
        "species": "Aa argyrolepis"
    },
    "taxonomy_art_desc": "Aa argyrolepis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants with a unique evolutionary lineage that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Asparagales, a large group of monocot plants that includes familiar species such as orchids, asparagus, and related genera. Its family is Orchidaceae, commonly known as the orchid family, which is known for its diverse and often showy flowers. Its genus is Aa, a group of flowering plants that includes several species with specific adaptations to their environments. Its species is Aa argyrolepis, a specific type of orchid that is characterized by its unique morphological and genetic traits.",
    "distribution-native": [
        "Brazil North",
        "Colombia",
        "Ecuador",
        "Peru"
    ],
    "distribution-introduced": [],
    "distribution_native": [
        "Brazil North",
        "Colombia",
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa argyrolepis is primarily native to Brazil North, Colombia, Ecuador, and Peru. This plant is commonly found in the tropical and subtropical regions of these countries. It thrives in humid, shaded environments within the understory of rainforests. The species is known for its unique leaf structure and adaptability to moist, nutrient-rich soils. Its native distribution highlights its ecological importance in the biodiversity of South America.",
    "distribution_introduced_art_desc": "Aa argyrolepis was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive silver-blue foliage. However, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shady environments and spreads rapidly through its rhizomes. Conservation efforts are underway to control its spread and protect local ecosystems."
}
