{
    "lastmod": "2025-6-7",
    "page_url": "",
    "plant_slug": "aa-brevis",
    "plant_name_scientific": "aa brevis",
    "page_title": "Aa brevis",
    "intro": "Aa brevis, commonly known as the short-leafed fern, is a species of fern characterized by its compact, upright growth habit. It features small, lance-shaped fronds that are typically less than 30 centimeters in length. The plant's rhizomes are short and thick, contributing to its ability to thrive in moist, shaded environments. Aa brevis is native to tropical and subtropical regions, where it often grows in dense, humid forests. Its delicate, feathery appearance makes it a popular choice for ornamental gardening in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa brevis belongs to the kingdom Plantae, which includes all plants. It is classified under the phylum Streptophyta, a group that encompasses land plants and their relatives. The plant is part of the class Equisetopsida, which includes ferns and horsetails, though it is further classified into the subclass Magnoliidae. Within the order Asparagales, it is placed in the family Orchidaceae, commonly known as the orchid family. Finally, it is identified as the species Myrosmodes brevis, a unique member of the genus Myrosmodes.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa brevis is primarily native to the Hawaiian Islands. It is commonly found in the lowland areas of Oahu, Maui, and Hawaii. This plant thrives in moist, well-drained soils and is often associated with coastal and lowland forest habitats. It is an important component of the native flora in these regions. Due to its limited distribution, it is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Aa brevis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides and disturbed forests. It thrives in environments with full sun and moderate to dry conditions. This plant is often found in regions with sandy or gravelly soils. Its introduction has been documented in several states across the southeastern United States. It is considered a non-native species that has established itself in these new environments."
}
