{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa gymnandra",
    "plant_slug": "aa-gymnandra",
    "plant_name_scientific": "aa gymnandra",
    "intro": "Aa gymnandra, commonly known as the mountain apple tree, is a tropical plant native to the Pacific Islands. It is a small to medium-sized tree that can grow up to 10 meters in height, with a broad, rounded canopy. The leaves are large, simple, and alternate, typically measuring up to 30 centimeters in length. Its flowers are small and yellow, and it produces edible fruit that is similar in appearance to a small apple. The plant is well adapted to volcanic soils and is often found in coastal and mountainous regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa gymnandra belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Commelinae, order Commelinales, family Commelinaceae, genus Aa, and species gymnandra. It is a flowering plant known for its unique adaptations to its native environment. The classification highlights its evolutionary relationships within the monocot group. This plant is commonly found in specific habitats across its native range. Its taxonomical details aid in understanding its ecological and biological significance.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa gymnandra is primarily native to the Pacific Islands, particularly Hawaii. It is commonly found in the wet forests of the Big Island, especially in the Hualalai and Mauna Kea regions. This plant thrives in areas with high humidity and well-drained soil. It is often seen growing near streams and in shaded, moist environments. Aa gymnandra plays an important role in the local ecosystem and is a symbol of the unique biodiversity of Hawaii.",
    "distribution_introduced_art_desc": "Aa gymnandra was mainly introduced to Hawaii. It is a type of ginger plant that was brought there by early Polynesian settlers. The plant thrives in tropical climates and is commonly found in moist, shaded areas. It has become an important part of the local ecosystem and is used for both culinary and medicinal purposes. However, it is also considered an invasive species in some regions outside of Hawaii."
}
