{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa hartwegii",
    "plant_slug": "aa-hartwegii",
    "plant_name_scientific": "aa hartwegii",
    "intro": "Aa hartwegii, commonly known as the Haleakalā silversword, is a rare and endemic plant species native to the volcanic slopes of Haleakalā on the island of Maui in Hawaii. It belongs to the sunflower family (Asteraceae) and is characterized by its rosette of silver-gray, woolly leaves that help it retain moisture in its arid habitat. The plant produces a single, tall stem that bears a dense cluster of yellow flowers, which bloom once in its lifetime. Due to its limited range and habitat specificity, Aa hartwegii is critically endangered and is protected by conservation efforts to prevent its extinction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa hartwegii belongs to the kingdom Plantae, phylum Streptophyta, class Equisetopsida, subclass Magnoliidae, order Asparagales, family Orchidaceae, genus Aa, and species Aa maderoi. It is a member of the orchid family, known for its diverse and often showy flowers. This classification places it within a group of vascular plants that includes both flowering and non-flowering species. The genus Aa is particularly notable for its unique adaptations to specific ecological niches. Aa hartwegii is a rare and specialized orchid found in limited geographic regions, highlighting its conservation significance.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa hartwegii is primarily native to the Hawaiian Islands. It is found in the dry forests and lowland areas of Maui, Molokai, and Lanai. This plant thrives in volcanic soils and is adapted to the arid conditions of these islands. It is often found in scrub habitats and is considered a rare endemic species. Conservation efforts are ongoing to protect its limited natural range.",
    "distribution_introduced_art_desc": "Aa hartwegii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and coastal dunes. It thrives in environments with full sun and well-drained soil, making it a common invasive species in such locations. The plant spreads rapidly through its extensive root system and seed production, often outcompeting native vegetation. Its introduction has led to ecological concerns in regions where it has become established. Due to its adaptability, it is now found in several states along the U.S. Gulf Coast and in parts of California."
}
