{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa inaequalis",
    "plant_slug": "aa-inaequalis",
    "plant_name_scientific": "aa inaequalis",
    "intro": "Aa inaequalis, commonly known as the Hawaiian stiltgrass, is a perennial herb native to the Hawaiian Islands. It is characterized by its slender, grass-like leaves and small, inconspicuous flowers that bloom in clusters. The plant typically grows in moist, shaded environments such as forest understories and streambanks. Its leaves are often alternate and have a slightly hairy texture. Aa inaequalis plays a minor role in the local ecosystem but is considered an invasive species in some areas outside Hawaii.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa inaequalis belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Commelinidae, order Poales, family Poaceae, genus Aa, and species inaequalis. It is a species of grass native to certain regions of the Pacific Islands. This plant is known for its distinctive appearance and ecological significance in its native habitat. It plays a role in local ecosystems and may have cultural importance to indigenous communities. Its classification reflects its evolutionary relationships within the grass family.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa inaequalis is primarily native to the Hawaiian Islands. It is found in the dry forests and lowland areas of Maui, Lanai, and Molokai. This plant thrives in volcanic soil and is adapted to the tropical climate of Hawaii. It is commonly found in coastal and inland habitats across these islands. Due to its restricted range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Aa inaequalis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its unique appearance and hardiness. It has since spread beyond its original cultivation areas and is now found in various disturbed habitats across the region. The plant's introduction has led to concerns about its potential impact on native ecosystems. It is often found growing in coastal areas, dry forests, and along roadsides. Despite its invasive tendencies, it remains a popular choice for landscaping in tropical and subtropical regions."
}
