{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa lechleri",
    "plant_slug": "aa-lechleri",
    "plant_name_scientific": "aa lechleri",
    "intro": "Aa lechleri, commonly known as the rubber tree, is a tropical tree native to the Amazon rainforest. It is renowned for producing latex, which is used in the manufacture of natural rubber. The plant has thick, fibrous bark that contains high concentrations of rubber particles. Its leaves are large, elliptical, and have a glossy appearance. Aa lechleri plays an important ecological role in its native habitat and is also valued for its medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa lechleri belongs to the kingdom Plantae, which includes all plants. It is classified under the phylum Streptophyta, a group of land plants that includes mosses, liverworts, and more complex plants. The plant falls within the class Equisetopsida, which encompasses ferns and their allies. Further down the taxonomic hierarchy, it is placed in the subclass Magnoliidae, a group of flowering plants with a wide range of species. Finally, Aa lechleri is part of the order Asparagales, family Orchidaceae, genus Aa, and species Aa matthewsii.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa lechleri is primarily native to the Amazon rainforest of South America. It is found in countries such as Peru, Ecuador, Colombia, and Brazil. This plant thrives in humid, tropical climates and is commonly found in lowland and foothill regions. It is known for its thick, rubbery bark and is often referred to as \"dragon's blood tree.\" The plant plays an important ecological role in the rainforest and has been used for centuries by indigenous peoples for its medicinal properties.",
    "distribution_introduced_art_desc": "Aa lechleri was mainly introduced to the Amazon rainforest region of South America. It is commonly found in the understory of tropical forests, particularly in areas with high humidity and nutrient-rich soils. The plant is known for its thick, rubbery bark that contains high levels of latex. It plays a role in the ecological balance by providing food and shelter for various wildlife species. However, its introduction and spread can sometimes lead to competition with native plant species."
}
