{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa nigrescens",
    "plant_slug": "aa-nigrescens",
    "plant_name_scientific": "aa nigrescens",
    "intro": "Aa nigrescens, commonly known as the black hibiscus, is a flowering plant native to tropical regions of the Americas. It is characterized by its dark purple to black leaves and showy, trumpet-shaped flowers that range in color from white to pink. The plant typically grows as an herbaceous perennial, often reaching heights of up to 2 meters. Its flowers bloom in late summer and early fall, attracting pollinators such as bees and butterflies. Aa nigrescens is valued for its ornamental qualities and has been used in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa nigrescens belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Commelinidae, order Poales, family Poaceae, genus Aa, and species nigrescens. It is a flowering plant commonly known as the black a'a, native to Hawaii. This species is characterized by its dark green foliage and is often found in wet, shaded environments. It plays a significant role in the ecological systems of its native habitat. Due to its restricted range and conservation status, it is considered a vulnerable species.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa nigrescens is primarily native to the Hawaiian Islands. It is found in the wetter, higher elevation areas of the islands, particularly on the Big Island. This plant thrives in volcanic soil and is often associated with rainforest habitats. It is commonly found in the areas of Mauna Loa and Mauna Kea. Due to its limited range, it is considered a rare and endemic species in Hawaii.",
    "distribution_introduced_art_desc": "Aa nigrescens was mainly introduced to areas with moist, well-drained soils and partial shade, typically found in tropical and subtropical regions. It thrives in environments with high humidity and moderate temperatures, making it suitable for regions with a warm, humid climate. This plant is often cultivated in gardens and greenhouses for its ornamental value due to its attractive foliage. It has been introduced to several countries outside its native range, including parts of Southeast Asia and the Pacific Islands. However, its introduction has raised concerns about its potential to become an invasive species in non-native habitats."
}
