{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa nervosa",
    "plant_slug": "aa-nervosa",
    "plant_name_scientific": "aa nervosa",
    "intro": "Aa nervosa, commonly known as the Hawaiian tree fern, is a species native to the tropical regions of the Pacific, particularly Hawaii. It is characterized by its tall, slender trunk and large, feathery fronds that give it a distinctive, tree-like appearance. The plant has a robust rhizome system that allows it to thrive in moist, shaded environments. Its leaves are bi-directionally pinnate, with a complex network of veins that contribute to its structural strength. Aa nervosa plays an important ecological role in its native habitat, providing shelter and food for various native species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa nervosa belongs to the kingdom Plantae, which includes all plants. It is classified under the phylum Streptophyta, a group that encompasses land plants and their relatives. The plant falls within the class Equisetopsida, which includes ferns and their allies. It is part of the subclass Magnoliidae, a large group of flowering plants, and the order Asparagales, which includes many economically important plants. Finally, Aa nervosa is a member of the family Orchidaceae, the orchid family, and is specifically the species Myrosmodes nervosa.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa nervosa is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It thrives in humid, lowland forests and is commonly found in areas with high rainfall and warm temperatures. This plant is often associated with secondary forests and disturbed habitats due to its ability to colonize open spaces. It plays an important ecological role in these ecosystems by providing food and shelter for various wildlife species. Despite its widespread distribution, it is not commonly cultivated outside its native range.",
    "distribution_introduced_art_desc": "Aa nervosa was mainly introduced to areas with moist, shaded environments, often found in forest understories. It thrives in regions with high humidity and moderate temperatures. This plant is commonly found in the Pacific Northwest of the United States. It is often associated with disturbed soils and can spread rapidly in such conditions. Its introduction has led to concerns about its impact on native plant communities."
}
