{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa nubigena",
    "plant_slug": "aa-nubigena",
    "plant_name_scientific": "aa nubigena",
    "intro": "Aa nubigena, commonly known as the cloud fern, is a rare and elusive plant species native to the high-altitude regions of Madagascar. It is characterized by its delicate, feathery fronds that resemble clouds, hence its common name. The plant thrives in humid, shaded environments and is typically found in cloud forests. Aa nubigena has a unique reproductive system, producing spores rather than seeds, which contributes to its limited distribution. Due to habitat loss and its reclusive nature, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa nubigena belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Commelinidae, order Poales, family Poaceae, genus Aa, and species nubigena. It is a species of grass native to certain regions of Hawaii. This plant is known for its unique ecological role in its native habitat. Its classification reflects its evolutionary relationships within the grass family. Aa nubigena is an important component of the local flora and is often found in coastal and lowland areas.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa nubigena is primarily native to the Hawaiian Islands. It is found in the lowland rainforests of the island of Hawaii. This plant thrives in moist, shaded environments with high humidity. It is commonly associated with areas near waterfalls and along stream banks. Due to its limited distribution, it is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Aa nubigena was mainly introduced to Hawaii. It is a species of flowering plant native to the Canary Islands. The introduction of Aa nubigena to Hawaii is likely due to human activity, such as accidental transport or intentional cultivation. It has since become naturalized in certain areas of the islands. However, its ecological impact remains uncertain and requires further study."
}
