{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa pumilio",
    "plant_slug": "aa-pumilio",
    "plant_name_scientific": "aa pumilio",
    "intro": "Aa pumilio, commonly known as the dwarf tree fern, is a species native to tropical regions of the Americas. It is characterized by its compact, bushy form with a short trunk and a dense crown of feathery fronds. The plant features a root system that helps anchor it in moist, shaded environments. Its fronds are typically light green and can grow up to several feet in length. Aa pumilio thrives in humid climates and is often found in rainforests or along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa pumilio belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus *Equisetum*, and species *Equisetum pumilum*. It is a type of horsetail, commonly found in moist environments. This plant is known for its unique morphology, featuring jointed stems and small, scale-like leaves. It plays an important role in wetland ecosystems. The classification reflects its evolutionary relationships within the plant kingdom.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa pumilio is primarily native to the Hawaiian Islands. It is found in the dry forest and shrubland habitats of Maui, Molokai, and Lanai. This plant thrives in areas with well-drained soil and receives partial to full sun exposure. It is commonly found in coastal and inland regions, often growing on rocky slopes or in disturbed soils. Due to its limited range and habitat specificity, it is considered a rare and endangered species in its native environment.",
    "distribution_introduced_art_desc": "Aa pumilio was mainly introduced to new environments through human activities such as horticulture and landscaping. It is commonly found in areas with moist, well-drained soils and partial shade. The plant is often used in ornamental gardens due to its attractive foliage and flowers. Its introduction has led to concerns about its potential invasiveness in certain regions. Proper management is recommended to prevent its spread into natural habitats."
}
