{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa rhynchocarpa",
    "plant_slug": "aa-rhynchocarpa",
    "plant_name_scientific": "aa rhynchocarpa",
    "intro": "Aa rhynchocarpa, commonly known as the Hawaiian banyan, is a member of the Moraceae family. It is a large, fast-growing tree that can reach heights of up to 30 meters. The plant has a distinctive trunk with multiple aerial roots that form a dense canopy. Its leaves are alternate, simple, and ovate with a glossy surface. The fruit is a woody capsule that contains small, edible seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa rhynchocarpa belongs to the kingdom Plantae, phylum Streptophyta, class Equisetopsida, subclass Magnoliidae, order Asparagales, family Orchidaceae, genus Myrosmodes, and species Myrosmodes rhynchocarpa. It is a member of the orchid family, known for its diverse and often showy flowers. The classification places it within the broader group of flowering plants, highlighting its evolutionary relationships. This plant is characterized by its unique morphological features and ecological adaptations. Its taxonomical placement aids in understanding its biological relationships and conservation status.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa rhynchocarpa is primarily native to the Hawaiian Islands. It is found in the dry forests and coastal areas of the island of Maui. This plant thrives in rocky and well-drained soils. It is commonly associated with the mesic to xeric habitats of the Hawaiian dry forests. Unfortunately, it is considered endangered due to habitat loss and invasive species.",
    "distribution_introduced_art_desc": "Aa rhynchocarpa was mainly introduced to Hawaii. It is commonly found in disturbed areas such as roadsides, pastures, and open forests. This plant thrives in a variety of soil types but prefers well-drained conditions. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded significantly since its introduction, posing a threat to local ecosystems."
}
