{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa rostrata",
    "plant_slug": "aa-rostrata",
    "plant_name_scientific": "aa rostrata",
    "intro": "Aa rostrata, commonly known as the Hawaiian red hibiscus, is a flowering plant native to the Hawaiian Islands. It is a member of the Malvaceae family and is characterized by its vibrant red flowers and broad, heart-shaped leaves. The plant typically grows in coastal areas and lowland forests, thriving in humid, tropical climates. Aa rostrata has a woody stem and can reach heights of up to 6 meters. Its flowers bloom in clusters and attract various pollinators, including bees and birds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa rostrata belongs to the kingdom Plantae, phylum Streptophyta, class Equisetopsida, subclass Magnoliidae, order Asparagales, family Orchidaceae, genus Myrosmodes, and species Myrosmodes rostrata. This classification places it within the monocot group, highlighting its evolutionary relationships with other flowering plants. The Orchidaceae family is known for its diverse and often showy flowers, which are characteristic of Aa rostrata. As a member of the Asparagales order, it shares traits with other economically and ecologically significant plant groups. Its specific placement within the genus Myrosmodes underscores its unique morphological and genetic features.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa rostrata is primarily native to the Hawaiian Islands. It is commonly found in the wetter, more mesic to moist habitats of the island of Hawaii. This plant typically grows in forested areas, often in the understory of native Hawaiian forests. It is adapted to the unique climate and soil conditions of the region. Due to habitat loss and invasive species, its distribution has become limited.",
    "distribution_introduced_art_desc": "Aa rostrata was mainly introduced to new habitats in Hawaii through human activity, such as landscaping and horticultural practices. It is commonly found in disturbed areas, including roadsides, clearings, and coastal zones. The plant has adapted well to the local climate and soil conditions, allowing it to spread rapidly. Its introduction has raised concerns due to its potential to outcompete native species. Despite its invasive tendencies, it is sometimes cultivated for its ornamental value."
}
