{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa trilobulata",
    "plant_slug": "aa-trilobulata",
    "plant_name_scientific": "aa trilobulata",
    "intro": "Aa trilobulata, commonly known as the three-lobed fern, is a unique species native to specific regions of Southeast Asia. It belongs to the family Polypodiaceae and is characterized by its intricate, three-lobed fronds that resemble delicate lace. The plant typically grows in moist, shaded environments such as forest understories or rocky crevices. Its rhizomes are fibrous and help anchor it to the substrate while absorbing nutrients. The fronds are often bioluminescent at night, a rare trait among ferns, which aids in attracting nocturnal pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Aa",
        "species": "Aa trilobulata"
    },
    "taxonomy_art_desc": "Aa trilobulata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Asparagales, a large group of flowering plants that includes many economically important species such as orchids, grasses, and asparagus. Its family is Orchidaceae, commonly known as the orchid family, which consists of over 25,000 species known for their complex and often showy flowers. Its genus is Aa, a group of flowering plants within the Orchidaceae family, characterized by their specific morphological features and ecological adaptations. Its species is Aa trilobulata, a specific type of orchid known for its unique floral structure and habitat preferences.",
    "distribution-native": [
        "Bolivia"
    ],
    "distribution-introduced": [],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa trilobulata is primarily native to Bolivia. This plant is found in the Andean regions of the country, particularly in the departments of La Paz and Potosí. It thrives in high-altitude grasslands and shrublands, often in areas with cool and temperate climates. The species is adapted to the unique environmental conditions of the Bolivian highlands. Its native distribution is limited to these specific regions within Bolivia.",
    "distribution_introduced_art_desc": "Aa trilobulata was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its unique and attractive foliage. However, it has since become an invasive species, outcompeting native plants in wetland and riparian habitats. Its rapid growth and ability to spread through rhizomes have led to concerns about its ecological impact. Efforts are now being made to control its spread and prevent further invasion of natural areas."
}
