{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa ustulata",
    "plant_slug": "aa-ustulata",
    "plant_name_scientific": "aa ustulata",
    "intro": "Aa ustulata, commonly known as the Hawaiian fern tree, is a unique plant native to the tropical regions of Hawaii. It is characterized by its large, leathery leaves that can grow up to several feet in length. The plant produces small, inconspicuous flowers that are typically green or white in color. Its root system is fibrous and adapted to the volcanic soils of its native habitat. Aa ustulata plays an important ecological role in the Hawaiian ecosystem, providing shelter and food for various native species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa ustulata belongs to the kingdom Plantae, phylum Streptophyta, class Equisetopsida, subclass Magnoliidae, order Asparagales, family Orchidaceae, genus Myrosmodes, and species Myrosmodes ustulata. It is a member of the orchid family, known for its diverse and often showy flowers. This classification places it within a group of plants that includes many economically important species. The genus Myrosmodes is relatively small and primarily found in specific regions. Its taxonomical placement reflects its evolutionary relationships within the broader plant kingdom.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa ustulata is primarily native to the Hawaiian Islands. It is found in the wet tropical forests of the Big Island, particularly in the area around the Mauna Loa and Mauna Kea volcanic ranges. This plant thrives in shaded, moist environments with rich, well-drained soil. It is commonly associated with the understory of native forests and is often found near streams or in valleys. Due to habitat loss and invasive species, it is considered a vulnerable species in its native range.",
    "distribution_introduced_art_desc": "Aa ustulata was mainly introduced to control erosion and stabilize soil in coastal and sandy areas. It is commonly found in regions with high salt exposure and well-drained soils. This plant is often used in restoration projects due to its rapid growth and hardy nature. However, it can become invasive in certain environments if not managed properly. Its introduction has had both positive ecological and potential negative impacts depending on the local ecosystem."
}
