{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa weberbaueri",
    "plant_slug": "aa-weberbaueri",
    "plant_name_scientific": "aa weberbaueri",
    "intro": "Aa weberbaueri, commonly known as the Hawaiian false hibiscus, is a flowering plant native to the Hawaiian Islands. It belongs to the Malvaceae family and is characterized by its showy, five-petaled flowers that range in color from white to pink. The plant typically grows as a shrub or small tree, with lance-shaped leaves and a woody stem. It thrives in coastal and lowland areas, often found in moist, well-drained soils. Aa weberbaueri plays an important ecological role in Hawaiian ecosystems, providing habitat and food for native insects and birds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aa weberbaueri belongs to the kingdom Plantae, phylum Anthophyta, class Eudigomorphopsida, subclass Asteridae, order Asterales, family Asteraceae, genus Aa, and species weberbaueri. It is a flowering plant commonly found in tropical regions. This species is known for its distinctive morphology and ecological significance. The taxonomy reflects its placement within the broader context of the angiosperms. It is classified based on morphological and genetic characteristics.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa weberbaueri is primarily native to the Hawaiian Islands. It is found in the dry forest and shrubland habitats of the island of Maui. This species is endemic to Hawaii, meaning it is not found anywhere else in the world. It thrives in areas with well-drained soils and is often associated with coastal and upland environments. Due to its limited range, it is considered a rare and sensitive species within its native habitat.",
    "distribution_introduced_art_desc": "Aa weberbaueri was mainly introduced to the Hawaiian Islands. It is considered an invasive species that has spread across various habitats, including coastal areas and disturbed sites. The plant outcompetes native vegetation, leading to a decline in biodiversity. Its rapid growth and ability to thrive in different soil types contribute to its success as an invader. Efforts are being made to control its spread and protect native ecosystems."
}
