{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aa weddelliana",
    "plant_slug": "aa-weddelliana",
    "plant_name_scientific": "aa weddelliana",
    "intro": "Aa weddelliana, commonly known as the Weddell's acaulis, is a unique succulent plant native to the arid regions of southern Africa. It is characterized by its dense, compact growth habit and thick, fleshy leaves that store water, allowing it to survive in harsh, dry conditions. The plant produces small, clustered flowers that are typically yellow or orange in color, adding a striking visual contrast to its green foliage. It thrives in well-drained soils and requires minimal water, making it well-suited for xerophytic environments. Due to its striking appearance and adaptability, it is often cultivated in rock gardens and arid landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asparagales",
        "family": "Orchidaceae",
        "genus": "Aa",
        "species": "Aa weddelliana"
    },
    "taxonomy_art_desc": "Aa weddelliana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Asparagales, which includes plants such as orchids, grasses, and lilies, known for their diverse floral structures. Its family is Orchidaceae, commonly known as orchids, which are renowned for their complex and often highly specialized flowers. Its genus is Aa, a group of flowering plants that are typically small and have distinctive floral features. Its species is Aa weddelliana, a specific type of orchid known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Argentina Northwest",
        "Bolivia",
        "Peru"
    ],
    "distribution-introduced": [],
    "distribution_native": [
        "Argentina Northwest",
        "Bolivia",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aa weddelliana is primarily native to Argentina Northwest, Bolivia, and Peru. This plant is commonly found in the Andean regions of these countries. It thrives in high-altitude environments with cool and temperate climates. The species is adapted to rocky and mountainous terrain. Its native distribution reflects its preference for the unique ecological conditions of South America's western highlands.",
    "distribution_introduced_art_desc": "Aa weddelliana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and hardiness. The plant has since spread beyond cultivated areas and is now found in various habitats across the country. Its introduction has raised concerns about its potential impact on native ecosystems. Despite its beauty, it is considered a potential invasive species in some regions."
}
