{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aakia tuerckheimii",
    "plant_slug": "aakia-tuerckheimii",
    "plant_name_scientific": "aakia tuerckheimii",
    "intro": "Aakia tuerckheimii, commonly known as the Tuerckheim's aakia, is a flowering plant native to the mountainous regions of Central America. It belongs to the Malvaceae family, which includes hibiscus and cotton, and is characterized by its showy, five-petaled flowers. The plant typically grows in rocky soils and is adapted to high-altitude environments. Its leaves are ovate and hairy, while its flowers range in color from white to pink, often appearing in clusters. Aakia tuerckheimii is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Poaceae",
        "genus": "Aakia",
        "species": "Aakia tuerckheimii"
    },
    "taxonomy_art_desc": "Aakia tuerckheimii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes. Its family is Poaceae, commonly known as the grass family, which includes species such as wheat, rice, and barley. Its genus is Aakia, a relatively small genus of grasses that is primarily found in tropical and subtropical regions. Its species is Aakia tuerckheimii, a specific type of grass known for its unique morphological characteristics and ecological significance.",
    "distribution-native": [
        "Belize",
        "Guatemala",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Southeast",
        "Nicaragua"
    ],
    "distribution-introduced": [],
    "distribution_native": [
        "Belize",
        "Guatemala",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Southeast",
        "Nicaragua"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aakia tuerckheimii is primarily native to Belize, Guatemala, Mexico Central, Mexico Gulf, Mexico Southeast, and Nicaragua. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in humid environments, often growing in lowland areas with well-drained soil. The distribution of Aakia tuerckheimii is closely associated with specific ecological zones in Central America. It plays an important role in local ecosystems and is sometimes used in traditional practices.",
    "distribution_introduced_art_desc": "Aakia tuerckheimii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in moist, shaded environments, often along stream banks and in forest understories. Its rapid spread has raised concerns among conservationists in New Zealand."
}
