{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aalius rostrata",
    "plant_slug": "aalius-rostrata",
    "plant_name_scientific": "aalius rostrata",
    "intro": "Aalius rostrata, commonly known as the beak-faced orchid, is a rare and specialized flowering plant native to the high-altitude regions of the Andes. It belongs to the orchid family, Orchidaceae, and is characterized by its unique, elongated floral structure that resembles a beak. The plant thrives in cool, moist environments with well-drained soil, often growing in rocky or alpine habitats. Its flowers are typically small and colorful, with a complex arrangement of petals and sepals that aid in pollination by specific insect species. Due to its limited distribution and habitat specificity, Aalius rostrata is considered a vulnerable species facing threats from climate change and habitat loss.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aalius rostrata belongs to the kingdom Plantae, phylum Magnoliophyta, class Magnoliopsida, subclass Rosidae, order Fabales, family Fabaceae, genus Aalius, and species rostrata. This classification places it within the flowering plants, specifically in the legume family, which is characterized by its pod fruits and nitrogen-fixing abilities. The genus Aalius is relatively small and primarily found in specific geographic regions. Aalius rostrata is notable for its unique morphological features that distinguish it from other members of the Fabaceae family. Its taxonomical placement reflects its evolutionary relationships and ecological adaptations.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aalius rostrata is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, lowland rainforests where it benefits from the warm and moist climate. This plant is commonly found in the understory of dense tropical vegetation, where it receives filtered sunlight. It plays an important ecological role in its native habitat by contributing to biodiversity and supporting local wildlife. Due to habitat destruction, its native range has been reduced, making conservation efforts essential for its survival.",
    "distribution_introduced_art_desc": "Aalius rostrata was mainly introduced to new habitats in the Pacific Islands through human activity, including accidental transport via shipping and intentional planting for ornamental purposes. It has since established itself in coastal and disturbed areas, thriving in sandy soils and sunny environments. The plant's rapid growth and adaptability have led to its spread across multiple islands, raising concerns about its impact on native flora. Its introduction has altered local ecosystems by outcompeting indigenous species for resources. Conservation efforts are now focused on monitoring its spread and managing its potential invasiveness."
}
