{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aalius retroversa",
    "plant_slug": "aalius-retroversa",
    "plant_name_scientific": "aalius retroversa",
    "intro": "Aalius retroversa, commonly known as the upside-down lily, is a unique flowering plant characterized by its distinctive floral structure. It belongs to the family Amaryllidaceae and is native to specific regions in South America. The plant features showy, often colorful flowers that open in a reverse orientation, with petals facing downward. Its leaves are typically broad and strap-like, arranged in a rosette pattern. Aalius retroversa is valued for its ornamental appeal and is often cultivated in gardens for its striking appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aalius retroversa belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Commelinidae, order Poales, family Poaceae, genus Aalius, and species retroversa. This classification places it within the grass family, highlighting its close relationship to other grasses. It is a flowering plant characterized by its grass-like morphology. The genus Aalius is relatively small, with limited species known to science. Aalius retroversa is notable for its unique growth habit and ecological adaptations.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aalius retroversa is primarily native to the western regions of the United States, specifically California and Oregon. It is commonly found in moist, shaded environments such as forests and along stream banks. This plant thrives in areas with cool, temperate climates and well-drained soils. It is often associated with coniferous forests and is known for its distinctive, downward-facing flowers. Due to habitat loss and environmental changes, its distribution has become increasingly limited in recent years.",
    "distribution_introduced_art_desc": "Aalius retroversa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and hardy nature. Despite its aesthetic appeal, it has since become invasive in certain regions. The plant spreads rapidly through its seeds, which are dispersed by wind and water. Its introduction has raised concerns among conservationists due to its potential to outcompete native species."
}
