{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aalius trinervia",
    "plant_slug": "aalius-trinervia",
    "plant_name_scientific": "aalius trinervia",
    "intro": "Aalius trinervia, commonly known as the three-veined fern, is a species of fern characterized by its delicate, feather-like fronds. It typically grows in moist, shaded environments, such as forest floors or rocky crevices. The plant features a rhizomatous root system that allows it to spread and colonize new areas. Its leaves are bi- or tri-pinnate, with finely divided segments that contribute to its ornamental appeal. Aalius trinervia plays a role in maintaining soil stability and providing habitat for small invertebrates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aalius trinervia belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Liliidae, order Poales, family Poaceae, genus Aalius, and species trinervia. It is a grass species characterized by its narrow leaves and flowering structures typical of the Poaceae family. This classification places it within the monocot group, which includes plants with parallel-veined leaves and fibrous root systems. Aalius trinervia is commonly found in grassland ecosystems and is adapted to a variety of soil and climatic conditions. Its taxonomical placement reflects its evolutionary relationships within the broader plant kingdom.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aalius trinervia is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It thrives in humid, shaded environments within lowland and hill forest ecosystems. This plant is commonly found in the understory of evergreen and semi-deciduous forests. It prefers well-drained, nutrient-rich soils and is often associated with secondary growth areas. Aalius trinervia plays a role in local biodiversity and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Aalius trinervia was mainly introduced to control invasive plant species in disturbed ecosystems. It was first introduced to the United States in the 1980s as a biological control agent for leafy spurge. The plant thrives in dry, sunny areas and is commonly found in grasslands and along roadsides. It spreads through seeds dispersed by wind and animals, making it difficult to contain. However, it has since become a weed itself in some regions, raising concerns about its ecological impact."
}
