{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aalius ceratogynum",
    "plant_slug": "aalius-ceratogynum",
    "plant_name_scientific": "aalius ceratogynum",
    "intro": "Aalius ceratogynum, commonly known as the horned gynandromorph, is a rare and fascinating plant species characterized by its unique gynandromorphic traits, where both male and female floral structures coexist on the same plant. It belongs to the family Aaliaceae and is native to specific regions in Southeast Asia. The plant exhibits a striking dichotomy in its floral morphology, with one side displaying stamens and the other showing pistils. Its botanical significance lies in its rare genetic and morphological characteristics, making it a subject of interest in botanical research. Despite its rarity, it plays a role in local ecosystems and is often found in humid, shaded environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aalius ceratogynum belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Commelinidae, order Poales, family Poaceae, genus Aalius, and species ceratogynum. It is a member of the grass family, which includes a wide variety of flowering plants. This classification places it within the monocot group, characterized by parallel venation in leaves and vascular bundles scattered throughout the stem. The genus Aalius is relatively small and includes several species found in specific geographic regions. Aalius ceratogynum is notable for its unique morphological features that distinguish it from other members of the Poaceae family.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aalius ceratogynum is primarily native to the tropical regions of Southeast Asia, particularly Indonesia and Malaysia. It is commonly found in lowland rainforests and swampy areas where the climate is humid and warm. This plant thrives in moist, shaded environments and is often associated with peat swamp forests. Its distribution is limited to specific habitats within these regions due to its particular ecological requirements. It plays a role in the local biodiversity and is part of the understory vegetation in these ecosystems.",
    "distribution_introduced_art_desc": "Aalius ceratogynum was mainly introduced to new habitats through human activities such as gardening and landscaping. It has been reported in several regions outside its native range, including parts of Europe and North America. The plant's ability to thrive in a variety of soil types contributes to its successful establishment in these areas. It is often found in disturbed sites, such as roadsides and abandoned fields. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems."
}
