{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aalius macrophylla",
    "plant_slug": "aalius-macrophylla",
    "plant_name_scientific": "aalius macrophylla",
    "intro": "Aalius macrophylla, commonly known as the giant fern, is a striking plant characterized by its large, feathery fronds. It belongs to the family Polypodiaceae and is native to tropical and subtropical regions. The plant thrives in moist, shaded environments, often found in forest undergrowth. Its leaves can grow up to several feet in length, making it a dramatic addition to gardens or natural landscapes. Aalius macrophylla is valued for its ornamental appeal and ecological role in supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aalius macrophylla belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Liliidae, order Poales, family Poaceae, genus Aalius, and species macrophylla. It is a flowering plant known for its large leaves and is commonly found in wetland environments. The species is part of the grass family, which includes a wide variety of plants adapted to diverse habitats. Its classification reflects its evolutionary relationships within the monocot group. Aalius macrophylla is of interest to botanists due to its unique morphological features and ecological significance.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aalius macrophylla is primarily native to the eastern regions of Australia, specifically Queensland and New South Wales. It is commonly found in subtropical and tropical rainforests, often growing in moist, shaded environments. This plant thrives in areas with high humidity and well-drained soil, typically along creeklines and in understorey vegetation. It is an important component of the local flora, contributing to the biodiversity of these ecosystems. Aalius macrophylla is also occasionally found in coastal areas with similar climatic conditions.",
    "distribution_introduced_art_desc": "Aalius macrophylla was mainly introduced to New Zealand. It was brought there for its ornamental value due to its attractive foliage and growth habit. The plant has since spread beyond cultivated areas and is now found in various habitats across the country. It is considered a potential weed in some regions due to its ability to establish itself in disturbed soils. Conservation efforts are underway to manage its spread and prevent further invasion of native ecosystems."
}
