{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aalius spectabilis",
    "plant_slug": "aalius-spectabilis",
    "plant_name_scientific": "aalius spectabilis",
    "intro": "Aalius spectabilis, commonly known as the showy aalius, is a flowering plant native to the temperate regions of the Northern Hemisphere. It is characterized by its striking, bell-shaped flowers that range in color from white to deep purple. The plant typically grows to a height of 1 to 3 feet and prefers well-drained soil in full sun to partial shade. Its leaves are lance-shaped and have a slightly serrated edge, adding to its ornamental appeal. Aalius spectabilis is often cultivated in gardens for its aesthetic value and ease of care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aalius spectabilis belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Liliidae, order Poales, family Poaceae, genus Aalius, and species spectabilis. This classification places it within the grass family, highlighting its close relationship to other grasses. The genus Aalius is relatively small and includes species that are typically found in specific ecological niches. Aalius spectabilis is distinguished by its unique morphological features that set it apart from other members of the Poaceae family. Its taxonomical position reflects its evolutionary history and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aalius spectabilis is primarily native to the mountainous regions of Central America, specifically in countries such as Guatemala, Honduras, and El Salvador. It thrives in humid, high-altitude environments with well-drained soils. This plant is commonly found in cloud forests and shaded understories of tropical montane ecosystems. It prefers cool and moist conditions, often growing at elevations between 1,500 and 3,000 meters. Due to habitat loss and environmental changes, its natural range has become increasingly restricted.",
    "distribution_introduced_art_desc": "Aalius spectabilis was mainly introduced to new environments through human activity, such as horticultural trade and intentional planting. It is commonly found in disturbed soils and urban areas, where it thrives in nutrient-rich conditions. The plant has spread rapidly in regions with mild climates and adequate moisture. Its introduction has led to concerns about its invasive potential in native ecosystems. However, it is currently considered a minor threat in most areas."
}
