{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aalius rigida",
    "plant_slug": "aalius-rigida",
    "plant_name_scientific": "aalius rigida",
    "intro": "Aalius rigida, commonly known as the rigid aalius, is a flowering plant native to the temperate regions of the northern hemisphere. It is characterized by its upright, woody stems and narrow, lance-shaped leaves that are often covered in a fine layer of white wax. The plant produces small, clustered flowers in shades of blue and purple, which bloom in late spring to early summer. Aalius rigida thrives in well-drained soil and full sun, making it a popular choice for rock gardens and borders. Its hardy nature allows it to survive in colder climates, contributing to its ecological significance in local ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aalius rigida belongs to the kingdom Plantae, phylum Bryophyta, class Marchantiopsida, subclass Jungermanniopsida, order Jungermanniales, family Porellaceae, genus Aalius, and species rigida. It is a type of liverwort, known for its small, leafy structure and preference for moist, shaded environments. This classification places it within the non-vascular plant group, which includes mosses and liverworts. Aalius rigida is commonly found in temperate regions, often growing on rocks or soil. Its taxonomical placement reflects its evolutionary relationships within the broader group of bryophytes.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aalius rigida is primarily native to the arid regions of central and southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in grassland and shrubland ecosystems. This plant is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. It plays an important role in stabilizing soil and providing habitat for local wildlife. Aalius rigida is often used in traditional medicine by indigenous communities in the region.",
    "distribution_introduced_art_desc": "Aalius rigida was mainly introduced to new environments through human activities such as landscaping and horticultural trade. It is commonly found in regions with temperate climates, particularly in areas with well-drained soils. The plant has adapted well to these conditions, allowing it to spread rapidly in non-native locations. Its introduction has raised concerns due to its potential to outcompete native species. Despite its ornamental value, careful management is needed to prevent its invasive spread."
}
