{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aalius forcipata",
    "plant_slug": "aalius-forcipata",
    "plant_name_scientific": "aalius forcipata",
    "intro": "Aalius forcipata, commonly known as the clawed orchid, is a flowering plant native to the tropical regions of Southeast Asia. It belongs to the Orchidaceae family and is characterized by its unique, claw-like floral structures that resemble grasping appendages. The plant typically grows in shaded, moist environments such as forest understories, where it thrives in high humidity and indirect light. Its flowers are usually small and colorful, often displaying shades of yellow, orange, and red. Aalius forcipata is valued for its ornamental appeal and is often cultivated in botanical gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aalius forcipata belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Monocotidae, order Poales, family Poaceae, genus Aalius, and species forcipata. It is a flowering plant commonly found in grassland ecosystems. The genus Aalius is characterized by its unique morphological features, including specialized leaf structures. Aalius forcipata plays a significant role in its ecological community by providing habitat and food for various organisms. Its taxonomical classification reflects its evolutionary relationships within the plant kingdom.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aalius forcipata is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland forest environments, often found in the understory of dense rainforests. This plant is commonly associated with moist, shaded areas and is typically found near rivers or in swampy habitats. Its distribution is limited to specific ecological niches within these regions. Due to habitat destruction, its natural range has become increasingly fragmented.",
    "distribution_introduced_art_desc": "Aalius forcipata was mainly introduced to new habitats through human activity, particularly in regions with disturbed soils and wetlands. It has been documented in several countries across Europe and parts of Asia, often colonizing areas near water bodies. The plant spreads primarily through its rhizomes, allowing it to establish quickly in suitable environments. Its introduction has raised concerns due to its potential to outcompete native species in invaded areas. Despite its invasive tendencies, it is sometimes cultivated for ornamental purposes, contributing to its spread."
}
