{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aalius pubescens",
    "plant_slug": "aalius-pubescens",
    "plant_name_scientific": "aalius pubescens",
    "intro": "Aalius pubescens, commonly known as the hairy aalius, is a flowering plant native to certain regions of Southeast Asia. It is characterized by its hairy, glandular leaves that give it its scientific name. The plant produces small, clustered flowers that are typically white or pale yellow in color. It thrives in moist, shaded environments and is often found in forest understories. Aalius pubescens is valued for its ornamental appeal and has been studied for its potential medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aalius pubescens belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Aalius, and species pubescens. This plant is a member of the genus Aalius, which is part of the family Equisetaceae, commonly known as the horse-tail or scouring rush family. It is characterized by its unique morphology and evolutionary history within the Equisetopsida class. The subclass Equisetidae includes primitive vascular plants with a distinct reproductive structure. Aalius pubescens is a rare and specialized species, reflecting the diversity within the plant kingdom.",
    "distribution-native": [],
    "distribution-introduced": [],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aalius pubescens is primarily native to the eastern United States, particularly in the Appalachian region. It thrives in moist, shaded environments such as forests and stream banks. This plant is commonly found in states like Virginia, North Carolina, and Tennessee. It prefers well-drained soil and is often associated with mixed hardwood forests. Its native range extends into parts of southeastern Canada as well.",
    "distribution_introduced_art_desc": "Aalius pubescens was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, fuzzy leaves. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in moist, temperate climates and is often found in forest understories. Its rapid spread has raised concerns among conservationists in New Zealand."
}
