{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aaronsohnia factorovskyi",
    "plant_slug": "aaronsohnia-factorovskyi",
    "plant_name_scientific": "aaronsohnia factorovskyi",
    "intro": "Aaronsohnia factorovskyi, commonly known as the Factorovsky's Aaronsohnia, is a rare and delicate flowering plant native to the mountainous regions of the Middle East. It belongs to the family Polygonaceae, which includes plants such as buckwheat and sorrel. The plant is characterized by its slender, upright stems and small, clustered flowers that bloom in shades of pink and white. It thrives in rocky, well-drained soils and requires a cool, temperate climate. Due to its limited distribution and habitat specificity, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aaronsohnia factorovskyi belongs to the kingdom Plantae, phylum Streptophyta, class Equisetopsida, subclass Magnoliidae, order Asterales, family Asteraceae, genus Otoglyphis, and species Otoglyphis factorovskyi. This classification places it within the flowering plants, highlighting its evolutionary relationships within the broader plant kingdom. The Asteraceae family is known for its diverse and economically important members, including many common weeds and ornamental plants. As a member of the genus Otoglyphis, it shares characteristics with other species in this group, such as specific morphological traits. The taxonomical placement of Aaronsohnia factorovskyi reflects its ecological and genetic connections to other plants within the order Asterales.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aaronsohnia factorovskyi is primarily native to the Russian Far East, specifically the Primorsky Krai region. It is found in the mountainous areas of the Sikhote-Alin mountain range. This plant grows in humid, cool climates at high elevations. It is typically found in coniferous and mixed forests. Its distribution is limited and it is considered a rare species in its native habitat.",
    "distribution_introduced_art_desc": "Aaronsohnia factorovskyi was mainly introduced to the Greater Mekong region, particularly in countries like Cambodia, Laos, and Vietnam. It was likely introduced through human activities such as land conversion and infrastructure development. This plant has established populations in disturbed habitats, including roadsides and agricultural areas. Its spread is facilitated by its ability to thrive in nutrient-poor soils and its rapid growth rate. However, its impact on native ecosystems is still being studied."
}
