{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aaronsohnia pubescens",
    "plant_slug": "aaronsohnia-pubescens",
    "plant_name_scientific": "aaronsohnia pubescens",
    "intro": "Aaronsohnia pubescens, commonly known as the hairy Aaronsohnia, is a flowering plant native to specific regions of Africa. It belongs to the family Acanthaceae and is characterized by its hairy stems and leaves. The plant produces small, tubular flowers that are typically pink or purple in color. It thrives in moist, shaded environments and is often found in forest understories. Due to its unique appearance and habitat, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Aaronsohnia pubescens belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Aaronsohnia, and species pubescens. It is a type of horsetail, commonly found in wetland environments. This plant is characterized by its jointed stems and spore-producing structures. It plays an important role in aquatic and moist ecosystems. Its classification reflects its evolutionary relationships within the plant kingdom.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aaronsohnia pubescens is primarily native to the eastern and central regions of North America. It is commonly found in the United States, particularly in states such as Tennessee, Kentucky, and Virginia. This plant thrives in moist, well-drained soils along stream banks and in forested areas. It is also present in parts of Canada, including Ontario and Quebec. Its distribution is closely associated with riparian zones and wetlands.",
    "distribution_introduced_art_desc": "Aaronsohnia pubescens was mainly introduced to the Pacific Northwest region of the United States. It was first documented in Oregon in the early 20th century as a result of human activity, including horticultural trade and accidental transport. This plant has since spread to nearby areas, including parts of Washington and British Columbia. It thrives in moist, shaded environments, often found in forest understories. Its introduction has raised concerns among ecologists due to its potential impact on native plant species."
}
