{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris cuspidata",
    "plant_slug": "abacopteris-cuspidata",
    "plant_name_scientific": "abacopteris cuspidata",
    "intro": "Abacopteris cuspidata, commonly known as the slender sea holly, is a flowering plant native to coastal regions of the Mediterranean. It is characterized by its narrow, grass-like leaves and distinctive blue or violet flowers that bloom in summer. The plant thrives in sandy or rocky soils and is often found in dune environments. It plays a role in stabilizing coastal dunes and providing habitat for small invertebrates. Due to its limited distribution, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris cuspidata belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species cuspidata. It is a member of the genus Abacopteris, which is part of the family Equisetaceae, commonly known as the horsetail family. This plant is characterized by its jointed stems and spore-producing structures. It is typically found in moist, temperate environments. Its classification reflects its evolutionary relationships within the vascular plant group.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris cuspidata is primarily native to the western Pacific islands, including parts of Southeast Asia and the Pacific Ocean. It is commonly found in regions such as Japan, the Philippines, and parts of Indonesia. This plant typically grows in coastal areas and sandy soils, often near the shoreline. It thrives in warm, humid climates with well-drained soil conditions. Its native range is limited to these specific geographic locations, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abacopteris cuspidata was mainly introduced to control invasive plant species in certain regions. It is commonly used in biological control programs due to its ability to feed on specific weeds. The plant is native to Australia and has been introduced to several countries for ecological management purposes. It thrives in disturbed soils and can colonize areas with low vegetation. However, its introduction has raised concerns about potential impacts on native ecosystems."
}
