{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris repanda",
    "plant_slug": "abacopteris-repanda",
    "plant_name_scientific": "abacopteris repanda",
    "intro": "Abacopteris repanda, commonly known as the New Zealand tree fern, is a distinctive evergreen plant native to New Zealand. It belongs to the Cyatheaceae family and is characterized by its tall, unbranched trunk and large, pinnately compound fronds. The plant can grow up to 10 meters in height, with a thick, fibrous trunk that stores water and nutrients. Its fronds are bioluminescent in the dark, a unique feature that aids in attracting nocturnal pollinators. The plant thrives in humid, shaded environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris repanda belongs to the kingdom Plantae, phylum Streptophyta, class Embryophyta, subclass Equisetopsida, order Equisetales, family Equisetaceae, genus Abacopteris, and species repanda. It is a member of the genus Abacopteris, which is part of the family Equisetaceae, commonly known as horsetails. This plant is characterized by its jointed stems and whorled leaves, typical of the Equisetaceae family. It is a primitive vascular plant that has remained relatively unchanged for millions of years. Its classification reflects its ancient lineage within the plant kingdom.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris repanda is primarily native to the Pacific Islands, including regions such as Hawaii, the Marquesas, and parts of French Polynesia. It is commonly found in coastal areas and lowland forests, thriving in humid and tropical climates. This plant is often associated with sandy or rocky soils and is well adapted to the island ecosystems. Its distribution is limited to these specific geographic regions, where it plays a role in local biodiversity. Due to its restricted range, it is considered a rare and endemic species in many of these areas.",
    "distribution_introduced_art_desc": "Abacopteris repanda was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in coastal regions and sandy soils where it thrives in temperate climates. This plant has been introduced to several regions for ornamental purposes due to its attractive foliage and adaptability. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its distribution is now expanding beyond its original range, raising concerns about ecological impact."
}
