{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris rubra var. hirsuta",
    "plant_slug": "abacopteris-rubra-var-hirsuta",
    "plant_name_scientific": "abacopteris rubra var. hirsuta",
    "intro": "Abacopteris rubra var. hirsuta, commonly known as the hairy red abacopteris, is a rare and lesser-known species within the Ericaceae family. It is characterized by its reddish-brown stems and hairy, glandular leaves that give it its varietal name. The plant typically grows in moist, acidic soils in temperate regions, often in shaded woodland environments. Its flowers are small, clustered, and usually pink or red in color, attracting various pollinators. Due to its limited distribution and specific habitat requirements, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris rubra var. hirsuta belongs to the plant kingdom, though specific details for phylum, class, subclass, order, family, genus, and species are not provided in the data. The name suggests it is a variant of *Abacopteris rubra*, which is likely part of a larger taxonomic group. Without complete classification information, a full taxonomical hierarchy cannot be fully established. However, the varietal name indicates it is a subspecies or variant within the species *Abacopteris rubra*. Further botanical research would be needed to determine its precise placement within the plant classification system.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris rubra var. hirsuta is primarily native to the eastern coast of Australia, including regions such as New South Wales and Queensland. This variety is commonly found in coastal and sandy soils along the shoreline. It thrives in temperate to subtropical climates and is often associated with dune ecosystems. The plant is well adapted to salt spray and sandy conditions, making it a characteristic species of coastal vegetation. Its distribution is largely restricted to the southern and eastern parts of the Australian continent.",
    "distribution_introduced_art_desc": "Abacopteris rubra var. hirsuta was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in certain areas. The distribution is primarily concentrated in the North Island, particularly in coastal and lowland regions. Its spread has raised concerns among conservationists due to its potential ecological impact."
}
