{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris hekouensis",
    "plant_slug": "abacopteris-hekouensis",
    "plant_name_scientific": "abacopteris hekouensis",
    "intro": "Abacopteris hekouensis, commonly known as the Hekou abacopteris, is a rare and endemic plant species native to China. It belongs to the family Apiaceae, which includes many aromatic herbs and vegetables. The plant is characterized by its slender stems and small, compound leaves that are often covered in fine hairs. It produces small, white to greenish flowers arranged in umbels, typical of the Apiaceae family. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native region.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris hekouensis belongs to the kingdom Plantae, phylum Streptophyta, class Equisetopsida, subclass Polypodiinae, order Polypodiales, family Aspleniaceae, genus Thelypteris, and species Thelypteris hekouensis. This classification places it within the group of ferns, specifically within the family Aspleniaceae, which includes various species of small to medium-sized ferns. The genus Thelypteris is well-known for its diverse and widespread species, many of which are found in tropical and subtropical regions. Thelypteris hekouensis is native to China, where it is typically found in moist, shaded environments. Its taxonomical placement reflects its evolutionary relationships within the broader group of ferns.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris hekouensis is primarily native to southern China, specifically the Hekou County in Yunnan Province. This plant is found in the subtropical regions of this area, where the climate is humid and warm. It typically grows in moist, well-drained soils along riverbanks and in forested areas. The species is endemic to this region, meaning it is not found naturally anywhere else in the world. Its limited distribution highlights its ecological significance and the need for conservation efforts in its native habitat.",
    "distribution_introduced_art_desc": "Abacopteris hekouensis was mainly introduced to areas with specific soil and climate conditions that support its growth. It is typically found in regions with moderate temperatures and well-drained soils. The plant has been documented in several locations, particularly in the Hekou area of China. Its introduction has been linked to both natural dispersal and human-assisted propagation. Due to its unique ecological niche, it is considered a rare and specialized species."
}
