{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris anjenabensis",
    "plant_slug": "abacopteris-anjenabensis",
    "plant_name_scientific": "abacopteris anjenabensis",
    "intro": "Abacopteris anjenabensis, commonly known as the Anjenabeng tree, is a species of flowering plant in the family Malvaceae. It is native to the tropical regions of Southeast Asia, particularly found in Indonesia and Malaysia. The tree can grow up to 20 meters tall, featuring broad, lance-shaped leaves and showy yellow flowers that bloom in clusters. Its fruit is a capsule that splits open to release seeds, which are dispersed by wind. The plant is valued for its timber and has cultural significance in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris anjenabensis belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Liliidae, order Poales, family Poaceae, genus Abacopteris, and species anjenabensis. This plant is a grass species known for its unique morphological characteristics. It is native to specific regions in Southeast Asia, where it thrives in tropical and subtropical climates. The genus Abacopteris is relatively small, with limited species distributed across various habitats. Its classification reflects its evolutionary relationships within the grass family, highlighting its ecological and botanical significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris anjenabensis is primarily native to the island of Anjouan in the Comoros archipelago. This plant is found in the humid, tropical rainforests of the island, where it thrives in the moist and shaded undergrowth. It is endemic to this region, meaning it is not found naturally anywhere else in the world. The species is adapted to the specific ecological conditions of Anjouan, including its unique soil composition and climate. Due to its restricted distribution, it is considered a vulnerable species facing threats from habitat loss and environmental changes.",
    "distribution_introduced_art_desc": "Abacopteris anjenabensis was mainly introduced to New Zealand as part of an ornamental plant collection. It was brought there in the late 19th century by European settlers who were interested in exotic flora. The plant was initially cultivated in botanical gardens and private collections before becoming more widely distributed. Despite its ornamental value, it has since naturalized in certain regions of the country. However, its spread has been limited due to its specific habitat requirements and relatively slow growth rate."
}
