{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris salicifolia",
    "plant_slug": "abacopteris-salicifolia",
    "plant_name_scientific": "abacopteris salicifolia",
    "intro": "Abacopteris salicifolia, commonly known as the narrow-leaved alder, is a species of flowering plant in the family Betulaceae. It is native to the mountainous regions of South America, particularly in Argentina and Chile. The plant is characterized by its slender, willow-like leaves and small, catkin-like flowers that appear in early spring. It typically grows in moist, well-drained soils along riverbanks and in forested areas. The species is valued for its ornamental appeal and its role in stabilizing soil in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris salicifolia is primarily native to the eastern and southern regions of Australia. It is commonly found in coastal and lowland areas, particularly in New South Wales and Victoria. This plant thrives in sandy or loamy soils and is often associated with heathland and woodland environments. It is well adapted to the temperate climate of these regions. The species is also occasionally found in parts of South Australia and Tasmania.",
    "distribution_introduced_art_desc": "Abacopteris salicifolia was mainly introduced to control erosion and stabilize soil in coastal and wetland areas. It is commonly used in restoration projects due to its ability to thrive in moist, saline environments. The plant forms dense mats that help prevent soil erosion and provide habitat for local wildlife. However, its rapid growth can sometimes lead to the displacement of native vegetation if not managed properly. It is now considered an invasive species in several regions where it has spread beyond its intended planting areas."
}
