{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris gracilis",
    "plant_slug": "abacopteris-gracilis",
    "plant_name_scientific": "abacopteris gracilis",
    "intro": "Abacopteris gracilis, commonly known as the slender mistletoe, is a hemiparasitic plant that grows on the branches of specific host trees. It belongs to the family Viscaraceae and is characterized by its small, evergreen leaves and white, fleshy berries. The plant derives some of its nutrients from its host through specialized root structures called haustoria. It is typically found in tropical and subtropical regions, often in areas with high humidity. Due to its parasitic nature, it can have significant ecological impacts on its host species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris gracilis belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Commelinidae, order Poales, family Poaceae, genus Abacopteris, and species gracilis. It is a grass species known for its slender, grass-like appearance. This plant is typically found in specific habitats where it contributes to local biodiversity. Its classification reflects its evolutionary relationships within the monocot group. The name Abacopteris gracilis highlights its morphological characteristics and taxonomic placement.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris gracilis is primarily native to the eastern regions of Australia, specifically Queensland and New South Wales. It is commonly found in coastal and sandy soils, often growing in open woodlands and heathlands. This species thrives in well-drained soils and is adapted to the temperate to subtropical climates of its native range. It plays an important ecological role in stabilizing coastal dunes and providing habitat for native wildlife. Due to its limited distribution, it is considered a rare and vulnerable plant species in its native habitat.",
    "distribution_introduced_art_desc": "Abacopteris gracilis was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in coastal regions and sandy soils along the eastern and southern coasts of Australia. This plant has been introduced to several regions for its ornamental value and ability to stabilize dunes. It is often used in landscaping and restoration projects due to its hardy nature. However, its spread can sometimes lead to competition with native plant species."
}
