{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris triphylla var. simplicifolia",
    "plant_slug": "abacopteris-triphylla-var-simplicifolia",
    "plant_name_scientific": "abacopteris triphylla var. simplicifolia",
    "intro": "Abacopteris triphylla var. simplicifolia, commonly known as the simple-leaved three-leaf fern, is a species native to certain regions of Southeast Asia. It is characterized by its trifoliate leaves, which consist of three lanceolate lobes arranged symmetrically. The plant typically grows in moist, shaded environments such as forest undergrowth. Its fronds are often covered in fine, silky hairs, contributing to its distinctive appearance. The plant reproduces via spores, typical of its fern classification, and thrives in humid, temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris triphylla var. simplicifolia is primarily native to eastern Australia, including regions of New South Wales, Queensland, and Victoria. It is commonly found in coastal and heathland areas, often growing in sandy or well-drained soils. This variant is part of the Restionaceae family and is adapted to the temperate to subtropical climates of these regions. It typically thrives in open habitats such as dunes, swales, and along the edges of forests. Due to its specific habitat requirements, it is sometimes considered a rare or locally restricted species.",
    "distribution_introduced_art_desc": "Abacopteris triphylla var. simplicifolia was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in coastal regions and disturbed sites where it can establish quickly. This plant is often used for erosion control due to its rapid growth and dense foliage. It has become naturalized in several regions outside its native range. However, its spread can sometimes lead to competition with native vegetation."
}
