{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris menisciicarpos",
    "plant_slug": "abacopteris-menisciicarpos",
    "plant_name_scientific": "abacopteris menisciicarpos",
    "intro": "Abacopteris menisciicarpos, commonly known as the ghost fern, is a rare and ancient species belonging to the family Osmundaceae. It is characterized by its delicate, lace-like fronds that resemble the appearance of ghostly apparitions, hence its common name. The plant is primarily found in moist, shaded environments in tropical and subtropical regions. Its reproductive structures, known as sporangia, are clustered in small, spore-producing clusters called sori. The botanical significance of Abacopteris menisciicarpos lies in its evolutionary history and its role in understanding the development of modern ferns.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris menisciicarpos belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species menisciicarpos. This fern is characterized by its unique morphology and reproductive structures. It is commonly found in moist, shaded environments. The genus Abacopteris is known for its specialized spore-bearing structures. This classification highlights its evolutionary relationships within the plant kingdom.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris menisciicarpos is primarily native to the southern and eastern regions of Australia, particularly in the states of New South Wales and Victoria. It is commonly found in coastal and semi-coastal areas, often growing in sandy or loamy soils. This plant thrives in warm, temperate climates with moderate rainfall. It is typically associated with open woodlands and heathlands. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abacopteris menisciicarpos was mainly introduced to control invasive plant species in certain regions. It is commonly used in biological control programs due to its specific feeding habits. The plant thrives in disturbed soils and is often found in agricultural areas. Its introduction has been monitored to prevent unintended ecological impacts. However, it is not widely distributed and remains localized in specific target environments."
}
