{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris triphylla var. parishii",
    "plant_slug": "abacopteris-triphylla-var-parishii",
    "plant_name_scientific": "abacopteris triphylla var. parishii",
    "intro": "Abacopteris triphylla var. parishii, commonly known as the Three-leafed Kowhai, is a shrub native to New Zealand. It is characterized by its trifoliate leaves, which consist of three leaflets arranged symmetrically. The plant produces yellow flowers that bloom in spring, attracting native pollinators. It thrives in well-drained soils and is often found in coastal and forested areas. The species is valued for its ornamental qualities and ecological importance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris triphylla var. parishii is primarily native to the eastern coast of Australia, including regions in New South Wales and Queensland. This variety is commonly found in coastal heathlands and sandy soils along the shoreline. It thrives in well-drained, acidic soils and is often associated with coastal dunes and cliff faces. The plant is adapted to withstand salt spray and strong coastal winds. It plays an important ecological role in stabilizing dune systems and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Abacopteris triphylla var. parishii was mainly introduced to New Zealand. It was brought there during the 19th century as part of the broader introduction of exotic plant species. This variety is commonly found in coastal areas and is often associated with disturbed soils. It has become naturalized in certain regions, though it is not considered invasive. The plant is valued for its ornamental qualities and its ability to thrive in harsh coastal environments."
}
