{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris macrophylla",
    "plant_slug": "abacopteris-macrophylla",
    "plant_name_scientific": "abacopteris macrophylla",
    "intro": "Abacopteris macrophylla, commonly known as the giant fan palm, is a striking tropical plant characterized by its large, fan-shaped leaves. It is native to Southeast Asia and thrives in warm, humid climates with well-drained soil. The plant features a slender trunk that can grow up to several meters in height, supporting its expansive fronds. Its leaves are typically green and can reach lengths of over two meters, making it a prominent feature in its natural habitat. Abacopteris macrophylla is often cultivated for ornamental purposes due to its unique appearance and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris macrophylla belongs to the kingdom Plantae, phylum Streptophyta, class Equisetopsida, subclass Polypodiinae, order Polypodiales, family Aspleniaceae, genus Thelypteris, and species Thelypteris rex. This classification places it within the group of ferns, specifically within the family Aspleniaceae, which includes various species of small to medium-sized ferns. The genus Thelypteris is known for its diverse species, many of which are commonly found in tropical and subtropical regions. Thelypteris rex is a specific species within this genus, characterized by its distinctive morphology and ecological preferences. This taxonomic structure helps in understanding the evolutionary relationships and biological characteristics of Abacopteris macrophylla.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris macrophylla is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in coastal and inland regions, particularly in sandy soils along the eastern coast. This plant thrives in open habitats such as heathlands, woodlands, and coastal dunes. It is often associated with the genus *Callitris* and grows in well-drained soils. Abacopteris macrophylla is an important component of the native vegetation in these areas.",
    "distribution_introduced_art_desc": "Abacopteris macrophylla was mainly introduced to enhance biodiversity and provide habitat in restored ecosystems. It is commonly used in ecological restoration projects due to its rapid growth and ability to stabilize soils. This plant thrives in moist, well-drained soils and is often found in wetlands and riparian zones. Its introduction has helped in reclaiming degraded lands and supporting native wildlife. However, it requires careful management to prevent it from becoming invasive in non-target areas."
}
