{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris gymnopteridifrons",
    "plant_slug": "abacopteris-gymnopteridifrons",
    "plant_name_scientific": "abacopteris gymnopteridifrons",
    "intro": "Abacopteris gymnopteridifrons, commonly known as the slender-winged fern, is a rare and specialized fern species found in specific tropical environments. It belongs to the family Blechnaceae and is characterized by its delicate, elongated fronds with narrow, leathery leaves. The plant exhibits a unique growth habit, often thriving in shaded, moist habitats with high humidity. Its reproductive structures, including spore-producing sorus, are typically located on the underside of the fronds. Due to its limited distribution and specific ecological requirements, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris gymnopteridifrons belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species gymnopteridifrons. This plant is a type of horsetail, characterized by its jointed stems and spore-producing structures. It is commonly found in moist, temperate environments. The genus Abacopteris is known for its unique morphological features, including the presence of annular nodes. This species plays a role in ecological systems by contributing to soil stabilization and providing habitat for various microorganisms.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris gymnopteridifrons is primarily native to the eastern coast of Australia, specifically Queensland and New South Wales. It is commonly found in coastal sand dunes and heathlands, where it thrives in sandy, well-drained soils. This plant is adapted to harsh coastal conditions, including salt spray and strong winds. It plays an important ecological role in stabilizing dune systems and providing habitat for native wildlife. Its distribution is limited to these specific regions due to its specialized habitat requirements.",
    "distribution_introduced_art_desc": "Abacopteris gymnopteridifrons was mainly introduced to control the spread of invasive weeds in agricultural areas. It is known for its ability to thrive in disturbed soils and compacted ground conditions. The plant was introduced as a biological control agent to reduce the dominance of problematic weeds. However, its introduction has raised concerns about potential ecological impacts on native plant communities. It is now considered a potential weed in some regions where it has established itself."
}
