{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris glandulosa",
    "plant_slug": "abacopteris-glandulosa",
    "plant_name_scientific": "abacopteris glandulosa",
    "intro": "Abacopteris glandulosa, commonly known as the sticky matted rock-rose, is a flowering plant native to the arid regions of southwestern Australia. It is characterized by its compact, low-growing habit with dense clusters of small, glandular leaves. The plant produces showy, tubular flowers that are typically pink or red, which attract nectar-feeding insects. It thrives in well-drained soils and is adapted to withstand drought and high temperatures. Due to its unique appearance and ecological role, it is often cultivated in xeriscapes and rock gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris glandulosa belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetoideae, order Equisetales, family Equisetaceae, genus Abacopteris, and species glandulosa. It is a member of the clubmoss group, characterized by its spore-producing structures and primitive vascular system. This plant is typically found in moist, shaded environments and is often associated with rocky or forested areas. The genus Abacopteris is known for its unique morphological features, including the presence of glandular structures on its stems. Its classification reflects its evolutionary position within the ancient lineage of vascular plants.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris glandulosa is primarily native to the coastal regions of southern Australia, including parts of New South Wales and Victoria. It thrives in sandy soils along the shorelines and is commonly found in dune environments. This plant is well adapted to salt spray and wind, making it a key component of coastal vegetation. It is also occasionally found in inland areas with similar ecological conditions. Its distribution is closely linked to the specific microclimates and soil types of the Australian coastline.",
    "distribution_introduced_art_desc": "Abacopteris glandulosa was mainly introduced to control the spread of invasive plants in disturbed areas. It is commonly used in ecological restoration projects due to its ability to thrive in poor soil conditions. This plant is known for its rapid growth and dense foliage, which helps prevent soil erosion. However, it requires careful management to avoid becoming invasive itself. Its distribution is primarily limited to regions with suitable climate and soil types."
}
