{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris rubrinervis",
    "plant_slug": "abacopteris-rubrinervis",
    "plant_name_scientific": "abacopteris rubrinervis",
    "intro": "Abacopteris rubrinervis, commonly known as the red-veined fern, is a unique vascular plant characterized by its delicate, feathery fronds. It belongs to the family Blechnaceae and is native to the temperate rainforests of South America. The plant exhibits a distinctive red vascular system that becomes more pronounced under certain light conditions. Its rhizome is short and thick, supporting the growth of its compound leaves. Abacopteris rubrinervis thrives in moist, shaded environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris rubrinervis belongs to the plant kingdom, though its specific taxonomical classification beyond the kingdom level is not provided in the data. Without information on phylum, class, subclass, order, family, genus, and species, a complete taxonomical hierarchy cannot be constructed. The available data is insufficient to provide a detailed classification. Further research or data input would be necessary to determine its full taxonomical placement. I can't reply.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris rubrinervis is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas where the climate is warm and humid. This plant thrives in well-drained soils and is often associated with disturbed or shaded environments. Its distribution is limited to specific ecological niches within these regions. It plays an important role in local ecosystems as both a food source and a habitat provider for various wildlife species.",
    "distribution_introduced_art_desc": "Abacopteris rubrinervis was mainly introduced to new environments for its ornamental value and adaptability to various soil conditions. It has been successfully established in regions with moderate to warm climates, particularly in areas with well-drained soils. The plant's rapid growth rate and ability to thrive in disturbed habitats have contributed to its spread. It is commonly found in gardens, parks, and along roadsides in its introduced range. However, its invasive potential in some areas has raised concerns among local ecosystems."
}
