{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris truncata",
    "plant_slug": "abacopteris-truncata",
    "plant_name_scientific": "abacopteris truncata",
    "intro": "Abacopteris truncata, commonly known as the narrow-leafed marsh fern, is a perennial herbaceous plant native to wetland and marsh habitats in eastern Australia. It is characterized by its slender, arching stems and trifoliate leaves that are typically less than 10 cm in length. The plant produces small, greenish-white spore-bearing structures called sori on the underside of its fronds. It thrives in moist, nutrient-poor soils and is often found in swampy or seasonally flooded areas. Abacopteris truncata plays an important ecological role in stabilizing wetland soils and providing habitat for various invertebrates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris truncata is primarily native to the eastern and southern regions of Australia. It is commonly found in coastal areas, particularly in sandy soils along the shores of New South Wales and Queensland. This plant thrives in maritime climates with high salt tolerance and is often seen in dune environments. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. Its distribution is closely linked to the specific environmental conditions of the Australian coastline.",
    "distribution_introduced_art_desc": "Abacopteris truncata was mainly introduced to new habitats through human activity, such as accidental transport via contaminated soil or equipment. It has been reported in several regions outside its native range, including parts of Europe and Asia. The plant thrives in disturbed environments, making it a potential invasive species in some areas. Its rapid growth and adaptability contribute to its successful establishment in non-native locations. However, its ecological impact remains under study due to limited long-term data."
}
