{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris nitida",
    "plant_slug": "abacopteris-nitida",
    "plant_name_scientific": "abacopteris nitida",
    "intro": "Abacopteris nitida, commonly known as the slender bamboo fern, is a species of fern native to Southeast Asia. It belongs to the family Blechnaceae and is characterized by its delicate, slender fronds that are typically less than 1 meter in length. The plant has a rhizomatous growth habit, with creeping underground stems that allow it to spread slowly across forest floors. Its leaves are usually bipinnate, with small, closely spaced pinnae that give it a feathery appearance. Abacopteris nitida thrives in humid, shaded environments and is often found in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris nitida belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species nitida. It is a member of the family Equisetaceae, commonly known as the horsetail family. This plant is characterized by its jointed stems and spore-producing structures. It is typically found in moist, temperate environments. The genus Abacopteris is relatively rare and includes only a few species.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris nitida is primarily native to the eastern coast of Australia, including Queensland and New South Wales. It is commonly found in coastal heathlands and sandy soils along the shoreline. This plant thrives in well-drained, acidic soils and is often associated with dune ecosystems. It plays an important role in stabilizing sand dunes and providing habitat for native wildlife. Due to its limited distribution, it is considered a rare and vulnerable species in its native range.",
    "distribution_introduced_art_desc": "Abacopteris nitida was mainly introduced to control the spread of invasive weeds in degraded coastal areas. It is commonly used in ecological restoration projects due to its ability to stabilize soil and prevent erosion. The plant thrives in saline and brackish environments, making it suitable for coastal rehabilitation. Its rapid growth and dense foliage help suppress unwanted vegetation. However, it requires careful management to prevent it from becoming invasive itself in non-target habitats."
}
