{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris sampsonii",
    "plant_slug": "abacopteris-sampsonii",
    "plant_name_scientific": "abacopteris sampsonii",
    "intro": "Abacopteris sampsonii, commonly known as the Sampson's ghost fern, is a rare and delicate fern species native to specific regions of Southeast Asia. It belongs to the family Polypodiaceae and is characterized by its slender, arching fronds with a distinctive, pale green coloration. The plant thrives in moist, shaded environments, typically found in dense tropical forests. Its reproductive structures, including spore-producing sorus, are positioned on the underside of its leaves. Due to habitat loss and limited distribution, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris sampsonii is primarily native to the eastern coast of Australia, specifically from Queensland to New South Wales. It is commonly found in coastal and sandy environments, including dunes and heathlands. This species thrives in well-drained soils and is often associated with open vegetation types. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. However, its distribution is relatively limited, and it is not widely cultivated outside its natural range.",
    "distribution_introduced_art_desc": "Abacopteris sampsonii was mainly introduced to New Zealand. It is a non-native species that has been documented in various regions of the country. The plant is typically found in coastal areas and has adapted well to the local climate. Its introduction is believed to have occurred through accidental transport via human activity. Due to its rapid growth and ability to thrive in disturbed environments, it has become a potential invasive species in some areas."
}
