{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris simplex",
    "plant_slug": "abacopteris-simplex",
    "plant_name_scientific": "abacopteris simplex",
    "intro": "Abacopteris simplex, commonly known as the slender sea holly, is a flowering plant native to the coastal regions of southern Africa. It is a member of the Goodeniaceae family and is characterized by its narrow, grass-like leaves and small, blue or purple flowers. The plant thrives in sandy or gravelly soils and is often found in maritime environments. It plays a role in stabilizing coastal dunes and providing habitat for small invertebrates. Due to its limited distribution, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris simplex is primarily native to the eastern coast of Australia, including regions such as New South Wales and Queensland. It thrives in coastal areas and sandy soils, often found in dune environments. This plant is well adapted to saline and windy conditions, making it a common sight in beachfront ecosystems. It plays an important role in stabilizing dunes and preventing erosion. Its distribution is closely linked to the unique climatic and geological features of the Australian coastline.",
    "distribution_introduced_art_desc": "Abacopteris simplex was mainly introduced to New Zealand. It was brought there as a potential ornamental plant due to its unique appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shaded environments, which allows it to spread rapidly. Its introduction has raised concerns among conservationists due to its ecological impact."
}
