{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris penangiana",
    "plant_slug": "abacopteris-penangiana",
    "plant_name_scientific": "abacopteris penangiana",
    "intro": "Abacopteris penangiana, commonly known as the Penang ghost orchid, is a rare and enigmatic orchid species native to the tropical regions of Southeast Asia. It is characterized by its striking, translucent white petals and a unique, ghost-like appearance that gives it its common name. The plant typically grows as an epiphyte on trees, relying on atmospheric moisture rather than soil for nutrients. Its flowers are small and delicate, often appearing in clusters during the rainy season. Due to its limited distribution and habitat specificity, Abacopteris penangiana is considered a vulnerable species facing threats from habitat loss and illegal collection.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris penangiana belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetae, order Equisetales, family Equisetaceae, genus Abacopteris, and species penangiana. It is a member of the whisk ferns, a group of primitive vascular plants. This species is native to Southeast Asia, particularly Malaysia. It is characterized by its simple, spore-bearing structure and lacks true leaves. Abacopteris penangiana is of interest to botanists due to its evolutionary significance and limited distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris penangiana is primarily native to the Peninsular Malaysia, specifically the state of Penang. It is commonly found in the coastal areas and mangrove ecosystems of Penang Island. This plant thrives in brackish water environments and is often associated with tidal zones. It is an important component of the local flora and plays a role in stabilizing coastal soils. Due to its limited distribution, it is considered a rare and endemic species in the region.",
    "distribution_introduced_art_desc": "Abacopteris penangiana was mainly introduced to enhance biodiversity and provide ecological benefits in tropical and subtropical regions. It is commonly found in coastal areas and mangrove ecosystems where it contributes to soil stabilization and habitat creation. This plant is valued for its ability to thrive in saline and waterlogged soils, making it useful for coastal restoration projects. Its introduction has also supported local wildlife by offering shelter and food resources. However, careful management is required to prevent its spread into non-target environments."
}
