{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris liukiuensis",
    "plant_slug": "abacopteris-liukiuensis",
    "plant_name_scientific": "abacopteris liukiuensis",
    "intro": "Abacopteris liukiuensis, commonly known as the Ryukyu sea holly, is a flowering plant native to the Ryukyu Islands in Japan. It is a member of the Boraginaceae family and is characterized by its distinctive blue or violet flowers. The plant typically grows in coastal areas and is adapted to saline and sandy soils. It has hairy leaves and produces small, capsule-like fruits. Due to its limited distribution, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris liukiuensis belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Liliidae, order Poales, family Poaceae, genus Abacopteris, and species liukiuensis. It is a flowering plant commonly found in specific regions of East Asia. This species is characterized by its grass-like appearance and is adapted to particular environmental conditions. Its classification places it within the broader group of monocots. Abacopteris liukiuensis is of interest to botanists due to its unique genetic and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris liukiuensis is primarily native to the Ryukyu Islands, specifically Okinawa and other nearby islands in Japan. This plant is found in the subtropical climate of these islands, where it thrives in moist, shaded environments. It is commonly associated with coastal areas and lowland forests. The species is also present in parts of Taiwan and the Philippines. Due to its limited distribution, it is considered a rare and endemic plant in the region.",
    "distribution_introduced_art_desc": "Abacopteris liukiuensis was mainly introduced to the Ryukyu Islands, where it thrives in the humid subtropical climate. It is commonly found in coastal areas and lowland forests, adapting well to the region's moist and warm conditions. This plant has become an important part of the local flora, contributing to the biodiversity of the area. Its introduction has also supported local ecosystems by providing habitat and food for various wildlife species. However, its spread is carefully monitored to prevent potential ecological imbalances."
}
