{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacosa kingii",
    "plant_slug": "abacosa-kingii",
    "plant_name_scientific": "abacosa kingii",
    "intro": "Abacosa kingii, commonly known as the King's abacosa, is a rare and striking plant native to the mountainous regions of South Africa. It belongs to the Asteraceae family, characterized by its composite flower heads and robust, hairy stems. The plant features narrow, sword-shaped leaves with a velvety texture, and its flowers are typically yellow or orange, arranged in dense clusters. Abacosa kingii thrives in well-drained soils and requires a sunny to partially shaded environment. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacosa kingii is primarily native to the eastern region of Australia, specifically the coastal areas of New South Wales and southern Queensland. It is commonly found in sandy soils along the coastline, often in dune environments. This plant thrives in areas with moderate to high rainfall and is adapted to the temperate climate of the region. It is also occasionally found in nearby coastal heathlands and open woodlands. Due to its limited distribution, it is considered a rare and locally endemic species.",
    "distribution_introduced_art_desc": "Abacosa kingii was mainly introduced to New Zealand as part of ornamental horticulture due to its unique appearance and hardy nature. It is primarily found in the North Island, particularly in the central and northern regions where the climate is suitable for its growth. The plant has adapted well to the local environment, leading to its establishment in both urban and rural areas. However, its spread has raised concerns among conservationists due to its potential to outcompete native species. Efforts are being made to monitor and manage its distribution to prevent ecological disruption."
}
