{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris multilineata",
    "plant_slug": "abacopteris-multilineata",
    "plant_name_scientific": "abacopteris multilineata",
    "intro": "Abacopteris multilineata, commonly known as the multilined orchid, is a rare and delicate flowering plant native to the tropical rainforests of Southeast Asia. It belongs to the orchid family, Orchidaceae, and is characterized by its intricate, multi-layered petals and sepals. The plant typically grows as an epiphyte, attaching itself to tree bark without deriving nutrients from its host. Its small, fragrant flowers bloom in clusters and are pollinated by specific insect species. Due to habitat destruction, Abacopteris multilineata is considered endangered and is of great interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris multilineata belongs to the kingdom Plantae, phylum Anthocerotophyta, class Anthocerotae, subclass Anthocerotidae, order Anthocerales, family Anthocerotaceae, genus Abacopteris, and species multilineata. This plant is a type of liverwort, which is a non-vascular plant commonly found in moist environments. It is characterized by its small, leaf-like structures and is typically found in damp, shaded areas. The genus Abacopteris is known for its unique morphological features, including the presence of specialized reproductive structures. The species multilineata is distinguished by its specific arrangement of cells and patterns on its thallus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris multilineata is primarily native to the eastern and southeastern regions of Australia. It is commonly found in coastal areas, including sand dunes and heathlands. This plant thrives in sandy soils and is often associated with maritime climates. It is also present in parts of New Zealand, where it grows in similar environmental conditions. Its distribution is largely limited to these specific geographic and ecological zones.",
    "distribution_introduced_art_desc": "Abacopteris multilineata was mainly introduced to control the spread of invasive plant species in disturbed habitats. It is commonly used in ecological restoration projects to stabilize soil and prevent erosion. This plant thrives in full sun and well-drained soils, making it suitable for reclamation sites. Its rapid growth and ability to establish dense cover make it an effective tool for land rehabilitation. However, it requires careful management to prevent it from becoming invasive in non-target areas."
}
