{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacosa canescens",
    "plant_slug": "abacosa-canescens",
    "plant_name_scientific": "abacosa canescens",
    "intro": "Abacosa canescens, commonly known as the hairy abacosa, is a flowering plant native to arid and semi-arid regions of southern Africa. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant has hairy, grayish-green leaves that help reduce water loss in its harsh environment. Its flowers are typically yellow or orange, attracting pollinators such as bees and butterflies. Abacosa canescens is often found growing on rocky outcrops and in sandy soils, showcasing its adaptability to extreme conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacosa canescens is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is commonly found in coastal areas and dry forests, particularly in the islands of Cuba, Hispaniola, and Jamaica. This plant thrives in sandy soils and is often associated with dune environments. It plays an important ecological role in stabilizing coastal ecosystems. Its distribution is limited to specific habitats within the Caribbean, reflecting its adaptation to the region's unique climate and soil conditions.",
    "distribution_introduced_art_desc": "Abacosa canescens was mainly introduced to new habitats in the Mediterranean region due to its adaptability to dry and rocky environments. It has been found growing along coastal areas and in disturbed soils, often outcompeting native vegetation. The plant's introduction has led to concerns about its potential impact on local biodiversity. Its rapid growth and reproductive capabilities contribute to its spread in invaded areas. Conservation efforts are being considered to manage its distribution and prevent further ecological disruption."
}
