{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris rubra",
    "plant_slug": "abacopteris-rubra",
    "plant_name_scientific": "abacopteris rubra",
    "intro": "Abacopteris rubra, commonly known as the red-flowered acacia, is a shrub native to parts of Australia. It is characterized by its compound leaves and clusters of bright red flowers that bloom in spring. The plant produces small, pod-like fruits that contain several seeds. It thrives in well-drained soils and is often found in dry, open habitats. Abacopteris rubra is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris rubra belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species rubra. This fern is characterized by its unique morphology and ecological adaptations. It is commonly found in moist, shaded environments. The genus Abacopteris is known for its specialized reproductive structures. Its classification reflects its evolutionary relationship to other ferns within the order Equisetales.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris rubra is primarily native to the coastal regions of southern Australia, particularly in New South Wales and Victoria. It thrives in sandy soils along the shoreline and is commonly found in dune ecosystems. This plant is well adapted to salt spray and wind, making it a key component of coastal vegetation. It plays an important role in stabilizing dunes and preventing erosion. Its distribution is largely restricted to the temperate coastal areas of the southeastern coast of Australia.",
    "distribution_introduced_art_desc": "Abacopteris rubra was mainly introduced to control invasive plant species in disturbed ecosystems. It is commonly used in restoration projects to stabilize soil and prevent erosion. The plant thrives in moist, well-drained soils and full sun conditions. It has been successfully introduced in several regions of the United States and parts of Australia. However, its use is sometimes limited due to potential ecological impacts on native flora."
}
