{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris presliana",
    "plant_slug": "abacopteris-presliana",
    "plant_name_scientific": "abacopteris presliana",
    "intro": "Abacopteris presliana, commonly known as the giant fan palm, is a tropical plant native to Southeast Asia. It is characterized by its large, fan-shaped leaves that can reach several meters in diameter. The plant has a slender, unbranched trunk that can grow up to 10 meters tall. Its reproductive structures include small, clustered inflorescences with both male and female flowers. The species is often cultivated for its ornamental value and is adapted to warm, humid climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris presliana belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species presliana. It is a type of horsetail, commonly found in wetland environments. This plant is characterized by its jointed stems and spore-producing structures. It plays an important role in aquatic and semi-aquatic ecosystems. Its classification reflects its evolutionary relationship to other ferns and clubmosses.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris presliana is primarily native to the island of New Guinea. It is also found in parts of Indonesia, particularly in the Maluku Islands. This plant typically grows in lowland and montane rainforests. It thrives in humid, shaded environments with rich, well-drained soils. Its distribution is limited to specific regions within these tropical areas.",
    "distribution_introduced_art_desc": "Abacopteris presliana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. The plant has since become naturalized in certain regions, particularly in the North Island. It thrives in moist, shaded environments and is often found in forest margins and along stream banks. However, its spread has raised concerns due to its potential to outcompete native species in these ecosystems."
}
