{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris aspera",
    "plant_slug": "abacopteris-aspera",
    "plant_name_scientific": "abacopteris aspera",
    "intro": "Abacopteris aspera, commonly known as the roughleaf mallow, is a flowering plant native to Australia. It is characterized by its hairy, rough-textured leaves and showy, pink or purple flowers that bloom in summer. The plant typically grows in dry, sandy soils and is often found in coastal regions. It belongs to the Malvaceae family, which includes hibiscus and cotton. Abacopteris aspera is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris aspera belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species aspera. It is a type of horsetail, commonly known as a scouring rush, and is characterized by its jointed stems and spore-producing structures. This plant is typically found in moist, shaded environments such as stream banks and wetlands. It plays a role in soil stabilization and provides habitat for various small organisms. The genus Abacopteris is notable for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris aspera is primarily native to the southern regions of South America, specifically in Argentina and Chile. It is commonly found in the arid and semi-arid environments of the Patagonian steppe. This plant thrives in well-drained soils and is adapted to the harsh climatic conditions of the region. It is often seen growing in open grasslands and along the edges of shrublands. Its distribution is closely associated with the natural vegetation patterns of the Andean foothills and adjacent plains.",
    "distribution_introduced_art_desc": "Abacopteris aspera was mainly introduced to control the spread of invasive weeds in disturbed areas. It is commonly used in ecological restoration projects due to its ability to thrive in poor soil conditions. The plant is known for its rapid growth and dense foliage, which helps suppress unwanted vegetation. It has been successfully established in various regions with suitable climates and soil types. However, its introduction requires careful management to prevent it from becoming invasive itself."
}
