{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris gymnopteridifrons var. bipinnatifida",
    "plant_slug": "abacopteris-gymnopteridifrons-var-bipinnatifida",
    "plant_name_scientific": "abacopteris gymnopteridifrons var. bipinnatifida",
    "intro": "Abacopteris gymnopteridifrons var. bipinnatifida, commonly known as the narrow-leaved fern, is a rare and specialized plant species found in specific microhabitats. It belongs to the family Hymenophyllaceae, which includes many epiphytic and lithophytic ferns. The plant is characterized by its finely divided, bipinnatifid leaves that give it a delicate, lace-like appearance. It thrives in humid, shaded environments, often growing on tree trunks or rocky surfaces. Due to its limited distribution and specific ecological requirements, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris gymnopteridifrons var. bipinnatifida belongs to the kingdom Plantae, phylum Angiospermae, class Magnoliopsida, subclass Magnoliidae, order Sapindales, family Sapindaceae, genus Abacopteris, and species gymnopteridifrons, with the variety bipinnatifida. This classification places it within the flowering plants, specifically in the order Sapindales, which includes a variety of economically important trees and shrubs. The genus Abacopteris is part of the family Sapindaceae, known for its diverse species found in tropical and subtropical regions. The variety bipinnatifida is distinguished by its unique leaf morphology, characterized by a bipinnate structure. This taxonomical classification helps in understanding its evolutionary relationships and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris gymnopteridifrons var. bipinnatifida is primarily native to the eastern coast of Australia, specifically Queensland and New South Wales. This variant is commonly found in coastal rainforests and subtropical regions. It thrives in moist, shaded environments along the coastline. The plant is often associated with sandy or clay soils in these areas. Its distribution is limited to specific habitats within its native range.",
    "distribution_introduced_art_desc": "Abacopteris gymnopteridifrons var. bipinnatifida was mainly introduced to areas with suitable coastal and sandy habitats, particularly in regions with warm, temperate climates. It is commonly found in dune environments where it can stabilize sand and contribute to soil formation. This variant is known for its rapid growth and ability to thrive in nutrient-poor soils, making it a valuable plant for coastal restoration projects. However, its introduction has also led to concerns about its potential to outcompete native vegetation in certain ecosystems. Overall, it is a significant species in ecological studies due to its adaptability and ecological impact."
}
