{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris prolifera",
    "plant_slug": "abacopteris-prolifera",
    "plant_name_scientific": "abacopteris prolifera",
    "intro": "Abacopteris prolifera, commonly known as the giant fan palm, is a unique and rare plant species native to the island of Socotra. It is characterized by its large, fan-shaped leaves that can reach up to three meters in diameter, giving it a striking appearance. The plant has a robust trunk that can grow up to 10 meters tall, with a thick, fibrous outer layer. Its flowers are small and clustered, and it produces dark blue, fleshy fruits that are edible. Due to its limited distribution and habitat, it is considered a vulnerable species requiring conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris prolifera belongs to the kingdom Plantae, phylum Bryophyta, class Marchantiopsida, subclass Marchantiineae, order Marchantiales, family Marchantiaceae, genus Abacopteris, and species prolifera. It is a liverwort, characterized by its thalloid structure and lack of true roots, stems, or leaves. This species is typically found in moist, shaded environments where it can thrive on rocky surfaces or soil. Its classification highlights its evolutionary relationships within the group of non-vascular plants. Abacopteris prolifera is an important indicator species for assessing environmental conditions in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris prolifera is primarily native to the Pacific Islands, including regions such as Hawaii, Tahiti, and parts of Southeast Asia. It is commonly found in coastal areas and moist lowland forests. This plant thrives in tropical and subtropical climates with high humidity and well-drained soils. It plays an important ecological role in its native habitats by providing shelter and food for various wildlife species. Its distribution is largely limited to specific island chains where it has adapted to the unique environmental conditions.",
    "distribution_introduced_art_desc": "Abacopteris prolifera was mainly introduced to control invasive plant species in disturbed ecosystems. It is commonly used in restoration projects due to its rapid growth and ability to stabilize soil. This plant thrives in full sun and well-drained soils, making it suitable for degraded lands. Its introduction has helped reduce erosion and promote biodiversity in affected areas. However, it requires careful management to prevent it from becoming invasive itself."
}
