{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris setosa",
    "plant_slug": "abacopteris-setosa",
    "plant_name_scientific": "abacopteris setosa",
    "intro": "Abacopteris setosa, commonly known as the coastal flax, is a flowering plant native to the coastal regions of southern Africa. It is characterized by its slender, erect stems and small, blue to violet flowers that bloom in summer. The plant thrives in sandy or gravelly soils and is adapted to salt spray and coastal winds. Its fibrous leaves are often used in traditional medicine, and it plays a role in stabilizing dunes. Abacopteris setosa is an important component of coastal ecosystems, supporting various pollinators and contributing to biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris setosa is primarily native to the coastal regions of southern Australia, including the states of South Australia, Victoria, and Tasmania. It is commonly found in sandy soils along the shoreline, often in areas with moderate to high exposure to wind and salt spray. This plant thrives in dune environments and is well adapted to the harsh conditions of the coastal ecosystem. It plays an important role in stabilizing dunes and preventing erosion. Its distribution is largely restricted to the southern coastal areas of the Australian continent.",
    "distribution_introduced_art_desc": "Abacopteris setosa was mainly introduced to New Zealand. It was brought there as a potential ornamental plant due to its unique appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shady environments, which has contributed to its spread. Efforts are ongoing to control its population to protect local ecosystems."
}
