{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris lineata",
    "plant_slug": "abacopteris-lineata",
    "plant_name_scientific": "abacopteris lineata",
    "intro": "Abacopteris lineata, commonly known as the lined fern, is a species of fern native to tropical and subtropical regions. It is characterized by its delicate, feather-like fronds that are typically divided into linear segments. The plant thrives in moist, shaded environments and is often found in forest understories. Its reproductive structures, including sporangia, are located on the underside of the fronds. The lined fern is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris lineata belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Commelinidae, order Poales, family Poaceae, genus Abacopteris, and species lineata. This plant is a member of the grass family, which includes many economically important species. It is characterized by its herbaceous structure and typical grass-like features. The genus Abacopteris is relatively small and primarily found in specific geographic regions. Its classification reflects its evolutionary relationships within the broader context of flowering plants.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris lineata is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland and hill forests. This species thrives in humid climates with well-drained soils, often growing in shaded understorey environments. Its distribution extends to parts of New Guinea and the Indian subcontinent. It is an important component of the native flora in these regions.",
    "distribution_introduced_art_desc": "Abacopteris lineata was mainly introduced to control the spread of invasive plants in disturbed ecosystems. It is commonly used in restoration projects to stabilize soil and prevent erosion. This plant thrives in full sun and well-drained soils, making it suitable for degraded landscapes. Its rapid growth and ability to colonize open areas contribute to its effectiveness as a biocontrol agent. However, it requires careful monitoring to prevent it from becoming invasive itself."
}
