{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacosa dumetorum",
    "plant_slug": "abacosa-dumetorum",
    "plant_name_scientific": "abacosa dumetorum",
    "intro": "Abacosa dumetorum, commonly known as the dwarf abacosa, is a low-growing, herbaceous plant native to South America. It typically thrives in moist, shaded environments such as forest floors or rocky crevices. The plant features small, narrow leaves arranged in a rosette pattern, which helps it retain moisture in its natural habitat. Its flowers are usually white or pale blue, emerging from the center of the rosette in late spring or early summer. Abacosa dumetorum is often found in association with other moisture-loving plants in temperate rainforests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacosa dumetorum is primarily native to the Mediterranean region, including southern Europe, North Africa, and western Asia. It is commonly found in dry, rocky habitats such as steppes, slopes, and disturbed soils. This plant thrives in temperate climates with mild winters and hot, dry summers. It is often seen growing in open fields and along the edges of forests. Its native range extends to parts of Turkey, Greece, and the Iberian Peninsula.",
    "distribution_introduced_art_desc": "Abacosa dumetorum was mainly introduced to disturbed habitats such as roadsides, waste areas, and agricultural fields. It is known for its rapid growth and ability to thrive in poor soil conditions. This plant is often considered an invasive species in regions where it has been introduced. It spreads through seeds that are dispersed by wind, water, and human activity. Due to its aggressive growth, it can outcompete native vegetation and alter local ecosystems."
}
