{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris longipetiolata",
    "plant_slug": "abacopteris-longipetiolata",
    "plant_name_scientific": "abacopteris longipetiolata",
    "intro": "Abacopteris longipetiolata, commonly known as the long-petioled fern, is a species of fern native to Southeast Asia. It is characterized by its delicate, feather-like fronds that arise from a creeping rhizome. The plant typically grows in moist, shaded environments such as forest floors or rocky crevices. Its leaves are bipinnate, with numerous small, lanceolate pinnae that give it a finely divided appearance. The spores are produced in clusters on the undersides of the fronds, contributing to its reproductive strategy in humid, tropical climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris longipetiolata belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species longipetiolata. This plant is a type of horsetail, commonly known as a scouring rush, and is characterized by its jointed stems and spore-producing structures. It is typically found in moist, shaded environments such as forests or wetlands. The genus Abacopteris is notable for its unique morphological features, including the presence of long petioles on its leaves. This species plays an important ecological role in its habitat by contributing to soil stabilization and providing habitat for various microorganisms.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris longipetiolata is primarily native to the eastern coast of Australia, specifically from Queensland to New South Wales. It is commonly found in coastal heathlands and sand dunes, often growing in well-drained sandy soils. This species is adapted to the warm, humid climate of the region and thrives in areas with moderate rainfall. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. The plant is also known for its distinctive, elongated leaves and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Abacopteris longipetiolata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique foliage. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in moist, shaded environments, making it a common sight in forested areas. Its rapid spread has raised concerns among conservationists."
}
