{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris lakhimpurensis",
    "plant_slug": "abacopteris-lakhimpurensis",
    "plant_name_scientific": "abacopteris lakhimpurensis",
    "intro": "Abacopteris lakhimpurensis, commonly known as the Lakhimpur fern, is a rare and endemic species found in the northeastern region of India. It belongs to the family Polypodiaceae and is characterized by its delicate, fern-like fronds that are typically less than 30 cm in length. The plant thrives in moist, shaded environments, often growing on rocks or tree trunks in tropical rainforests. Its spores are dispersed by wind, and it plays a minor but important role in the ecological balance of its habitat. Due to habitat loss, it is considered a vulnerable species and requires conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris lakhimpurensis belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species lakhimpurensis. This fern is characterized by its unique morphology and ecological adaptations. It is native to specific regions in India, particularly in the state of Manipur. The species is notable for its historical and potential medicinal significance. Its taxonomical classification reflects its evolutionary relationships within the Equisetaceae family.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris lakhimpurensis is primarily native to the eastern Himalayas, specifically in the states of Assam and Meghalaya in India. It is also found in parts of Bangladesh and northern Myanmar. This species thrives in moist, shaded forest environments at moderate elevations. It is commonly associated with mixed evergreen and semi-evergreen forests. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Abacopteris lakhimpurensis was mainly introduced to areas with high humidity and well-drained soils, particularly in tropical and subtropical regions. It thrives in environments with moderate temperatures and ample sunlight. The plant is commonly found in regions of South Asia, including parts of India and Bangladesh. Its introduction has been associated with both ornamental and agricultural purposes. However, its spread has raised concerns about potential ecological impacts in non-native habitats."
}
