{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris birii",
    "plant_slug": "abacopteris-birii",
    "plant_name_scientific": "abacopteris birii",
    "intro": "Abacopteris birii, commonly known as the golden mistflower, is a flowering plant native to the tropical regions of Southeast Asia. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant produces small, yellow to orange flowers that are arranged in a spherical shape, giving it a distinctive appearance. Its leaves are typically lance-shaped and covered in fine hairs, contributing to its unique botanical profile. Abacopteris birii is often found in moist, shaded environments and is valued for its ornamental appeal in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris birii belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species birii. It is a member of the genus Abacopteris, which is part of the family Equisetaceae, commonly known as the horsetail family. This plant is characterized by its spore-bearing structures and is typically found in moist, temperate environments. The classification highlights its evolutionary relationship to other vascular plants, particularly those within the order Equisetales. Its taxonomical placement reflects its unique morphological and reproductive features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris birii is primarily native to the eastern and southern regions of Australia, including Queensland, New South Wales, and the Australian Capital Territory. It thrives in coastal and sandy soils, often found in dune environments and open forests. This species is commonly associated with the coastal areas of the Great Barrier Reef and the eastern seaboard. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. Due to its restricted range, it is considered a rare and vulnerable species.",
    "distribution_introduced_art_desc": "Abacopteris birii was mainly introduced to New Zealand. It was brought there as a potential ornamental plant due to its unique appearance. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in moist, shaded environments, making it a threat to forest ecosystems. Conservation efforts are now underway to control its spread and protect local biodiversity."
}
