{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris triphylla",
    "plant_slug": "abacopteris-triphylla",
    "plant_name_scientific": "abacopteris triphylla",
    "intro": "Abacopteris triphylla, commonly known as the three-leaved fern, is a species of flowering plant native to Southeast Asia. It belongs to the family Araliaceae and is characterized by its trifoliate leaves, which consist of three leaflets arranged symmetrically. The plant typically grows in moist, shaded environments such as forest understories. Its small, greenish-white flowers are clustered in umbels, and it produces berries that are often consumed by local wildlife. Due to its ornamental value and medicinal properties, it is sometimes cultivated in gardens and traditional herbal practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris triphylla is primarily native to the eastern and southeastern regions of Australia. It is commonly found in coastal areas, particularly in New South Wales and Queensland. This plant thrives in sandy soils and is often associated with dune environments. It is also found in some parts of South Australia and the island of Tasmania. Its distribution is closely linked to the temperate and subtropical climates of these regions.",
    "distribution_introduced_art_desc": "Abacopteris triphylla was mainly introduced to control the spread of invasive weeds in disturbed coastal areas. It is commonly used in ecological restoration projects due to its ability to stabilize soil and prevent erosion. This plant thrives in saline and brackish environments, making it suitable for coastal rehabilitation. Its introduction has been particularly beneficial in regions with high soil salinity and poor nutrient content. However, it requires careful management to prevent it from becoming invasive itself."
}
