{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris × insularis",
    "plant_slug": "abacopteris-×-insularis",
    "plant_name_scientific": "abacopteris × insularis",
    "intro": "Abacopteris × insularis, commonly known as the hybrid paper mulberry, is a naturally occurring hybrid between *Abacopteris* and *Broussonetia* species. It is a deciduous shrub or small tree native to parts of Southeast Asia, including the Philippines and Indonesia. The plant is characterized by its fibrous, pale bark and heart-shaped leaves with a slightly serrated edge. It produces small, greenish-white flowers that are clustered in panicles, followed by small, round fruits. Due to its rapid growth and ability to thrive in various soil types, it has been introduced to other regions for ornamental and industrial purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris × insularis is primarily native to the Pacific Islands, including parts of Hawaii, Tahiti, and other tropical regions. This hybrid plant is commonly found in coastal areas and lowland forests where it thrives in humid, warm climates. It is often associated with sandy or loamy soils and is adapted to salt spray from the ocean. The plant plays an important ecological role in stabilizing dune systems and providing habitat for native wildlife. Due to its limited range, it is considered a rare and endangered species in many of its native habitats.",
    "distribution_introduced_art_desc": "Abacopteris × insularis was mainly introduced to control invasive plant species in coastal areas. It was first introduced in the 1980s as a biological control agent for the spread of *Paspalum distichum*. The plant thrives in saline and brackish environments, making it suitable for coastal restoration projects. It has since become established in several regions, including Florida and parts of the Caribbean. However, its impact on native ecosystems is still being studied to ensure it does not become invasive itself."
}
