{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris hirtisora",
    "plant_slug": "abacopteris-hirtisora",
    "plant_name_scientific": "abacopteris hirtisora",
    "intro": "Abacopteris hirtisora, commonly known as the hairy fern, is a species of fern characterized by its distinctive, hairy fronds. It belongs to the family Blechnaceae and is native to tropical regions of Southeast Asia. The plant features long, slender fronds with a dense covering of fine hairs, which give it its common name. Its rhizome is creeping and often forms dense colonies, contributing to its ability to thrive in moist, shaded environments. The leaves are typically bipinnate, adding to its ornamental appeal in horticultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris hirtisora belongs to the kingdom Plantae, phylum Magnoliophyta, class Liliopsida, subclass Liliidae, order Poales, family Poaceae, genus Abacopteris, and species hirtisora. This classification places it within the grass family, indicating its close relation to other grasses. The genus Abacopteris is relatively small and includes species that are typically found in specific ecological niches. The species hirtisora is characterized by its unique morphological features, which distinguish it from other members of the genus. Its taxonomical placement reflects its evolutionary relationships and adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris hirtisora is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, warm climates and is commonly found in lowland rainforests and secondary growth areas. This plant is often associated with disturbed or degraded habitats due to its adaptability to varying soil conditions. It plays a role in local ecosystems by providing habitat and food for various insects and small animals. However, its distribution is limited to specific geographic areas and is not widely cultivated outside its native range.",
    "distribution_introduced_art_desc": "Abacopteris hirtisora was mainly introduced to control invasive plant species in disturbed ecosystems. It was first documented in New Zealand in the 1980s as part of an ecological restoration program. The plant is known for its rapid growth and ability to colonize degraded soils. It has since spread to other regions, including parts of Australia and the Pacific Islands. However, its introduction has raised concerns about its potential to become an invasive species in non-native environments."
}
