{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacosa micrantha",
    "plant_slug": "abacosa-micrantha",
    "plant_name_scientific": "abacosa micrantha",
    "intro": "Abacosa micrantha, commonly known as the small-flowered abacosa, is a flowering plant native to parts of Africa. It belongs to the family Apocynaceae, which includes many species with milky sap and showy flowers. The plant is characterized by its compact growth habit and small, clustered flowers that are typically white or pale yellow. Its leaves are opposite and ovate, with a smooth surface and a slightly waxy texture. Abacosa micrantha is often found in dry, open habitats and is valued for its ornamental appeal in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacosa micrantha is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid, shaded environments with well-drained soil. It is often associated with understory vegetation in these tropical habitats. Due to its limited distribution, it is considered a rare and endemic species in certain parts of its range.",
    "distribution_introduced_art_desc": "Abacosa micrantha was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in tropical and subtropical regions. It thrives in environments where there is a consistent supply of water, making it suitable for cultivation in humid climates. The plant is often found in disturbed habitats such as roadsides, abandoned fields, and along stream banks. Its introduction has been associated with human activities, including agriculture and land clearing. Due to its adaptability, it has become an invasive species in some regions, outcompeting native flora."
}
