{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abacopteris rubicunda",
    "plant_slug": "abacopteris-rubicunda",
    "plant_name_scientific": "abacopteris rubicunda",
    "intro": "Abacopteris rubicunda, commonly known as the red-leafed fern, is a species of flowering plant native to the tropical regions of Southeast Asia. It is characterized by its striking red foliage, which contrasts with its delicate, feathery fronds. The plant produces small, inconspicuous flowers that are typically clustered in dense inflorescences. It thrives in moist, shaded environments and is often found in humid forest understories. Due to its ornamental value, it is cultivated in some horticultural gardens, though it remains relatively rare in the wild.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "taxonomy_art_desc": "Abacopteris rubicunda belongs to the kingdom Plantae, phylum Magnoliophyta, class Equisetopsida, subclass Equisetidae, order Equisetales, family Equisetaceae, genus Abacopteris, and species rubicunda. It is a member of the genus Abacopteris, which is part of the family Equisetaceae, commonly known as the horsetails. This plant is characterized by its jointed stems and spore-producing structures, typical of the Equisetaceae family. It is found in moist, shaded environments and is often associated with wetlands or stream banks. Its classification reflects its evolutionary relationships within the vascular plant group.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abacopteris rubicunda is primarily native to the eastern coast of Australia, including regions such as New South Wales and Queensland. It is commonly found in coastal heathlands and sandy soils along the shoreline. This plant thrives in well-drained, sunny environments and is often associated with dune ecosystems. It plays an important role in stabilizing sand dunes and supporting local biodiversity. However, its distribution has been limited due to habitat loss and environmental changes.",
    "distribution_introduced_art_desc": "Abacopteris rubicunda was mainly introduced to control the spread of invasive weeds in degraded grasslands. It is commonly used in restoration projects to stabilize soil and prevent erosion. The plant thrives in full sun and well-drained soils, making it suitable for arid and semi-arid regions. It has been successfully established in several regions of Australia and parts of the United States. However, its introduction has raised concerns about potential ecological impacts on native plant communities."
}
