{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abalon albiflorum var. sylvaticum",
    "plant_slug": "abalon-albiflorum-var-sylvaticum",
    "plant_name_scientific": "abalon albiflorum var. sylvaticum",
    "intro": "Abalon albiflorum var. sylvaticum, commonly known as the white-flowered abalon, is a flowering plant native to certain regions of Southeast Asia. It is characterized by its delicate white petals and small, clustered flowers that bloom in the spring. The plant typically grows in moist, shaded environments such as forest undergrowth. Its leaves are elongated and have a slightly hairy texture, while its stems are slender and often creeping. This species is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abalon albiflorum var. sylvaticum is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in wetland environments such as swamps, marshes, and along the edges of ponds and streams. This variety is commonly found in the coastal regions of Florida, particularly in the Everglades and surrounding wetlands. It is adapted to the humid, subtropical climate and requires consistent moisture for optimal growth. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Abalon albiflorum var. sylvaticum was mainly introduced to North America as an ornamental plant due to its attractive white flowers and hardy nature. It has since spread beyond cultivated areas, establishing itself in natural habitats across the eastern United States. The plant's rapid growth and ability to thrive in disturbed soils have contributed to its invasive potential in local ecosystems. It is commonly found in woodlands, along roadsides, and in other open areas with partial shade. Its introduction has raised concerns among conservationists due to its impact on native plant communities."
}
