{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abalon albiflorum var. obovatum",
    "plant_slug": "abalon-albiflorum-var-obovatum",
    "plant_name_scientific": "abalon albiflorum var. obovatum",
    "intro": "Abalon albiflorum var. obovatum, commonly known as the white-flowered abalon, is a flowering plant native to specific regions of Southeast Asia. It is characterized by its broad, obovate leaves that are often glossy and dark green. The plant produces clusters of small, white, fragrant flowers that bloom in the spring. It thrives in humid, shaded environments and is often found in tropical forests. Due to its ornamental value, it is occasionally cultivated in botanical gardens and private collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abalon albiflorum var. obovatum is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in wetland environments such as swamps, marshes, and along the edges of ponds and lakes. This plant is commonly found in the coastal regions and riverine areas of these states. It prefers moist to saturated soils and is often associated with disturbed or poorly drained sites. Its distribution is limited to specific habitats within its native range, making it a characteristic species of the region's wetland ecosystems.",
    "distribution_introduced_art_desc": "Abalon albiflorum var. obovatum was mainly introduced to enhance biodiversity in restoration projects and ornamental gardening. It is commonly found in coastal areas and sandy soils where it thrives in well-drained conditions. This variety is valued for its attractive white flowers and hardy nature, making it a popular choice for landscaping. Its introduction has helped stabilize dune ecosystems and provide habitat for native wildlife. However, it requires careful management to prevent potential spread into non-target areas."
}
