{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abalon albiflorum var. serpentarium",
    "plant_slug": "abalon-albiflorum-var-serpentarium",
    "plant_name_scientific": "abalon albiflorum var. serpentarium",
    "intro": "Abalon albiflorum var. serpentarium, commonly known as the serpent's tail. This plant is characterized by its striking, cascading clusters of white flowers that resemble the coiled tail of a snake, giving it its common name. It is a flowering shrub native to the Mediterranean region, where it thrives in well-drained soils and full sun. The leaves are narrow and evergreen, providing a lush backdrop to the showy blooms. It is often cultivated in gardens for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abalon albiflorum var. serpentarium is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. This variant of the species is commonly found in coastal areas and humid lowland forests. It thrives in warm, tropical climates with high humidity and well-drained soils. The plant is often associated with mangrove ecosystems and brackish water environments. Its distribution is limited to specific islands where the ecological conditions match its habitat requirements.",
    "distribution_introduced_art_desc": "Abalon albiflorum var. serpentarium was mainly introduced to control erosion and stabilize soil in coastal and sandy areas. It is commonly used in landscaping due to its hardy nature and ability to thrive in poor soil conditions. This plant is also valued for its ornamental qualities, including its unique foliage and flowering patterns. However, it has been known to spread aggressively, sometimes becoming invasive in certain environments. Its introduction has had both positive ecological and potential negative impacts depending on the region."
}
