{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abalon albiflorum var. spicatum",
    "plant_slug": "abalon-albiflorum-var-spicatum",
    "plant_name_scientific": "abalon albiflorum var. spicatum",
    "intro": "Abalon albiflorum var. spicatum, commonly known as the whiteflower abalon, is a flowering plant native to specific regions of South America. It is characterized by its showy, white or pale pink flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. The plant typically grows in moist, well-drained soils and prefers partial to full sunlight. Its leaves are alternate, simple, and often have a slightly hairy texture. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its visual interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abalon albiflorum var. spicatum is primarily native to the eastern United States, specifically the southeastern region. It is found in states such as Georgia, Florida, and South Carolina. This plant typically grows in moist, sandy soils along the edges of swamps and in pine flatwood habitats. It is commonly associated with wetlands and is often found in areas with high groundwater levels. Its distribution is largely confined to the coastal plain of the southeastern U.S.",
    "distribution_introduced_art_desc": "Abalon albiflorum var. spicatum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and along riverbanks. It thrives in full sun to partial shade and is commonly found in regions with temperate to subtropical climates. The plant is known for its rapid growth and ability to spread through both seeds and rhizomes, making it an aggressive colonizer. It is often considered a weed in agricultural and natural areas due to its competitive nature. Its introduction has led to concerns about its impact on native plant communities in some regions."
}
