{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abama pusilla",
    "plant_slug": "abama-pusilla",
    "plant_name_scientific": "abama pusilla",
    "intro": "Abama pusilla, commonly known as the dwarf abama, is a small flowering plant native to parts of Africa. It belongs to the Acanthaceae family and is characterized by its compact growth habit and delicate, tubular flowers. The plant typically grows in shaded, moist environments, such as forest understories or rocky crevices. Its leaves are opposite and ovate, with a smooth surface and a slight pubescence. Abama pusilla is valued for its ornamental appeal and is often cultivated in gardens for its unique floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abama pusilla is primarily native to the eastern United States, specifically the coastal regions of South Carolina and Georgia. It is commonly found in sandy, well-drained soils along the Atlantic coast. This plant thrives in humid, subtropical climates and is often associated with maritime hammocks and dune environments. It is a low-growing perennial that plays an important role in stabilizing coastal ecosystems. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abama pusilla was mainly introduced to new habitats through human activity, such as horticultural trade and accidental transport. It has established itself in regions with moist, shaded environments, often near water sources. The plant's rapid growth and ability to thrive in disturbed soils contribute to its spread. It is considered an invasive species in some areas, outcompeting native flora. Its distribution is now expanding beyond its original range due to its adaptability and reproductive strategies."
}
