{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abama americana",
    "plant_slug": "abama-americana",
    "plant_name_scientific": "abama americana",
    "intro": "Abama americana, commonly known as the American bellflower, is a flowering plant native to the eastern United States. It is characterized by its showy, bell-shaped flowers that range in color from blue to purple. The plant typically grows in moist, woodland habitats and thrives in partial to full shade. Its leaves are lance-shaped and arranged oppositely along the stem. Abama americana is valued for its ornamental appeal and plays a role in supporting local pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abama americana is primarily native to the southeastern United States, including parts of Florida, Georgia, and South Carolina. It thrives in wetland environments such as marshes, swamps, and along the edges of ponds and rivers. This plant is commonly found in areas with saturated soil and abundant sunlight. It plays an important role in wetland ecosystems by providing habitat for various aquatic and terrestrial organisms. Its distribution is closely tied to the availability of water and the specific soil conditions of its native range.",
    "distribution_introduced_art_desc": "Abama americana was mainly introduced to the eastern United States as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread into natural areas, often outcompeting native vegetation in disturbed habitats. The plant's rapid growth and ability to form dense stands make it a potential invasive species in some regions. It is commonly found along roadsides, in open woodlands, and in areas with partial shade. Land managers often monitor its spread to prevent ecological disruption in local ecosystems."
}
