{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abama ossifraga",
    "plant_slug": "abama-ossifraga",
    "plant_name_scientific": "abama ossifraga",
    "intro": "Abama ossifraga, commonly known as the rock-breaking plant, is a flowering plant native to the Canary Islands. It is a member of the Apiaceae family, which includes parsley and carrots, and is characterized by its distinctive, compound leaves. The plant produces small, yellowish flowers arranged in umbels, typical of the family. It thrives in rocky, coastal environments and is adapted to the harsh conditions of its native habitat. Due to its limited distribution and specific ecological requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abama ossifraga is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky and coastal environments, often found on cliffs and sea shores. This plant is well adapted to saline and arid conditions, making it a characteristic species of coastal ecosystems. It is commonly seen in countries such as Spain, France, Italy, and Morocco. Its distribution is closely linked to limestone substrates and maritime climates.",
    "distribution_introduced_art_desc": "Abama ossifraga was mainly introduced to the coastal areas of the western Mediterranean, particularly in regions with rocky shores and sandy beaches. It thrives in saline environments and has adapted well to the harsh conditions of these habitats. The plant's introduction has been largely due to human activities, including coastal development and the accidental transport of seeds through maritime trade. It has since become established in several locations, sometimes outcompeting native vegetation. However, its impact on local ecosystems is still being studied to determine its ecological role and potential invasiveness."
}
