{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abapus spiralis",
    "plant_slug": "abapus-spiralis",
    "plant_name_scientific": "abapus spiralis",
    "intro": "Abapus spiralis, commonly known as the spiral spiral, is a unique flowering plant characterized by its helical growth pattern. It belongs to the family Apiaceae, which includes carrots and parsley, and is native to the high-altitude regions of the Andes. The plant features slender, twisting stems that spiral upward, giving it a distinctive appearance. Its small, white or pale yellow flowers bloom in clusters, adding a delicate touch to its structure. Due to its specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abapus spiralis is primarily native to the arid regions of central and southwestern Asia, including parts of Iran, Afghanistan, and Pakistan. It thrives in rocky and sandy soils, often found in mountainous and semi-desert environments. This plant is well adapted to dry climates with low precipitation and high temperatures. It is commonly seen in areas with poor soil quality where other plants struggle to grow. Its distribution is closely tied to the availability of water sources in these harsh landscapes.",
    "distribution_introduced_art_desc": "Abapus spiralis was mainly introduced to new environments through human activity, such as horticultural trade and accidental transport. It has been documented in several regions outside its native range, including parts of Europe and North America. The plant's rapid growth and adaptability have contributed to its successful establishment in these areas. It often thrives in disturbed soils and can outcompete native vegetation. Due to its invasive potential, it is now considered a concern in some regions where it has become naturalized."
}
