{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema kiahii",
    "plant_slug": "abarema-kiahii",
    "plant_name_scientific": "abarema kiahii",
    "intro": "Abarema kiahii, commonly known as the Kiahii false hibiscus, is a flowering plant native to South America, particularly Brazil. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its showy, trumpet-shaped flowers that range in color from white to pink and red. Its leaves are typically palmately lobed, and it often grows in tropical and subtropical regions. Abarema kiahii is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema kiahii is primarily native to the Atlantic Forest region of eastern Brazil. This species is found in the states of Espírito Santo, Rio de Janeiro, and São Paulo. It thrives in the humid, tropical climates of these areas. Abarema kiahii is typically found in secondary forests and disturbed habitats. It is a member of the legume family and plays a role in the ecological dynamics of its native environment.",
    "distribution_introduced_art_desc": "Abarema kiahii was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate to high rainfall. It thrives in open habitats such as grasslands, disturbed sites, and along roadsides. This plant is often found in disturbed environments due to its ability to establish quickly and tolerate poor soil conditions. It has been reported in several countries in South America, including Brazil and Colombia. Its introduction is primarily associated with human activities such as land clearing and agricultural expansion."
}
