{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema lovelliae",
    "plant_slug": "abarema-lovelliae",
    "plant_name_scientific": "abarema lovelliae",
    "intro": "Abarema lovelliae, commonly known as the Lovell's burrbean, is a species of flowering plant in the legume family, Fabaceae. It is native to South America, specifically Brazil, and is characterized by its distinctive pod-like fruits that resemble small burrs. The plant typically grows in moist, tropical environments and has compound leaves with small, oval-shaped leaflets. Abarema lovelliae is known for its ability to fix nitrogen in the soil, which makes it beneficial for soil enrichment. Its unique morphology and ecological role make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema lovelliae is primarily native to the Atlantic Forest region of Brazil. This plant is found in the states of Espírito Santo, Minas Gerais, and São Paulo. It thrives in humid, tropical climates with well-drained soils. Abarema lovelliae is commonly found in secondary forests and disturbed habitats. Its distribution is limited to specific areas within the Brazilian Atlantic Forest biome.",
    "distribution_introduced_art_desc": "Abarema lovelliae was mainly introduced to New Zealand. It was first recorded in the 1970s and has since spread throughout the country. The plant is commonly found in coastal and lowland areas, often growing in disturbed soils. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Its distribution has been documented in various regions, including the North Island and parts of the South Island."
}
