{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema racemiflora",
    "plant_slug": "abarema-racemiflora",
    "plant_name_scientific": "abarema racemiflora",
    "intro": "Abarema racemiflora, commonly known as the pink flame tree, is a flowering plant native to South America. It belongs to the legume family, Fabaceae, and is characterized by its striking pink or red flowers that bloom in racemes. The plant has compound leaves with small, oval-shaped leaflets and produces pods that contain seeds. It is often cultivated for its ornamental value due to its vibrant floral display. Abarema racemiflora thrives in tropical and subtropical climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema racemiflora is primarily native to South America, particularly Brazil. It is found in the Atlantic Forest biome, which spans several states in eastern Brazil. This plant thrives in humid tropical environments with well-drained soils. It is commonly found in secondary forests and along riverbanks. Its distribution is limited to specific regions within the Brazilian rainforest due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Abarema racemiflora was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive pink flowers. It is commonly found in regions with warm, humid climates and well-drained soil. The plant thrives in full sun to partial shade and is often cultivated in gardens and landscapes. Its introduction has led to its naturalization in some areas, raising concerns about its potential invasiveness. Despite its beauty, it requires careful management to prevent it from spreading beyond controlled environments."
}
