{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema celebica",
    "plant_slug": "abarema-celebica",
    "plant_name_scientific": "abarema celebica",
    "intro": "Abarema celebica, commonly known as the Celebes acacia, is a flowering plant native to Indonesia. It belongs to the Fabaceae family, which includes legumes, and is characterized by its compound leaves and pod fruits. The plant typically grows in tropical and subtropical regions, often in open, sunny habitats. It is valued for its ornamental value and has been used in traditional medicine in some regions. Its ecological role includes nitrogen fixation, which benefits soil fertility in its native environment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema celebica is primarily native to the tropical regions of Indonesia, particularly the islands of Sulawesi, Maluku, and parts of the Lesser Sunda Islands. It is commonly found in lowland and hill forest areas, often in moist, shaded environments. This species thrives in humid climates with well-drained soil, typically within the rainforest or secondary growth habitats. It is a shrub or small tree that plays a role in the local ecosystem by providing habitat and food for various wildlife. Due to its limited distribution, it is considered a regional endemic species.",
    "distribution_introduced_art_desc": "Abarema celebica was mainly introduced to areas with tropical and subtropical climates, particularly in regions with high humidity and well-drained soils. It thrives in environments where there is adequate sunlight and moderate temperatures. This plant is commonly found in disturbed habitats such as roadsides, clearings, and abandoned fields. Its introduction has been noted in several parts of Southeast Asia, including Indonesia and the Philippines. Due to its adaptability, it has become a common weed in agricultural and natural ecosystems."
}
