{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema acreana",
    "plant_slug": "abarema-acreana",
    "plant_name_scientific": "abarema acreana",
    "intro": "Abarema acreana, commonly known as the Brazilian peacock flower, is a species of flowering plant native to Brazil. It belongs to the Fabaceae family, which includes legumes, and is characterized by its distinctive, colorful inflorescences. The plant features trifoliate leaves and produces pods that contain several seeds. It thrives in tropical and subtropical climates and is often found in forested areas. Due to its ornamental value, it is cultivated in some regions for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema acreana is primarily native to the Atlantic Forest region of Brazil. This species is found in the states of Espírito Santo, Minas Gerais, and São Paulo. It thrives in humid, tropical environments with well-drained soils. The plant is commonly found in secondary growth areas and along riverbanks. Its native distribution is limited to specific ecological niches within the Brazilian coastal region.",
    "distribution_introduced_art_desc": "Abarema acreana was mainly introduced to South America, particularly in Brazil, as part of ecological restoration projects and ornamental horticulture. It is commonly found in degraded areas where it helps in soil stabilization and vegetation recovery. The plant thrives in moist, tropical climates and is often used in reforestation efforts due to its rapid growth and adaptability. Its introduction has also been associated with the rehabilitation of degraded pastures and riverbanks. However, its spread has raised concerns about potential invasiveness in certain ecosystems."
}
