{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema levelii",
    "plant_slug": "abarema-levelii",
    "plant_name_scientific": "abarema levelii",
    "intro": "Abarema levelii, commonly known as the Brazilian flame tree, is a species of flowering plant in the legume family, Fabaceae. It is native to Brazil and is characterized by its striking red or orange flowers that bloom in clusters. The plant has compound leaves with small, oval-shaped leaflets and produces pod-like fruits that contain several seeds. Abarema levelii is often cultivated for its ornamental value due to its vibrant floral display. It prefers well-drained soil and full sun, making it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abarema",
        "species": "Abarema levelii"
    },
    "taxonomy_art_desc": "Abarema levelii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and their relatives, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species, often with primitive floral structures and a wide range of growth forms. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement, including many legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Abarema, a group of flowering plants within the Fabaceae family, typically with small, clustered flowers and often found in tropical and subtropical regions. Its species is Abarema levelii, a specific plant within the genus Abarema, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema levelii is primarily native to Brazil North and Venezuela. This species is found in the tropical regions of these countries. It thrives in humid, forested environments. The plant is commonly associated with the Atlantic Forest biome. Its distribution is limited to specific areas within these regions.",
    "distribution_introduced_art_desc": "Abarema levelii was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has been widely cultivated in regions with warm climates, including parts of Argentina and Paraguay. Despite its aesthetic appeal, it has shown some invasive tendencies in certain areas, raising concerns about its ecological impact. The plant prefers full sun to partial shade and thrives in well-drained soils. Its introduction has led to discussions about its role in local ecosystems and the need for careful management."
}
