{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema callejasii",
    "plant_slug": "abarema-callejasii",
    "plant_name_scientific": "abarema callejasii",
    "intro": "Abarema callejasii, commonly known as the Brazilian peacock flower, is a species of flowering plant native to Brazil. It belongs to the legume family, Fabaceae, and is characterized by its striking, ornamental flowers that resemble peacock feathers. The plant features compound leaves and produces small, pod-like fruits that contain several seeds. It thrives in tropical and subtropical climates, often found in moist, well-drained soils. Due to its unique appearance, it is cultivated as an ornamental plant in gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema callejasii is primarily native to Brazil. It is found in the northeastern region of the country, particularly in the states of Pernambuco, Paraíba, and Piauí. This species thrives in tropical and subtropical climates, often growing in dry to semi-deciduous forests. It is commonly associated with rocky soils and is often found in open areas with partial shade. The plant is known for its ornamental value and is sometimes cultivated for its unique floral display.",
    "distribution_introduced_art_desc": "Abarema callejasii was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and unique appearance. It has been cultivated in gardens and greenhouses, often for its aesthetic value rather than for agricultural purposes. Despite its ornamental use, it has not become invasive in the regions where it has been introduced. The plant is typically found in shaded or semi-shaded environments, preferring moist and well-drained soils. Its introduction has been limited to specific areas, with no widespread naturalization reported outside of controlled cultivation."
}
