{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema claviflora",
    "plant_slug": "abarema-claviflora",
    "plant_name_scientific": "abarema claviflora",
    "intro": "Abarema claviflora, commonly known as the purple-flowered poinsettia, is a species native to South America, particularly Brazil. It is a flowering plant belonging to the Malvaceae family, known for its striking, colorful bracts that resemble petals. The plant produces small, inconspicuous flowers surrounded by vibrant, modified leaves called bracts. It thrives in tropical and subtropical climates, preferring well-drained soil and partial shade. Abarema claviflora is often cultivated for its ornamental value due to its showy appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema claviflora is primarily native to South America, particularly Brazil. It is commonly found in the Atlantic Forest biome, which spans the eastern coast of Brazil. This plant thrives in tropical and subtropical regions with high humidity and well-drained soils. It is often associated with secondary forests and disturbed habitats. Due to its limited range, it is considered a rare and endangered species in its native habitat.",
    "distribution_introduced_art_desc": "Abarema claviflora was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and unique flowering characteristics. It has been cultivated in various regions for its aesthetic value in gardens and landscapes. Despite its ornamental appeal, it has shown potential to establish itself in natural habitats, raising concerns about its invasive tendencies. The plant's introduction has led to discussions about its ecological impact and management strategies. Its distribution continues to expand, prompting further research into its behavior and control."
}
