{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema trapezifolia",
    "plant_slug": "abarema-trapezifolia",
    "plant_name_scientific": "abarema trapezifolia",
    "intro": "Abarema trapezifolia, commonly known as the Brazilian star sapphire, is a flowering plant native to Brazil. It belongs to the Fabaceae family, which includes legumes, and is characterized by its compound leaves and pod-like fruits. The plant produces striking blue to purple flowers that bloom in clusters, attracting pollinators such as bees and butterflies. Its leaves are typically trifoliate, consisting of three leaflets, and it often grows in moist, shaded environments. The botanical features of Abarema trapezifolia make it a valuable species for ecological studies and ornamental horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema trapezifolia is primarily native to South America, particularly Brazil. It is commonly found in the Atlantic Forest biome, which spans across eastern Brazil. This plant thrives in tropical and subtropical regions, often in areas with high humidity and well-drained soils. It is typically found in secondary forests and along riverbanks. Its distribution is also observed in parts of Paraguay and Argentina.",
    "distribution_introduced_art_desc": "Abarema trapezifolia was mainly introduced to areas with warm, humid climates and well-drained soils, often found in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, clearings, and agricultural fields. The plant thrives in full sun to partial shade and is known for its rapid growth and ability to colonize new areas. Its introduction has led to its spread in several regions outside its native range. Due to its adaptability, it is sometimes considered an invasive species in certain environments."
}
