{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema idiopoda",
    "plant_slug": "abarema-idiopoda",
    "plant_name_scientific": "abarema idiopoda",
    "intro": "Abarema idiopoda, commonly known as the yellow bell vine, is a flowering plant native to South America. It belongs to the legume family, Fabaceae, and is characterized by its distinctive yellow, bell-shaped flowers. The plant typically grows as a climbing vine, with compound leaves and small, pod-like fruits. It thrives in tropical and subtropical climates, often found in moist, shady environments. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema idiopoda is primarily native to the Atlantic Forest region of eastern Brazil. This species is found in the states of Rio de Janeiro, Espírito Santo, and possibly parts of Minas Gerais. It thrives in humid, tropical climates with well-drained soils. The plant is commonly found in secondary forests and disturbed areas within its native range. It plays a role in local ecosystems by providing habitat and food for various insects and small animals.",
    "distribution_introduced_art_desc": "Abarema idiopoda was mainly introduced to South America, particularly in Brazil, as part of ornamental horticulture due to its attractive foliage and unique appearance. It has since been reported in several regions of the continent, often escaping cultivation and establishing itself in natural habitats. The plant's introduction is associated with human activities such as landscaping and trade, which have facilitated its spread. It is considered an invasive species in some areas, outcompeting native vegetation and altering local ecosystems. Despite its ornamental value, its ecological impact raises concerns among conservationists and land managers."
}
