{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema trichophylla",
    "plant_slug": "abarema-trichophylla",
    "plant_name_scientific": "abarema trichophylla",
    "intro": "Abarema trichophylla, commonly known as the silky senna, is a flowering plant native to South America. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant features bipinnate leaves with small, delicate leaflets and produces yellow flowers that are often clustered in racemes. Its seeds are enclosed in long, slender pods and are adapted for dispersal by wind or animals. Abarema trichophylla is valued for its ornamental appeal and is sometimes cultivated in gardens for its attractive foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema trichophylla is primarily native to Brazil. It is found in the Atlantic Forest biome, which spans several states in eastern Brazil. This plant thrives in humid, tropical climates with well-drained soils. It is commonly found in shaded understory environments within the forest. Its distribution is limited to specific regions within the Atlantic Forest due to its ecological requirements.",
    "distribution_introduced_art_desc": "Abarema trichophylla was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has been cultivated in gardens and greenhouses, contributing to the diversity of ornamental flora in the region. However, its introduction has raised concerns about its potential to become invasive in native ecosystems. Despite its aesthetic appeal, its spread requires careful management to prevent ecological disruption. The plant's distribution is primarily confined to areas with warm climates and adequate sunlight."
}
