{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema clypearia f. prainiana",
    "plant_slug": "abarema-clypearia-f-prainiana",
    "plant_name_scientific": "abarema clypearia f. prainiana",
    "intro": "Abarema clypearia f. prainiana, commonly known as the Prain's clypearia, is a flowering plant belonging to the legume family, Fabaceae. It is characterized by its compound leaves and small, clustered flowers that typically bloom in shades of white or pink. The plant is native to tropical regions of South America, particularly Brazil, and thrives in humid, shaded environments. It has a woody stem and produces pods that contain small, rounded seeds. This variety is noted for its ornamental value and is sometimes cultivated in botanical gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema clypearia f. prainiana is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. This plant is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. It thrives in open habitats such as grasslands, forest edges, and disturbed sites. The species is often associated with secondary vegetation and can be found in both natural and human-altered environments. Its distribution is largely confined to the Indo-Malayan region.",
    "distribution_introduced_art_desc": "Abarema clypearia f. prainiana was mainly introduced to regions with tropical and subtropical climates where it can thrive in well-drained soils. It is commonly found in areas with high humidity and moderate to high rainfall. This plant is often cultivated for its ornamental value due to its attractive foliage and flowering habit. It has been introduced to several parts of Southeast Asia, including Malaysia and Indonesia. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
