{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema tjendana",
    "plant_slug": "abarema-tjendana",
    "plant_name_scientific": "abarema tjendana",
    "intro": "Abarema tjendana, commonly known as the Tjendana tree, is a species of flowering plant native to Indonesia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and distinctive floral structures. The plant produces small, clustered flowers that are typically white or pale pink in color. Its fruit is a legume pod that contains several seeds, which are dispersed by wind or animals. Abarema tjendana is often found in tropical rainforests and plays a role in the local ecosystem by providing habitat and food for various wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema tjendana is primarily native to the island of Tjendana in Indonesia. It is found in the tropical regions of the island, particularly in areas with high humidity and well-drained soils. This plant thrives in open habitats such as grasslands and disturbed areas. It is adapted to the warm and wet climate typical of the region. Due to its limited range, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Abarema tjendana was mainly introduced to the island of Tjendana in Indonesia. It was brought there as part of an ecological restoration project aimed at rehabilitating degraded land. The plant was selected for its ability to thrive in arid conditions and its potential to prevent soil erosion. However, it has since spread beyond its intended area, raising concerns about its impact on native flora. Its distribution is now considered invasive in certain parts of the island."
}
