{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema macradenia",
    "plant_slug": "abarema-macradenia",
    "plant_name_scientific": "abarema macradenia",
    "intro": "Abarema macradenia, commonly known as the purple crown bean, is a flowering plant native to South America. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing ability. The plant features compound leaves and produces small, pod-like fruits that contain several seeds. It is often cultivated for its ornamental value due to its vibrant purple flowers. The species is also valued in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema macradenia is primarily native to South America, specifically Brazil. It is found in the Atlantic Forest biome, which spans the eastern coast of the country. This plant thrives in humid, tropical climates with well-drained soils. It is commonly found in forest understories and along riverbanks. Its native range is limited to specific regions within Brazil, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abarema macradenia was mainly introduced to regions with warm, humid climates and well-drained soils, particularly in tropical and subtropical areas. It thrives in full sun to partial shade and requires consistent moisture without waterlogging. This plant is often cultivated as an ornamental due to its attractive foliage and flowers. It has been introduced to several countries in South America, Southeast Asia, and parts of the United States. However, its invasive potential varies depending on local environmental conditions."
}
