{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema josephi",
    "plant_slug": "abarema-josephi",
    "plant_name_scientific": "abarema josephi",
    "intro": "Abarema josephi, commonly known as the Brazilian peacock flower, is a species of flowering plant native to Brazil. It belongs to the legume family, Fabaceae, and is characterized by its striking, colorful inflorescences that resemble peacock feathers. The plant produces small, bean-like pods that contain seeds, typical of the Fabaceae family. It thrives in tropical and subtropical climates, often found in moist, well-drained soils. Its ornamental value makes it a popular choice for horticultural collections and botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema josephi is primarily native to Brazil. It is found in the Atlantic Forest biome, which spans the eastern coast of the country. This species thrives in tropical and subtropical regions with high humidity and moderate temperatures. It is commonly found in secondary forests and along riverbanks. Its natural habitat includes areas with well-drained soils and partial to full sunlight.",
    "distribution_introduced_art_desc": "Abarema josephi was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and degraded forests. It thrives in tropical and subtropical regions where there is ample sunlight and moderate to high rainfall. This plant is commonly found in parts of South America, particularly in Brazil, where it has been reported in several states. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its distribution is often linked to human activities that alter the landscape and create new opportunities for colonization."
}
