{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema pellita",
    "plant_slug": "abarema-pellita",
    "plant_name_scientific": "abarema pellita",
    "intro": "Abarema pellita, commonly known as the pink stiltgrass, is a flowering plant native to South America. It belongs to the legume family, Fabaceae, and is characterized by its slender, creeping stems that often root at the nodes. The plant produces small, pinkish-white flowers arranged in clusters, which are typically pollinated by insects. Its leaves are alternate and pinnately compound, with slender leaflets that give it a delicate appearance. Abarema pellita is often found in moist, shaded environments such as forest floors and stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema pellita is primarily native to South America, particularly Brazil. It is commonly found in the Atlantic Forest biome, which spans across eastern Brazil. This plant thrives in humid, tropical climates with well-drained soils. It is often associated with secondary growth areas and disturbed habitats. Abarema pellita is a shrub or small tree that plays a role in the local ecosystem by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Abarema pellita was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and adaptability to various environmental conditions. It has been widely cultivated in urban and suburban areas for its aesthetic value. However, its introduction has raised concerns about its potential invasiveness in native ecosystems. Despite its ornamental appeal, it is important to monitor its spread to prevent ecological disruption. Proper management practices are recommended to control its distribution and minimize negative impacts on local biodiversity."
}
