{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema microcalyx var. enterolobioides",
    "plant_slug": "abarema-microcalyx-var-enterolobioides",
    "plant_name_scientific": "abarema microcalyx var. enterolobioides",
    "intro": "Abarema microcalyx var. enterolobioides, commonly known as the small-flowered abarema, is a species of flowering plant native to South America. It belongs to the legume family, Fabaceae, and is characterized by its small, delicate flowers and trifoliate leaves. The plant typically grows in tropical and subtropical regions, often in moist, shaded environments. It produces pods that contain several seeds, which are dispersed by wind or animals. This variant is noted for its ornamental value and potential use in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema microcalyx var. enterolobioides is primarily native to South America, particularly Brazil. It is found in the Atlantic Forest biome, which spans across eastern Brazil. This species thrives in humid tropical climates and is commonly found in secondary forests and disturbed areas. It is also present in parts of Paraguay and Argentina. The plant is well adapted to the region's warm and wet conditions, making it a characteristic component of the local flora.",
    "distribution_introduced_art_desc": "Abarema microcalyx var. enterolobioides was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and forest edges. This plant has been reported in several countries in South America, including Brazil, Colombia, and Peru. Its introduction is often associated with human activities like agriculture and land clearing. Due to its rapid growth and adaptability, it can become invasive in certain ecosystems."
}
