{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema leucophylla var. vaupesensis",
    "plant_slug": "abarema-leucophylla-var-vaupesensis",
    "plant_name_scientific": "abarema leucophylla var. vaupesensis",
    "intro": "Abarema leucophylla var. vaupesensis, commonly known as the white-leafed acanthus, is a species native to the Amazon rainforest. It is characterized by its striking white or pale green leaves that are often velvety to the touch. The plant produces small, clustered flowers that are typically pink or purple in color. It thrives in humid, shaded environments and requires well-drained soil. This variant is noted for its ornamental value and is sometimes cultivated in tropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema leucophylla var. vaupesensis is primarily native to the Amazon Basin, specifically in regions of Venezuela, Colombia, and northern Brazil. It is commonly found in lowland tropical rainforests and moist, shaded understory habitats. This variant thrives in areas with high humidity and well-drained soils. It is often associated with riparian zones and is part of the native flora in these ecosystems. Due to its limited distribution, it is considered a rare and localized species within its range.",
    "distribution_introduced_art_desc": "Abarema leucophylla var. vaupesensis was mainly introduced to regions with specific ecological conditions that support its growth, such as well-drained soils and moderate humidity. It is typically found in areas with a tropical or subtropical climate, often in secondary vegetation or disturbed sites. This plant has been recorded in parts of South America, particularly in Venezuela and Colombia, where it thrives in open habitats. Its introduction to these areas is largely due to its adaptability and potential for ornamental or ecological use. However, its distribution remains limited and localized, with no widespread naturalization outside its native range."
}
