{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema fournieri",
    "plant_slug": "abarema-fournieri",
    "plant_name_scientific": "abarema fournieri",
    "intro": "Abarema fournieri, commonly known as the Brazilian peacock flower, is a member of the Fabaceae family and is native to Brazil. It is a shrub that typically grows in tropical and subtropical regions, characterized by its dense, bushy growth habit. The plant features trifoliate leaves and produces showy, pea-like flowers in a range of colors, including pink, purple, and red. It thrives in well-drained soil and requires full sun to partial shade for optimal growth. Due to its ornamental value, it is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema fournieri is primarily native to the Atlantic Forest region of Brazil. This plant is found in the humid, tropical environments of the southeastern part of the country. It thrives in areas with high rainfall and well-drained soils. Abarema fournieri is often associated with secondary growth and disturbed habitats within the biome. Its distribution is limited to specific microhabitats within this ecologically rich region.",
    "distribution_introduced_art_desc": "Abarema fournieri was mainly introduced to new habitats in South America, particularly in regions with moist, tropical climates. It has been observed in countries such as Brazil, Colombia, and Peru, where it thrives in disturbed forest areas and along riverbanks. The plant is often found in secondary growth forests, where it spreads through its rhizomatous growth system. Its introduction has raised concerns due to its potential to outcompete native vegetation in invaded areas. Despite its ornamental value, it is considered a potential weed in some regions."
}
