{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema limae",
    "plant_slug": "abarema-limae",
    "plant_name_scientific": "abarema limae",
    "intro": "Abarema limae, commonly known as the Brazilian rosewood or false rosewood, is a species of flowering plant in the legume family, Fabaceae. It is native to South America, particularly Brazil, and is characterized by its compound leaves and showy, pink to purple flowers. The plant is often found in tropical and subtropical regions, growing in shaded, moist environments. Its wood is valued for its density and aesthetic qualities, though it is also used in traditional medicine. However, due to overharvesting, it is considered threatened in some areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Jupunba",
        "species": "Jupunba rhombea"
    },
    "taxonomy_art_desc": "Abarema limae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which consists of ferns and their relatives, known for their primitive vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and a wide range of habitats. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities, such as peas and beans. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Jupunba, a group of flowering plants native to South America, typically found in tropical and subtropical regions. Its species is Jupunba rhombea, a specific plant within the Jupunba genus, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema limae is primarily native to Brazil Southeast. It is commonly found in the humid tropical regions of this area. The plant thrives in dense forests and undergrowth where it receives ample sunlight. It is an important component of the local flora in these ecosystems. Its distribution is largely restricted to the southeastern part of Brazil.",
    "distribution_introduced_art_desc": "Abarema limae was mainly introduced to control erosion and for ornamental purposes in tropical and subtropical regions. It is commonly found in areas with well-drained soils and full sun exposure. The plant is known for its rapid growth and ability to thrive in disturbed environments. Due to its invasive nature, it has become a concern in several countries where it has spread beyond its intended planting areas. Proper management is essential to prevent its further spread and impact on native ecosystems."
}
