{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema syringifolia",
    "plant_slug": "abarema-syringifolia",
    "plant_name_scientific": "abarema syringifolia",
    "intro": "Abarema syringifolia, commonly known as the pink-flowered acacia, is a shrub native to South America, particularly Brazil. It is characterized by its slender, branching stems and dense foliage of small, leathery leaves. The plant produces clusters of delicate, pinkish-white flowers that bloom throughout the year, attracting various pollinators. Its root system is fibrous and adapted to nutrient-poor soils, allowing it to thrive in dry, tropical environments. The plant is often used in ornamental gardening due to its attractive appearance and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema syringifolia is primarily native to South America, specifically Brazil. It is found in the Atlantic Forest biome, which spans across eastern and northeastern Brazil. This plant thrives in humid tropical environments and is commonly found in secondary forests and disturbed areas. It is also present in parts of Paraguay and Argentina. Due to habitat loss, it is considered a threatened species in its native range.",
    "distribution_introduced_art_desc": "Abarema syringifolia was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, clearings, and degraded forests. The plant thrives in full sun to partial shade and is often used for soil stabilization due to its extensive root system. It has been introduced to several countries in South America and parts of Africa for ornamental and ecological purposes. However, its invasive potential remains a topic of ongoing research and monitoring."
}
