{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema borneensis",
    "plant_slug": "abarema-borneensis",
    "plant_name_scientific": "abarema borneensis",
    "intro": "Abarema borneensis, commonly known as the Bornean flame tree, is a species of flowering plant native to Borneo. It belongs to the legume family, Fabaceae, and is characterized by its striking red and orange flowers that bloom in clusters. The plant has bipinnate leaves, which are divided into small, feather-like leaflets. It thrives in tropical rainforest environments and is often found growing in secondary forests or along riverbanks. Its ornamental value makes it a popular choice for horticultural cultivation in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema borneensis is primarily native to the islands of Borneo. It is found in the tropical rainforests of Malaysia, Indonesia, and Brunei. This species thrives in humid, shaded environments within the understorey of primary forests. It is commonly associated with lowland and hill dipterocarp forests. Due to its restricted distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Abarema borneensis was mainly introduced to tropical and subtropical regions of Southeast Asia, particularly in countries like Malaysia and Indonesia. It is commonly found in lowland rainforests and secondary growth areas. The plant is often used in horticulture for its ornamental value due to its attractive foliage. It has also been introduced to parts of Australia and the Pacific Islands for similar purposes. However, its spread outside its native range is limited due to specific climate and soil requirements."
}
