{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema novoguineensis",
    "plant_slug": "abarema-novoguineensis",
    "plant_name_scientific": "abarema novoguineensis",
    "intro": "Abarema novoguineensis, commonly known as the New Guinea bracken. It is a member of the legume family, Fabaceae, and is characterized by its fern-like fronds and ability to thrive in moist, shaded environments. The plant has a rhizomatous growth habit, allowing it to spread vegetatively. Its leaves are typically compound, with a delicate, lacy appearance. While not widely cultivated, it is occasionally found in horticultural collections for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema novoguineensis is primarily native to the lowland rainforests of New Guinea. It is commonly found in the humid and warm tropical regions of the island. This plant thrives in shaded understory environments within these dense forests. It is also occasionally reported in nearby islands of the Pacific, such as the Solomon Islands. Its distribution is closely linked to the specific ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Abarema novoguineensis was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in disturbed habitats such as roadsides, clearings, and agricultural fields. This plant has been reported in several countries in Southeast Asia, including Indonesia and the Philippines. Its introduction is often associated with human activity, such as land clearing and trade. Due to its adaptability, it can become invasive in certain regions if not managed properly."
}
