{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema dolichadena",
    "plant_slug": "abarema-dolichadena",
    "plant_name_scientific": "abarema dolichadena",
    "intro": "Abarema dolichadena, commonly known as the long-stemmed bush bean, is a species native to South America, particularly Brazil. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant typically grows as a shrub with compound leaves and produces small, pod-like fruits containing edible seeds. Its botanical features include hairy stems, trifoliate leaves, and yellow flowers that attract pollinators. It is often cultivated for its nutritional seeds and is valued in traditional agriculture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema dolichadena is primarily native to South America, particularly in regions of Brazil, Colombia, and Peru. It is commonly found in tropical and subtropical areas, often in lowland rainforests and secondary growth habitats. This species thrives in humid climates with well-drained soils, typically growing in shaded understory conditions. It is part of the Fabaceae family, known for its nitrogen-fixing abilities, which contribute to soil fertility in its native ecosystems. Due to its specific habitat requirements, Abarema dolichadena is often associated with areas of high biodiversity in the Amazon and Andes regions.",
    "distribution_introduced_art_desc": "Abarema dolichadena was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activities such as agriculture and land clearing. It is commonly found in regions with a tropical or subtropical climate, where it can thrive in full sun conditions. This plant is known for its rapid growth and ability to colonize disturbed sites, making it a potential invasive species in certain ecosystems. Its introduction has been documented in several countries in South America, particularly in Brazil and Colombia. Due to its adaptability, it can outcompete native flora and alter local biodiversity."
}
