{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema langsdorffii",
    "plant_slug": "abarema-langsdorffii",
    "plant_name_scientific": "abarema langsdorffii",
    "intro": "Abarema langsdorffii, commonly known as the Brazilian peacock flower, is a species of flowering plant in the legume family, Fabaceae. It is native to South America, particularly Brazil, and is characterized by its striking, colorful bracts that resemble peacock feathers. The plant typically grows as a shrub or small tree, with compound leaves and small, pod-like fruits. It thrives in tropical and subtropical climates and is often found in moist, well-drained soils. Due to its ornamental value, it is cultivated in gardens and botanical collections for its unique and showy appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema langsdorffii is primarily native to South America, specifically Brazil. It is found in the Atlantic Forest biome, which spans across eastern and southeastern Brazil. This species thrives in humid, tropical environments with well-drained soils. It is commonly found in secondary forests and along riverbanks. The plant is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Abarema langsdorffii was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has been widely cultivated in regions with warm climates, where it thrives in full sun to partial shade. The plant's introduction has led to its establishment in some native ecosystems, raising concerns about its potential invasiveness. Despite its ornamental value, it is important to monitor its spread to prevent ecological disruption. Proper management practices are recommended to control its distribution and minimize environmental impact."
}
