{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema moniliformis",
    "plant_slug": "abarema-moniliformis",
    "plant_name_scientific": "abarema moniliformis",
    "intro": "Abarema moniliformis, commonly known as the chain flower or yellow ball tree, is a flowering plant native to South America. It belongs to the Fabaceae family, which includes legumes, and is characterized by its distinctive yellow, spherical flower heads. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are trifoliate, consisting of three oval-shaped leaflets, and it produces pods that contain several seeds. Abarema moniliformis is valued for its ornamental qualities and is often cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema moniliformis is primarily native to South America, particularly Brazil. It is found in the tropical and subtropical regions of the continent. This plant thrives in moist, well-drained soils and is commonly found in forested areas. It is also present in parts of Paraguay and Argentina. Abarema moniliformis is often associated with secondary growth and disturbed habitats.",
    "distribution_introduced_art_desc": "Abarema moniliformis was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and growth habit. It has since spread to other regions, including parts of Africa and Asia, where it has been cultivated for similar aesthetic reasons. Despite its ornamental value, the plant has shown invasive tendencies in some areas, outcompeting native species and altering local ecosystems. Its rapid growth and adaptability have made it a concern for environmental management in regions where it has become naturalized. However, it remains popular in horticulture for its visual appeal and ease of care."
}
