{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema obovalis",
    "plant_slug": "abarema-obovalis",
    "plant_name_scientific": "abarema obovalis",
    "intro": "Abarema obovalis, commonly known as the ovalleaf acacia, is a species of flowering plant in the legume family, Fabaceae. It is native to South America, particularly Brazil, and is characterized by its compound leaves and yellow flowers. The plant is often found in moist, shaded areas of tropical forests, where it thrives in the understory. Its seeds are enclosed in pods and are dispersed by animals, contributing to its ecological role in the forest ecosystem. Abarema obovalis is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema obovalis is primarily native to South America, particularly Brazil. It is found in the Atlantic Forest biome, which spans several states in eastern Brazil. This species thrives in humid tropical environments and is commonly found in secondary forests and disturbed areas. It is also present in parts of Paraguay and Argentina. The plant is adapted to the warm and moist conditions typical of the region's climate.",
    "distribution_introduced_art_desc": "Abarema obovalis was mainly introduced to control erosion and stabilize soil in degraded lands. It is commonly found in tropical and subtropical regions where it thrives in well-drained soils. The plant is often used in reforestation projects due to its fast growth rate and ability to establish quickly. It has also been introduced as an ornamental plant in some parts of the world. However, its spread can sometimes lead to competition with native species in certain ecosystems."
}
