{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema leucophylla",
    "plant_slug": "abarema-leucophylla",
    "plant_name_scientific": "abarema leucophylla",
    "intro": "Abarema leucophylla, commonly known as the white-leafed acacia, is a shrub native to the tropical regions of South America. It belongs to the Fabaceae family, which is characterized by its leguminous properties and often compound leaves. The plant features bipinnate leaves that are typically white or pale green, giving it its common name. It produces small, yellowish flowers arranged in racemes, which are followed by flat, pod-like fruits. Abarema leucophylla is often found in dry, open habitats and is adapted to thrive in nutrient-poor soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema leucophylla is primarily native to Brazil. It is found in the northeastern region of the country, particularly in the states of Piauí, Ceará, and Rio Grande do Norte. This plant typically grows in dry to semi-arid environments, such as sandy soils and rocky areas. It is commonly found in open woodlands and savannas. Its distribution is limited to specific ecological zones within Brazil's northeastern region.",
    "distribution_introduced_art_desc": "Abarema leucophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces. The plant thrives in coastal and semi-arid environments, often growing in sandy or gravelly soils. It is considered an invasive species in some areas due to its rapid spread and competitive nature. Its introduction is believed to have occurred through horticultural trade or accidental seed dispersal."
}
