{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema poilanei",
    "plant_slug": "abarema-poilanei",
    "plant_name_scientific": "abarema poilanei",
    "intro": "Abarema poilanei, commonly known as the Brazilian peacock flower, is a species of flowering plant native to Brazil. It belongs to the legume family, Fabaceae, and is characterized by its striking, ornamental flowers that resemble peacock feathers. The plant produces small, bean-like pods that contain several seeds, typical of the Fabaceae family. It thrives in tropical climates and is often found in forest understories. Due to its unique appearance and ecological importance, it is of interest to botanists and horticulturists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema poilanei is primarily native to the Atlantic Forest region of eastern Brazil. It is found in the states of Espírito Santo, Rio de Janeiro, and São Paulo. This species thrives in humid, tropical climates with well-drained soils. It is commonly encountered in secondary forests and along riverbanks. Due to habitat loss, it is considered vulnerable and requires conservation efforts to ensure its survival.",
    "distribution_introduced_art_desc": "Abarema poilanei was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, pastures, and degraded forests. It thrives in regions with warm temperatures and moderate to high rainfall. The plant is commonly found in South America, particularly in Brazil, Colombia, and Peru. Its introduction has been linked to human activities like land clearing and agricultural expansion. Due to its adaptability, it can become invasive in some ecosystems if not managed properly."
}
