{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema adenophora",
    "plant_slug": "abarema-adenophora",
    "plant_name_scientific": "abarema adenophora",
    "intro": "Abarema adenophora, commonly known as the Brazilian peacock flower, is a species of flowering plant native to Brazil. It belongs to the legume family, Fabaceae, and is characterized by its striking, colorful flowers that resemble peacock feathers. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are bipinnate, meaning they are divided into multiple small leaflets, and it produces pod-like fruits that contain several seeds. Abarema adenophora is valued for its ornamental appeal and is often cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema adenophora is primarily native to South America, particularly Brazil. It is found in the Atlantic Forest biome, which spans several states in eastern Brazil. This species thrives in tropical and subtropical regions with high humidity and well-drained soils. It is commonly found in secondary forests and along riverbanks. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abarema adenophora was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, pastures, and degraded forests. It thrives in regions with warm climates and moderate to high rainfall. The plant is commonly found in South America, particularly in Brazil, Argentina, and Paraguay. Its introduction has been associated with human activities like agriculture and land clearing. Due to its rapid growth and adaptability, it can become invasive in certain ecosystems."
}
