{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema maestrensis",
    "plant_slug": "abarema-maestrensis",
    "plant_name_scientific": "abarema maestrensis",
    "intro": "Abarema maestrensis, commonly known as the Maestrensis legume, is a flowering plant native to South America, particularly Brazil. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing ability. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are trifoliate, consisting of three oval-shaped leaflets, and it produces small, clustered white or pale yellow flowers. The seeds are enclosed in slender, elongated pods, which are often used in traditional medicine and as a source of protein.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema maestrensis is primarily native to the tropical regions of South America, specifically Brazil. It is found in the states of Mato Grosso and Mato Grosso do Sul. This plant thrives in the cerrado biome, which is characterized by savanna-like vegetation. It is also present in parts of Paraguay and Bolivia. Abarema maestrensis is adapted to the seasonal climate with distinct wet and dry periods.",
    "distribution_introduced_art_desc": "Abarema maestrensis was mainly introduced to South America, particularly in regions with tropical and subtropical climates. It is commonly found in countries such as Brazil, Colombia, and Venezuela. This plant thrives in areas with high humidity and well-drained soils. It is often cultivated for its ornamental value due to its attractive foliage and flowers. Its distribution has been expanding due to human activities and climate change."
}
