{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema campestris",
    "plant_slug": "abarema-campestris",
    "plant_name_scientific": "abarema campestris",
    "intro": "Abarema campestris, commonly known as the field abarema, is a flowering plant native to South America. It belongs to the legume family, Fabaceae, and is characterized by its trifoliate leaves and small, pea-like flowers. The plant typically grows in open, sunny areas and is often found in grasslands and disturbed soils. Its seeds are enclosed in pods and can remain viable in the soil for several years, contributing to its persistence in certain habitats. Abarema campestris is also known for its ability to fix nitrogen, which enhances soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema campestris is primarily native to South America, particularly Brazil. It is commonly found in the cerrado biome, which is a tropical savanna ecosystem. This plant thrives in areas with seasonal rainfall and well-drained soils. It is often seen in open fields and along roadsides in the central and eastern regions of Brazil. Its distribution is also reported in parts of Argentina and Paraguay.",
    "distribution_introduced_art_desc": "Abarema campestris was mainly introduced to South America, particularly in countries like Brazil, Argentina, and Paraguay. It is commonly found in grasslands and disturbed areas, often as an invasive species. The plant was likely introduced through agricultural activities or accidental transport. It has since spread widely, affecting native vegetation and ecosystem balance. Its rapid growth and adaptability make it a significant concern in ecological studies."
}
