{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema barbouriana",
    "plant_slug": "abarema-barbouriana",
    "plant_name_scientific": "abarema barbouriana",
    "intro": "Abarema barbouriana, commonly known as the Barbour's acacia, is a flowering plant native to Brazil. It belongs to the Fabaceae family, which includes legumes and is characterized by its pod fruits and often compound leaves. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are bipinnate, meaning they are divided into smaller leaflets, and it produces yellow flowers arranged in dense clusters. Abarema barbouriana is valued for its ornamental appeal and plays a role in local ecosystems by providing habitat and food for various insects and animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema barbouriana is primarily native to South America, particularly in countries such as Brazil, Colombia, and Venezuela. It is commonly found in tropical and subtropical regions, often growing in humid lowland areas. This plant thrives in open forests and disturbed habitats, where it can receive ample sunlight. It is often associated with sandy or well-drained soils in its natural environment. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Abarema barbouriana was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and agricultural fields. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is commonly found in the Neotropical region, particularly in South America. It has been reported in countries like Brazil, Colombia, and Venezuela. Its introduction is often associated with human activities such as land clearing and agriculture."
}
