{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema nipensis",
    "plant_slug": "abarema-nipensis",
    "plant_name_scientific": "abarema nipensis",
    "intro": "Abarema nipensis, commonly known as the Brazilian peacock flower, is a flowering plant native to Brazil. It belongs to the Fabaceae family, which includes legumes, and is characterized by its distinctive, colorful, and showy inflorescences. The plant features compound leaves with small, oval-shaped leaflets and produces small, pod-like fruits that contain seeds. It thrives in tropical and subtropical climates, often growing in shaded or semi-shaded environments. Due to its ornamental value, it is cultivated in gardens and greenhouses for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema nipensis is primarily native to the Atlantic Forest biome of eastern Brazil. This species is found in the states of Rio de Janeiro and Espírito Santo. It thrives in humid, tropical climates with well-drained soils. The plant is commonly found in secondary growth areas and along riverbanks. It plays an important ecological role in the region's biodiversity.",
    "distribution_introduced_art_desc": "Abarema nipensis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and agricultural fields. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is commonly found in tropical and subtropical climates across South America. Its introduction has been associated with human activities, including land clearing and seed dispersal through contaminated soil. Due to its adaptability, it has become an invasive species in some regions where it outcompetes native vegetation."
}
