{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema racemosa",
    "plant_slug": "abarema-racemosa",
    "plant_name_scientific": "abarema racemosa",
    "intro": "Abarema racemosa, commonly known as the Brazilian peacock flower, is a flowering plant native to South America. It belongs to the legume family, Fabaceae, and is characterized by its striking, colorful inflorescences that resemble peacock feathers. The plant produces small, pod-like fruits that contain several seeds. It is often cultivated for its ornamental value due to its vibrant flowers and unique appearance. Abarema racemosa thrives in tropical and subtropical climates, preferring well-drained soil and full sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema racemosa is primarily native to South America, particularly in regions of Brazil, Paraguay, and Argentina. It is commonly found in the Atlantic Forest and Pantanal ecosystems, where it thrives in moist, tropical climates. This plant is often associated with riverbanks and wetlands, where it can tolerate periodic flooding. It is an important component of the local flora and plays a role in supporting biodiversity. Its distribution is closely linked to the availability of water and nutrient-rich soils.",
    "distribution_introduced_art_desc": "Abarema racemosa was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and agricultural fields. It thrives in regions with warm, tropical climates and is commonly found in South America, particularly in Brazil. This plant is known for its rapid growth and ability to colonize new areas, making it an invasive species in some regions. Its distribution is often linked to human activity, including land clearing and transportation. Due to its adaptability, it has been reported in several countries across the Americas."
}
