{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema malinoensis",
    "plant_slug": "abarema-malinoensis",
    "plant_name_scientific": "abarema malinoensis",
    "intro": "Abarema malinoensis, commonly known as the Malinoensis false acacia, is a shrub native to tropical regions of South America. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and small, pea-like flowers. The plant is typically found in humid, lowland areas with well-drained soil. It has a woody stem and produces pod-like fruits that contain several seeds. Due to its ornamental value and ability to fix nitrogen, it is sometimes cultivated in gardens and reforestation projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema malinoensis is primarily native to the tropical regions of northern Australia, particularly in the Northern Territory and Queensland. It is commonly found in the savannas and woodland areas where the climate is hot and dry. This plant thrives in well-drained soils and is often associated with rocky outcrops and open habitats. It plays an important role in the local ecosystem by providing food and shelter for various wildlife species. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Abarema malinoensis was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate to high rainfall. It is commonly found in disturbed habitats such as roadsides, clearings, and agricultural fields. The plant thrives in full sun to partial shade conditions, making it adaptable to a variety of environments. Its introduction has been associated with human activities, including land clearing and horticultural practices. However, its spread is limited due to its preference for specific soil types and climatic conditions."
}
