{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema curvicarpa var. rodriguesii",
    "plant_slug": "abarema-curvicarpa-var-rodriguesii",
    "plant_name_scientific": "abarema curvicarpa var. rodriguesii",
    "intro": "Abarema curvicarpa var. rodriguesii, commonly known as the Rodrigues's narrow-leafed acacia, is a flowering plant native to Madagascar. It belongs to the legume family, Fabaceae, and is characterized by its slender, compound leaves and yellow flowers. The plant typically grows in dry, open habitats and is adapted to the island's unique climate. It plays a role in local ecosystems by providing forage for herbivores and contributing to soil nitrogen through its nitrogen-fixing abilities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema curvicarpa var. rodriguesii is primarily native to the Atlantic Forest biome of eastern Brazil. This variant is found in the states of Espírito Santo, Rio de Janeiro, and São Paulo. It grows in humid, tropical environments within this region. The plant is typically found in secondary forests and disturbed areas. Its distribution is limited to specific microhabitats within the broader Atlantic Forest ecosystem.",
    "distribution_introduced_art_desc": "Abarema curvicarpa var. rodriguesii was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It thrives in tropical and subtropical climates, making it suitable for regions with warm temperatures and high humidity. This plant is often cultivated for its ornamental value due to its attractive foliage and flowers. It is commonly found in gardens and landscaped areas in South America, particularly in Brazil. Its introduction has been primarily for horticultural purposes, though it may spread naturally in suitable environments."
}
