{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema kerrii",
    "plant_slug": "abarema-kerrii",
    "plant_name_scientific": "abarema kerrii",
    "intro": "Abarema kerrii, commonly known as the Kerri's bristlepod, is a flowering plant native to South America, particularly Brazil. It belongs to the legume family, Fabaceae, and is characterized by its unique, hairy pods that remain attached to the plant even after maturity. The plant typically grows in tropical and subtropical regions, thriving in well-drained soils and full sun. Its small, delicate flowers are usually pink or purple, adding ornamental value to its natural habitat. Abarema kerrii is not widely cultivated but is of interest to botanists due to its distinctive morphology and ecological role.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema kerrii is primarily native to the tropical regions of South America, particularly Brazil. It is found in the Atlantic Forest biome, which spans across eastern Brazil. This plant thrives in humid, shaded environments within the understory of dense rainforests. It is commonly encountered in areas with rich organic soil and high rainfall. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "distribution_introduced_art_desc": "Abarema kerrii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, pastures, and degraded forests. It thrives in regions with moderate to high rainfall and well-drained soils. The plant is often found in tropical and subtropical climates, particularly in South America. Its introduction is associated with human activities like land clearing and agricultural expansion. It has the potential to become invasive in certain environments if not managed properly."
}
