{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema motleyana",
    "plant_slug": "abarema-motleyana",
    "plant_name_scientific": "abarema motleyana",
    "intro": "Abarema motleyana, commonly known as the Motley's legume, is a species of flowering plant native to South America. It belongs to the Fabaceae family, which is characterized by its distinctive pod fruits and nitrogen-fixing abilities. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are compound, consisting of several pairs of oval-shaped leaflets, and it produces small, pea-like flowers in shades of pink or white. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its attractive foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema motleyana is primarily native to Brazil. It is found in the northeastern region of the country, specifically in the states of Pernambuco, Piauí, and Ceará. This plant thrives in tropical and subtropical climates, often growing in open woodlands and savannas. It is adapted to well-drained soils and is commonly found in areas with seasonal rainfall. Its native range is limited to these specific regions within Brazil.",
    "distribution_introduced_art_desc": "Abarema motleyana was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, clearings, and agricultural fields. The plant is often spread through human activity, including the transport of contaminated soil or seeds. It has adapted well to a variety of environmental conditions, making it a successful invasive species in many regions. Its rapid growth and ability to form dense stands contribute to its competitive advantage over native vegetation."
}
