{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema glomeriflora",
    "plant_slug": "abarema-glomeriflora",
    "plant_name_scientific": "abarema glomeriflora",
    "intro": "Abarema glomeriflora, commonly known as the clustered-flower shrub, is a flowering plant native to South America, particularly Brazil. It belongs to the legume family, Fabaceae, and is characterized by its dense clusters of small, white or pale pink flowers. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are compound, consisting of several oval-shaped leaflets, and it produces leguminous pods that contain seeds. Abarema glomeriflora is often found in tropical and subtropical regions, thriving in well-drained soils and full sun.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema glomeriflora is primarily native to South America, particularly Brazil. It is commonly found in the Atlantic Forest biome, which spans across eastern Brazil. This species thrives in tropical and subtropical regions with high humidity and well-drained soils. It is often encountered in secondary forests and disturbed habitats. Due to its ecological significance, it plays a vital role in the biodiversity of its native range.",
    "distribution_introduced_art_desc": "Abarema glomeriflora was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It is often cultivated in gardens and greenhouses for its ornamental value due to its attractive, clustered flowers. This plant prefers full sun to partial shade and requires regular watering to thrive. It is relatively low maintenance once established, making it a popular choice for landscapers and home gardeners. However, it is important to monitor its spread to prevent it from becoming invasive in local ecosystems."
}
