{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema kinabaluensis",
    "plant_slug": "abarema-kinabaluensis",
    "plant_name_scientific": "abarema kinabaluensis",
    "intro": "Abarema kinabaluensis, commonly known as the Kinabalu tree, is a species of flowering plant native to the mountainous regions of Borneo. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and small, pod-like fruits. The plant is adapted to high-altitude environments, exhibiting features that help it thrive in cool, moist conditions. It plays a significant role in the local ecosystem by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema kinabaluensis is primarily native to the mountainous regions of Borneo, specifically found in the areas of Sabah and Sarawak. It is commonly encountered in the lowland to submontane forests, often growing in shaded, humid environments. This species is particularly associated with the vicinity of Mount Kinabalu, where it thrives in the unique microclimatic conditions of the region. It is an endemic plant, meaning it is found nowhere else in the world. Its distribution is limited to specific elevations and habitats within these tropical rainforest areas.",
    "distribution_introduced_art_desc": "Abarema kinabaluensis was mainly introduced to the data as a rare and endemic species native to the montane forests of Borneo. It is characterized by its unique floral structure and is adapted to the cool, humid conditions of its native habitat. The distribution data highlights its limited range, primarily found in the vicinity of Mount Kinabalu. Due to its restricted habitat, it is considered vulnerable to environmental changes and habitat loss. This introduction to the dataset aims to raise awareness about its conservation status and ecological significance."
}
