{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema cochleata",
    "plant_slug": "abarema-cochleata",
    "plant_name_scientific": "abarema cochleata",
    "intro": "Abarema cochleata, commonly known as the Brazilian bean or velvet bean, is a leguminous plant native to South America. It is characterized by its compound leaves and produces small, yellow flowers that develop into elongated pods. The plant is notable for its ability to fix atmospheric nitrogen, making it valuable in agricultural systems. Its seeds are used in traditional medicine and as a protein source in some regions. The plant thrives in tropical and subtropical climates, often found in moist, well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema cochleata is primarily native to South America, particularly Brazil. It is commonly found in the Atlantic Forest biome, which spans across eastern Brazil. This plant thrives in humid, tropical environments with well-drained soils. It is often associated with secondary growth areas and is sometimes found in disturbed habitats. Its distribution includes parts of Paraguay and Argentina as well.",
    "distribution_introduced_art_desc": "Abarema cochleata was mainly introduced to areas with tropical and subtropical climates, particularly in regions where it can thrive in well-drained soils. It is commonly found in countries such as Brazil, Colombia, and Venezuela, where it has been cultivated for its ornamental value. This plant prefers full sun to partial shade and is often used in landscaping due to its attractive foliage and flowering capabilities. Its introduction has been primarily through horticultural practices and accidental spread. However, it is not considered invasive in most regions where it is introduced."
}
