{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema hendersonii",
    "plant_slug": "abarema-hendersonii",
    "plant_name_scientific": "abarema hendersonii",
    "intro": "Abarema hendersonii, commonly known as the Henderson's acacia, is a flowering plant native to Brazil. It belongs to the Fabaceae family, which is characterized by its legume fruits and nitrogen-fixing abilities. The plant features bipinnate leaves and produces yellow flowers arranged in racemose inflorescences. It is typically found in tropical and subtropical regions, thriving in well-drained soils. Due to its ornamental value, it is occasionally cultivated in botanical gardens and as a decorative plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema hendersonii is primarily native to the Atlantic Forest region of eastern Brazil. This species is found in the states of Espírito Santo, Minas Gerais, and Rio de Janeiro. It typically grows in humid, tropical environments with well-drained soils. The plant is often associated with secondary vegetation and disturbed areas within this biome. Due to habitat loss, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abarema hendersonii was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It thrives in environments with full sun to partial shade, making it suitable for both ornamental and agricultural purposes. The plant is often cultivated for its attractive foliage and potential medicinal properties. Its introduction has been documented in several countries in South America and parts of Southeast Asia. However, its spread is limited due to specific climatic requirements and the need for careful cultivation."
}
