{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema jupunba var. trapezifolia",
    "plant_slug": "abarema-jupunba-var-trapezifolia",
    "plant_name_scientific": "abarema jupunba var. trapezifolia",
    "intro": "Abarema jupunba var. trapezifolia, commonly known as the Brazilian pea vine, is a climbing legume native to South America. It features trifoliate leaves with ovate to lanceolate leaflets and produces small, pea-like flowers in shades of pink or white. The plant is characterized by its slender, twining stems and is often found in moist, tropical environments. It belongs to the Fabaceae family, which includes many nitrogen-fixing plants, contributing to soil fertility. Its ornamental value makes it a popular choice for gardeners seeking a climbing plant with attractive foliage and blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema jupunba var. trapezifolia is primarily native to Brazil, specifically the state of Pará in the northeastern region of the country. This plant is found in the dense tropical rainforests of the Amazon Basin, where it thrives in the humid and shaded understory. It is commonly associated with secondary growth areas and disturbed sites within the forest ecosystem. The species is also occasionally found in adjacent regions of northern Bolivia and northern Peru. Due to its restricted habitat, it is considered a rare and endemic plant within its native range.",
    "distribution_introduced_art_desc": "Abarema jupunba var. trapezifolia was mainly introduced to areas with well-drained soils and moderate to high light exposure. It thrives in tropical and subtropical climates, making it suitable for regions with warm temperatures and distinct wet and dry seasons. This variant is often found in disturbed habitats such as roadsides, clearings, and degraded forests. Its adaptability allows it to spread rapidly in new environments, sometimes becoming invasive. Due to its hardy nature, it is commonly used in restoration projects and as an ornamental plant."
}
