{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema globosa",
    "plant_slug": "abarema-globosa",
    "plant_name_scientific": "abarema globosa",
    "intro": "Abarema globosa, commonly known as the globular acacia, is a species of flowering plant in the legume family, Fabaceae. It is native to South America, particularly Brazil, and is characterized by its distinctive globular inflorescences. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are bipinnate, and the flowers are yellow, forming dense clusters at the ends of the branches. Abarema globosa is adapted to tropical and subtropical climates and is often found in savanna and woodland habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema globosa is primarily native to South America, specifically the Amazon Basin and surrounding regions. It is commonly found in the tropical rainforests of Brazil, Colombia, Ecuador, Peru, and Venezuela. This plant thrives in humid, shaded environments with rich, well-drained soil. It is often associated with secondary growth areas and disturbed sites within the Amazonian ecosystem. Its distribution is largely confined to the lowland tropical regions of the continent.",
    "distribution_introduced_art_desc": "Abarema globosa was mainly introduced to South America, particularly in regions with tropical and subtropical climates. It is commonly found in countries such as Brazil, Colombia, and Venezuela. The plant thrives in well-drained soils and full sun exposure. It is often cultivated for its ornamental value due to its attractive foliage and flowers. However, it has also been reported as an invasive species in some areas where it outcompetes native vegetation."
}
