{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema obovata",
    "plant_slug": "abarema-obovata",
    "plant_name_scientific": "abarema obovata",
    "intro": "Abarema obovata, commonly known as the Brazilian rosewood or *Pau-rosa*, is a species of flowering plant in the legume family, Fabaceae. It is native to South America, particularly Brazil, and is characterized by its ornamental, elongated, obovate leaves. The plant produces small, fragrant yellow flowers that bloom in clusters, attracting various pollinators. Its woody stems and hard, dark wood make it valuable in traditional woodworking. However, due to overharvesting, it is now considered endangered and protected in several regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema obovata is primarily native to South America, particularly in countries such as Brazil, Colombia, and Peru. It is commonly found in tropical and subtropical regions, often in areas with moist, well-drained soils. This plant thrives in open woodland and forest understory environments. It is a member of the Leguminosae family, known for its nitrogen-fixing abilities. Its distribution is largely restricted to the Amazon Basin and surrounding regions.",
    "distribution_introduced_art_desc": "Abarema obovata was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and flowers. It has been cultivated in various regions for its aesthetic value in gardens and landscapes. However, it has also been reported to escape cultivation and establish itself in natural areas, raising concerns about its potential invasiveness. Despite its ornamental appeal, its ecological impact remains under study in native ecosystems. Its introduction highlights the balance between horticultural interest and environmental risk."
}
