{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema teysmannii",
    "plant_slug": "abarema-teysmannii",
    "plant_name_scientific": "abarema teysmannii",
    "intro": "Abarema teysmannii, commonly known as the Teyssmann's everlet, is a species of flowering plant native to Brazil. It belongs to the legume family, Fabaceae, and is characterized by its small, clustered flowers and compound leaves. The plant typically grows in tropical and subtropical regions, often in moist, shaded environments. Its botanical features include a slender stem, trifoliate leaves, and small, yellowish-white blooms that attract pollinators. Abarema teysmannii is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema teysmannii is primarily native to the Amazon Basin, particularly in regions of Brazil, Colombia, and Peru. It is commonly found in lowland tropical rainforests where the climate is humid and warm year-round. This species thrives in shaded understory environments, often growing along riverbanks and in secondary forest regrowth areas. Its native distribution includes parts of Ecuador and Bolivia as well. Abarema teysmannii is an important component of the biodiversity in these regions, contributing to the ecological balance of the rainforest ecosystem.",
    "distribution_introduced_art_desc": "Abarema teysmannii was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, clearings, and fallow fields. The plant has been reported in several countries in South America, including Brazil, Colombia, and Peru. It is often used as a forage plant due to its high nutritional value for livestock. However, its introduction has raised concerns about its potential invasiveness in some regions."
}
