{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema multiflora",
    "plant_slug": "abarema-multiflora",
    "plant_name_scientific": "abarema multiflora",
    "intro": "Abarema multiflora, commonly known as the Brazilian rosewood, is a species of flowering plant in the legume family. It is native to South America, particularly Brazil, and is characterized by its woody stems and compound leaves. The plant produces small, clustered flowers that are typically pink or white in color. Its fruits are legumes that contain several seeds, and the plant is often found in tropical and subtropical regions. Abarema multiflora is valued for its hard, dense wood, which has been traditionally used in woodworking and musical instrument making.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema multiflora is primarily native to South America, particularly Brazil. It is found in the Atlantic Forest biome, which spans several states in eastern Brazil. This plant thrives in humid, tropical climates and is commonly found in secondary forests and disturbed areas. It is also present in parts of Paraguay and Argentina. Abarema multiflora is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Abarema multiflora was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and degraded pastures. It thrives in tropical and subtropical climates, preferring full sun and well-drained soils. This species is commonly found in regions of South America, particularly in Brazil, Colombia, and Peru. Its rapid growth and ability to colonize disturbed areas make it an aggressive weed in agricultural and natural ecosystems. Due to its adaptability, it has become a concern in some regions where it outcompetes native vegetation."
}
