{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema occultata",
    "plant_slug": "abarema-occultata",
    "plant_name_scientific": "abarema occultata",
    "intro": "Abarema occultata, commonly known as the hidden beauty or the ghost plant, is a species of flowering plant native to the rainforests of South America. It belongs to the legume family, Fabaceae, and is characterized by its delicate, fern-like leaves and small, clustered flowers. The plant is notable for its ability to thrive in shaded environments, making it a common understory species in tropical forests. Its flowers, which are often pale or white in color, attract a variety of pollinators such as bees and butterflies. Due to its unique appearance and habitat, Abarema occultata is of interest to botanists and conservationists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema occultata is primarily native to the Atlantic Forest biome of eastern Brazil. This species is found in the coastal regions of states such as Rio de Janeiro, Espírito Santo, and Santa Catarina. It thrives in humid, tropical climates with well-drained soils. The plant is commonly found in secondary growth areas and disturbed habitats within this region. Its distribution is limited to specific microhabitats within the Atlantic Forest ecosystem.",
    "distribution_introduced_art_desc": "Abarema occultata was mainly introduced to areas with disturbed soils and open habitats, such as roadsides and degraded pastures. It thrives in environments with moderate to high sunlight exposure and well-drained soils. This plant is often found in tropical and subtropical regions where it can spread rapidly due to its ability to colonize disturbed areas. Its introduction has been associated with human activities, including agriculture and land clearing. However, it is not considered invasive in most regions where it has been recorded."
}
