{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema barnebyana",
    "plant_slug": "abarema-barnebyana",
    "plant_name_scientific": "abarema barnebyana",
    "intro": "Abarema barnebyana, commonly known as the Barneby's false acacia, is a flowering plant native to South America, particularly Brazil. It belongs to the legume family, Fabaceae, and is characterized by its bipinnate leaves and showy, yellow-orange flowers. The plant typically grows in moist, shaded environments within tropical forests. Its seeds are encased in pods and are dispersed by animals, contributing to its ecological role in the understory vegetation. Abarema barnebyana is valued for its ornamental appeal and potential use in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Jupunba",
        "species": "Jupunba barnebyana"
    },
    "taxonomy_art_desc": "Abarema barnebyana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle that includes both a gametophyte and a sporophyte stage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose family. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing abilities. Its genus is Jupunba, a group of flowering plants within the Fabaceae family, primarily found in tropical regions of South America. Its species is Jupunba barnebyana, a specific plant within the Jupunba genus, known for its unique morphological features and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema barnebyana is primarily native to Brazil Southeast. This species is found in the southeastern region of Brazil, where it thrives in tropical and subtropical environments. It is commonly associated with forested areas and is often found in regions with high humidity and well-drained soils. The plant is part of the Fabaceae family and is known for its ornamental value. Its native distribution is largely restricted to this specific geographic area within Brazil.",
    "distribution_introduced_art_desc": "Abarema barnebyana was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and agricultural fields. It thrives in tropical and subtropical regions with high rainfall and warm temperatures. The plant is commonly found in parts of South America, particularly in Brazil and Peru. Its introduction has led to its spread into new regions, sometimes becoming invasive in local ecosystems. Due to its rapid growth and ability to adapt to various soil types, it is often considered a weed in agricultural settings."
}
