{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema abeywickramae",
    "plant_slug": "abarema-abeywickramae",
    "plant_name_scientific": "abarema abeywickramae",
    "intro": "Abarema abeywickramae, commonly known as the Sri Lankan evergreen tree, is a species native to the tropical regions of Sri Lanka. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and small, clustered flowers. The plant is typically found in moist, shaded forest environments, where it thrives in the understory. Its botanical features include woody stems, trifoliate leaves, and pods that contain small, rounded seeds. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema abeywickramae is primarily native to Sri Lanka. It is found in the wet zone of the island, particularly in the central and southwestern regions. This plant typically grows in moist, shaded environments such as tropical rainforests and understorey vegetation. It is a shrub or small tree that thrives in humid conditions with high rainfall. Due to its limited distribution, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Abarema abeywickramae was mainly introduced to areas with disturbed soils and human activity. It is commonly found in regions with moderate to high rainfall. This plant thrives in open habitats such as roadsides and agricultural fields. Its introduction has been linked to its ability to tolerate poor soil conditions. It is considered an invasive species in some regions due to its rapid growth and competitive nature."
}
