{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema mataybifolia",
    "plant_slug": "abarema-mataybifolia",
    "plant_name_scientific": "abarema mataybifolia",
    "intro": "Abarema mataybifolia, commonly known as the Mataybifolia or the Brazilian peacock flower, is a striking tropical plant native to South America. It is characterized by its large, showy, and colorful bracts that resemble peacock feathers, which are actually modified leaves rather than flowers. The plant typically grows as an erect shrub or small tree, reaching heights of up to 3 meters. Its leaves are usually opposite and palmately lobed, with a rough, hairy texture. Abarema mataybifolia thrives in warm, humid climates and is often cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema mataybifolia is primarily native to South America, specifically Brazil. It is found in the Atlantic Forest biome, which spans the eastern coast of the country. This plant typically grows in humid, tropical environments with well-drained soils. It is commonly found in secondary forests and disturbed areas within its range. Its native distribution is limited to specific regions within Brazil where the climate and soil conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Abarema mataybifolia was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage. It is commonly found in regions with warm, humid climates, often cultivated in gardens and greenhouses. The plant's introduction has led to its establishment in some areas, raising concerns about its potential invasiveness. Despite its aesthetic appeal, its ecological impact remains under study. It is important to monitor its spread to prevent unintended environmental consequences."
}
