{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema clypearia f. subacuta",
    "plant_slug": "abarema-clypearia-f-subacuta",
    "plant_name_scientific": "abarema clypearia f. subacuta",
    "intro": "Abarema clypearia f. subacuta, commonly known as the acute-leafed clypearia, is a flowering plant native to South America. It belongs to the legume family, Fabaceae, and is characterized by its distinctive, narrow, acute leaves. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its flowers are usually small and clustered, producing pods that contain several seeds. This species is valued for its ornamental appeal and potential ecological roles in native habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema clypearia f. subacuta is primarily native to South America, particularly Brazil. It is commonly found in the northeastern regions of the country, including the states of Piauí, Ceará, and Rio Grande do Norte. This plant thrives in tropical and subtropical climates, often growing in open areas with well-drained soils. It is typically associated with dry to semi-arid environments and is part of the legume family. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abarema clypearia f. subacuta was mainly introduced to areas with warm and humid climates, particularly in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant has been reported in several countries in South America, including Brazil, Colombia, and Peru. Its introduction is likely due to its adaptability and ability to thrive in poor soil conditions. However, its potential as an invasive species requires further study."
}
