{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema quocensis",
    "plant_slug": "abarema-quocensis",
    "plant_name_scientific": "abarema quocensis",
    "intro": "Abarema quocensis, commonly known as the Quocense Everlasting, is a flowering plant native to the tropical regions of South America. It belongs to the legume family, Fabaceae, and is characterized by its small, clustered flowers that range in color from white to pink. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are pinnate, and it produces pod-like fruits that contain several seeds. Abarema quocensis is valued for its ornamental appeal and is sometimes cultivated in gardens for its delicate floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema quocensis is primarily native to the Atlantic Forest biome in eastern Brazil. This species is found in the states of Bahia and Pernambuco. It thrives in humid, tropical environments with well-drained soils. The plant is commonly associated with secondary growth and disturbed areas within the forest. Its distribution is limited to specific microhabitats within this region.",
    "distribution_introduced_art_desc": "Abarema quocensis was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of South America, particularly in Brazil, where it has been cultivated for ornamental purposes. The plant is known for its attractive, showy flowers that come in a variety of colors. Due to its adaptability, it has been introduced to other parts of the world with similar climatic conditions. However, its spread is limited by its specific soil and temperature requirements."
}
