{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema clypearia",
    "plant_slug": "abarema-clypearia",
    "plant_name_scientific": "abarema clypearia",
    "intro": "Abarema clypearia, commonly known as the velvetleaf or Brazilian velvetleaf, is a tropical plant belonging to the Fabaceae family. It is characterized by its palmately compound leaves, which are typically covered in a dense, velvety pubescence. The plant produces small, yellow flowers arranged in racemes, followed by legume pods that contain several seeds. It is native to South America, particularly Brazil, and thrives in warm, humid climates. Due to its rapid growth and ability to spread, it is often considered an invasive species in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema clypearia is primarily native to South America, particularly Brazil. It is found in the Atlantic Forest biome, which spans across eastern Brazil. This plant thrives in humid, tropical environments with well-drained soils. It is commonly found in shaded undergrowth of forests and along stream banks. Abarema clypearia is an important component of the local flora and plays a role in supporting biodiversity in its native habitat.",
    "distribution_introduced_art_desc": "Abarema clypearia was mainly introduced to new habitats in South America, particularly in Brazil, where it has been observed in disturbed areas and along roadsides. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. The plant spreads primarily through seeds dispersed by wind, water, and animals. Its introduction has led to concerns about its impact on local ecosystems and biodiversity. Efforts are being made to monitor and control its spread to prevent further ecological damage."
}
