{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema microcalyx",
    "plant_slug": "abarema-microcalyx",
    "plant_name_scientific": "abarema microcalyx",
    "intro": "Abarema microcalyx, commonly known as the small-fruited burr legume, is a flowering plant native to South America, particularly Brazil. It belongs to the legume family, Fabaceae, and is characterized by its small, yellow flowers and compound leaves. The plant produces small, spherical pods that contain several seeds, which are often used in traditional medicine. Its botanical features make it an important species for ecological studies and potential pharmaceutical applications.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema microcalyx is primarily native to South America, specifically Brazil. It is found in the states of Pará, Amazonas, and Mato Grosso. This species thrives in tropical and subtropical regions, often in wetland and swampy habitats. It is commonly associated with the Amazon rainforest ecosystem. Its distribution is closely linked to the presence of waterlogged soils and dense vegetation.",
    "distribution_introduced_art_desc": "Abarema microcalyx was mainly introduced to areas with disturbed soils and open habitats, such as roadsides and abandoned fields. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is commonly found in the southeastern United States, particularly in Florida and parts of Georgia. It is often considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded in recent years, raising concerns among ecologists and land managers."
}
