{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema alexandri var. troyana",
    "plant_slug": "abarema-alexandri-var-troyana",
    "plant_name_scientific": "abarema alexandri var. troyana",
    "intro": "Abarema alexandri var. troyana, commonly known as the Troyana variant of Alexandri's abarema, is a tropical shrub native to South America. It features compound leaves with elongated, elliptical leaflets that are often pubescent. The plant produces small, fragrant flowers in shades of pink and white, arranged in terminal clusters. It thrives in warm, humid climates and requires well-drained soil for optimal growth. Due to its ornamental value, it is occasionally cultivated in botanical gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema alexandri var. troyana is primarily native to the Atlantic Forest region of Brazil. This plant is found in the states of Paraná, Santa Catarina, and southern Rio Grande do Sul. It thrives in humid, subtropical climates with well-drained soils. The species is commonly associated with rocky outcrops and coastal areas. Its native distribution is limited to specific microhabitats within this biodiversity-rich ecosystem.",
    "distribution_introduced_art_desc": "Abarema alexandri var. troyana was mainly introduced to the United States as an ornamental plant due to its attractive foliage and unique floral characteristics. It was first documented in the early 2000s in Florida, where it was cultivated in botanical gardens and private collections. The plant's introduction has raised concerns among ecologists due to its potential invasive tendencies in certain environments. Despite its aesthetic appeal, it has been found to outcompete native species in some regions, leading to increased monitoring efforts. Its distribution remains limited but is expanding in areas with suitable climate conditions."
}
