{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema kalkmanii",
    "plant_slug": "abarema-kalkmanii",
    "plant_name_scientific": "abarema kalkmanii",
    "intro": "Abarema kalkmanii, commonly known as the Kalkman's bower vine, is a climbing plant native to South America, particularly Brazil. It belongs to the Leguminosae family, which is characterized by its ability to fix atmospheric nitrogen through symbiotic relationships with rhizobia bacteria. The plant features compound leaves with small, ovate leaflets and produces small, yellowish-white flowers arranged in dense clusters. Its fruit is a legume pod that splits open to release its seeds, contributing to its propagation in the wild. Abarema kalkmanii is often found in moist, shaded areas of tropical forests, where it thrives in the undergrowth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema kalkmanii is primarily native to the Atlantic Forest region of Brazil. This species is found in the humid, tropical environments of the southeastern part of the country. It thrives in areas with high rainfall and well-drained soils. The plant is commonly associated with secondary growth and disturbed habitats within this biome. Its distribution is limited to specific microhabitats within the Atlantic Forest, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Abarema kalkmanii was mainly introduced to South America, particularly in Brazil, as a ornamental plant due to its attractive foliage and unique growth habit. It is commonly found in regions with tropical and subtropical climates, where it thrives in well-drained soils and partial shade. Although it is not widely invasive, it has been reported in several states in Brazil, including Paraná and São Paulo. The plant is often cultivated in gardens and greenhouses, where it is appreciated for its aesthetic value. However, its introduction outside its native range requires careful management to prevent potential ecological impacts."
}
