{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema laeta",
    "plant_slug": "abarema-laeta",
    "plant_name_scientific": "abarema laeta",
    "intro": "Abarema laeta, commonly known as the showy legume, is a species native to South America, particularly Brazil. It is a flowering plant belonging to the Fabaceae family, which is known for its nitrogen-fixing abilities. The plant features compound leaves and produces small, showy flowers that are typically pink or purple in color. Abarema laeta is often found in tropical and subtropical regions, growing in a variety of habitats including forests and open areas. Its ornamental value makes it a popular choice for horticultural use in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema laeta is primarily native to South America, particularly in Brazil. It is commonly found in the Atlantic Forest biome, which spans across eastern and southern Brazil. This plant thrives in tropical and subtropical regions with high humidity and well-drained soils. It is often encountered in moist, shaded areas such as undergrowth in dense forests. Abarema laeta is also present in parts of Paraguay and Argentina, where it grows in similar environmental conditions.",
    "distribution_introduced_art_desc": "Abarema laeta was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate to high rainfall. It is commonly found in disturbed habitats such as roadsides, clearings, and agricultural fields. The plant has been reported in several countries across South America, including Brazil, Colombia, and Peru. Its introduction is often associated with human activity, such as land clearing and seed dispersal through livestock. Due to its adaptability, it has become an invasive species in some regions, outcompeting native vegetation."
}
