{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema muelleriana",
    "plant_slug": "abarema-muelleriana",
    "plant_name_scientific": "abarema muelleriana",
    "intro": "Abarema muelleriana, commonly known as the Mueller's sensitive plant, is a species of flowering plant in the legume family, Fabaceae. It is native to tropical regions of South America, particularly Brazil, and is known for its rapid leaf movement in response to touch, a trait called thigmonastic response. The plant has compound leaves with small, oval-shaped leaflets and produces small, pea-like flowers that are typically pink or purple in color. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded habitats within tropical forests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema muelleriana is primarily native to Brazil, specifically the state of Mato Grosso do Sul. It is commonly found in the Cerrado biome, which is a tropical savanna ecosystem. This plant thrives in well-drained soils and is often associated with open woodland and grassland habitats. It is adapted to the seasonal climate of the region, with distinct wet and dry periods. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Abarema muelleriana was mainly introduced to South America, particularly in Brazil, as part of ornamental plant collections. It is commonly found in regions with tropical and subtropical climates, where it thrives in well-drained soils. The plant is often cultivated for its attractive foliage and potential use in horticulture. However, its introduction has raised concerns about its potential invasiveness in native ecosystems. Due to its rapid growth and adaptability, it requires careful management to prevent ecological disruption."
}
