{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema ferruginea",
    "plant_slug": "abarema-ferruginea",
    "plant_name_scientific": "abarema ferruginea",
    "intro": "Abarema ferruginea, commonly known as the rusty abarema, is a species of flowering plant in the legume family, Fabaceae. It is native to South America, particularly Brazil, and thrives in tropical and subtropical climates. The plant is characterized by its compound leaves and small, clustered flowers that range in color from white to pink. It produces pod-like fruits that contain several seeds, which are dispersed by wind or animals. Abarema ferruginea is often found in moist, well-drained soils in forested or disturbed areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema ferruginea is primarily native to South America, specifically Brazil. It is found in the northeastern region of the country, including the states of Bahia, Piauí, and Ceará. This plant typically grows in dry to semi-arid environments, such as savannas and open woodlands. It is adapted to the tropical and subtropical climates of these regions. Its distribution is largely restricted to the Atlantic Forest biome and surrounding areas.",
    "distribution_introduced_art_desc": "Abarema ferruginea was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and degraded pastures. It thrives in tropical and subtropical regions with high temperatures and moderate to high rainfall. The plant is often found in regions of South America, particularly in Brazil, Colombia, and Venezuela. Its introduction is associated with human activities like agriculture and land clearing. It has adapted well to these new environments, often becoming a common weed in disturbed ecosystems."
}
