{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema cordifolia",
    "plant_slug": "abarema-cordifolia",
    "plant_name_scientific": "abarema cordifolia",
    "intro": "Abarema cordifolia, commonly known as the heartleaf acacia, is a shrub native to South America, particularly Brazil. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant features simple, heart-shaped leaves and produces yellow flowers arranged in clusters. Its fruit is a pod that contains several seeds, and it is often found in dry tropical and subtropical regions. Due to its ornamental value and ecological importance, it is sometimes cultivated in gardens and restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema cordifolia is primarily native to South America, specifically Brazil. It is found in the Atlantic Forest biome, which spans several states in eastern Brazil. This plant thrives in tropical and subtropical regions with high humidity and well-drained soils. It is commonly found in secondary forests and along riverbanks. Abarema cordifolia is known for its ornamental value and is sometimes cultivated for its attractive foliage.",
    "distribution_introduced_art_desc": "Abarema cordifolia was mainly introduced to regions with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in areas with high humidity and moderate rainfall, making it suitable for cultivation in parts of South America, Africa, and Southeast Asia. This plant is often used in ornamental gardening due to its attractive foliage and ability to tolerate various environmental conditions. Its introduction has been driven by its aesthetic value and adaptability to different soil types. However, it requires careful management to prevent potential ecological impacts in non-native habitats."
}
