{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema cochliacarpos",
    "plant_slug": "abarema-cochliacarpos",
    "plant_name_scientific": "abarema cochliacarpos",
    "intro": "Abarema cochliacarpos, commonly known as the Brazilian peacock flower, is a flowering plant native to Brazil. It belongs to the legume family, Fabaceae, and is characterized by its striking, colorful inflorescences that resemble peacock feathers. The plant produces small, pod-like fruits that contain several seeds. It thrives in tropical and subtropical climates, often found in moist, well-drained soils. Its ornamental value makes it a popular choice for gardens and horticultural displays.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abarema",
        "species": "Abarema cochliacarpos"
    },
    "taxonomy_art_desc": "Abarema cochliacarpos belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Abarema, a group of flowering plants native to South America, known for their distinctive flowers and ecological importance. Its species is Abarema cochliacarpos, a specific plant within the genus Abarema, recognized for its unique morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Northeast",
        "Brazil Southeast"
    ],
    "distribution_introduced": [
        "Mozambique"
    ],
    "distribution_native_art_desc": "Abarema cochliacarpos is primarily native to Brazil Northeast and Brazil Southeast. This species is found in the northeastern and southeastern regions of Brazil. It is commonly distributed in the tropical and subtropical areas of these regions. The plant thrives in humid environments with well-drained soils. It is often found in forested and savanna-like habitats within its native range.",
    "distribution_introduced_art_desc": "Abarema cochliacarpos was mainly introduced to Mozambique. It is commonly found in disturbed habitats such as roadsides, agricultural fields, and degraded forests. The plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It has spread across various regions of the country, posing a threat to local biodiversity. Its introduction is likely associated with human activities such as land clearing and accidental seed dispersal."
}
