{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema zolleriana",
    "plant_slug": "abarema-zolleriana",
    "plant_name_scientific": "abarema zolleriana",
    "intro": "Abarema zolleriana, commonly known as the Zoller's burrbean, is a species of flowering plant native to South America. It belongs to the legume family, Fabaceae, and is characterized by its distinctive pod-like fruits that contain seeds. The plant typically grows in tropical and subtropical regions, often in disturbed or open habitats. Its leaves are bipinnate, and it produces small, yellowish flowers that attract pollinators. Due to its unique morphology and ecological role, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema zolleriana is primarily native to the Atlantic Forest region of eastern Brazil. This species is found in the states of Espírito Santo, Rio de Janeiro, and São Paulo. It thrives in humid tropical climates with well-drained soils. The plant is commonly found in secondary growth areas and disturbed habitats. It plays an important ecological role in the biodiversity of the region.",
    "distribution_introduced_art_desc": "Abarema zolleriana was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive foliage and unique appearance. It has been cultivated in various regions for its aesthetic value, although its natural habitat is limited to specific areas in the Amazon basin. Despite its introduction, it remains relatively rare in the wild and is not widely distributed beyond its native range. The plant's introduction has raised concerns about its potential impact on local ecosystems if it were to escape cultivation. Its distribution is primarily confined to controlled environments, with limited natural spread."
}
