{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abarema clypearia f. montana",
    "plant_slug": "abarema-clypearia-f-montana",
    "plant_name_scientific": "abarema clypearia f. montana",
    "intro": "Abarema clypearia f. montana, commonly known as the mountain clypearia, is a variant of the species native to South America. It is a shrub characterized by its narrow, lance-shaped leaves and clusters of small, pinkish-white flowers. The plant typically grows in moist, well-drained soils and thrives in shaded to partially sunny conditions. Its botanical features include a woody stem and small, elliptical leaves with a slightly hairy texture. This form is distinguished by its slightly elevated habitat preference compared to the typical variety.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abarema clypearia f. montana is primarily native to the highland regions of South America, particularly in countries such as Bolivia, Peru, and northern Argentina. It is commonly found in Andean foothills and montane grasslands at elevations ranging from 2,000 to 4,000 meters. This plant thrives in well-drained soils and is often associated with open habitats such as shrublands and rocky slopes. It is adapted to the cooler and more temperate climates of these regions. Due to its specific habitat requirements, it is not widely distributed beyond these areas.",
    "distribution_introduced_art_desc": "Abarema clypearia f. montana was mainly introduced to areas with well-drained soils and moderate to high light exposure. It thrives in tropical and subtropical climates, making it suitable for regions with warm temperatures year-round. This plant is often cultivated in gardens and landscapes for its ornamental value and hardy nature. It has been noted for its ability to adapt to various soil types, although it prefers loamy or sandy soils. Due to its resilience, it has been introduced to several regions outside its native range for horticultural purposes."
}
