{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abasoloa taboada",
    "plant_slug": "abasoloa-taboada",
    "plant_name_scientific": "abasoloa taboada",
    "intro": "Abasoloa taboada, commonly known as the Mexican thornapple, is a shrub native to Mexico and parts of Central America. It belongs to the nightshade family (Solanaceae) and is characterized by its spiny stems and showy, bell-shaped flowers that bloom in the spring. The plant produces small, orange-yellow berries that are toxic to humans but serve as a food source for certain wildlife. It thrives in dry, rocky soils and is often found in arid or semi-arid environments. Due to its ornamental value and ecological role, it is sometimes cultivated in gardens and natural habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abasoloa taboada is primarily native to the arid and semi-arid regions of northern Mexico, particularly in the states of Chihuahua, Coahuila, and Nuevo León. It thrives in rocky soils and is commonly found in desert scrub and grassland habitats. This plant is well adapted to the harsh climate of the region, with its deep root system allowing it to access water from deeper underground. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abasoloa taboada was mainly introduced to the region of southern Mexico, particularly in the states of Oaxaca and Chiapas. It is commonly found in tropical rainforests and humid mountainous areas where the climate is warm and moist. The plant is often cultivated for its ornamental value due to its striking foliage and unique flowering patterns. It has also been introduced to other tropical regions for horticultural purposes. However, its spread outside its native habitat is limited due to specific environmental requirements."
}
