{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abasicarpon patulum",
    "plant_slug": "abasicarpon-patulum",
    "plant_name_scientific": "abasicarpon patulum",
    "intro": "Abasicarpon patulum, commonly known as the slender leaved water plant, is a small aquatic plant native to tropical and subtropical regions. It typically grows in still or slow-moving freshwater environments, such as ponds and marshes. The plant has narrow, ribbon-like leaves that float on the water surface, often with a waxy coating to reduce water loss. Its flowers are small and inconspicuous, usually appearing in clusters near the water's edge. Abasicarpon patulum plays a role in aquatic ecosystems by providing habitat for small organisms and contributing to water filtration.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abasicarpon patulum is primarily native to the southern United States, particularly in Texas and northern Mexico. It thrives in dry, open habitats such as grasslands, rocky slopes, and disturbed areas. This plant is commonly found in sandy or gravelly soils with good drainage. It is often associated with xeric environments and is adapted to withstand drought conditions. Its distribution is limited to specific regions where the climate and soil conditions match its ecological requirements.",
    "distribution_introduced_art_desc": "Abasicarpon patulum was mainly introduced to new habitats through human activities such as landscaping and horticulture. It is commonly found in disturbed soils and urban environments, where it thrives in nutrient-rich conditions. This plant has shown rapid growth and spread, potentially outcompeting native species in invaded areas. Its introduction has raised concerns among ecologists due to its potential impact on local biodiversity. Efforts are being made to monitor and control its spread to prevent ecological disruption."
}
