{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia borealis",
    "plant_slug": "abatia-borealis",
    "plant_name_scientific": "abatia borealis",
    "intro": "Abatia borealis, commonly known as the northern abatia, is a flowering plant native to the Arctic and subarctic regions of North America. It is a low-growing perennial that thrives in cold, harsh environments, often found in tundra and alpine habitats. The plant produces small, white or pale pink flowers that bloom in late summer. Its leaves are typically narrow and arranged in a rosette pattern, adapted to minimize heat loss and maximize light absorption. Abatia borealis plays a role in its ecosystem by providing nectar for pollinators and serving as a food source for certain herbivores.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia borealis is primarily native to the northern regions of North America, including parts of Canada and the northern United States. It is commonly found in boreal forests and wetland areas where it thrives in cool, moist environments. This plant is particularly associated with the Great Lakes region and the northeastern United States. It prefers acidic soils and is often seen in swampy or marshy habitats. Its distribution is limited to these specific ecological zones due to its specialized environmental requirements.",
    "distribution_introduced_art_desc": "Abatia borealis was mainly introduced to North America as an ornamental plant due to its unique foliage and adaptability to various soil conditions. It has since spread beyond cultivated areas, establishing itself in disturbed habitats and forest edges. The plant's rapid growth and ability to thrive in both sunny and shaded environments have contributed to its successful distribution. However, its introduction has raised concerns about its potential impact on native plant communities. Despite its aesthetic appeal, ongoing monitoring is necessary to assess its ecological effects."
}
