{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia stellata",
    "plant_slug": "abatia-stellata",
    "plant_name_scientific": "abatia stellata",
    "intro": "Abatia stellata, commonly known as the starleaf abatia, is a flowering plant native to Central and South America. It is a member of the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its palmate leaves, which are divided into five to seven lobes, giving it a star-like appearance. It produces small, yellowish flowers that are clustered in terminal inflorescences. Abatia stellata is often found in moist, shaded areas such as forests and along streambanks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Salicaceae",
        "genus": "Abatia",
        "species": "Abatia stellata"
    },
    "taxonomy_art_desc": "Abatia stellata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often having a distinct morphology. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose and magnolia families. Its order is Malpighiales, a diverse group of flowering plants that includes many species with unique adaptations, such as the ability to thrive in various environmental conditions. Its family is Salicaceae, commonly known as the willow family, which includes trees and shrubs with simple leaves and often catkin-like flowers. Its genus is Abatia, a group of flowering plants typically found in tropical and subtropical regions, characterized by their morphological features and ecological roles. Its species is Abatia stellata, a specific plant within the genus Abatia, distinguished by its unique characteristics such as its star-shaped flowers and specific habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest",
        "Bolivia",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia stellata is primarily native to Argentina Northwest, Bolivia, and Peru. This plant is commonly found in the Andean regions of these countries. It thrives in dry to semi-arid environments, often in scrublands and rocky areas. Abatia stellata is known for its distinctive star-shaped flowers. Its native distribution is closely tied to the ecological conditions of the Andean foothills and valleys.",
    "distribution_introduced_art_desc": "Abatia stellata was mainly introduced to the southeastern United States, particularly in Florida and parts of Georgia. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and wetlands. This plant has been reported in several states including Texas, Louisiana, and Mississippi as well. It is often associated with moist to wet soil conditions and can thrive in a variety of light environments. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems."
}
