{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia parviflora",
    "plant_slug": "abatia-parviflora",
    "plant_name_scientific": "abatia parviflora",
    "intro": "Abatia parviflora, commonly known as the small-flowered abatia, is a flowering plant native to the tropical regions of South America. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its slender, woody stems and simple, ovate leaves with a slightly hairy surface. Its small, white to pale pink flowers are typically clustered in terminal inflorescences. Abatia parviflora is often found in humid, shaded environments such as forest understories.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Salicaceae",
        "genus": "Abatia",
        "species": "Abatia parviflora"
    },
    "taxonomy_art_desc": "Abatia parviflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and often having a distinct morphology. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse habitats and ecological roles. Its family is Salicaceae, commonly known as the willow family, which includes trees and shrubs often found in moist environments. Its genus is Abatia, a group of flowering plants primarily found in tropical and subtropical regions, known for their ornamental value. Its species is Abatia parviflora, a specific plant within the genus Abatia, characterized by its small flowers and specific ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Costa Rica",
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia parviflora is primarily native to Colombia, Costa Rica, Ecuador, and Peru. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shaded environments such as forests and undergrowth. Abatia parviflora is often associated with humid climates and is part of the native flora in these areas. Its distribution is largely restricted to the western regions of South America.",
    "distribution_introduced_art_desc": "Abatia parviflora was mainly introduced to the southeastern United States, particularly in states like Florida and Georgia. It is commonly found in wetland areas, swamp forests, and along the edges of freshwater bodies. This species thrives in humid, subtropical climates with high rainfall and well-drained soils. Its introduction has led to its establishment in both natural and disturbed habitats. However, it is considered a non-native species in these regions and has not been widely reported as invasive."
}
