{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia mexicana",
    "plant_slug": "abatia-mexicana",
    "plant_name_scientific": "abatia mexicana",
    "intro": "Abatia mexicana, commonly known as Mexican false hibiscus, is a flowering plant native to Mexico and parts of Central America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant features palmate leaves with five to seven lobes and produces showy, trumpet-shaped flowers in shades of yellow to orange. It is often found in moist, shaded areas such as forests and along stream banks. The plant is valued for its ornamental appeal and has traditional uses in some indigenous cultures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Salicaceae",
        "genus": "Abatia",
        "species": "Abatia mexicana"
    },
    "taxonomy_art_desc": "Abatia mexicana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a large and diverse group of flowering plants that includes many species with unique adaptations for survival in various environments. Its family is Salicaceae, commonly known as the willow family, which includes trees and shrubs with opposite leaves and often produces catkin-like flowers. Its genus is Abatia, a group of flowering plants native to tropical and subtropical regions, typically characterized by their small, showy flowers. Its species is Abatia mexicana, a specific plant species found in Mexico, known for its ornamental value and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia mexicana is primarily native to Mexico Central, Mexico Gulf, Mexico Northeast, and Mexico Southwest. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid climates and is often associated with lowland forests and disturbed habitats. Abatia mexicana is known for its medicinal properties and is used in traditional herbal remedies. Its distribution is closely linked to the ecological zones of central and southern Mexico.",
    "distribution_introduced_art_desc": "Abatia mexicana was mainly introduced to control invasive species and for ornamental purposes in certain regions. It is commonly found in disturbed areas such as roadsides and abandoned fields. The plant has been reported in several states in the southern United States. Its introduction has led to concerns about its potential to become invasive in native ecosystems. Proper monitoring is necessary to manage its spread and impact."
}
