{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia boliviana",
    "plant_slug": "abatia-boliviana",
    "plant_name_scientific": "abatia boliviana",
    "intro": "Abatia boliviana, commonly known as the Bolivian abatia, is a flowering plant native to South America, particularly Bolivia and Peru. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its palmate leaves and showy, pentagonal flowers that are typically pink or purple in color. It thrives in moist, tropical environments and is often found in forest understories. Abatia boliviana is valued for its ornamental appeal and has been studied for its potential medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia boliviana is primarily native to the Andean regions of South America, particularly in Bolivia, Peru, and northern Argentina. It is commonly found in high-altitude grasslands and shrublands, often in areas with moderate to high rainfall. This species thrives in temperate climates and is typically associated with rocky or mountainous terrain. It is an important plant in the local ecosystems, providing habitat and food for various wildlife species. Due to its restricted range, it is considered a vulnerable species in some areas.",
    "distribution_introduced_art_desc": "Abatia boliviana was mainly introduced to the southern United States, particularly in Texas and Arizona, as a ornamental plant due to its attractive foliage and adaptability to arid conditions. It has since spread into neighboring regions, including parts of New Mexico and northern Mexico, where it thrives in disturbed soils and along roadsides. The plant's rapid growth and ability to colonize open areas have led to its classification as an invasive species in some regions. Despite its ornamental value, it poses a threat to native plant communities by outcompeting them for resources. Management efforts are ongoing to control its spread and mitigate its ecological impact."
}
