{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia spicata",
    "plant_slug": "abatia-spicata",
    "plant_name_scientific": "abatia spicata",
    "intro": "Abatia spicata, commonly known as the Mexican coffee plant, is a flowering plant native to Central America and northern South America. It belongs to the family Malvaceae and is characterized by its shrub-like growth habit with woody stems. The plant produces small, showy flowers that are typically pink or red in color, arranged in spicate inflorescences. Its leaves are ovate to elliptic in shape, with a smooth or slightly hairy surface. Abatia spicata is often cultivated for its ornamental value and has traditional uses in some indigenous communities.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Salicaceae",
        "genus": "Abatia",
        "species": "Abatia spicata"
    },
    "taxonomy_art_desc": "Abatia spicata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical species and is known for its varied morphological features. Its family is Salicaceae, commonly known as the willow family, which includes trees and shrubs with simple leaves and often catkin-like flowers. Its genus is Abatia, a group of flowering plants native to tropical regions, typically characterized by their woody stems and showy flowers. Its species is Abatia spicata, a specific plant within the genus Abatia, known for its distinctive spicate inflorescence and found in certain parts of South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia spicata is primarily native to Bolivia and Peru. This plant is commonly found in the Andean regions of these countries. It thrives in high-altitude environments, typically in humid and temperate climates. Abatia spicata is often associated with forested areas and mountainous terrain. Its native distribution is limited to specific ecological zones within Bolivia and Peru.",
    "distribution_introduced_art_desc": "Abatia spicata was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and agricultural fields. It thrives in tropical and subtropical regions where there is ample sunlight and moderate to high rainfall. This plant is often found in regions of Central and South America, as well as parts of the Caribbean. Its rapid growth and ability to colonize new areas make it an invasive species in some regions. Due to its adaptability, it can outcompete native vegetation, leading to ecological concerns in invaded habitats."
}
