{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia tomentosa f. parvifolia",
    "plant_slug": "abatia-tomentosa-f-parvifolia",
    "plant_name_scientific": "abatia tomentosa f. parvifolia",
    "intro": "Abatia tomentosa f. parvifolia, commonly known as the small-leaved velvetleaf, is a flowering plant native to the tropical regions of the Americas. It is a member of the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its hairy, velvety stems and leaves that are smaller than those of the typical variety. Its flowers are usually yellow or orange, with five petals and stamens, and it produces capsule fruits containing numerous seeds. This plant is often found in disturbed habitats and is sometimes considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia tomentosa f. parvifolia is primarily native to the southern United States, particularly Florida and parts of Georgia. It is also found in the Caribbean, including the Bahamas and Cuba. This plant typically grows in moist, shaded environments such as swamps, hammocks, and along stream banks. It is well adapted to wetland habitats and is often associated with hardwood forests. Its distribution is limited to specific regions where the climate and soil conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Abatia tomentosa f. parvifolia was mainly introduced to the southeastern United States, particularly in Florida and parts of Georgia. It is commonly found in disturbed areas such as roadsides, railroads, and abandoned fields. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It thrives in sandy or well-drained soils and can tolerate a wide range of environmental conditions. Its introduction has led to ecological concerns, prompting efforts to control its spread in natural habitats."
}
