{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia glabra",
    "plant_slug": "abatia-glabra",
    "plant_name_scientific": "abatia glabra",
    "intro": "Abatia glabra, commonly known as the smooth abatia, is a flowering plant native to the southeastern United States. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its simple, alternate leaves and showy, yellow flowers that bloom in summer. It thrives in moist, well-drained soils and is often found in wetlands and along stream banks. The plant is also valued for its ornamental appeal and ecological benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Salicaceae",
        "genus": "Abatia",
        "species": "Abatia glabra"
    },
    "taxonomy_art_desc": "Abatia glabra belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns, horsetails, and their allies, typically featuring vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and often possessing showy flowers. Its order is Malpighiales, a large group of flowering plants that includes many economically important species such as coffee and cotton. Its family is Salicaceae, commonly known as the willow family, which includes trees and shrubs with simple leaves and often catkin-like flowers. Its genus is Abatia, a group of flowering plants native to tropical regions, characterized by their shrub-like growth and small, clustered flowers. Its species is Abatia glabra, a specific plant within the genus Abatia, distinguished by its smooth, glabrous stems and is commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia glabra is primarily native to Brazil Southeast. It is commonly found in the coastal regions and adjacent areas of the Southeastern part of Brazil. This plant thrives in tropical and subtropical climates, often growing in humid environments. It is typically associated with coastal forests and sandy soils. Its native distribution is largely confined to this specific region within Brazil.",
    "distribution_introduced_art_desc": "Abatia glabra was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It is commonly found in disturbed areas such as roadsides, abandoned fields, and along riverbanks. This plant thrives in moist, sandy soils and is often considered an invasive species in some regions. Its rapid growth and ability to spread through seeds make it a challenging weed to control. Despite its invasive tendencies, it plays a role in stabilizing soil and providing habitat for certain wildlife."
}
