{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia tomentosa",
    "plant_slug": "abatia-tomentosa",
    "plant_name_scientific": "abatia tomentosa",
    "intro": "Abatia tomentosa, commonly known as the silky abatia, is a flowering plant native to the tropical regions of the Americas. It is characterized by its soft, hairy leaves and clusters of small, white or pale yellow flowers. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its bark is often used in traditional medicine for its potential anti-inflammatory properties. The fruit is a capsule that contains several small, hard seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia tomentosa is primarily native to Central and South America, including countries such as Mexico, Guatemala, Belize, and parts of the Caribbean. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid environments and is often associated with secondary forests and disturbed habitats. It is also present in some parts of the southeastern United States, particularly in Florida. Its distribution extends into the Amazon Basin, where it grows in dense undergrowth.",
    "distribution_introduced_art_desc": "Abatia tomentosa was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was brought in for its ornamental value due to its attractive, waxy leaves and showy yellow flowers. However, it has since become an invasive species in many areas, outcompeting native plants and altering local ecosystems. Its rapid growth and ability to spread through seeds and vegetative reproduction contribute to its invasive nature. Efforts are ongoing to control its spread and manage its impact on native flora."
}
