{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia luxemburgioides",
    "plant_slug": "abatia-luxemburgioides",
    "plant_name_scientific": "abatia luxemburgioides",
    "intro": "Abatia luxemburgioides, commonly known as the velvetleaf or velvetleaf abatia, is a flowering plant native to Central and South America. It is a member of the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its broad, heart-shaped leaves that are covered in fine, velvety hairs. It produces showy, yellow-orange flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. The plant is often found in moist, shaded environments, such as along stream banks or in forest understories.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia luxemburgioides is primarily native to the tropical regions of Central and South America. It is found in countries such as Brazil, Colombia, Ecuador, and Peru. This plant typically grows in humid lowland forests and is often associated with secondary vegetation. It thrives in areas with high rainfall and warm temperatures. Its natural range extends into parts of the Caribbean as well.",
    "distribution_introduced_art_desc": "Abatia luxemburgioides was mainly introduced to the United States as an ornamental plant due to its attractive foliage and potential for erosion control. It has been reported in several states, including Texas, Florida, and California, where it has established itself in disturbed soils and along waterways. Despite its initial purpose, it has become invasive in some regions, outcompeting native vegetation and altering local ecosystems. The plant's rapid growth and ability to spread through seeds and vegetative reproduction contribute to its invasive potential. Management efforts are ongoing to control its spread and mitigate its ecological impact."
}
