{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia americana",
    "plant_slug": "abatia-americana",
    "plant_name_scientific": "abatia americana",
    "intro": "Abatia americana, commonly known as the American abatia, is a flowering plant native to the southeastern United States. It is a member of the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its palmate leaves and showy, yellow flowers that bloom in summer. It typically grows in moist, well-drained soils along streambanks and woodland edges. The fruit is a capsule that splits open to release tiny seeds, aiding in its dispersal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Salicaceae",
        "genus": "Abatia",
        "species": "Abatia americana"
    },
    "taxonomy_art_desc": "Abatia americana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails and some modern ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malpighiales, a diverse group of flowering plants that includes many tropical and temperate species. Its family is Salicaceae, commonly known as the willow family, which includes trees and shrubs with opposite leaves and often catkin-like flowers. Its genus is Abatia, a small genus of flowering plants native to the Americas, typically found in tropical and subtropical regions. Its species is Abatia americana, a specific plant within the genus Abatia, native to the United States, characterized by its shrub-like growth and medicinal properties.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia americana is primarily native to Brazil Southeast. It is commonly found in the coastal regions of this area. The plant thrives in humid and tropical climates. It is often associated with mangrove ecosystems and estuarine environments. Its distribution is limited to specific habitats within the southeastern part of Brazil.",
    "distribution_introduced_art_desc": "Abatia americana was mainly introduced to the United States as an ornamental plant due to its attractive foliage and adaptability to various growing conditions. It has since spread beyond its original cultivation areas, establishing itself in natural habitats across several states. The plant's rapid growth and ability to thrive in disturbed soils have contributed to its invasive potential in some regions. It is often found in wetlands, along stream banks, and in other moist environments where it can outcompete native vegetation. Despite its ornamental value, its introduction has raised concerns about ecological impact and management efforts."
}
