{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia rugosa",
    "plant_slug": "abatia-rugosa",
    "plant_name_scientific": "abatia rugosa",
    "intro": "Abatia rugosa, commonly known as the rough abatia, is a flowering plant native to the southeastern United States. It is a member of the Malvaceae family, which includes hibiscus and cotton. The plant features palmate leaves with a rough, hairy texture and produces showy yellow flowers with prominent stamens. It thrives in moist, sandy soils and is often found in swampy areas or along stream banks. Abatia rugosa is valued for its ornamental appeal and ecological importance as a habitat for various insects and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Salicaceae",
        "genus": "Abatia",
        "species": "Abatia rugosa"
    },
    "taxonomy_art_desc": "Abatia rugosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails and some extinct groups. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Malpighiales, a large group of flowering plants that includes many species with diverse morphologies and habitats. Its family is Salicaceae, commonly known as the willow family, which includes trees and shrubs such as willows and poplars. Its genus is Abatia, a small group of flowering plants native to South America, known for their ornamental value. Its species is Abatia rugosa, a specific plant within the genus Abatia, characterized by its distinctive leaf patterns and growth habits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia rugosa is primarily native to Peru. It is commonly found in the tropical and subtropical regions of the country. This plant thrives in humid environments, often growing in forest understories or along riverbanks. It is known for its distinctive, waxy leaves and is sometimes used in traditional medicine. Its distribution is largely confined to specific ecological zones within Peru.",
    "distribution_introduced_art_desc": "Abatia rugosa was mainly introduced to control erosion and for its ornamental value in tropical and subtropical regions. It is commonly found in wetlands, marshes, and along the edges of water bodies. The plant spreads rapidly through its rhizomes, making it a potential invasive species in non-native habitats. It is often used in ecological restoration projects due to its ability to stabilize soil. However, its aggressive growth can outcompete native vegetation, leading to ecological concerns."
}
