{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia canescens",
    "plant_slug": "abatia-canescens",
    "plant_name_scientific": "abatia canescens",
    "intro": "Abatia canescens, commonly known as the gray abatia, is a flowering plant native to the southeastern United States. It is a deciduous shrub that typically grows in moist, well-drained soils along streambanks and in wetlands. The plant features opposite, lance-shaped leaves that are covered in fine, grayish-white hairs. Its showy, yellowish-white flowers bloom in clusters during the spring and summer months. Abatia canescens is valued for its ornamental appeal and its ability to thrive in wetland environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Salicaceae",
        "genus": "Abatia",
        "species": "Abatia canescens"
    },
    "taxonomy_art_desc": "Abatia canescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malpighiales, a large group of flowering plants that includes many species with alternate leaves and often showy flowers. Its family is Salicaceae, commonly known as the willow family, which includes trees and shrubs with alternate leaves and often catkin-like flowers. Its genus is Abatia, a small genus of flowering plants native to South America, typically characterized by their woody stems and simple leaves. Its species is Abatia canescens, a specific plant within the genus Abatia, known for its hairy leaves and its adaptation to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia canescens is primarily native to Ecuador and Peru. It is commonly found in the Andean regions of these countries. This plant typically grows in dry to semi-arid environments. It is often associated with rocky or mountainous terrain. Its distribution is limited to specific ecological niches within these South American nations.",
    "distribution_introduced_art_desc": "Abatia canescens was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and wetlands. This plant thrives in wet to moderately wet soils and is often associated with riparian zones. Its introduction has led to its establishment in both natural and human-altered environments. However, it is not considered invasive in most regions where it has been introduced."
}
