{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abatia angeliana",
    "plant_slug": "abatia-angeliana",
    "plant_name_scientific": "abatia angeliana",
    "intro": "Abatia angeliana, commonly known as the angel's blessing, is a flowering plant native to the tropical regions of Central and South America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its large, showy flowers that range in color from white to pink and yellow. Its leaves are heart-shaped and often have a velvety texture. Abatia angeliana is often cultivated for its ornamental value and is also used in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malpighiales",
        "family": "Salicaceae",
        "genus": "Abatia",
        "species": "Abatia angeliana"
    },
    "taxonomy_art_desc": "Abatia angeliana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which consists of fern allies and includes plants like horsetails and quillworts. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Malpighiales, a large order of flowering plants that includes species with diverse morphological features and ecological roles. Its family is Salicaceae, commonly known as the willow family, which includes trees and shrubs characterized by opposite leaves and often catkin-like flowers. Its genus is Abatia, a group of flowering plants native to tropical regions, known for their ornamental value and medicinal properties. Its species is Abatia angeliana, a specific type within the genus Abatia, distinguished by its unique morphological traits and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Brazil South",
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abatia angeliana is primarily native to Argentina Northeast, Brazil South, and Brazil Southeast. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in humid environments, often growing in forests or near water sources. The species is known for its medicinal properties and is part of the Malvaceae family. Its distribution is limited to these specific regions in South America.",
    "distribution_introduced_art_desc": "Abatia angeliana was mainly introduced to the Southeastern United States, particularly in Florida and parts of Georgia. It is commonly found in wetlands, marshes, and along the edges of water bodies. This plant is often associated with disturbed habitats and can thrive in areas with high moisture levels. Its introduction has led to its establishment in natural and semi-natural environments. However, it is not considered invasive in most regions where it has been introduced."
}
