{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abauria excelsa",
    "plant_slug": "abauria-excelsa",
    "plant_name_scientific": "abauria excelsa",
    "intro": "Abauria excelsa, commonly known as the giant water lily, is a striking aquatic plant native to the tropical regions of South America. It is characterized by its large, floating leaves that can reach up to 3 meters in diameter, providing a unique habitat for various aquatic organisms. The plant's flowers are typically white or pink, with a distinctive, showy appearance that attracts pollinators such as beetles and flies. Its roots are submerged, anchoring it in shallow waters and absorbing nutrients from the surrounding environment. Abauria excelsa plays an important ecological role in maintaining water quality and supporting biodiversity in its native habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abauria excelsa is primarily native to the tropical regions of South America, particularly in countries such as Brazil, Colombia, and Peru. It is commonly found in humid lowland forests and along riverbanks in these areas. The plant thrives in warm, moist environments with high levels of sunlight. It is often associated with secondary growth forests and can be found in disturbed habitats. Its distribution is largely restricted to the Neotropical region, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abauria excelsa was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its striking appearance and unique foliage. However, it has since become invasive in some areas, outcompeting native species for resources. Its rapid growth and ability to spread through seeds have raised concerns among local conservationists. Efforts are now being made to control its spread and protect the ecosystem."
}
