{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abaxianthus convexus",
    "plant_slug": "abaxianthus-convexus",
    "plant_name_scientific": "abaxianthus convexus",
    "intro": "Abaxianthus convexus, commonly known as the convex-leafed abaxianthus, is a rare flowering plant native to the mountainous regions of southern Africa. It is characterized by its thick, waxy leaves that curl inward, forming a protective layer against harsh environmental conditions. The plant produces small, clustered flowers that range in color from pale yellow to deep orange, blooming during the dry season. Its root system is extensive, allowing it to absorb moisture from deep within the soil. Due to its unique morphology and limited distribution, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abaxianthus convexus is primarily native to the mountainous regions of southern Africa, specifically in countries such as South Africa, Lesotho, and Eswatini. It thrives in rocky, well-drained soils at high altitudes, often found in grassland and shrubland habitats. This plant is commonly associated with the fynbos biome, which is known for its rich biodiversity and unique flora. It is adapted to the cool, moist conditions of these regions and is often found in areas with mild temperatures and seasonal rainfall. Due to its specific habitat requirements, it is not widely distributed beyond these geographic areas.",
    "distribution_introduced_art_desc": "Abaxianthus convexus was mainly introduced to regions with temperate climates and well-drained soils, where it thrives in full sun to partial shade. It is commonly found in areas with moderate rainfall and cool summers, making it suitable for gardens in the northern hemisphere. This plant is often cultivated for its ornamental value, particularly its vibrant flowers that bloom in the spring. Due to its adaptability, it has been introduced to various parts of Europe and North America. However, its spread is limited by its specific environmental requirements and lack of naturalized populations in most regions."
}
