{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea maschalantha var. ovata",
    "plant_slug": "abbevillea-maschalantha-var-ovata",
    "plant_name_scientific": "abbevillea maschalantha var. ovata",
    "intro": "Abbevillea maschalantha var. ovata, commonly known as the broad-leafed abbevillea, is a flowering plant native to the mountainous regions of South America. It belongs to the Ericaceae family, which includes heathers and blueberries, and is characterized by its evergreen shrub form. The plant features lance-shaped leaves that are typically arranged in whorls around the stems. Its flowers are usually pink or white, appearing in clusters and blooming in the spring. It thrives in well-drained, acidic soils and requires partial to full sunlight for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea maschalantha var. ovata is primarily native to the eastern United States, specifically the Appalachian region. It is found in areas of Virginia, North Carolina, South Carolina, and Georgia. This species thrives in moist, acidic soils along stream banks and in forest understories. It is commonly associated with rocky and wooded habitats. The plant is known for its delicate, pinkish-white flowers that bloom in late spring.",
    "distribution_introduced_art_desc": "Abbevillea maschalantha var. ovata was mainly introduced to ornamental horticulture due to its striking floral display and unique foliage. It is commonly cultivated in gardens and landscapes in regions with mild climates, where it thrives in well-drained soil and partial shade. This plant is often used as a decorative element in mixed borders and as a focal point in shaded garden areas. Its introduction has expanded its geographic range beyond its native habitat in South America. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
