{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea guaviroba",
    "plant_slug": "abbevillea-guaviroba",
    "plant_name_scientific": "abbevillea guaviroba",
    "intro": "Abbevillea guaviroba, commonly known as the Guaviroba orchid, is a flowering plant native to the tropical regions of South America. It belongs to the Orchidaceae family and is characterized by its striking, showy flowers that typically display vibrant colors such as red, yellow, and orange. The plant thrives in humid, shaded environments and requires well-drained soil to prevent root rot. Its leaves are usually broad and strap-like, contributing to its ornamental appeal. Abbevillea guaviroba is valued not only for its aesthetic beauty but also for its ecological role in supporting pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea guaviroba is primarily native to the Amazon Basin, specifically in regions of northern South America. It is found in countries such as Brazil, Colombia, and Venezuela. This plant thrives in humid, tropical rainforest environments. It is commonly associated with secondary growth areas and disturbed habitats within the Amazon. Its distribution is limited to specific ecological niches within this vast and biodiverse region.",
    "distribution_introduced_art_desc": "Abbevillea guaviroba was mainly introduced to the Neotropical regions, particularly in South America, as part of horticultural and ornamental plant collections. It is commonly found in countries such as Brazil, Colombia, and Peru, where it has been cultivated for its unique floral characteristics. The plant is often grown in botanical gardens and private collections due to its striking appearance and adaptability to various soil types. However, its introduction has raised concerns about potential ecological impacts in non-native environments. Despite its ornamental value, further research is needed to assess its long-term effects on local ecosystems."
}
