{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea klotzschiana var. laurifolia",
    "plant_slug": "abbevillea-klotzschiana-var-laurifolia",
    "plant_name_scientific": "abbevillea klotzschiana var. laurifolia",
    "intro": "Abbevillea klotzschiana var. laurifolia, commonly known as the laurelleaf abbevillea, is a species native to the mountainous regions of South America. It is characterized by its evergreen foliage, with lance-shaped leaves that are glossy and dark green. The plant produces clusters of small, fragrant white flowers during the spring season. It thrives in well-drained, acidic soils and requires partial to full sunlight. Due to its ornamental value, it is occasionally cultivated in botanical gardens and as a decorative plant in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea klotzschiana var. laurifolia is primarily native to the eastern United States, specifically the southeastern region. It is found in states such as Georgia, Florida, and South Carolina. This plant thrives in moist, well-drained soils and is commonly found in forested areas. It is often associated with the Atlantic coastal plain and is part of the Rubiaceae family. Its distribution is limited to specific habitats, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Abbevillea klotzschiana var. laurifolia was mainly introduced to the southeastern United States, particularly in states like Florida and Georgia. It thrives in humid, subtropical climates and is often found in moist, well-drained soils. This plant is commonly used in landscaping due to its attractive foliage and ornamental value. It has been introduced to various botanical gardens and private collections across the region. However, its spread outside its native range is limited due to specific environmental requirements."
}
