{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea klotzschiana var. longipes",
    "plant_slug": "abbevillea-klotzschiana-var-longipes",
    "plant_name_scientific": "abbevillea klotzschiana var. longipes",
    "intro": "Abbevillea klotzschiana var. longipes, commonly known as the long-stemmed abbevillea, is a flowering plant native to the Andes mountains of South America. It is characterized by its upright growth habit and clusters of fragrant, showy flowers that bloom in shades of pink and white. The leaves are typically lance-shaped and arranged alternately along the stems. This variety is noted for its ornamental value and is often cultivated in gardens for its striking appearance. It prefers well-drained soil and full sun to partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea klotzschiana var. longipes is primarily native to the Andean regions of South America, specifically in countries such as Peru, Bolivia, and northern Argentina. It is found in high-altitude habitats, including cloud forests and paramo ecosystems. This plant typically grows in rocky or well-drained soils at elevations ranging from 2,000 to 4,000 meters. It is often associated with humid, cool climates and is part of the natural flora of the Andes. Due to its specific habitat requirements, it is not widely distributed outside of these regions.",
    "distribution_introduced_art_desc": "Abbevillea klotzschiana var. longipes was mainly introduced to the eastern United States as an ornamental plant due to its striking appearance and adaptability to various growing conditions. It is commonly found in gardens and landscaped areas where it thrives in partial to full sun and well-drained soil. This variety is known for its long, narrow leaves and clusters of small, fragrant flowers that bloom in the spring. Despite its beauty, it has raised concerns among conservationists due to its potential to spread beyond cultivated areas. Its introduction has led to discussions about its impact on native plant communities in the region."
}
