{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea maschalantha",
    "plant_slug": "abbevillea-maschalantha",
    "plant_name_scientific": "abbevillea maschalantha",
    "intro": "Abbevillea maschalantha, commonly known as the Maschalantha abbevillea, is a flowering plant native to the rainforests of South America. It belongs to the Rubiaceae family, which includes coffee and gardenias, and is characterized by its showy, clustered flowers. The plant typically grows as an epiphyte, attaching itself to trees in the humid, shaded understory of tropical forests. Its leaves are opposite, elliptical, and often have a waxy texture, while its flowers are usually pink or white with prominent stamens. Due to habitat loss, it is considered a rare and endangered species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea maschalantha is primarily native to the Andean regions of South America, specifically in countries such as Peru, Bolivia, and Ecuador. It is commonly found in the cloud forests and humid montane areas at elevations ranging from 1,500 to 3,000 meters. This plant thrives in shaded, moist environments with rich, well-drained soil. It is often associated with tropical and subtropical climates, particularly in the western Andes. Due to its specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abbevillea maschalantha was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It is commonly found in wetlands, marshes, and along the edges of water bodies where it thrives in moist to swampy conditions. This plant has become established in these regions, often forming dense stands that can alter local ecosystems. Its introduction has raised concerns among conservationists due to its potential to outcompete native flora. Despite its invasive tendencies, it is sometimes used in ornamental gardening for its attractive, fragrant flowers."
}
