{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea bullata",
    "plant_slug": "abbevillea-bullata",
    "plant_name_scientific": "abbevillea bullata",
    "intro": "Abbevillea bullata, commonly known as the pink bellflower, is a striking flowering plant native to the southeastern United States. It belongs to the Campanulaceae family and is characterized by its showy, bell-shaped flowers that range in color from white to pink. The plant typically grows in moist, well-drained soils in woodland or swampy areas. Its leaves are opposite, lance-shaped, and often have a slightly hairy texture. Abbevillea bullata is valued for its ornamental appeal and is often cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea bullata is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in wetland habitats such as swamps, marshes, and along the edges of ponds. This plant thrives in moist, acidic soils and is often associated with cypress and mangrove ecosystems. It is also occasionally found in the Caribbean, including parts of Cuba and the Bahamas. Due to its specific habitat requirements, it is considered a rare and endangered species in many areas of its native range.",
    "distribution_introduced_art_desc": "Abbevillea bullata was mainly introduced to the eastern United States, particularly in the southeastern region. It was brought there as an ornamental plant due to its attractive, showy flowers. The introduction occurred during the 19th century as part of efforts to diversify garden flora. It has since spread beyond cultivated areas into natural habitats, raising concerns about its ecological impact. This plant is now considered an invasive species in several states where it has displaced native vegetation."
}
