{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea maschalantha var. recurvata",
    "plant_slug": "abbevillea-maschalantha-var-recurvata",
    "plant_name_scientific": "abbevillea maschalantha var. recurvata",
    "intro": "Abbevillea maschalantha var. recurvata, commonly known as the recurved abbevillea, is a flowering plant native to the tropical regions of South America. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its showy, trumpet-shaped flowers that range in color from pink to deep red. Its leaves are typically ovate with a smooth or slightly hairy surface. This species is often cultivated for its ornamental value in gardens due to its vibrant blooms and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea maschalantha var. recurvata is primarily native to the eastern United States, specifically the Appalachian region. It is found in areas of Virginia, North Carolina, and Tennessee. This variant thrives in moist, well-drained soils along stream banks and in forested understories. It is commonly associated with rocky or sandy soils in humid climates. The plant is often found in mixed hardwood forests and is a characteristic species of the southeastern U.S. ecosystem.",
    "distribution_introduced_art_desc": "Abbevillea maschalantha var. recurvata was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in temperate regions. It thrives in environments that mimic its native habitat, which includes forest edges and rocky slopes. This plant is often found in regions with a mild climate and moderate rainfall. Its introduction has been noted in horticultural gardens and conservation areas where it is cultivated for its ornamental value. However, its spread outside of these controlled environments is limited due to specific ecological requirements."
}
