{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea chrysophylla",
    "plant_slug": "abbevillea-chrysophylla",
    "plant_name_scientific": "abbevillea chrysophylla",
    "intro": "Abbevillea chrysophylla, commonly known as the golden-leaved abbevillea, is a species of flowering plant native to the tropical regions of South America. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its striking yellow foliage and showy, pinkish-white flowers that bloom during the warmer months. Its leaves are typically large, ovate, and have a waxy texture, while its stems are woody and branched. Abbevillea chrysophylla is often cultivated for its ornamental value in botanical gardens and as a houseplant due to its unique appearance and relatively low maintenance requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea chrysophylla is primarily native to the tropical regions of South America, specifically Colombia and Ecuador. It is commonly found in the Andean foothills and adjacent lowland areas. This plant thrives in humid, shaded environments within tropical rainforests. Its distribution is limited to specific microhabitats with high humidity and well-drained soils. Due to habitat loss, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abbevillea chrysophylla was mainly introduced to the Southeastern United States, particularly in states like Florida and Georgia. It was brought there for its ornamental value due to its vibrant yellow foliage and unique growth habit. This plant thrives in wetland environments and has been found in marshes and along riverbanks. Its introduction has raised concerns about its potential to become invasive in native ecosystems. Despite its beauty, careful monitoring is needed to prevent it from outcompeting local flora."
}
