{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea cerasoides",
    "plant_slug": "abbevillea-cerasoides",
    "plant_name_scientific": "abbevillea cerasoides",
    "intro": "Abbevillea cerasoides, commonly known as the pink sandalwood, is a flowering plant native to the eastern United States. It belongs to the Fabaceae family and is characterized by its compound leaves and showy, pinkish-white flowers. The plant typically grows in moist, acidic soils and thrives in partial to full shade. Its ornamental value comes from its attractive foliage and fragrant blooms. However, it is considered rare and is often found in specific habitats such as forested areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea cerasoides is primarily native to the Caribbean region, particularly the Greater Antilles. It is found in countries such as Cuba, Hispaniola, and Jamaica. This plant typically grows in moist, shaded environments within tropical forests. It is often associated with limestone substrates and is commonly found in mountainous areas. Its distribution is limited to specific ecological niches within these islands.",
    "distribution_introduced_art_desc": "Abbevillea cerasoides was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It thrives in environments with ample sunlight and moderate to high rainfall. This plant is often found in disturbed habitats such as roadsides, clearings, and secondary forests. Its introduction has been associated with ornamental horticulture and ecological restoration projects. However, it can become invasive in certain regions if not managed properly."
}
