{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea recurvata",
    "plant_slug": "abbevillea-recurvata",
    "plant_name_scientific": "abbevillea recurvata",
    "intro": "Abbevillea recurvata, commonly known as the slender abbevillea, is a flowering plant native to the Andean region of South America. It is a member of the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its delicate, pendulous flowers that bloom in shades of pink and white. Its leaves are alternate, ovate, and often have a hairy texture. Abbevillea recurvata thrives in moist, well-drained soils and is often found in cloud forests at elevations above 1,500 meters.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea recurvata is primarily native to the eastern United States, specifically the southeastern region. It is found in states such as Georgia, South Carolina, and North Carolina. This plant typically grows in moist, wooded areas and along stream banks. It thrives in the humid climate of the Appalachian region. Its native range is limited to these specific geographic areas within the southeastern United States.",
    "distribution_introduced_art_desc": "Abbevillea recurvata was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically in temperate climates. It is commonly found in regions with mild winters and cool summers, where it thrives in forested or woodland environments. This plant is often used in ornamental horticulture due to its attractive foliage and unique flowering pattern. It has been introduced to several parts of the United States, particularly in the southeastern region. However, its spread is limited due to its specific environmental requirements and slower growth rate."
}
