{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea klotzschiana var. intermedia",
    "plant_slug": "abbevillea-klotzschiana-var-intermedia",
    "plant_name_scientific": "abbevillea klotzschiana var. intermedia",
    "intro": "Abbevillea klotzschiana var. intermedia, commonly known as the intermediate abbevillea, is a flowering plant native to the Andes mountains of South America. It is characterized by its evergreen foliage and showy, bell-shaped flowers that bloom in shades of pink and white. The plant typically grows in moist, shaded environments, often found in cloud forests. Its leaves are leathery and glossy, providing a striking visual contrast to its delicate flowers. This variety is valued for its ornamental appeal and is often cultivated in gardens with suitable climate conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea klotzschiana var. intermedia is primarily native to the southern United States, specifically Florida and parts of Georgia. It is commonly found in wetland areas, swamp forests, and along the edges of ponds and rivers. This plant thrives in moist, acidic soils and is often associated with coastal and inland wetlands. It is an important component of the vegetation in these habitats, providing food and shelter for various wildlife species. The variety is known for its striking pink to red flowers that bloom in the spring.",
    "distribution_introduced_art_desc": "Abbevillea klotzschiana var. intermedia was mainly introduced to the southeastern United States, particularly in states like Florida and Georgia. It is commonly found in wetland areas and along the edges of swamps, where it thrives in moist, acidic soils. This variety is known for its showy, pink to red flowers that bloom in the spring. It has been introduced as an ornamental plant due to its aesthetic appeal and adaptability to various wetland conditions. However, it is considered invasive in some regions, outcompeting native vegetation."
}
