{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea schlechtendahliana",
    "plant_slug": "abbevillea-schlechtendahliana",
    "plant_name_scientific": "abbevillea schlechtendahliana",
    "intro": "Abbevillea schlechtendahliana, commonly known as the Schlechtendahl's abbevillea, is a flowering plant native to the Andean region of South America. It belongs to the family Polemoniaceae and is characterized by its showy, tubular flowers that range in color from blue to purple. The plant typically grows as an evergreen shrub, reaching heights of up to 2 meters, with opposite, lance-shaped leaves. Its flowers are adapted for pollination by hummingbirds, which are attracted to its nectar-rich blooms. Abbevillea schlechtendahliana is valued in horticulture for its ornamental appeal and ability to thrive in well-drained, acidic soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea schlechtendahliana is primarily native to the mountainous regions of Colombia and Ecuador in South America. It is found in the Andes, specifically in areas with high altitude and cool, humid climates. This species thrives in cloud forests and is often associated with rocky or forested slopes. Its native range is limited to these specific ecological zones within the Andean region. The plant is adapted to the unique environmental conditions of its native habitat.",
    "distribution_introduced_art_desc": "Abbevillea schlechtendahliana was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It thrives in wet, humid environments and is often found in swampy areas or near water bodies. This plant is known for its showy, pink to red flowers that bloom in the spring. It has been cultivated in botanical gardens and private collections due to its ornamental value. However, it is considered an invasive species in some regions, posing a threat to native plant communities."
}
