{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea punctulata",
    "plant_slug": "abbevillea-punctulata",
    "plant_name_scientific": "abbevillea punctulata",
    "intro": "Abbevillea punctulata, commonly known as the spotted abbevillea, is a flowering plant native to the mountainous regions of South America. It belongs to the family Malvaceae, which includes cotton and hibiscus, and is characterized by its showy, pentagonal flowers. The plant typically grows in rocky soils and is adapted to high-altitude environments. Its leaves are usually ovate with a hairy texture, and it produces small, capsule-like fruits. Abbevillea punctulata is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea punctulata is primarily native to the Atlantic Forest biome of eastern Brazil. It is found in the states of Rio de Janeiro, Espírito Santo, and Minas Gerais. This plant typically grows in humid, tropical environments with well-drained soils. It is often associated with rocky outcrops and secondary forests. Its distribution is limited to a relatively small geographic area within this region.",
    "distribution_introduced_art_desc": "Abbevillea punctulata was mainly introduced to the southeastern United States, particularly in states like Georgia, South Carolina, and Florida. It was brought there for its ornamental value due to its showy, bell-shaped flowers. The plant thrives in moist, well-drained soils and is often found in wetlands or along stream banks. It has become naturalized in some areas, raising concerns about its impact on native plant communities. Despite its beauty, it is considered an invasive species in certain regions where it outcompetes local flora."
}
