{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea maschalantha var. oblongata",
    "plant_slug": "abbevillea-maschalantha-var-oblongata",
    "plant_name_scientific": "abbevillea maschalantha var. oblongata",
    "intro": "Abbevillea maschalantha var. oblongata, commonly known as the oblongleaf abbevillea, is a flowering plant native to the tropical rainforests of Southeast Asia. It is characterized by its large, showy inflorescences that consist of numerous small, fragrant flowers clustered in panicles. The leaves are typically oblong in shape, with a glossy surface and a prominent midrib. This species thrives in humid, shaded environments and requires well-drained, nutrient-rich soil. It is valued in horticulture for its ornamental value and ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea maschalantha var. oblongata is primarily native to the western regions of the United States, specifically in California and Oregon. This variety of Abbevillea is typically found in moist, shaded environments such as woodlands and forest understories. It thrives in areas with cool, humid climates and is often associated with coastal and mountainous habitats. The plant is known for its delicate, fragrant flowers that bloom in the spring. Its native range is limited, making it a rare and specialized species within its ecological niche.",
    "distribution_introduced_art_desc": "Abbevillea maschalantha var. oblongata was mainly introduced to the eastern United States, particularly in the southeastern region. It is commonly found in moist, shaded habitats such as woodlands and stream banks. This plant is often cultivated in gardens for its ornamental value due to its attractive foliage and flowering habit. It has been noted to spread readily in natural areas, sometimes becoming invasive. Its introduction has raised concerns among conservationists due to its potential impact on native plant communities."
}
