{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea fenzliana var. obversa",
    "plant_slug": "abbevillea-fenzliana-var-obversa",
    "plant_name_scientific": "abbevillea fenzliana var. obversa",
    "intro": "Abbevillea fenzliana var. obversa, commonly known as the yellow-flowered abbevillea, is a rare and striking plant native to the mountainous regions of South America. It belongs to the Ericaceae family, which includes heathers and blueberries, and is characterized by its evergreen foliage and showy, bell-shaped flowers. The varietal form obversa is distinguished by its pale yellow petals, which contrast with its dark green leaves. This plant thrives in cool, humid environments and is often found in cloud forests at high elevations. Due to its limited distribution and ornamental value, it is considered a valuable species in botanical gardens and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea fenzliana var. obversa is primarily native to the Andean regions of South America, specifically in Ecuador and Peru. This variant is typically found in cloud forests at elevations ranging from 1,200 to 2,500 meters above sea level. It thrives in humid, shaded environments with well-drained soil. The plant is known for its striking pink to red flowers that bloom during the warmer months. Due to habitat loss, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abbevillea fenzliana var. obversa was mainly introduced to the southeastern United States, particularly in areas with moist, acidic soils. It is commonly found in the Carolinas and Georgia, where it thrives in shaded, woodland environments. This plant is often cultivated in gardens for its attractive, bell-shaped flowers that bloom in spring. Its introduction has been primarily through horticultural efforts aimed at adding ornamental value to landscapes. However, it is important to monitor its spread to prevent potential ecological impacts in native habitats."
}
