{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea phaea",
    "plant_slug": "abbevillea-phaea",
    "plant_name_scientific": "abbevillea phaea",
    "intro": "Abbevillea phaea, commonly known as the yellow bellflower, is a flowering plant native to the southeastern United States. It belongs to the Campanulaceae family and is characterized by its bell-shaped, yellow flowers that bloom in late spring. The plant typically grows in moist, well-drained soils and prefers partial to full shade. Its leaves are lance-shaped and have a smooth texture, while its stems are erect and often branched. Abbevillea phaea is valued for its ornamental appeal and is often cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea phaea is primarily native to the Atlantic coastal plain of the southeastern United States. It is found in states such as North Carolina, South Carolina, Georgia, and Florida. This plant typically grows in moist, sandy soils along riverbanks and in wetlands. It is commonly associated with the Carolinas and is part of the Lythraceae family. Abbevillea phaea is an important component of the wetland ecosystems in its native range.",
    "distribution_introduced_art_desc": "Abbevillea phaea was mainly introduced to the southeastern United States, particularly in states such as Florida, Georgia, and South Carolina. It was brought there as an ornamental plant due to its attractive, fragrant flowers. The introduction has led to its establishment in various habitats, including disturbed soils and wetlands. However, it is considered an invasive species in some areas, outcompeting native vegetation. Conservation efforts are ongoing to control its spread and protect local ecosystems."
}
