{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea martiana",
    "plant_slug": "abbevillea-martiana",
    "plant_name_scientific": "abbevillea martiana",
    "intro": "Abbevillea martiana, commonly known as the velvetleaf abbevillea, is a flowering plant native to the tropical regions of South America. It is characterized by its large, heart-shaped leaves that are often covered in a dense layer of fine, velvety hairs. The plant produces clusters of small, white or pale yellow flowers that bloom during the warmer months. It thrives in humid, shaded environments and is often found in the understory of rainforests. Due to its ornamental value and ecological importance, it is sometimes cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea martiana is primarily native to the Caribbean region, particularly the island of Hispaniola, which includes the countries of Haiti and the Dominican Republic. It is commonly found in moist, shaded areas within tropical forests. This plant thrives in humid environments with high levels of rainfall. It is often associated with secondary growth forests and can be found at low to moderate elevations. Due to its specific habitat requirements, it is considered a relatively rare species in its native range.",
    "distribution_introduced_art_desc": "Abbevillea martiana was mainly introduced to the southeastern United States, particularly in states like Florida, Georgia, and South Carolina. It was brought there for its ornamental value due to its attractive, showy flowers. The plant thrives in wetland environments and has become naturalized in many areas where it can outcompete native vegetation. Its introduction has led to concerns about its invasive potential in certain ecosystems. Despite its beauty, careful management is needed to prevent it from becoming a nuisance in local habitats."
}
