{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea klotzschiana",
    "plant_slug": "abbevillea-klotzschiana",
    "plant_name_scientific": "abbevillea klotzschiana",
    "intro": "Abbevillea klotzschiana, commonly known as the Klotzschian abbevillea, is a flowering plant native to the mountainous regions of South America. It belongs to the Ericaceae family, which includes heathers and blueberries, and is characterized by its evergreen shrub form. The plant produces clusters of small, bell-shaped flowers that range in color from white to pink, typically blooming in spring. Its leaves are elliptical, leathery, and retain their color year-round, contributing to its ornamental appeal. Abbevillea klotzschiana thrives in well-drained, acidic soils and is often found in cool, humid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea klotzschiana is primarily native to the Andean regions of South America, specifically in countries such as Bolivia, Peru, and Ecuador. It is found in the high-altitude zones of the Andes, typically between 2,000 and 4,000 meters above sea level. This plant thrives in humid, temperate climates with well-drained soils, often growing in cloud forests or rocky mountainous areas. It is known for its striking pink or red flowers, which bloom during the warmer months. Due to its specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abbevillea klotzschiana was mainly introduced to the eastern United States, particularly in regions with moist, well-drained soils. It is commonly found in forested areas and along stream banks, where it thrives in partial shade. This plant is valued for its ornamental qualities, including its fragrant flowers and attractive foliage. It has been widely cultivated in gardens and naturalized in certain areas. However, its spread is limited due to its specific habitat requirements and climate preferences."
}
