{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea rufa",
    "plant_slug": "abbevillea-rufa",
    "plant_name_scientific": "abbevillea rufa",
    "intro": "Abbevillea rufa, commonly known as the red abbevillea, is a flowering plant native to the tropical regions of South America. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its showy, trumpet-shaped flowers that range in color from pink to red. It typically grows in moist, shaded environments such as forests and riverbanks. Its ornamental value makes it a popular choice for gardens in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea rufa is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in wetland habitats such as swamps, marshes, and along the edges of ponds. This species thrives in moist, acidic soils and is often associated with pine flatwoods and cypress swamps. It is an important component of the understory vegetation in these ecosystems. Due to its specific habitat requirements, it is relatively rare and considered a sensitive indicator of wetland health.",
    "distribution_introduced_art_desc": "Abbevillea rufa was mainly introduced to the southeastern United States, particularly in regions with warm, humid climates. It is commonly found in coastal areas and along riverbanks where it thrives in moist, well-drained soils. This plant is often cultivated for its ornamental value due to its vibrant red flowers and attractive foliage. It has been introduced to several states including Florida, Georgia, and South Carolina. However, it is considered an invasive species in some areas, outcompeting native vegetation."
}
