{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea gardneriana",
    "plant_slug": "abbevillea-gardneriana",
    "plant_name_scientific": "abbevillea gardneriana",
    "intro": "Abbevillea gardneriana, commonly known as the Gardner's abbevillea, is a flowering plant native to the Andean region of South America. It belongs to the Ericaceae family, which includes heathers and blueberries, and is characterized by its evergreen foliage and showy, bell-shaped flowers. The plant typically grows in moist, well-drained soils in shaded to semi-shaded environments. It produces small, dark berries that are edible and often consumed by local wildlife. Due to its ornamental value and ecological importance, it is sometimes cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea gardneriana is primarily native to the Caribbean region, specifically the Greater Antilles. It is found in countries such as Cuba, Hispaniola, Jamaica, and the Bahamas. This plant typically grows in moist, shaded areas within tropical forests. It is often associated with limestone substrates and is commonly found in coastal and lowland habitats. Its distribution is limited to these specific regions, making it a rare and endemic species in the Caribbean.",
    "distribution_introduced_art_desc": "Abbevillea gardneriana was mainly introduced to the southeastern United States, particularly in Florida and Georgia. It is commonly found in moist, well-drained soils along stream banks and in open woodlands. This plant is often used in landscaping for its ornamental value, especially its vibrant red flowers. It has been introduced to various regions beyond its native range, including parts of the Caribbean. However, it is considered an invasive species in some areas where it outcompetes native vegetation."
}
