{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbevillea fenzliana var. intermedia",
    "plant_slug": "abbevillea-fenzliana-var-intermedia",
    "plant_name_scientific": "abbevillea fenzliana var. intermedia",
    "intro": "Abbevillea fenzliana var. intermedia, commonly known as the Intermediate Abbevillea, is a flowering plant native to South America, particularly Brazil. It belongs to the Malvaceae family and is characterized by its shrub-like growth habit with woody stems. The plant produces showy, trumpet-shaped flowers that are typically pink or red in color, blooming during the warmer months. Its leaves are alternate, ovate, and have a hairy texture, contributing to its ornamental value. This species is often cultivated for its vibrant blooms and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbevillea fenzliana var. intermedia is primarily native to the highland regions of South America, specifically in the Andean foothills of Argentina and Chile. This variant is commonly found in rocky and arid environments, often growing in association with other succulent plants. It thrives in areas with well-drained soils and full sun exposure, typical of its native habitat. The plant is adapted to the seasonal climate of the region, with periods of drought and cooler temperatures. Due to its limited distribution, it is considered a rare and localized species within its range.",
    "distribution_introduced_art_desc": "Abbevillea fenzliana var. intermedia was mainly introduced to the southeastern United States, particularly in regions with moist, acidic soils. It is commonly found in the Carolinas and parts of Georgia, where it thrives in shaded, forested environments. This plant is often used in horticulture for its ornamental value, especially its vibrant red flowers. However, it is considered an invasive species in some areas, outcompeting native vegetation. Its introduction has led to ecological concerns, prompting efforts to control its spread."
}
