{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbottia singularis",
    "plant_slug": "abbottia-singularis",
    "plant_name_scientific": "abbottia singularis",
    "intro": "Abbottia singularis, commonly known as the singleflower calystetha, is a rare and striking member of the Ranunculaceae family. It is native to the mountainous regions of southern China, where it thrives in cool, moist, and shaded environments. The plant is characterized by its unique, single white or pale yellow flower that sits atop a tall, slender stem. Its foliage consists of trifoliate leaves with finely toothed edges, adding to its ornamental appeal. Due to its limited distribution and habitat specificity, Abbottia singularis is considered a conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbottia singularis is primarily native to the mountainous regions of southern China, particularly in the provinces of Yunnan and Sichuan. It thrives in cool, humid climates at high altitudes, often found in shaded forest understories. This plant is also occasionally reported in northern Vietnam, though its presence there is less common. It is typically found in areas with well-drained, acidic soils. Abbottia singularis is a rare and specialized species, making it a subject of interest for botanists and conservationists.",
    "distribution_introduced_art_desc": "Abbottia singularis was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded forest understories where it thrives in cool, humid conditions. This plant is often cultivated in gardens for its attractive, bell-shaped flowers that bloom in late spring. It prefers well-drained, loamy soil and partial to full shade. Due to its ornamental value, it has become a popular addition to native plant gardens and conservation areas."
}
