{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbotia pumila",
    "plant_slug": "abbotia-pumila",
    "plant_name_scientific": "abbotia pumila",
    "intro": "Abbotia pumila, commonly known as the dwarf abbotia, is a herbaceous perennial native to eastern North America. It features small, heart-shaped leaves that are often covered in fine, silky hairs. The plant produces clusters of pale yellow to greenish-white flowers in early spring. It thrives in moist, shaded environments and is often found in woodlands and stream banks. Abbotia pumila is valued for its ornamental appeal and ecological importance in supporting pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbotia pumila is primarily native to the southeastern United States, specifically in the coastal plain regions of North and South Carolina. It thrives in moist, acidic soils and is commonly found in wetlands, swamps, and along the edges of ponds and streams. This species is also present in parts of Georgia and Florida, where it grows in similar wetland habitats. It is often associated with pine flatwoods and other lowland ecosystems. Due to its specific habitat requirements, it is considered a rare and sensitive plant species in its native range.",
    "distribution_introduced_art_desc": "Abbotia pumila was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It was first recorded in the late 19th century and has since become established in several regions across the country. The plant thrives in coastal and lowland areas, often growing in disturbed soils and along roadsides. Despite its aesthetic appeal, it is considered a potential weed in some areas due to its ability to spread rapidly. Its introduction has raised concerns among conservationists regarding its impact on native ecosystems."
}
