{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abbotia filiformis",
    "plant_slug": "abbotia-filiformis",
    "plant_name_scientific": "abbotia filiformis",
    "intro": "Abbotia filiformis, commonly known as the slender abbotia, is a deciduous shrub native to eastern Asia, particularly China. It is characterized by its slender, branching stems and small, opposite leaves that are typically elliptical in shape. The plant produces clusters of fragrant, white to pale yellow flowers in late spring to early summer. These flowers are borne on short pedicels and are often described as resembling tiny bells. Abbotia filiformis is valued in horticulture for its ornamental appeal and ability to thrive in partial shade to full sun conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abbotia filiformis is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in wetlands, swamps, and along the edges of ponds and streams. This species thrives in moist, acidic soils and is often associated with cypress swamps and other wetland habitats. It is an important component of the understory vegetation in these ecosystems. Due to its limited range, it is considered a rare and endangered plant in many areas of its native habitat.",
    "distribution_introduced_art_desc": "Abbotia filiformis was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically in woodland or forested environments. It thrives in regions with cool summers and mild winters, making it suitable for temperate climates. This plant is often found in the understory of forests where it can receive adequate light without being exposed to direct sunlight. Its introduction has been primarily for ornamental purposes due to its attractive, fern-like foliage. However, it is important to note that it may become invasive in certain ecosystems if not managed properly."
}
