{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abdominea macranthera",
    "plant_slug": "abdominea-macranthera",
    "plant_name_scientific": "abdominea macranthera",
    "intro": "Abdominea macranthera, commonly known as the large-flowered bladderwort, is a unique aquatic plant belonging to the family Lentibacillaceae. It is characterized by its inflated, bladder-like structures that trap small aquatic organisms, aiding in its nutrient acquisition. The plant typically grows in still or slow-moving freshwater environments, such as ponds and ditches. Its flowers are distinctive, featuring large, showy petals that attract pollinators. Despite its name, it is not a true bladderwort but shares some morphological similarities with other aquatic carnivorous plants.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abdominea macranthera is primarily native to the Mediterranean region, including parts of southern Europe, northern Africa, and western Asia. It thrives in rocky and coastal environments, often found in dry, sunny habitats. The plant is commonly associated with limestone soils and is well-adapted to the harsh conditions of its native range. It is a member of the Apiaceae family, known for its aromatic properties. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Abdominea macranthera was mainly introduced to new habitats through human activities such as horticulture and accidental transport. It has been documented in several regions outside its native range, including parts of Europe and North America. The plant's ability to thrive in a variety of soil types contributes to its successful establishment in these areas. It is often found in disturbed environments such as roadsides and gardens. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
