{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abdominea intricata",
    "plant_slug": "abdominea-intricata",
    "plant_name_scientific": "abdominea intricata",
    "intro": "Abdominea intricata, commonly known as the spiral liverwort, is a small, cryptogamic plant belonging to the family Porellaceae. It is characterized by its intricate, spirally arranged thallus, which gives it its scientific name. The plant typically grows in moist, shaded environments, such as on rocks or soil in temperate regions. Its structure consists of a flattened, ribbon-like body with distinct lobes and a central canal. Abdominea intricata plays a role in soil stabilization and provides microhabitats for various invertebrates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abdominea intricata is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky and arid environments, often found in coastal areas and mountainous regions. This plant is adapted to withstand harsh climatic conditions, such as high temperatures and limited water availability. Its distribution is closely associated with specific microhabitats that provide shelter and nutrients. Due to its specialized habitat requirements, it is not commonly found outside of these regions.",
    "distribution_introduced_art_desc": "Abdominea intricata was mainly introduced to new habitats through human activities such as horticulture and landscaping. It has been observed thriving in disturbed soils and urban environments, which are often unsuitable for native plant species. The distribution of this plant has expanded across several regions, including parts of Europe and North America. Its ability to adapt to different soil types and climates has contributed to its successful establishment. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
