{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abdra brachycarpa",
    "plant_slug": "abdra-brachycarpa",
    "plant_name_scientific": "abdra brachycarpa",
    "intro": "Abdra brachycarpa, commonly known as the narrow-fruited abdra, is a perennial shrub native to the arid regions of southern Africa. It is characterized by its small, woody stems and dense clusters of narrow, lance-shaped leaves. The plant produces small, pale yellow flowers that are clustered in inflorescences, followed by elliptical, fleshy fruits that are typically less than 1 cm in length. It is adapted to survive in harsh, dry environments with low rainfall. The species is of interest in botanical studies due to its unique morphology and ecological adaptations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Brassicales",
        "family": "Brassicaceae",
        "genus": "Abdra",
        "species": "Abdra brachycarpa"
    },
    "taxonomy_art_desc": "Abdra brachycarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their algae relatives, characterized by their complex cellular structures and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often possessing jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and reproductive strategies. Its order is Brassicales, a group of flowering plants that includes economically significant crops like cabbage and mustard, known for their cruciform flowers and seed pods. Its family is Brassicaceae, commonly known as the mustard family, characterized by their four-petaled flowers and siliquae or pods. Its genus is Abdra, a relatively small genus within the Brassicaceae family, consisting of a few species native to specific regions. Its species is Abdra brachycarpa, a specific plant within the genus Abdra, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Alabama",
        "Arizona",
        "Arkansas",
        "Florida",
        "Georgia",
        "Illinois",
        "Indiana",
        "Kansas",
        "Kentucky",
        "Louisiana",
        "Mississippi",
        "Missouri",
        "North Carolina",
        "Ohio",
        "Oklahoma",
        "Oregon",
        "South Carolina",
        "Tennessee",
        "Texas",
        "Virginia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abdra brachycarpa is primarily native to Alabama, Arizona, Arkansas, Florida, Georgia, Illinois, Indiana, Kansas, Kentucky, Louisiana, Mississippi, Missouri, North Carolina, Ohio, Oklahoma, Oregon, South Carolina, Tennessee, Texas, Virginia. This plant is commonly found in a variety of habitats including woodlands, prairies, and disturbed areas across these regions. It thrives in well-drained soils and is often associated with open or partially shaded environments. The distribution of Abdra brachycarpa reflects its adaptability to different climatic conditions within the southeastern and central United States. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Abdra brachycarpa was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and waste areas. It thrives in regions with moderate to high rainfall and full sun exposure. The plant is commonly found in the southeastern United States, particularly in states like Georgia, Florida, and South Carolina. Its rapid growth and ability to spread through seeds make it an invasive species in some regions. Due to its adaptability, it has become a common sight in both natural and human-altered landscapes."
}
