{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abdulmajidia rimata",
    "plant_slug": "abdulmajidia-rimata",
    "plant_name_scientific": "abdulmajidia rimata",
    "intro": "Abdulmajidia rimata, commonly known as the silverleaf moonflower, is a rare flowering plant native to the high-altitude regions of the Andes. It is characterized by its striking silver-gray foliage and large, fragrant white flowers that bloom at night. The plant has a compact growth habit with thick, waxy leaves that help it retain moisture in arid conditions. Its flowers emit a subtle scent that attracts nocturnal pollinators such as moths. Due to its limited distribution and habitat specificity, Abdulmajidia rimata is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abdulmajidia rimata is primarily native to the tropical rainforests of Southeast Asia, particularly in regions of Indonesia and Malaysia. It thrives in humid, shaded environments with high biodiversity. The plant is commonly found in lowland and mountainous areas where the climate remains consistently warm and moist. Its distribution is limited to specific microhabitats within these forests, often growing on the forest floor or on the trunks of large trees. Due to habitat loss, its native range has become increasingly restricted in recent decades.",
    "distribution_introduced_art_desc": "Abdulmajidia rimata was mainly introduced to new environments through human activity, such as accidental transport via trade or travel. It has established itself in regions with similar climatic conditions to its native habitat. The plant's introduction has led to concerns about its potential impact on local ecosystems. It is currently found in several areas outside its original range. Further study is needed to fully understand its ecological effects."
}
