{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abdulmajidia maxwelliana",
    "plant_slug": "abdulmajidia-maxwelliana",
    "plant_name_scientific": "abdulmajidia maxwelliana",
    "intro": "Abdulmajidia maxwelliana, commonly known as the Maxwell's abdulmajidia, is a rare flowering plant native to the mountainous regions of Southeast Asia. It belongs to the family Rubiaceae and is characterized by its small, clustered flowers that range in color from white to pale pink. The plant typically grows in shaded, humid environments and has lance-shaped leaves with a slightly hairy surface. It is known for its ornamental value and is often cultivated in botanical gardens for its unique appearance. Due to habitat loss, it is considered endangered and requires conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abdulmajidia maxwelliana is primarily native to the highland regions of eastern Africa, specifically within the countries of Kenya and Tanzania. It is commonly found in the montane grasslands and woodlands of these areas. This species thrives in cool, moist climates at elevations ranging from 1,500 to 3,000 meters above sea level. It is often associated with rocky outcrops and well-drained soils. Due to its limited distribution, it is considered a rare and endemic plant in its native habitat.",
    "distribution_introduced_art_desc": "Abdulmajidia maxwelliana was mainly introduced to new habitats in tropical and subtropical regions due to its ornamental value and adaptability. It has been widely cultivated in gardens and greenhouses across Southeast Asia, the Caribbean, and parts of Africa. The plant's rapid growth and ability to thrive in diverse soil conditions have contributed to its spread beyond its native range. However, its introduction has raised concerns about potential invasiveness in certain ecosystems. Despite its aesthetic appeal, careful management is recommended to prevent unintended ecological impacts."
}
