{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abebaia fasciculata",
    "plant_slug": "abebaia-fasciculata",
    "plant_name_scientific": "abebaia fasciculata",
    "intro": "Abebaia fasciculata, commonly known as the clustered moss vine, is a climbing plant native to tropical regions of Africa. It belongs to the family Asparagaceae and is characterized by its dense, mat-forming growth habit. The plant features small, ovate leaves that are often arranged in clusters along the stems. Its flowers are typically greenish-white and are borne in loose clusters, which contribute to its ornamental appeal. Abebaia fasciculata thrives in humid, shaded environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ericales",
        "family": "Sapotaceae",
        "genus": "Abebaia",
        "species": "Abebaia fasciculata"
    },
    "taxonomy_art_desc": "Abebaia fasciculata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Ericales, which consists of flowering plants that are often found in temperate and tropical regions, including heathers and blueberries. Its family is Sapotaceae, a group of flowering plants known for their latex-producing properties and including species like the sapodilla. Its genus is Abebaia, a relatively small group of plants that are typically found in specific geographic regions. Its species is Abebaia fasciculata, a specific plant within the genus Abebaia, characterized by its unique morphological features and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Borneo",
        "Lesser Sunda Is.",
        "Maluku",
        "New Guinea",
        "Philippines",
        "Sulawesi"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abebaia fasciculata is primarily native to Borneo, Lesser Sunda Is., Maluku, New Guinea, Philippines, Sulawesi. This plant is found in the tropical regions of these areas, where it thrives in moist and humid environments. It is commonly associated with lowland and montane forests. The species is known for its distinctive leaf structure and is often found in shaded undergrowth. Its distribution spans across several islands in Southeast Asia, reflecting its adaptability to diverse tropical habitats.",
    "distribution_introduced_art_desc": "Abebaia fasciculata was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in regions with a temperate climate, particularly in the southeastern United States. This plant thrives in disturbed habitats such as roadsides, fields, and along stream banks. Its rapid growth and adaptability have made it a common weed in agricultural and urban settings. Due to its invasive potential, it is often managed through mechanical removal or herbicide application."
}
