{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelicea hirta",
    "plant_slug": "abelicea-hirta",
    "plant_name_scientific": "abelicea hirta",
    "intro": "Abelicea hirta, commonly known as the hairy abelicea, is a flowering plant native to the Canary Islands. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant features hairy leaves and stems, which help it retain moisture in its arid habitat. It produces small yellow flowers that attract pollinators such as bees and butterflies. Abelicea hirta is adapted to coastal environments and is often found growing on rocky soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelicea hirta is primarily native to the Canary Islands, specifically Tenerife, Gran Canaria, and La Gomera. It is commonly found in coastal areas and rocky habitats, often growing on cliffs or among scrub vegetation. The plant thrives in the unique microclimates of these islands, characterized by mild temperatures and seasonal rainfall. It is an important component of the local flora and is adapted to the specific environmental conditions of the Canary archipelago. Due to its restricted distribution, it is considered a regional endemic species.",
    "distribution_introduced_art_desc": "Abelicea hirta was mainly introduced to the coastal regions of southern Europe, particularly in countries like Portugal and Spain. It thrives in sandy and gravelly soils along the shoreline, where it forms dense mats that stabilize the dune ecosystem. This plant is often found in disturbed habitats, such as beach dunes and coastal roadsides, due to its ability to tolerate salt spray and strong winds. Its introduction has been linked to human activity, including the accidental transport of seeds through maritime traffic. However, its spread is limited by its preference for specific microhabitats and its relatively low reproductive capacity."
}
