{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus vanoverberghii",
    "plant_slug": "abelmoschus-vanoverberghii",
    "plant_name_scientific": "abelmoschus vanoverberghii",
    "intro": "Abelmoschus vanoverberghii, commonly known as the African okra, is a flowering plant native to Africa and belongs to the Malvaceae family. It is characterized by its hairy, ridged stems and large, heart-shaped leaves that are typically green and lobed. The plant produces capsule fruits that contain numerous edible seeds, similar to other members of the okra genus. Its flowers are usually yellow with five petals and are borne in clusters along the stems. Abelmoschus vanoverberghii is valued for its ornamental qualities and its seeds, which are used in traditional cuisine and medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus vanoverberghii is primarily native to tropical and subtropical regions of Africa, including countries such as Sudan, Ethiopia, and Kenya. It is also found in parts of southern Arabia and the island of Socotra. This plant thrives in arid and semi-arid environments, often growing in rocky or sandy soils. It is commonly associated with dry savannas and shrublands. Its native range reflects its adaptation to harsh climatic conditions typical of the African continent.",
    "distribution_introduced_art_desc": "Abelmoschus vanoverberghii was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive flowers. It was also introduced to parts of Africa and Southeast Asia for its ornamental value and potential medicinal uses. The plant has been reported in several countries, including Argentina, Colombia, and Peru, where it has established populations in disturbed habitats. Despite its introduction, it is not considered invasive in most regions, though it has the potential to spread in suitable environments. Its distribution is primarily limited to areas with warm climates and well-drained soils."
}
