{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia mairei",
    "plant_slug": "abelia-mairei",
    "plant_name_scientific": "abelia mairei",
    "intro": "Abelia mairei, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features showy, tubular flowers that range from white to pink, often with a red throat, blooming in late spring to early summer. The plant has opposite, ovate leaves that are usually dark green and have a slightly rough texture. It thrives in partial shade to full sun and prefers well-drained, acidic soil. Abelia mairei is valued for its ornamental appeal and ability to attract pollinators like bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia mairei is primarily native to China, specifically the provinces of Yunnan and Sichuan. It thrives in mountainous regions with a temperate climate and is often found in forests and shrublands. This plant is well adapted to the humid and cool conditions of these areas. It is also occasionally found in neighboring regions such as Vietnam. Abelia mairei is valued for its ornamental qualities and is sometimes cultivated in gardens outside its native range.",
    "distribution_introduced_art_desc": "Abelia mairei was mainly introduced to North America as an ornamental plant due to its attractive foliage and showy flowers. It was first brought to the United States in the late 19th century by botanists and horticulturalists interested in exotic plant species. The plant thrives in USDA hardiness zones 6 through 9, making it suitable for a wide range of climates across the continent. It has since become naturalized in some regions, particularly in the eastern and southern United States. Despite its ornamental value, it is considered invasive in certain areas where it outcompetes native vegetation."
}
