{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus betulifolius",
    "plant_slug": "abelmoschus-betulifolius",
    "plant_name_scientific": "abelmoschus betulifolius",
    "intro": "Abelmoschus betulifolius, commonly known as the maple-leaf okra, is a flowering plant native to Africa and parts of Asia. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant is characterized by its heart-shaped leaves that resemble maple leaves, hence its common name. It produces capsule fruits that contain numerous seeds, and the flowers are typically yellow with five petals. The plant is often grown for its edible seeds and has some traditional medicinal uses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus betulifolius is primarily native to tropical and subtropical regions of Africa, including countries such as Nigeria, Ghana, and Sudan. It is also found in parts of southern Asia, particularly in India and Sri Lanka. This plant thrives in warm climates with well-drained soils and is commonly found in open woodlands and along riverbanks. It is often cultivated for its edible seeds and ornamental value. Its native distribution reflects its adaptability to diverse environmental conditions across these regions.",
    "distribution_introduced_art_desc": "Abelmoschus betulifolius was mainly introduced to new regions for its ornamental value and potential as a medicinal plant. It is commonly found in tropical and subtropical areas, including parts of Africa, Southeast Asia, and the Pacific Islands. The plant thrives in warm climates with well-drained soil and requires full sun for optimal growth. Its distinctive leaf shape and showy flowers make it a popular choice for gardeners and landscapers. However, it is important to monitor its spread to prevent it from becoming invasive in non-native environments."
}
