{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus verrucosus",
    "plant_slug": "abelmoschus-verrucosus",
    "plant_name_scientific": "abelmoschus verrucosus",
    "intro": "Abelmoschus verrucosus, commonly known as the rough hibiscus, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other hibiscus species and cotton. The plant is characterized by its hairy, rough-textured leaves and showy, trumpet-shaped flowers that range in color from yellow to red. It thrives in well-drained soil and requires full sun to partial shade for optimal growth. The plant is often cultivated for ornamental purposes due to its vibrant blooms and unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus verrucosus is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Indonesia. It thrives in warm climates with well-drained soils and is commonly found in open habitats like fields and wastelands. This species is also present in parts of Africa and the Middle East, where it has been introduced or occurs naturally. It is often associated with disturbed areas and can be found growing along roadsides and in agricultural fields. The plant is known for its distinctive spiny fruits and is sometimes cultivated for its seeds or medicinal properties.",
    "distribution_introduced_art_desc": "Abelmoschus verrucosus was mainly introduced to new regions for its potential agricultural use and ornamental value. It is commonly found in tropical and subtropical areas where it thrives in warm climates with well-drained soil. The plant is often cultivated for its edible seeds, which are used in cooking and traditional medicine. Its introduction has also been linked to ornamental horticulture due to its attractive foliage and flowers. However, in some regions, it has become an invasive species, posing challenges to local ecosystems."
}
