{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata f. colorata",
    "plant_slug": "abelia-spathulata-f-colorata",
    "plant_name_scientific": "abelia spathulata f. colorata",
    "intro": "Abelia spathulata f. colorata, commonly known as the variegated spathulata abelia, is a compact, evergreen shrub native to eastern Asia. It features attractive, narrow, lance-shaped leaves with striking white and green variegation. The plant produces clusters of fragrant, bell-shaped flowers in shades of white, pink, and red during the summer months. It is well-suited for container gardening or as a border plant due to its compact size and ornamental foliage. This cultivar thrives in partial shade to full sun and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata f. colorata is primarily native to the southeastern United States, specifically the coastal regions of South Carolina and Georgia. This cultivar is a variant of Abelia spathulata, which is commonly found in moist, acidic soils along the Atlantic and Gulf coasts. It thrives in partial to full sun and is often seen in natural woodlands and wetland areas. The plant is known for its showy, tubular flowers that bloom in late spring to early summer. Its ornamental value has made it a popular choice for gardens in its native range.",
    "distribution_introduced_art_desc": "Abelia spathulata f. colorata was mainly introduced to enhance ornamental value in gardens and landscapes due to its striking variegated foliage. It is commonly found in regions with temperate climates where it thrives in partial shade to full sun. This cultivar is valued for its compact growth habit and long blooming period, making it a popular choice for borders and containers. However, it requires well-drained soil and regular watering to maintain its health and vigor. Its introduction has expanded the range of Abelia species available for horticultural use in diverse garden settings."
}
