{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia longituba",
    "plant_slug": "abelia-longituba",
    "plant_name_scientific": "abelia longituba",
    "intro": "Abelia longituba, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features slender, arching stems and small, fragrant white flowers that bloom in late summer. The leaves are opposite, ovate, and have a smooth texture with a slightly hairy underside. It thrives in partial shade to full sun and prefers well-drained soil. This plant is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia longituba is primarily native to eastern North America, including the United States and Canada. It is commonly found in the southeastern United States, particularly in states such as Alabama, Georgia, Florida, and South Carolina. This plant thrives in moist, well-drained soils and is often found in woodland edges, thickets, and along stream banks. It is also present in parts of eastern Canada, including Ontario and Quebec. Abelia longituba is well adapted to the temperate climate of its native range and is a valuable addition to native plant gardens.",
    "distribution_introduced_art_desc": "Abelia longituba was mainly introduced to ornamental horticulture due to its attractive, fragrant flowers and compact growth habit. It is commonly used in gardens and landscapes for its aesthetic value and ability to thrive in a variety of soil conditions. The plant is native to China but has been widely cultivated in other regions for its ornamental qualities. It is often found in USDA hardiness zones 5 through 9, making it adaptable to many climates. However, it is important to note that it may spread aggressively in certain environments, requiring careful management."
}
