{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia grandifolia",
    "plant_slug": "abelia-grandifolia",
    "plant_name_scientific": "abelia grandifolia",
    "intro": "Abelia grandifolia, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features narrow, lance-shaped leaves that are usually dark green and slightly hairy. The plant produces clusters of fragrant, white to pinkish flowers in the summer, which attract pollinators like bees and butterflies. It thrives in partial shade to full sun and prefers well-drained soil. Abelia grandifolia is valued for its ornamental appeal and hardy nature in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia grandifolia is primarily native to the southeastern United States, including states such as Alabama, Georgia, Florida, South Carolina, and North Carolina. It thrives in moist, well-drained soils and is commonly found in woodland edges, swamps, and along stream banks. This plant is well adapted to humid climates and partial to full sunlight. It is often seen in the understory of forests and can tolerate a variety of soil types. Abelia grandifolia is a popular ornamental plant due to its attractive foliage and showy flowers.",
    "distribution_introduced_art_desc": "Abelia grandifolia was mainly introduced to the eastern United States as an ornamental plant due to its attractive foliage and showy flowers. It is commonly found in gardens and landscaped areas, particularly in regions with mild winters and well-drained soil. The plant thrives in partial shade to full sun and is known for its ability to tolerate a variety of soil conditions. However, it has also become naturalized in some areas, raising concerns about its potential impact on native plant communities. Its introduction has led to increased interest in its horticultural value and ecological implications."
}
