{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus bammia",
    "plant_slug": "abelmoschus-bammia",
    "plant_name_scientific": "abelmoschus bammia",
    "intro": "Abelmoschus bammia, commonly known as the African okra or wild okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant produces capsule fruits that contain numerous seeds, which are often dispersed by wind. Its leaves are broad and heart-shaped, with a rough texture, and the flowers are typically yellow with five petals. Abelmoschus bammia is adapted to grow in poor soils and can thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus bammia is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Sudan. It is commonly found in areas with warm climates and well-drained soils. This plant thrives in open fields and along the edges of forests. It is also known to grow in regions of southern Asia, including parts of India and Malaysia. Its natural habitat includes both wild and cultivated environments.",
    "distribution_introduced_art_desc": "Abelmoschus bammia was mainly introduced to areas with warm climates and well-drained soils, particularly in tropical and subtropical regions. It is often cultivated in parts of Africa, Southeast Asia, and the Caribbean due to its adaptability to these environments. The plant is valued for its edible seeds and ornamental flowers, which contribute to its introduction and spread. It has been incorporated into local agriculture systems as a source of nutrition and income. However, its introduction has also raised concerns about potential ecological impacts in non-native regions."
}
