{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot var. megaspermus",
    "plant_slug": "abelmoschus-manihot-var-megaspermus",
    "plant_name_scientific": "abelmoschus manihot var. megaspermus",
    "intro": "Abelmoschus manihot var. megaspermus, commonly known as the giant African nightshade, is a variant of the okra plant native to Africa. It is characterized by its large, heart-shaped leaves and showy, violet flowers that bloom at night. The plant produces thick, fleshy pods that contain numerous seeds, which are often used in traditional medicine. It thrives in warm climates and is cultivated for both ornamental and medicinal purposes. Its botanical features make it distinct from other Abelmoschus species, particularly in its size and flowering habits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus manihot var. megaspermus is primarily native to tropical regions of Africa, particularly in countries such as Nigeria, Ghana, and the Democratic Republic of the Congo. This variant of the abelmoschus species is commonly found in humid, lowland areas with rich, well-drained soils. It thrives in warm climates with high rainfall, making it well-suited for cultivation in sub-Saharan Africa. The plant is often used for its starchy roots, which are a staple food in many local communities. Its native distribution reflects its adaptation to the ecological conditions of the African continent.",
    "distribution_introduced_art_desc": "Abelmoschus manihot var. megaspermus was mainly introduced to regions with tropical and subtropical climates due to its adaptability and nutritional value. It is commonly cultivated in parts of Africa, Southeast Asia, and the Caribbean for its starchy roots, which are used as a food source. The plant thrives in well-drained soils and requires a warm climate with adequate rainfall during the growing season. Its introduction has contributed to food security in areas where traditional crops may struggle. Additionally, it has been incorporated into agricultural systems as a potential alternative to cassava and other root crops."
}
