{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus moschatus subsp. quinquelobus",
    "plant_slug": "abelmoschus-moschatus-subsp-quinquelobus",
    "plant_name_scientific": "abelmoschus moschatus subsp. quinquelobus",
    "intro": "Abelmoschus moschatus subsp. quinquelobus, commonly known as the five-lobed okra, is a variant of the okra species native to tropical and subtropical regions. It is characterized by its distinctive five-lobed flowers and spiny, triangular pods that mature to a light green or yellowish color. The plant is an annual herb with a bushy growth habit, typically reaching heights of 1 to 2 meters. Its leaves are heart-shaped with serrated edges, and it thrives in warm climates with well-drained soil. The subspecies is valued for its edible pods, which are used in various culinary traditions around the world.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus moschatus subsp. quinquelobus is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Sudan. It thrives in warm climates with well-drained soils and is commonly found in open habitats like grasslands and riverine areas. This subspecies is also present in parts of southern Asia, including India and Sri Lanka, where it has been introduced for its ornamental and medicinal value. It is often cultivated for its large, showy flowers and has been used in traditional medicine for its purported health benefits. The plant's native range reflects its adaptation to diverse ecological conditions across the continent.",
    "distribution_introduced_art_desc": "Abelmoschus moschatus subsp. quinquelobus was mainly introduced to new regions for its ornamental value and potential agricultural use. It is often cultivated for its unique, lobed leaves and ability to thrive in warm climates. The plant has been spread through both intentional planting and accidental introduction via trade or landscaping activities. It is considered an invasive species in some areas due to its rapid growth and competitive nature. However, it also provides habitat and food for certain wildlife species."
}
