{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata f. flavescens",
    "plant_slug": "abelia-spathulata-f-flavescens",
    "plant_name_scientific": "abelia spathulata f. flavescens",
    "intro": "Abelia spathulata f. flavescens, commonly known as the golden abelia, is a compact, deciduous shrub native to China. It features narrow, elliptical leaves that are dark green on top and lighter underneath. The plant produces clusters of small, fragrant, white flowers that transition to a soft yellow hue as they age. It thrives in partial shade to full sun and prefers well-drained, moist soil. This cultivar is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata f. flavescens is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This plant thrives in wetland environments such as swamps, marshes, and along the edges of ponds. It is commonly found in areas with moist, acidic soils and partial to full sunlight. The subspecies is known for its yellowish flowers, which bloom in the summer months. Due to its limited range, it is considered a rare and endangered plant in its native habitat.",
    "distribution_introduced_art_desc": "Abelia spathulata f. flavescens was mainly introduced to the United States as an ornamental plant due to its attractive yellow flowers and compact growth habit. It is commonly found in gardens and landscaped areas, particularly in the eastern and southern regions of the country. This cultivar is often used in mixed borders, rock gardens, and as a specimen plant because of its hardiness and adaptability. However, it has also been reported to naturalize in some areas, raising concerns about its potential invasiveness. Despite its ornamental value, its ecological impact remains a topic of ongoing study."
}
