{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia serrata f. gymnocarpa",
    "plant_slug": "abelia-serrata-f-gymnocarpa",
    "plant_name_scientific": "abelia serrata f. gymnocarpa",
    "intro": "Abelia serrata f. gymnocarpa, commonly known as the smooth-seeded abelia, is a compact shrub characterized by its dense, upright growth habit. It features ovate to elliptic leaves that are typically glossy and dark green, with serrated edges. The plant produces clusters of fragrant, white to pale pink flowers in late summer, which are borne on short pedicels. Its fruit is a capsule that remains smooth and glabrous, distinguishing it from other forms of Abelia serrata. This cultivar is prized for its ornamental value and adaptability to a variety of garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia serrata f. gymnocarpa is primarily native to Southeast Asia, including countries such as China, Vietnam, and Thailand. This plant thrives in tropical and subtropical regions, often found in moist, shaded environments within forests. It is commonly associated with mountainous areas and is adapted to humid climates with well-drained soils. The variety gymnocarpa is distinguished by its smooth, hairless fruits, setting it apart from other forms of Abelia serrata. It plays an important ecological role in its native habitat, supporting local biodiversity.",
    "distribution_introduced_art_desc": "Abelia serrata f. gymnocarpa was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in regions with a temperate climate, such as parts of eastern Asia and North America. This plant is often cultivated for its ornamental value due to its attractive foliage and showy flowers. It has been introduced to gardens and landscapes as a hardy shrub that thrives in a variety of soil conditions. Its distribution has expanded due to its adaptability and aesthetic appeal in horticulture."
}
