{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia forrestii",
    "plant_slug": "abelia-forrestii",
    "plant_name_scientific": "abelia forrestii",
    "intro": "Abelia forrestii, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features slender, arching stems and produces clusters of fragrant, bell-shaped flowers in shades of white, pink, and red. The plant has heart-shaped leaves that are often covered in a fine, silvery down. It thrives in partial shade to full sun and prefers well-drained soil. Abelia forrestii is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia forrestii"
    },
    "taxonomy_art_desc": "Abelia forrestii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Dipsacales, which consists of flowering plants often with showy flowers and includes genera like Caprifoliaceae. Its family is Caprifoliaceae, commonly known as the honeysuckle family, characterized by opposite leaves and often fragrant flowers. Its genus is Abelia, a group of shrubs known for their attractive, tubular flowers and are typically found in temperate regions. Its species is Abelia forrestii, a specific type of shrub native to China, recognized for its ornamental value and unique floral structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia forrestii is primarily native to China South-Central. This plant is found in the mountainous regions of Sichuan and Hubei provinces. It thrives in humid, temperate climates with well-drained soil. Abelia forrestii is commonly found in forested areas and along stream banks. Its natural habitat includes subtropical and temperate forests in this region.",
    "distribution_introduced_art_desc": "Abelia forrestii was mainly introduced to North America as an ornamental plant due to its attractive foliage and showy flowers. It is commonly found in gardens and landscapes across the eastern United States. The plant thrives in partial shade to full sun and prefers well-drained soil. It is often used in shrub borders and as a specimen plant. However, it has also been reported as an invasive species in some regions, raising concerns about its ecological impact."
}
