{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia biflora var. minor",
    "plant_slug": "abelia-biflora-var-minor",
    "plant_name_scientific": "abelia biflora var. minor",
    "intro": "Abelia biflora var. minor, commonly known as the dwarf abelia, is a compact, deciduous shrub native to eastern North America. It features small, fragrant, tubular flowers that bloom in late spring to early summer, typically in shades of white and pink. The plant has dark green, oval-shaped leaves that provide attractive foliage throughout the growing season. It thrives in partial shade to full sun and prefers moist, well-drained soil. This variety is prized for its ornamental value and ability to attract pollinators like bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia biflora var. minor is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variety is typically found in wetlands, swamps, and along the edges of water bodies. It thrives in moist, acidic soils and is often associated with coastal and riverine habitats. The plant is well adapted to the humid climate and frequent flooding of its native range. It is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Abelia biflora var. minor was mainly introduced to the eastern and southeastern United States. It is commonly found in moist, well-drained soils in woodland areas and along stream banks. This variety is valued for its fragrant white flowers and attractive foliage. It has been used in ornamental horticulture due to its hardiness and aesthetic appeal. However, it is considered an invasive species in some regions, posing a threat to native plant communities."
}
