{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus × caillei",
    "plant_slug": "abelmoschus-×-caillei",
    "plant_name_scientific": "abelmoschus × caillei",
    "intro": "Abelmoschus × caillei, commonly known as the African okra, is a hybrid plant belonging to the Malvaceae family. It is characterized by its hairy, ridged stems and large, heart-shaped leaves. The plant produces showy, yellow flowers that are followed by capsule fruits containing numerous seeds. Native to tropical and subtropical regions, it thrives in warm climates with well-drained soil. Abelmoschus × caillei is cultivated not only for its ornamental value but also for its edible pods, which are used in various culinary traditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus × caillei"
    },
    "taxonomy_art_desc": "Abelmoschus × caillei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which consists of flowering plants that often have showy flowers and include plants like cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with capsule fruits and often hairy stems. Its genus is Abelmoschus, which includes species of flowering plants known for their edible fruits and ornamental value. Its species is Abelmoschus × caillei, a hybrid plant that results from the cross between different species within the genus Abelmoschus, often exhibiting characteristics from both parent plants.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus × caillei is primarily native to India. It is commonly found in the southern and eastern regions of the country. This plant thrives in tropical and subtropical climates, often growing in open fields and along roadsides. It is known for its distinctive yellow flowers and is sometimes cultivated for ornamental purposes. Its native range in India reflects its adaptation to the region's warm and humid conditions.",
    "distribution_introduced_art_desc": "Abelmoschus × caillei was mainly introduced to the Americas through human activity, particularly during the 19th and early 20th centuries. It was brought primarily for its ornamental value due to its striking yellow flowers and unique foliage. The plant has since become naturalized in several regions, including parts of the southern United States and tropical areas of the Caribbean. Its introduction has led to its establishment in both urban and rural environments. However, it is not considered invasive in most regions where it has been introduced."
}
