{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia verticillata",
    "plant_slug": "abelia-verticillata",
    "plant_name_scientific": "abelia verticillata",
    "intro": "Abelia verticillata, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features opposite, ovate leaves that are typically dark green and have a smooth texture. The plant produces clusters of fragrant, tubular flowers in shades of pink and white during the summer months. It thrives in partial shade to full sun and prefers well-drained soil. Abelia verticillata is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia verticillata is primarily native to eastern North America. It can be found in the United States, particularly in the southeastern region, including states such as Florida, Georgia, and South Carolina. This plant also extends into parts of southeastern Canada, including Ontario and Quebec. It thrives in moist, well-drained soils and is commonly found in woodlands, swamps, and along stream banks. Its native range includes areas with a temperate climate and high humidity.",
    "distribution_introduced_art_desc": "Abelia verticillata was mainly introduced to the Pacific Northwest region of the United States. It was brought there for its ornamental value, including its fragrant flowers and attractive foliage. The plant thrives in moist, well-drained soils and partial to full sun. It has become naturalized in some areas, leading to concerns about its potential impact on native plant communities. Despite its beauty, its spread requires careful management to prevent ecological disruption."
}
