{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus platydactylus",
    "plant_slug": "abelmoschus-platydactylus",
    "plant_name_scientific": "abelmoschus platydactylus",
    "intro": "Abelmoschus platydactylus, commonly known as the broad-fingered okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like hibiscus and cotton. The plant is characterized by its large, heart-shaped leaves and distinctive, spiny capsules that contain edible seeds. It thrives in warm climates with well-drained soil and requires ample sunlight for optimal growth. The flowers are typically yellow or white, adding ornamental value to the plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus platydactylus is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Indonesia. It thrives in warm climates with well-drained soils and is commonly found in open fields and along roadsides. This plant is often associated with humid environments and is adapted to seasonal rainfall patterns. It is also present in parts of Africa and the Pacific Islands. Its native range reflects its historical use in traditional medicine and as a source of fiber and seeds.",
    "distribution_introduced_art_desc": "Abelmoschus platydactylus was mainly introduced to areas with warm, humid climates where it can thrive in tropical and subtropical regions. It is commonly found in parts of Southeast Asia, Africa, and the Caribbean, where it has been cultivated for its edible fruits and ornamental value. The plant's introduction has been driven by agricultural interests and its adaptability to diverse soil types. However, it has also raised concerns about its potential to become an invasive species in some regions. Its distribution highlights the balance between ecological impact and agricultural benefits."
}
