{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus congener",
    "plant_slug": "abelmoschus-congener",
    "plant_name_scientific": "abelmoschus congener",
    "intro": "Abelmoschus congener, commonly known as the African okra, is a flowering plant in the Malvaceae family. It is native to tropical and subtropical regions of Africa and thrives in warm climates with well-drained soil. The plant features showy yellow flowers and capsule fruits that contain edible seeds. Its leaves are lobed and often have a hairy texture, while its stems are erect and branching. Abelmoschus congener is cultivated for its ornamental value and as a source of seeds used in traditional cuisines.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus congener is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Southeast Asia. It thrives in warm climates with well-drained soil and ample sunlight. This plant is commonly found in areas with a monsoonal climate, where it can grow as an annual or perennial herb. It is often cultivated for its edible seeds and ornamental value. Its natural range extends into parts of Africa and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abelmoschus congener was mainly introduced to new habitats through human activities such as trade and gardening. It has been found in regions with warm climates and well-drained soils, often thriving in disturbed areas. This plant's introduction has led to its establishment in several parts of the world, including parts of Asia, Africa, and the Americas. Its rapid growth and adaptability have made it a potential invasive species in some areas. However, its impact on native ecosystems is still being studied."
}
