{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus angulosus var. purpureus",
    "plant_slug": "abelmoschus-angulosus-var-purpureus",
    "plant_name_scientific": "abelmoschus angulosus var. purpureus",
    "intro": "Abelmoschus angulosus var. purpureus, commonly known as purple okra, is a variant of the okra plant characterized by its distinctive purple foliage and fruit. It belongs to the Malvaceae family and is native to tropical and subtropical regions. The plant produces capsule fruits that contain edible seeds, similar to other okra varieties. It thrives in warm climates and requires well-drained soil for optimal growth. Its ornamental value, combined with its culinary uses, makes it a versatile plant in both gardens and agriculture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus angulosus var. purpureus is primarily native to southern and eastern Asia, including regions such as India, China, and parts of Southeast Asia. It is commonly found in tropical and subtropical climates, often growing in open fields, along roadsides, and in disturbed habitats. This plant is well adapted to warm, humid environments and is often considered a weed in agricultural areas. It thrives in well-drained soils and can tolerate a range of soil types. Its native range extends to parts of Africa and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abelmoschus angulosus var. purpureus was mainly introduced to areas with warm, humid climates where it can thrive in well-drained soils. It is commonly found in regions of Southeast Asia, including parts of India, Indonesia, and the Philippines. This plant is often cultivated for its ornamental value due to its striking purple flowers and unique foliage. It has also been introduced to other tropical and subtropical regions as a decorative plant. However, its spread is limited by its specific environmental requirements and lack of widespread commercial cultivation."
}
