{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia gracilenta",
    "plant_slug": "abelia-gracilenta",
    "plant_name_scientific": "abelia gracilenta",
    "intro": "Abelia gracilenta, commonly known as the slender abelia, is a deciduous shrub native to the southeastern United States. It features slender, arching stems and small, fragrant, white to pinkish flowers that bloom in late spring to early summer. The plant has opposite, ovate leaves that are often covered in fine, silky hairs. It thrives in partial shade to full sun and prefers well-drained, acidic soil. Abelia gracilenta is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia gracilenta is primarily native to the southeastern United States, specifically found in states such as Alabama, Georgia, Florida, and South Carolina. It thrives in moist, well-drained soils and is commonly found in woodland edges, thickets, and along stream banks. This plant is adapted to humid climates and is often associated with wetland habitats. It is known for its fragrant, white to pinkish flowers that bloom in the summer. Abelia gracilenta is an important part of the native flora in these regions, supporting local wildlife and contributing to biodiversity.",
    "distribution_introduced_art_desc": "Abelia gracilenta was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils along stream banks and in shaded woodland areas. This plant is valued for its fragrant, tubular flowers and its ability to thrive in partial shade. It has become a popular ornamental plant in garden settings due to its attractive appearance and hardiness. However, it is important to manage its spread to prevent it from becoming invasive in natural habitats."
}
