{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia macrotera var. henanensis",
    "plant_slug": "abelia-macrotera-var-henanensis",
    "plant_name_scientific": "abelia macrotera var. henanensis",
    "intro": "Abelia macrotera var. henanensis, commonly known as the Henan abelia, is a deciduous shrub native to China. It features showy, tubular flowers that range in color from white to pink, typically blooming in late summer. The plant has lance-shaped leaves that are glossy and dark green, providing a striking contrast to its floral display. It thrives in well-drained soil and partial to full sun, making it a hardy addition to gardens. This variety is valued for its ornamental appeal and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia macrotera"
    },
    "taxonomy_art_desc": "Abelia macrotera var. henanensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for having vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Dipsacales, which includes flowering plants such as honeysuckles and is known for its diverse floral morphology. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which consists of shrubs and vines with showy flowers. Its genus is Abelia, a group of flowering shrubs known for their ornamental value and showy, fragrant flowers. Its species is Abelia macrotera, a specific type of abelia known for its large, showy flowers and is a variant found in Henan, China.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia macrotera var. henanensis is primarily native to China Southeast. This variant of Abelia macrotera is found in the southern regions of China, particularly in the provinces of Guangdong, Guangxi, and Fujian. It thrives in humid, subtropical climates with well-drained soils. The plant is commonly found in forest understories and along riverbanks. Its native distribution is limited to these specific geographic areas within China.",
    "distribution_introduced_art_desc": "Abelia macrotera var. henanensis was mainly introduced to the United States as an ornamental plant due to its attractive foliage and flowers. It is commonly found in gardens and landscapes in regions with mild climates, such as California and the Pacific Northwest. This variety is valued for its compact growth habit and ability to thrive in partial shade. It has been cultivated for its aesthetic appeal and is often used in mixed borders or as a specimen plant. However, it is important to note that it may spread aggressively in certain conditions, requiring careful management."
}
