{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelicea ulmoides",
    "plant_slug": "abelicea-ulmoides",
    "plant_name_scientific": "abelicea ulmoides",
    "intro": "Abelicea ulmoides, commonly known as the slender abelicea, is a flowering plant native to parts of South America. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its slender, erect stems and small, woolly leaves. Its flowers are typically pale yellow to greenish-white, with five petals and a prominent central stamen. Abelicea ulmoides is often found in dry, open habitats and is adapted to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelicea ulmoides is primarily native to the Mediterranean Basin, including regions such as southern Europe, North Africa, and western Asia. It is commonly found in coastal areas, particularly on rocky shores and cliffs. This plant thrives in saline and well-drained soils, often growing in association with other halophytic species. It is also present in parts of the Canary Islands and the Balearic Islands. Its distribution is largely confined to the western Mediterranean, where it plays a role in stabilizing coastal ecosystems.",
    "distribution_introduced_art_desc": "Abelicea ulmoides was mainly introduced to coastal areas with sandy soils and moderate salinity. It thrives in environments where it can establish dense stands, often outcompeting native vegetation. This plant has been reported in several regions along the Atlantic coast, including parts of Europe and North America. Its introduction is likely due to human activities such as coastal development and the unintentional transport of seeds through maritime traffic. However, its ecological impact remains under study, as it may alter local ecosystems by changing soil composition and reducing biodiversity."
}
