{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia fargesii",
    "plant_slug": "abelia-fargesii",
    "plant_name_scientific": "abelia fargesii",
    "intro": "Abelia fargesii, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features slender, arching branches and produces clusters of fragrant, tubular flowers in shades of pink and white. The plant has opposite, ovate leaves that are often adorned with a silvery underside. It thrives in partial shade to full sun and prefers well-drained soil. Abelia fargesii is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia fargesii is primarily native to the mountainous regions of western China, particularly in the provinces of Sichuan, Gansu, and Yunnan. It thrives in temperate climates with cool, moist conditions and is commonly found in forested areas and along stream banks. This plant is adapted to high-altitude environments, often growing at elevations between 1,500 and 3,000 meters. It is well-suited to partial shade and well-drained soil, making it a hardy species in its native habitat. Abelia fargesii is valued for its ornamental value and is sometimes cultivated in gardens outside its native range.",
    "distribution_introduced_art_desc": "Abelia fargesii was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils along stream banks and in woodland areas. This plant is valued for its showy clusters of fragrant, white to pink flowers that bloom in late spring to early summer. It thrives in partial to full shade and is often used in native plant gardens and restoration projects. Due to its ornamental value and ecological benefits, it has become a popular choice for landscaping in temperate climates."
}
