{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia microphylla",
    "plant_slug": "abelia-microphylla",
    "plant_name_scientific": "abelia microphylla",
    "intro": "Abelia microphylla, commonly known as the dwarf abelia, is a compact evergreen shrub native to China. It features small, elliptical leaves that are dark green on top and lighter underneath. The plant produces clusters of fragrant, white to pinkish flowers in the summer months. It thrives in partial shade to full sun and well-drained soil. Abelia microphylla is prized for its ornamental value and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia microphylla is primarily native to eastern North America, specifically the southeastern United States. It is found in states such as Florida, Georgia, South Carolina, and Alabama. This plant typically grows in moist, well-drained soils in woodland areas or along stream banks. It thrives in partial to full shade and is commonly found in the Coastal Plain and Piedmont regions. Abelia microphylla is well adapted to the humid climate and is often used in native plant gardens.",
    "distribution_introduced_art_desc": "Abelia microphylla was mainly introduced to the United States as an ornamental plant due to its attractive appearance and adaptability to various climates. It is commonly found in gardens and landscapes across the eastern and southern regions of the country. The plant thrives in well-drained soil and partial to full sunlight, making it a popular choice for homeowners and landscapers. Its small, fragrant flowers and compact growth habit contribute to its widespread use in cultivated settings. However, it is important to note that it can sometimes become invasive in certain areas if not properly managed."
}
