{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia tetrasepala",
    "plant_slug": "abelia-tetrasepala",
    "plant_name_scientific": "abelia tetrasepala",
    "intro": "Abelia tetrasepala, commonly known as the four-parted abelia, is a deciduous shrub native to eastern Asia. It features fragrant, tubular flowers that are typically pink or white, arranged in clusters at the ends of its branches. The plant has opposite, simple, ovate leaves that are usually dark green and slightly pubescent. It thrives in partial shade to full sun and prefers well-drained, moist soil. Abelia tetrasepala is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia tetrasepala is primarily native to eastern North America, specifically the southeastern United States. It is found in states such as Georgia, South Carolina, North Carolina, and Tennessee. This plant typically grows in moist, well-drained soils along stream banks, in woodland edges, and in shaded to partially sunny areas. It is commonly associated with the Appalachian region and is often found in mixed hardwood forests. Abelia tetrasepala is known for its showy, fragrant flowers that bloom in late spring to early summer.",
    "distribution_introduced_art_desc": "Abelia tetrasepala was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in woodland and streamside habitats. This plant is often cultivated in gardens for its fragrant flowers and ornamental value. It has been reported to spread along riverbanks and in disturbed areas. However, it is considered non-invasive in its introduced range."
}
