{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus esculentus",
    "plant_slug": "abelmoschus-esculentus",
    "plant_name_scientific": "abelmoschus esculentus",
    "intro": "Abelmoschus esculentus, commonly known as okra, is a flowering plant in the mallow family. It is native to Africa and thrives in warm, tropical climates. The plant produces capsule fruits that contain fibrous, mucilaginous seeds, which are often used in cooking. Its leaves are broad and heart-shaped, and the stems are hairy and erect. Okra is valued for its nutritional content and is commonly grown as a vegetable in many parts of the world.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus esculentus"
    },
    "taxonomy_art_desc": "Abelmoschus esculentus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which consists of vascular plants with a long evolutionary history, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which comprises flowering plants known for their showy flowers and often hairy leaves, including cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often used in agriculture and horticulture. Its genus is Abelmoschus, a group of flowering plants that includes several species, many of which are cultivated for their edible parts. Its species is Abelmoschus esculentus, commonly known as okra, a tropical vegetable valued for its nutritional content and culinary uses.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bangladesh",
        "India",
        "West Himalaya"
    ],
    "distribution_introduced": [
        "Alabama",
        "Albania",
        "Andaman Is.",
        "Angola",
        "Assam",
        "Bahamas",
        "Benin",
        "Borneo",
        "Bulgaria",
        "Burkina",
        "Cambodia",
        "Cape Verde",
        "Caroline Is.",
        "Cayman Is.",
        "Central African Republic",
        "Chad",
        "China South-Central",
        "China Southeast",
        "Comoros",
        "Congo",
        "Cuba",
        "Dominican Republic",
        "DR Congo",
        "East Himalaya",
        "Eritrea",
        "Fiji",
        "Florida",
        "Gabon",
        "Gambia",
        "Georgia",
        "Greece",
        "Guinea-Bissau",
        "Gulf of Guinea Is.",
        "Hainan",
        "Haiti",
        "Illinois",
        "Ivory Coast",
        "Jamaica",
        "Jawa",
        "Krym",
        "KwaZulu-Natal",
        "Laos",
        "Leeward Is.",
        "Louisiana",
        "Malaya",
        "Mali",
        "Marianas",
        "Marshall Is.",
        "Maryland",
        "Mauritania",
        "Mexico Southwest",
        "Mississippi",
        "Mozambique",
        "Myanmar",
        "Nicobar Is.",
        "Niger",
        "Nigeria",
        "North Carolina",
        "Northern Provinces",
        "Oman",
        "Pakistan",
        "Peru",
        "Philippines",
        "Puerto Rico",
        "Romania",
        "Senegal",
        "Sierra Leone",
        "South Carolina",
        "South European Russia",
        "Southwest Caribbean",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Tanzania",
        "Thailand",
        "Togo",
        "Uganda",
        "Ukraine",
        "Venezuela",
        "Venezuelan Antilles",
        "Vietnam",
        "Virginia",
        "Windward Is.",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Abelmoschus esculentus is primarily native to Bangladesh, India, and the West Himalaya. This plant is commonly known as okra and has been cultivated for centuries in these regions. It thrives in warm climates and is well adapted to the tropical and subtropical conditions found in its native range. The plant is widely used in traditional cuisines and has significant agricultural importance in South Asia. Its native distribution highlights its deep cultural and ecological roots in these areas.",
    "distribution_introduced_art_desc": "Abelmoschus esculentus was mainly introduced to a wide range of regions across Africa, Asia, and the Americas, including Alabama, Albania, Andaman Is., Angola, Assam, Bahamas, Benin, Borneo, Bulgaria, Burkina, Cambodia, Cape Verde, Caroline Is., Cayman Is., Central African Republic, Chad, China South-Central, China Southeast, Comoros, Congo, Cuba, Dominican Republic, DR Congo, East Himalaya, Eritrea, Fiji, Florida, Gabon, Gambia, Georgia, Greece, Guinea-Bissau, Gulf of Guinea Is., Hainan, Haiti, Illinois, Ivory Coast, Jamaica, Jawa, Krym, KwaZulu-Natal, Laos, Leeward Is., Louisiana, Malaya, Mali, Marianas, Marshall Is., Maryland, Mauritania, Mexico Southwest, Mississippi, Mozambique, Myanmar, Nicobar Is., Niger, Nigeria, North Carolina, Northern Provinces, Oman, Pakistan, Peru, Philippines, Puerto Rico, Romania, Senegal, Sierra Leone, South Carolina, South European Russia, Southwest Caribbean, Sri Lanka, Sudan-South Sudan, Tanzania, Thailand, Togo, Uganda, Ukraine, Venezuela, Venezuelan Antilles, Vietnam, Virginia, Windward Is., Zambia, and Zimbabwe. This plant has been widely cultivated for its edible seeds and nutritional value, making it an important crop in many of these regions. It thrives in tropical and subtropical climates, contributing to food security and agricultural diversity. The introduction of Abelmoschus esculentus has been facilitated by trade, migration, and agricultural exchange. Its presence in so many diverse locations highlights its adaptability and significance in global agriculture."
}
