{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus moschatus var. multiformis",
    "plant_slug": "abelmoschus-moschatus-var-multiformis",
    "plant_name_scientific": "abelmoschus moschatus var. multiformis",
    "intro": "Abelmoschus moschatus var. multiformis, commonly known as the Chinese okra or long cowpea, is a herbaceous annual plant native to Southeast Asia. It belongs to the Malvaceae family and is characterized by its upright stems, lobed leaves, and capsule fruits that contain numerous seeds. The plant typically grows to a height of 1 to 2 meters and thrives in warm, humid climates. Its flowers are yellow with prominent red stamens, and it is cultivated for its edible pods, which are used in various cuisines. The plant also has ornamental value due to its attractive foliage and flowering habits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus moschatus var. multiformis is primarily native to tropical and subtropical regions of Asia, including India, China, and parts of Southeast Asia. It thrives in warm climates with well-drained soil and is commonly found in areas with a monsoonal rainfall pattern. This variant is often associated with wild or semi-wild habitats, such as grasslands, forest edges, and disturbed soils. It is also known to occur in parts of Africa and the Middle East, though its distribution is less well-documented in these regions. The plant is valued for its seeds, which are used in traditional medicine and as a source of oil.",
    "distribution_introduced_art_desc": "Abelmoschus moschatus var. multiformis was mainly introduced to new agricultural regions for its potential as a drought-resistant crop. It was brought to these areas to diversify local farming systems and improve food security. The plant's introduction aimed to provide a reliable source of vegetable protein and fiber. Its adaptability to various soil types made it a valuable addition to many ecosystems. However, its spread has raised concerns about its impact on native plant species."
}
