{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelicea keaki",
    "plant_slug": "abelicea-keaki",
    "plant_name_scientific": "abelicea keaki",
    "intro": "Abelicea keaki, commonly known as the Hawaiian mountain apple tree, is a member of the Rosaceae family. It is native to the Hawaiian Islands and is characterized by its broad, elliptical leaves and showy white flowers. The plant produces small, fleshy fruits that are edible and have a sweet, tangy flavor. Abelicea keaki thrives in moist, shaded environments and is often found in montane rainforests. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelicea keaki is primarily native to the tropical regions of Southeast Asia, particularly in countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, lowland forests where it receives ample sunlight and consistent rainfall. This plant is commonly found in coastal areas and riverine habitats, where the soil is rich in nutrients. It plays an important ecological role in supporting local biodiversity. However, its natural range has been reduced due to habitat loss and deforestation.",
    "distribution_introduced_art_desc": "Abelicea keaki was mainly introduced to areas with warm, humid climates and well-drained soil, often found in coastal regions. It thrives in environments with moderate sunlight and consistent moisture. The plant has been observed spreading rapidly in disturbed habitats such as roadsides and abandoned fields. Its introduction has raised concerns due to its potential to outcompete native species. Despite its ornamental value, careful management is necessary to prevent its invasive spread."
}
