{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus palustris",
    "plant_slug": "abelmoschus-palustris",
    "plant_name_scientific": "abelmoschus palustris",
    "intro": "Abelmoschus palustris, commonly known as marsh okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant features heart-shaped leaves and produces capsule fruits that contain edible seeds. It thrives in wetland environments and is often found near water bodies. Its botanical characteristics make it an important species in ecological and agricultural contexts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus palustris is primarily native to tropical and subtropical regions of Asia, including India, China, and Southeast Asia. It thrives in wetland and marshy environments, often found near rivers and coastal areas. This species is also present in parts of Africa and the Caribbean, where it adapts to similar moist habitats. Its natural range extends into the southern United States, particularly in Florida and along the Gulf Coast. The plant is commonly associated with aquatic or semi-aquatic ecosystems, where it plays a role in stabilizing soil and providing habitat for various organisms.",
    "distribution_introduced_art_desc": "Abelmoschus palustris was mainly introduced to wetland and marshy areas where it thrives in moist soil conditions. It is commonly found in regions with seasonal flooding, such as along riverbanks and in low-lying areas. This plant is often considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to ecological concerns in parts of the United States and other parts of the world. Despite its invasive nature, it is sometimes used for erosion control due to its dense root system."
}
