{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abeliophyllum distichum",
    "plant_slug": "abeliophyllum-distichum",
    "plant_name_scientific": "abeliophyllum distichum",
    "intro": "Abeliophyllum distichum, commonly known as the fragrant snowbell, is a deciduous shrub native to eastern Asia. It features opposite, lance-shaped leaves that are typically dark green and glossy. The plant produces small, bell-shaped flowers that are white or pale pink, often with a subtle fragrance. It thrives in well-drained soil and partial shade, making it suitable for woodland gardens. Its ornamental value comes from its delicate blooms and attractive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Lamiales",
        "family": "Oleaceae",
        "genus": "Abeliophyllum",
        "species": "Abeliophyllum distichum"
    },
    "taxonomy_art_desc": "Abeliophyllum distichum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Lamiales, a group of flowering plants that includes many aromatic plants such as lavender and olive trees. Its family is Oleaceae, commonly known as the olive family, which includes trees and shrubs with fragrant flowers. Its genus is Abeliophyllum, a group of flowering plants characterized by their showy, often fragrant flowers and woody stems. Its species is Abeliophyllum distichum, a specific type of plant within this genus known for its distinct leaf arrangement and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Korea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abeliophyllum distichum is primarily native to Korea. It is found in the southern and central regions of the country. This plant typically grows in forested areas and rocky slopes. It is a shrub that thrives in temperate climates. Its natural habitat includes mountainous regions with well-drained soil.",
    "distribution_introduced_art_desc": "Abeliophyllum distichum was mainly introduced to ornamental horticulture due to its attractive, fragrant white flowers and compact growth habit. It is commonly cultivated in gardens and landscapes for its aesthetic value. The plant is native to China and has been introduced to various regions with temperate climates. It thrives in well-drained soil and partial to full sunlight. However, it is considered an invasive species in some areas where it can outcompete native vegetation."
}
