{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus sagittifolius",
    "plant_slug": "abelmoschus-sagittifolius",
    "plant_name_scientific": "abelmoschus sagittifolius",
    "intro": "Abelmoschus sagittifolius, commonly known as the arrowleaf okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant is characterized by its heart-shaped leaves and edible, fibrous pods that are used in various cuisines. It thrives in warm climates and requires well-drained soil for optimal growth. The flowers are typically yellow or white, adding ornamental value to the plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus sagittifolius is primarily native to southern and eastern Africa, including countries such as South Africa, Zimbabwe, and Kenya. It is also found in parts of Madagascar and the Arabian Peninsula. This plant typically grows in tropical and subtropical regions, often in open woodlands or grasslands. It is well adapted to warm climates with distinct wet and dry seasons. Its natural range extends into some parts of Southeast Asia, though it is more commonly associated with African ecosystems.",
    "distribution_introduced_art_desc": "Abelmoschus sagittifolius was mainly introduced to regions with warm climates and well-drained soils, where it can thrive as an ornamental and potential medicinal plant. It is commonly found in parts of Asia, Africa, and the Caribbean, where it has been cultivated for its vibrant flowers and nutritional value. The plant's introduction has been driven by its aesthetic appeal and its use in traditional medicine for treating various ailments. Its distribution has expanded due to horticultural interest and the demand for drought-resistant crops. However, it is considered invasive in some areas, posing challenges to local ecosystems."
}
