{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia hersii",
    "plant_slug": "abelia-hersii",
    "plant_name_scientific": "abelia hersii",
    "intro": "Abelia hersii, commonly known as the dwarf abelia or mountain abelia, is a compact evergreen shrub native to the southeastern United States. It features small, fragrant white to pinkish flowers that bloom in late spring to early summer. The plant has glossy, dark green foliage that remains attractive throughout the growing season. It thrives in partial shade to full sun and prefers well-drained, acidic soil. Abelia hersii is often used in gardens for its ornamental value and adaptability to various landscape conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia hersii is primarily native to the southeastern United States, specifically ranging from Georgia to Florida. It is commonly found in the coastal plain regions of these states. This plant thrives in moist, well-drained soils and is often associated with wetlands, marshes, and along stream banks. Abelia hersii is also found in parts of Alabama and South Carolina. It is well adapted to the humid climate and is often seen in natural habitats throughout the southeastern U.S.",
    "distribution_introduced_art_desc": "Abelia hersii was mainly introduced to the southeastern United States, particularly in states like Florida and Georgia. It is commonly found in moist, well-drained soils in woodland or garden settings. This plant is often cultivated for its attractive foliage and showy flowers that bloom in the summer. It has been introduced to various regions beyond its native range for ornamental purposes. However, it is considered non-invasive in most areas where it is planted."
}
