{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata var. ionostachya",
    "plant_slug": "abelia-spathulata-var-ionostachya",
    "plant_name_scientific": "abelia spathulata var. ionostachya",
    "intro": "Abelia spathulata var. ionostachya, commonly known as the narrow-leaved abelia, is a deciduous shrub native to the eastern United States. It features lance-shaped leaves that are typically a deep green on top and lighter underneath. The plant produces clusters of fragrant, white to pale pink flowers in the summer, which attract pollinators such as bees and butterflies. It thrives in partial shade to full sun and prefers moist, well-drained soil. This variety is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata var. ionostachya is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variety is commonly found in wetland areas, swamps, and along the edges of ponds and lakes. It thrives in moist, acidic soils and is often associated with coastal and riverine habitats. The plant is well adapted to the humid climate and frequent flooding typical of its native range. It is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Abelia spathulata var. ionostachya was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in woodland and streamside habitats. This plant is valued for its attractive foliage and clusters of white to pale pink flowers that bloom in late summer. It has been used in landscaping for its ornamental qualities and ability to thrive in shaded conditions. However, it is considered an invasive species in some areas due to its rapid spread and competition with native plants."
}
