{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata var. macrophylla",
    "plant_slug": "abelia-spathulata-var-macrophylla",
    "plant_name_scientific": "abelia spathulata var. macrophylla",
    "intro": "Abelia spathulata var. macrophylla, commonly known as the broadleaf abelia, is a deciduous shrub native to the southeastern United States. It is characterized by its large, heart-shaped leaves that can grow up to 5 inches in length. The plant produces clusters of fragrant, white to pinkish flowers in the summer, which attract pollinators such as bees and butterflies. It thrives in partial to full sun and prefers well-drained, moist soil. This variety is noted for its ornamental value and adaptability to a variety of garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata var. macrophylla is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in wetlands, swamps, and along the edges of ponds and streams. This variety is known for its large, showy leaves and is often found in disturbed or moist habitats. It is commonly associated with the Coastal Plain and lower elevations in its native range. The plant is well adapted to humid, subtropical climates with high rainfall.",
    "distribution_introduced_art_desc": "Abelia spathulata var. macrophylla was mainly introduced to the eastern and southeastern United States. It is commonly found in moist, well-drained soils in woodland or shaded areas. This variety is known for its large, showy leaves and clusters of fragrant white flowers. It has been cultivated for its ornamental value in gardens and landscapes. However, it is considered invasive in some regions due to its rapid growth and ability to spread aggressively."
}
