{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia corymbosa",
    "plant_slug": "abelia-corymbosa",
    "plant_name_scientific": "abelia corymbosa",
    "intro": "Abelia corymbosa, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features glossy, ovate leaves that turn red in the fall, adding ornamental value to gardens. The plant produces clusters of fragrant, tubular flowers in shades of pink and white during late spring to early summer. It thrives in partial to full sun and well-drained soil, making it suitable for a variety of garden settings. Abelia corymbosa is also valued for its adaptability and resistance to pests and diseases.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Zabelia",
        "species": "Zabelia corymbosa"
    },
    "taxonomy_art_desc": "Abelia corymbosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises ferns and their relatives, known for their spore-based reproduction and often having vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with simple flower structures and diverse leaf forms. Its order is Dipsacales, a group of flowering plants that typically have opposite leaves and showy flowers, often found in temperate regions. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with often fragrant flowers and berries. Its genus is Zabelia, a small group of flowering plants native to Asia, characterized by their showy flowers and woody stems. Its species is Zabelia corymbosa, a specific plant within the genus Zabelia, known for its clusters of white or pink flowers and its ornamental value in gardens.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Kazakhstan",
        "Kirgizstan",
        "Tadzhikistan",
        "Uzbekistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia corymbosa is primarily native to Afghanistan, Kazakhstan, Kirgizstan, Tadzhikistan, and Uzbekistan. This plant is commonly found in the mountainous regions of these Central Asian countries. It thrives in temperate climates and is often associated with rocky or forested areas. Abelia corymbosa is well adapted to the local environmental conditions of its native range. It is a hardy shrub that plays an important role in the local flora.",
    "distribution_introduced_art_desc": "Abelia corymbosa was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in woodland and streamside habitats. This plant is often used in landscaping due to its ornamental value and adaptability. It has also been reported in parts of California and Oregon. However, it is considered non-invasive in its introduced range."
}
