{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot f. platydactylus",
    "plant_slug": "abelmoschus-manihot-f-platydactylus",
    "plant_name_scientific": "abelmoschus manihot f. platydactylus",
    "intro": "Abelmoschus manihot f. platydactylus, commonly known as the African arrowroot, is a variant of the okra plant native to tropical regions. It is characterized by its broad, heart-shaped leaves and cylindrical, green pods that contain edible seeds. The plant thrives in warm, humid climates and is often cultivated for its starchy roots, which are used as a food source. Its botanical features include a robust root system and a flowering structure that produces small yellow flowers. This variety is valued for its adaptability and nutritional content, making it an important crop in certain agricultural systems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus manihot f. platydactylus is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Sudan. It is also found in parts of southern Arabia and the Horn of Africa. This plant thrives in warm climates with well-drained soils and is commonly grown as a cash crop. It is widely distributed across sub-Saharan Africa and has been introduced to other tropical regions around the world. Its native range includes areas with a humid climate and adequate rainfall for its growth.",
    "distribution_introduced_art_desc": "Abelmoschus manihot f. platydactylus was mainly introduced to regions where its drought-resistant properties make it suitable for cultivation in arid and semi-arid environments. It has been introduced to parts of Africa, Asia, and Latin America as a potential crop for food security and soil improvement. This distribution is driven by its ability to thrive in poor soils and its potential as a source of nutrition and income for local communities. However, its introduction has raised concerns about its potential to become an invasive species in some areas. Despite these concerns, it remains an important plant in agricultural systems where traditional crops struggle to grow."
}
