{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata f. subtetrasepala",
    "plant_slug": "abelia-spathulata-f-subtetrasepala",
    "plant_name_scientific": "abelia spathulata f. subtetrasepala",
    "intro": "Abelia spathulata f. subtetrasepala, commonly known as the four-lobed abelia, is a unique variant of the abelia plant characterized by its distinctive floral morphology. This cultivar features flowers with four lobes instead of the typical five, giving it a more compact and refined appearance. The plant is known for its showy, fragrant blooms that range in color from white to pink, depending on the specific cultivar. It typically grows as an upright shrub with glossy, dark green leaves that provide a striking contrast to its flowers. This variety is prized in gardens for its ornamental value and adaptability to a range of growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata f. subtetrasepala is primarily native to the southern United States, specifically occurring in parts of Georgia, South Carolina, and Florida. This subspecies is typically found in moist, well-drained soils in woodland areas or along streambanks. It thrives in partial to full shade and is often associated with humid, temperate climates. The plant is known for its showy, fragrant white to pink flowers that bloom in the spring. Its native range is limited, making it a relatively rare and specialized species within its habitat.",
    "distribution_introduced_art_desc": "Abelia spathulata f. subtetrasepala was mainly introduced to enhance ornamental value in gardens and landscapes due to its unique floral characteristics. This form is distinguished by its subtetrasepalous petals, which contribute to its aesthetic appeal. It is often cultivated for its compact growth habit and ability to thrive in partial shade. The introduction of this form has expanded the horticultural diversity within the Abelia genus. It is particularly favored in regions with temperate climates for its adaptability and visual interest."
}
