{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia gymnocarpa",
    "plant_slug": "abelia-gymnocarpa",
    "plant_name_scientific": "abelia gymnocarpa",
    "intro": "Abelia gymnocarpa, commonly known as smooth-fruit abelia, is a deciduous shrub native to eastern North America. It features slender, arching branches and is characterized by its showy, tubular flowers that bloom in late summer. The plant produces small, smooth, yellowish fruits that are edible for certain bird species. Abelia gymnocarpa thrives in partial shade to full sun and prefers well-drained soil. It is valued in gardens for its ornamental appeal and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia gymnocarpa is primarily native to eastern North America. It is found in the United States, particularly in the southeastern states. This plant thrives in moist, acidic soils and is commonly found in woodland areas. It is also native to parts of southern Ontario in Canada. Abelia gymnocarpa is often associated with stream banks and other wetland habitats.",
    "distribution_introduced_art_desc": "Abelia gymnocarpa was mainly introduced to areas with well-drained soil and partial to full sun, typically in temperate climates. It thrives in USDA hardiness zones 5 through 8, making it suitable for regions with moderate winters and warm summers. This plant is often cultivated for its ornamental value, featuring clusters of fragrant white flowers in the summer. It is commonly used in gardens and landscapes for its compact size and attractive foliage. Due to its adaptability, it has been introduced to various parts of the United States and Europe."
}
