{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus moschatus subsp. biakensis",
    "plant_slug": "abelmoschus-moschatus-subsp-biakensis",
    "plant_name_scientific": "abelmoschus moschatus subsp. biakensis",
    "intro": "Abelmoschus moschatus subsp. biakensis, commonly known as the Biak okra, is a tropical flowering plant native to Indonesia. It belongs to the Malvaceae family and is characterized by its hairy stems and large, lobed leaves. The plant produces capsule fruits that contain numerous seeds, and it is cultivated for its edible green pods. It thrives in warm, humid climates and requires well-drained soil for optimal growth. Its botanical features make it distinct from other okra species, particularly in its geographic distribution and morphological traits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus moschatus"
    },
    "taxonomy_art_desc": "Abelmoschus moschatus subsp. biakensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Malvales, a group of flowering plants that includes many economically important species such as cotton and okra. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and showy flowers. Its genus is Abelmoschus, which includes several species of flowering plants commonly known as okra or gumbo. Its species is Abelmoschus moschatus, a specific variety within the genus Abelmoschus, which is known for its distinctive appearance and use in various culinary and medicinal applications.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus moschatus subsp. biakensis is primarily native to New Guinea. This subspecies is found in the highland regions of the island, particularly in the western and central parts. It thrives in tropical and subtropical climates with well-drained soils. The plant is commonly found in natural habitats such as forests and grasslands. Its distribution is limited to specific ecological zones within New Guinea.",
    "distribution_introduced_art_desc": "Abelmoschus moschatus subsp. biakensis was mainly introduced to the region of West Papua, Indonesia. It is primarily found in the highland areas of the island, where it thrives in tropical and subtropical climates. The plant is known for its large, pale yellow flowers and edible pods, which are used in local cuisine. It has been introduced for its ornamental value and potential agricultural use. However, its distribution remains limited due to specific environmental requirements."
}
