{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus moschatus",
    "plant_slug": "abelmoschus-moschatus",
    "plant_name_scientific": "abelmoschus moschatus",
    "intro": "Abelmoschus moschatus, commonly known as the musk thorn, is a flowering plant belonging to the Malvaceae family. It is native to tropical and subtropical regions of Asia, Africa, and the Americas. The plant is characterized by its spiny stems and heart-shaped leaves, with yellow flowers that bloom in clusters. Its fruit is a capsule that contains numerous seeds, which are often used in traditional medicine. The plant's name derives from the musky fragrance emitted by its flowers and fruits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus moschatus"
    },
    "taxonomy_art_desc": "Abelmoschus moschatus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and often possessing aromatic compounds. Its order is Malvales, which includes plants such as hibiscus and cotton, typically featuring showy flowers and a distinctive type of pollen. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and capsule fruits. Its genus is Abelmoschus, a group of flowering plants native to tropical and subtropical regions, often cultivated for their edible parts. Its species is Abelmoschus moschatus, a specific plant known for its aromatic properties and used in traditional medicine and culinary applications.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "Bangladesh",
        "Borneo",
        "Cambodia",
        "China South-Central",
        "China Southeast",
        "Hainan",
        "India",
        "Jawa",
        "Laos",
        "Lesser Sunda Is.",
        "Malaya",
        "Maluku",
        "Myanmar",
        "New Guinea",
        "Philippines",
        "Sulawesi",
        "Sumatera",
        "Taiwan",
        "Thailand",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [
        "Aldabra",
        "Andaman Is.",
        "Angola",
        "Belize",
        "Benin",
        "Burkina",
        "Cabinda",
        "Cameroon",
        "Caroline Is.",
        "Cook Is.",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "DR Congo",
        "Ecuador",
        "El Salvador",
        "Fiji",
        "Ghana",
        "Guatemala",
        "Guinea",
        "Gulf of Guinea Is.",
        "Haiti",
        "Hawaii",
        "Honduras",
        "Ivory Coast",
        "Jamaica",
        "Kazan-retto",
        "Leeward Is.",
        "Liberia",
        "Maldives",
        "Marianas",
        "Mauritania",
        "Mexico Central",
        "Mexico Southwest",
        "Nansei-shoto",
        "New Caledonia",
        "Nigeria",
        "Niue",
        "Ogasawara-shoto",
        "Peru",
        "Puerto Rico",
        "Samoa",
        "Santa Cruz Is.",
        "Senegal",
        "Seychelles",
        "Sierra Leone",
        "Society Is.",
        "Solomon Is.",
        "Sri Lanka",
        "Tanzania",
        "Tonga",
        "Trinidad-Tobago",
        "Tuamotu",
        "Tubuai Is.",
        "Vanuatu",
        "Venezuela",
        "Wallis-Futuna Is.",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abelmoschus moschatus is primarily native to Assam, Bangladesh, Borneo, Cambodia, China South-Central, China Southeast, Hainan, India, Jawa, Laos, Lesser Sunda Is., Malaya, Maluku, Myanmar, New Guinea, Philippines, Sulawesi, Sumatera, Taiwan, Thailand, Vietnam, and West Himalaya. This species is commonly found in tropical and subtropical regions across Southeast Asia and parts of South Asia. It thrives in warm climates with well-drained soils, often growing in open areas or near water sources. The plant is known for its edible fruits and has been cultivated for centuries in these regions. Its native distribution reflects its adaptation to diverse ecological conditions in the region.",
    "distribution_introduced_art_desc": "Abelmoschus moschatus was mainly introduced to the tropical and subtropical regions of the Indian and Pacific Oceans, as well as parts of the Atlantic. It has been established in numerous island nations, including the Aldabra, Andaman Is., and Maldives, as well as mainland countries like Angola, Benin, and Nigeria. The plant's introduction is likely linked to its use as a vegetable, ornamental, or for its medicinal properties. It has also been found in the Caribbean, such as in Cuba, Haiti, and Jamaica, and in the Pacific, including Hawaii and Fiji. Its widespread distribution suggests successful adaptation to diverse tropical climates and human-mediated dispersal."
}
