{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia serrata var. obspathulata",
    "plant_slug": "abelia-serrata-var-obspathulata",
    "plant_name_scientific": "abelia serrata var. obspathulata",
    "intro": "Abelia serrata var. obspathulata, commonly known as the narrow-leaf abelia, is a deciduous shrub native to China. It features lance-shaped leaves that are typically dark green and have serrated edges. The plant produces clusters of fragrant, white to pinkish flowers in the summer, which attract pollinators like bees and butterflies. It thrives in partial shade to full sun and prefers well-drained soil. This variety is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia serrata var. obspathulata is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variant of Abelia serrata is commonly found in wetlands, swamps, and along the edges of water bodies in these regions. It thrives in moist, acidic soils and is often associated with coastal and tidal environments. The plant is well adapted to the humid climate and can tolerate periodic flooding. It is an important species in the local flora, contributing to the biodiversity of its native habitat.",
    "distribution_introduced_art_desc": "Abelia serrata var. obspathulata was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils along streambanks and forest edges. This variety is valued for its ornamental qualities, including its fragrant white flowers and attractive foliage. It has been widely cultivated in gardens and landscapes due to its hardiness and adaptability. However, it is important to note that it may spread aggressively in natural areas if not properly managed."
}
