{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelicea acuminata",
    "plant_slug": "abelicea-acuminata",
    "plant_name_scientific": "abelicea acuminata",
    "intro": "Abelicea acuminata, commonly known as the sharp-pointed abelicea, is a flowering plant native to specific regions of South America. It belongs to the family Malvaceae, which includes hibiscus and cotton plants. The plant is characterized by its slender, woody stems and lance-shaped leaves with serrated edges. Its flowers are typically small, clustered in inflorescences, and display shades of pink or white. Abelicea acuminata is often found in dry, sandy soils and thrives in full sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelicea acuminata is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and the Middle East. It is commonly found in coastal areas, often growing in rocky or sandy soils along the shoreline. This plant thrives in warm, sunny climates and is adapted to withstand salt spray and coastal conditions. It is particularly common in countries such as Italy, Greece, and Spain. Its distribution is closely linked to the ecological characteristics of the Mediterranean ecosystem.",
    "distribution_introduced_art_desc": "Abelicea acuminata was mainly introduced to new environments through human activities such as trade and accidental transport. It has established populations in coastal areas where it thrives in sandy or muddy substrates. The plant's introduction has raised concerns due to its potential to outcompete native species for resources. Its rapid growth and adaptability make it a significant invasive species in some regions. Monitoring and management strategies are essential to control its spread and mitigate ecological impacts."
}
