{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia tereticalyx",
    "plant_slug": "abelia-tereticalyx",
    "plant_name_scientific": "abelia tereticalyx",
    "intro": "Abelia tereticalyx, commonly known as the narrowleaf abelia, is a deciduous shrub native to the southeastern United States. It features slender, arching stems and small, fragrant white to pink flowers that bloom in late spring to early summer. The plant has narrow, dark green leaves that turn reddish in the fall, adding ornamental value to the landscape. It thrives in partial shade to full sun and prefers well-drained soil. Abelia tereticalyx is often used in gardens for its attractive foliage and long-lasting blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia tereticalyx is primarily native to China, specifically the regions of Sichuan and Yunnan. This species thrives in the mountainous areas of these provinces, where it grows in temperate and subtropical climates. It is commonly found in forests and along stream banks, preferring well-drained soils. The plant is adapted to the humid and cool conditions of its native habitat. Due to its unique characteristics, it is sometimes cultivated in botanical gardens and for ornamental purposes.",
    "distribution_introduced_art_desc": "Abelia tereticalyx was mainly introduced to ornamental horticulture due to its attractive foliage and showy flowers. It is commonly found in gardens and landscaped areas where it serves as a decorative plant. The species is native to Asia but has been cultivated in various regions around the world. Its introduction has led to its presence in some natural habitats, raising concerns about potential invasiveness. However, it is generally considered a non-invasive species when properly managed."
}
