{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus chinensis",
    "plant_slug": "abelmoschus-chinensis",
    "plant_name_scientific": "abelmoschus chinensis",
    "intro": "Abelmoschus chinensis, commonly known as the Chinese okra, is a flowering plant native to East Asia. It belongs to the Malvaceae family and is characterized by its upright stems and large, heart-shaped leaves. The plant produces capsules that contain numerous seeds, and its flowers are typically yellow with five petals. Abelmoschus chinensis is valued for its edible pods, which are used in various traditional cuisines. It thrives in warm climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus chinensis is primarily native to southern China, including regions such as Guangdong, Guangxi, and Yunnan. It is also found in parts of Southeast Asia, including Vietnam, Thailand, and Malaysia. This plant thrives in warm, humid climates and is often cultivated for its edible seeds and ornamental value. It grows in lowland areas and is commonly found in rural and agricultural settings. Its natural range extends into tropical and subtropical regions of East Asia.",
    "distribution_introduced_art_desc": "Abelmoschus chinensis was mainly introduced to regions with warm, humid climates where it can thrive. It is commonly found in parts of Southeast Asia, including Thailand, Vietnam, and the Philippines. The plant is valued for its edible fruits, which are rich in nutrients and used in local cuisines. Its introduction has also supported agricultural practices in these areas. However, it requires careful management to prevent it from becoming invasive in new environments."
}
