{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus haenkeanus",
    "plant_slug": "abelmoschus-haenkeanus",
    "plant_name_scientific": "abelmoschus haenkeanus",
    "intro": "Abelmoschus haenkeanus, commonly known as the Indian okra or lady's finger, is an annual herbaceous plant native to tropical and subtropical regions. It belongs to the Malvaceae family and is characterized by its hairy, lobed leaves and capsule fruits that contain numerous seeds. The plant typically grows to a height of 1 to 2 meters, with stout stems and yellow flowers that bloom in the summer. It thrives in warm climates and requires well-drained soil for optimal growth. The fruit is often cultivated for its edible, mucilaginous seeds and is widely used in culinary and medicinal applications.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus haenkeanus is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Sudan. It is also found in parts of southern Asia, including India and Malaysia. This plant thrives in warm climates with well-drained soil and is commonly grown for its edible pods and seeds. It is often cultivated in home gardens and small-scale farms due to its nutritional value and adaptability. The species has been introduced to other parts of the world for agricultural and culinary purposes.",
    "distribution_introduced_art_desc": "Abelmoschus haenkeanus was mainly introduced to tropical and subtropical regions for its ornamental value and potential agricultural use. It is commonly found in areas with warm climates, such as parts of Southeast Asia, Africa, and the Caribbean. The plant is often cultivated in gardens and greenhouses due to its attractive foliage and unique fruit characteristics. Its introduction has also been linked to horticultural trade and botanical interest. However, it is not widely naturalized in most regions outside its native range."
}
