{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus muliensis",
    "plant_slug": "abelmoschus-muliensis",
    "plant_name_scientific": "abelmoschus muliensis",
    "intro": "Abelmoschus muliensis, commonly known as the Yunnan okra, is a flowering plant native to China. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant is characterized by its hairy stems and large, heart-shaped leaves. Its flowers are typically yellow or white, and it produces capsule fruits that contain edible seeds. This species is valued for its ornamental qualities and has some traditional uses in local medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus muliensis"
    },
    "taxonomy_art_desc": "Abelmoschus muliensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and the presence of vascular tissue. Its class is Equisetopsida, a group of plants that includes horsetails and their relatives, known for their primitive features and ability to thrive in moist environments. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and modern species, often with showy flowers and a wide range of morphological diversity. Its order is Malvales, which comprises flowering plants with a distinctive floral structure, many of which produce cotton-like fibers or seeds enclosed in pods. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton, okra, and hibiscus, typically characterized by their showy flowers and velvety leaves. Its genus is Abelmoschus, a group of flowering plants native to tropical and subtropical regions, known for their large, showy flowers and edible fruits. Its species is Abelmoschus muliensis, a specific type of plant within the genus Abelmoschus, distinguished by its unique morphological and genetic traits, often found in specific ecological niches.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus muliensis is primarily native to China South-Central. This species is found in regions of central China, including provinces such as Hubei, Sichuan, and Hunan. It typically grows in moist, fertile soils in mountainous or forested areas. The plant is part of the Malvaceae family and is known for its medicinal properties. Its native distribution is limited to specific ecological zones within this geographic region.",
    "distribution_introduced_art_desc": "Abelmoschus muliensis was mainly introduced to regions with warm, humid climates where it can thrive in well-drained soils. It is often cultivated for its edible pods, which are similar to okra but have a unique flavor and texture. The plant is commonly grown in tropical and subtropical areas, including parts of Southeast Asia, Africa, and the Caribbean. Its introduction has been driven by both culinary interest and its potential as a crop with nutritional value. However, it is not widely cultivated outside of its native range due to specific growing conditions required."
}
