{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia serrata var. gymnocarpa",
    "plant_slug": "abelia-serrata-var-gymnocarpa",
    "plant_name_scientific": "abelia serrata var. gymnocarpa",
    "intro": "Abelia serrata var. gymnocarpa, commonly known as the smooth-seeded abelia, is a deciduous shrub native to eastern Asia. It features small, showy white to pink flowers that bloom in late spring to early summer. The plant has opposite, ovate leaves with serrated edges, and its stems are often reddish in color. It prefers partial shade to full sun and well-drained soil, making it adaptable to various garden conditions. This variety is valued for its ornamental appeal and ability to thrive in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia serrata var. gymnocarpa is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant is often associated with secondary forests and disturbed habitats, where it thrives in partial shade to full sun conditions. Its natural range extends into parts of Indonesia and the Philippines as well. The plant is well adapted to the warm, humid climates of these regions.",
    "distribution_introduced_art_desc": "Abelia serrata var. gymnocarpa was mainly introduced to the southeastern United States, particularly in regions with moist, acidic soils. It was popularized as an ornamental plant for its fragrant flowers and attractive foliage. The introduction occurred during the 19th century as part of botanical exploration and horticultural exchange. It has since been cultivated in gardens and naturalized in some areas, though its spread is limited compared to other invasive species. This variety is valued for its hardiness and adaptability to temperate climates."
}
