{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia biflora var. alpina",
    "plant_slug": "abelia-biflora-var-alpina",
    "plant_name_scientific": "abelia biflora var. alpina",
    "intro": "Abelia biflora var. alpina, commonly known as the alpine abelia, is a compact, evergreen shrub native to the mountainous regions of central and southern Europe. It features small, fragrant white to pink flowers that bloom in late spring to early summer, attracting pollinators such as bees and butterflies. The plant has dark green, glossy leaves that remain throughout the year, providing ornamental value in both garden and natural settings. It thrives in well-drained soil and full to partial sun, making it suitable for rock gardens and alpine landscapes. Its hardy nature allows it to withstand colder climates, contributing to its popularity among horticulturists and garden enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia biflora var. alpina is primarily native to the mountainous regions of eastern Asia, specifically China, Korea, and Japan. This variant thrives in cool, moist climates at higher elevations. It is commonly found in forested areas and rocky slopes where the soil is well-drained. The plant prefers partial to full shade and is often associated with temperate coniferous forests. Its natural range is limited to these specific geographic locations, making it a rare and specialized species.",
    "distribution_introduced_art_desc": "Abelia biflora var. alpina was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as woodlands and stream banks. This plant is valued for its fragrant flowers and adaptability to various soil types. It has been used in both ornamental gardening and ecological restoration projects. However, it is considered an invasive species in some areas due to its rapid spread."
}
