{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus enbeepeegearensis",
    "plant_slug": "abelmoschus-enbeepeegearensis",
    "plant_name_scientific": "abelmoschus enbeepeegearensis",
    "intro": "Abelmoschus enbeepeegearensis, commonly known as the African okra, is a flowering plant native to tropical regions of Africa. It belongs to the Malvaceae family and is characterized by its large, heart-shaped leaves and showy, yellow flowers. The plant produces capsule fruits that contain numerous seeds, which are used in various culinary and medicinal applications. It thrives in warm climates with well-drained soil and requires moderate water for optimal growth. Due to its adaptability, it is cultivated in several African countries for both food and traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus enbeepeegearensis"
    },
    "taxonomy_art_desc": "Abelmoschus enbeepeegearensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and fibrous fruits. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abelmoschus, which includes species such as okra, known for their edible fruits and economic importance. Its species is Abelmoschus enbeepeegearensis, a specific variety within the genus Abelmoschus, likely characterized by unique morphological or genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus enbeepeegearensis is primarily native to India. It is found in various regions across the country, particularly in the southern and eastern states. This species thrives in tropical and subtropical climates, often growing in open fields and along riverbanks. It is commonly associated with areas that have well-drained soils and adequate sunlight. The plant is known for its medicinal properties and is used in traditional remedies in local communities.",
    "distribution_introduced_art_desc": "Abelmoschus enbeepeegearensis was mainly introduced to regions with warm, tropical climates where it can thrive in well-drained soils. This plant is typically found in areas with high humidity and adequate sunlight, making it suitable for cultivation in parts of Southeast Asia and the Caribbean. It has been introduced as a potential crop due to its nutritional value and adaptability to different growing conditions. However, its distribution is still limited compared to more widely cultivated species within the Abelmoschus genus. Further research is needed to fully understand its ecological impact and potential uses."
}
