{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia lipoensis",
    "plant_slug": "abelia-lipoensis",
    "plant_name_scientific": "abelia lipoensis",
    "intro": "Abelia lipoensis, commonly known as the Lipoensis abelia, is a deciduous shrub native to Southeast Asia. It features showy, tubular flowers that range in color from white to pink, typically blooming in the summer months. The plant has lance-shaped leaves that are usually arranged oppositely along the stems. It thrives in partial to full sun and well-drained soil, making it suitable for garden landscapes. Its ornamental value is enhanced by its attractive foliage and long-lasting blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia lipoensis is primarily native to the mountainous regions of southern China, particularly in the provinces of Guangdong, Guangxi, and Yunnan. It thrives in humid, subtropical climates with well-drained soil and partial to full sunlight. This plant is often found in forested areas and along streamside habitats. It is well adapted to the moist, cool conditions of its native environment. Due to its ornamental value, it has been introduced to other parts of the world, but it remains most commonly associated with its original habitat in southern China.",
    "distribution_introduced_art_desc": "Abelia lipoensis was mainly introduced to the southeastern United States as an ornamental plant due to its attractive foliage and flowering habits. It was first documented in the early 20th century and has since been cultivated in gardens and landscapes across the region. The plant thrives in moist, well-drained soils and partial to full sun, making it suitable for a variety of garden environments. Its introduction has led to its naturalization in some areas, raising concerns about its potential impact on native plant communities. Despite its beauty, Abelia lipoensis is considered an invasive species in certain parts of its range."
}
