{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus collinsianus",
    "plant_slug": "abelmoschus-collinsianus",
    "plant_name_scientific": "abelmoschus collinsianus",
    "intro": "Abelmoschus collinsianus, commonly known as the Collins' okra, is a flowering plant native to tropical regions of the Americas. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant produces showy, yellow flowers with red or purple markings, followed by capsule fruits that contain numerous seeds. Its leaves are broad and heart-shaped, often with a velvety texture. Abelmoschus collinsianus is valued both for its ornamental appeal and its potential medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus collinsianus is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in open habitats such as forests, grasslands, and along riverbanks. It is often associated with disturbed soils and can be found in both natural and cultivated environments. Its native range extends to parts of the Indian subcontinent as well.",
    "distribution_introduced_art_desc": "Abelmoschus collinsianus was mainly introduced to the United States as an ornamental plant due to its attractive, showy flowers. It is commonly found in gardens and greenhouses, particularly in the southern states where the climate is more suitable for its growth. The plant is also occasionally cultivated in tropical and subtropical regions for its edible pods, although it is less common than other species in the Abelmoschus genus. Its introduction has led to its presence in various ecological settings, sometimes becoming invasive in certain areas. Despite its ornamental value, it requires careful management to prevent it from spreading beyond controlled environments."
}
