{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia serrata f. colorata",
    "plant_slug": "abelia-serrata-f-colorata",
    "plant_name_scientific": "abelia serrata f. colorata",
    "intro": "Abelia serrata f. colorata, commonly known as the Crimson Abelia, is a compact, deciduous shrub native to China. It features showy, tubular flowers that range from white to deep pink, often with a red throat, blooming in late spring to early summer. The plant has elliptical, serrated leaves that provide a textured appearance throughout the growing season. It thrives in partial shade to full sun and is drought-tolerant once established. Its ornamental value makes it a popular choice for garden borders and containers.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Diabelia",
        "species": "Diabelia serrata"
    },
    "taxonomy_art_desc": "Abelia serrata f. colorata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which consists of vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Dipsacales, which comprises flowering plants with showy inflorescences, often found in temperate regions. Its family is Caprifoliaceae, known as the honeysuckle family, which includes shrubs and vines with fragrant flowers and often edible fruits. Its genus is Diabelia, a small group of flowering plants native to southern Africa, characterized by their simple leaves and showy flowers. Its species is Diabelia serrata, a specific plant within the genus Diabelia, distinguished by its serrated leaves and distinctive floral morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia serrata f. colorata is primarily native to Japan. This plant is found in the southern regions of the country, including the islands of Kyushu and Shikoku. It thrives in moist, well-drained soils and is often found in woodland areas or along stream banks. The variety is known for its showy, pinkish-white flowers that bloom in late spring to early summer. It is a popular ornamental plant due to its attractive foliage and flowering habit.",
    "distribution_introduced_art_desc": "Abelia serrata f. colorata was mainly introduced to enhance ornamental value in gardens and landscapes due to its attractive foliage and flowering characteristics. It is commonly found in regions with temperate climates where it thrives in partial shade to full sun conditions. This cultivar is prized for its vibrant, colorful leaves that provide year-round visual interest. It has been widely propagated for use in residential and public gardens. However, it is important to monitor its spread to prevent potential invasiveness in natural habitats."
}
