{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia macrotera",
    "plant_slug": "abelia-macrotera",
    "plant_name_scientific": "abelia macrotera",
    "intro": "Abelia macrotera, commonly known as the large-flowered abelia, is a deciduous shrub native to the southeastern United States. It features fragrant, tubular flowers that range in color from white to pink, blooming in late summer to early autumn. The plant has opposite, ovate leaves that are typically dark green with a slightly hairy texture. It thrives in partial to full sun and prefers moist, well-drained soil. Abelia macrotera is valued for its ornamental appeal and ability to attract pollinators like bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia macrotera"
    },
    "taxonomy_art_desc": "Abelia macrotera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Dipsacales, which consists of flowering plants with usually showy flowers and often includes plants with medicinal properties. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with fragrant flowers. Its genus is Abelia, a group of flowering shrubs known for their showy, tubular flowers and are often used in ornamental gardening. Its species is Abelia macrotera, a specific type of Abelia characterized by its large, showy flowers and is native to certain regions in Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia macrotera is primarily native to China North-Central, China South-Central, and China Southeast. This plant is commonly found in regions with temperate climates and well-drained soils. It thrives in woodland areas and along stream banks where it receives partial to full sunlight. The species is known for its showy flowers and is often used in ornamental gardening. Its native range reflects its adaptability to diverse environmental conditions within these regions.",
    "distribution_introduced_art_desc": "Abelia macrotera was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils along streambanks and in shaded woodlands. This plant is valued for its fragrant white to pink flowers that bloom in late spring to early summer. It has been successfully established in both natural and cultivated settings due to its adaptability. However, it is important to monitor its spread to prevent potential ecological impacts in native habitats."
}
