{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus mutabilis",
    "plant_slug": "abelmoschus-mutabilis",
    "plant_name_scientific": "abelmoschus mutabilis",
    "intro": "Abelmoschus mutabilis, commonly known as the lady's finger or okra, is a flowering plant native to Africa and cultivated in tropical and subtropical regions. It belongs to the Malvaceae family and is characterized by its capsule fruit, which contains numerous seeds. The plant produces vibrant yellow or orange flowers that are typically short-lived. Its leaves are alternate, ovate, and covered with fine hairs. Abelmoschus mutabilis is valued for its edible young pods, which are rich in nutrients and used in various cuisines worldwide.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus mutabilis is primarily native to Southeast Asia, including countries such as India, Thailand, and Malaysia. It is commonly found in tropical and subtropical regions with warm climates and well-drained soils. This plant thrives in open areas and is often cultivated for its ornamental flowers and edible pods. It is also known as the Chinese okra or lady's finger in some regions. Its natural range extends to parts of Africa and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abelmoschus mutabilis was mainly introduced to regions with warm climates and well-drained soils, where it can thrive and produce its characteristic okra-like fruits. It is commonly cultivated in tropical and subtropical areas for its edible pods, which are used in various culinary traditions. The plant's introduction has often been driven by agricultural interests and the demand for nutritious, versatile crops. It has been successfully established in countries such as India, Nigeria, and parts of Southeast Asia. However, its spread has also raised concerns about potential ecological impacts in non-native environments."
}
