{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus cancellatus",
    "plant_slug": "abelmoschus-cancellatus",
    "plant_name_scientific": "abelmoschus cancellatus",
    "intro": "Abelmoschus cancellatus, commonly known as the African okra or spider flower, is a flowering plant native to Africa and parts of Asia. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant is characterized by its hairy, ovate leaves and showy, yellow flowers with prominent stamens. Its fruit is a capsule that splits open to release seeds, and it is often cultivated for its ornamental value. Abelmoschus cancellatus is drought-tolerant and thrives in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus cancellatus is primarily native to tropical and subtropical regions of Africa, southern Asia, and parts of the Middle East. It is commonly found in countries such as Sudan, Ethiopia, India, and Pakistan. This plant thrives in warm climates with well-drained soil and is often cultivated for its edible seeds and ornamental value. It is particularly common in areas with a dry season, where it adapts well to seasonal rainfall patterns. Its native distribution includes both wild and cultivated populations across these regions.",
    "distribution_introduced_art_desc": "Abelmoschus cancellatus was mainly introduced to new agricultural regions for its potential as a vegetable crop. It is valued for its edible pods, which are similar to okra but have a milder flavor. The plant thrives in warm climates and is often cultivated in tropical and subtropical areas. Its introduction has been driven by the demand for diverse and nutritious food sources. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
