{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abeliophyllum distichum f. albiflorum",
    "plant_slug": "abeliophyllum-distichum-f-albiflorum",
    "plant_name_scientific": "abeliophyllum distichum f. albiflorum",
    "intro": "Abeliophyllum distichum f. albiflorum, commonly known as the whiteflowered abelia, is a compact, evergreen shrub native to Japan. It features fragrant, white to pale pink flowers that bloom in late spring to early summer, adding a delicate floral display. The plant has small, oval-shaped leaves that are glossy and dark green, providing a striking contrast to its blossoms. It thrives in partial shade to full sun and prefers well-drained, acidic soil. This cultivar is valued for its ornamental appeal and is often used in gardens for its elegant appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abeliophyllum distichum f. albiflorum is primarily native to southern China, particularly the provinces of Guangdong, Guangxi, and Yunnan. This plant is also found in parts of Southeast Asia, including Vietnam and Thailand. It thrives in humid, subtropical climates with well-drained soil. The species is commonly found in mountainous regions and forested areas. Its natural habitat includes rocky slopes and shaded understories in evergreen forests.",
    "distribution_introduced_art_desc": "Abeliophyllum distichum f. albiflorum was mainly introduced to the United States as an ornamental plant due to its attractive white flowers and compact growth habit. It is commonly found in gardens and landscaped areas, particularly in the southeastern and eastern regions of the country. This cultivar is valued for its ability to thrive in partial shade and its resistance to common pests and diseases. It has been widely propagated through horticultural practices, contributing to its popularity among gardeners. However, its introduction has raised concerns about its potential impact on native plant communities in certain regions."
}
