{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia mexicana",
    "plant_slug": "abelia-mexicana",
    "plant_name_scientific": "abelia mexicana",
    "intro": "Abelia mexicana, commonly known as Mexican abelia, is a flowering shrub native to Mexico and parts of Central America. It typically grows to a height of 1 to 3 meters and features opposite, ovate to lanceolate leaves. The plant produces clusters of fragrant, tubular flowers in shades of white, pink, and red, which bloom in late spring to early summer. Its flowering period attracts pollinators such as bees and hummingbirds. Abelia mexicana is often cultivated for its ornamental value and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia mexicana is primarily native to Mexico and parts of Central America, including countries such as Guatemala, Belize, and Honduras. It is commonly found in tropical and subtropical regions, particularly in areas with moist, well-drained soils. This plant thrives in shaded to partially sunny environments, often growing in the understory of forests or along stream banks. It is also known to occur in the Caribbean islands, such as Cuba and Hispaniola. Abelia mexicana is valued for its ornamental qualities and is sometimes cultivated in gardens in warm climates.",
    "distribution_introduced_art_desc": "Abelia mexicana was mainly introduced to the Pacific Northwest of the United States. It was brought there for its ornamental value due to its attractive foliage and showy flowers. The plant has since become naturalized in moist, shaded areas along stream banks and forest floors. It is often found in regions with cool, humid climates and well-drained soil. However, its spread has raised concerns about its potential impact on native plant communities."
}
