{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot",
    "plant_slug": "abelmoschus-manihot",
    "plant_name_scientific": "abelmoschus manihot",
    "intro": "Abelmoschus manihot, commonly known as wild cotton or manioc, is a herbaceous perennial plant native to tropical regions of Africa. It belongs to the Malvaceae family and is characterized by its large, heart-shaped leaves and showy yellow flowers. The plant is notable for its starchy underground tuberous roots, which are a staple food in many parts of the world. It thrives in warm, humid climates and requires well-drained soil for optimal growth. Additionally, it is sometimes cultivated for its fibers, which are used in the production of textiles.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus manihot"
    },
    "taxonomy_art_desc": "Abelmoschus manihot belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and other primitive plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malvales, a group of flowering plants that includes plants such as cotton and okra. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy stems. Its genus is Abelmoschus, which includes several species of flowering plants, many of which are cultivated for their edible parts. Its species is Abelmoschus manihot, commonly known as the African breadfruit, which is a tropical plant cultivated for its starchy roots.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "Bangladesh",
        "Bismarck Archipelago",
        "China North-Central",
        "China South-Central",
        "China Southeast",
        "Christmas I.",
        "East Himalaya",
        "India",
        "Jawa",
        "Laos",
        "Lesser Sunda Is.",
        "Maluku",
        "Myanmar",
        "Nepal",
        "New Guinea",
        "Pakistan",
        "Philippines",
        "Queensland",
        "Sulawesi",
        "Sumatera",
        "Thailand",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [
        "Cameroon",
        "Central African Republic",
        "Cook Is.",
        "DR Congo",
        "Ecuador",
        "Fiji",
        "Gabon",
        "Guinea",
        "Korea",
        "Liberia",
        "Line Is.",
        "Nansei-shoto",
        "New Caledonia",
        "Nigeria",
        "Oman",
        "Peru",
        "Réunion",
        "Santa Cruz Is.",
        "Sierra Leone",
        "Solomon Is.",
        "Taiwan",
        "Togo",
        "Vanuatu",
        "Venezuela"
    ],
    "distribution_native_art_desc": "Abelmoschus manihot is primarily native to Assam, Bangladesh, Bismarck Archipelago, China North-Central, China South-Central, China Southeast, Christmas Island, East Himalaya, India, Jawa, Laos, Lesser Sunda Islands, Maluku, Myanmar, Nepal, New Guinea, Pakistan, Philippines, Queensland, Sulawesi, Sumatra, Thailand, Vietnam, and West Himalaya. It is commonly found in tropical and subtropical regions, often growing in wetlands, marshes, and along riverbanks. The plant is well adapted to humid climates and can thrive in a variety of soil types. It has been historically used for its starchy roots, which are a staple food in many parts of its native range. Its wide distribution across Asia and the Pacific highlights its ecological and agricultural significance in these regions.",
    "distribution_introduced_art_desc": "Abelmoschus manihot was mainly introduced to Cameroon, Central African Republic, Cook Is., DR Congo, Ecuador, Fiji, Gabon, Guinea, Korea, Liberia, Line Is., Nansei-shoto, New Caledonia, Nigeria, Oman, Peru, Réunion, Santa Cruz Is., Sierra Leone, Solomon Is., Taiwan, Togo, Vanuatu, and Venezuela. It has been widely distributed across these regions, often as an ornamental or for its edible roots. The plant is commonly found in tropical and subtropical climates, thriving in warm and humid environments. Its introduction is likely due to its adaptability and potential agricultural or horticultural value. It is now considered an invasive species in some areas, posing ecological challenges."
}
