{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot subsp. manihot",
    "plant_slug": "abelmoschus-manihot-subsp-manihot",
    "plant_name_scientific": "abelmoschus manihot subsp. manihot",
    "intro": "Abelmoschus manihot subsp. manihot, commonly known as cassava, is a tropical plant native to Africa and widely cultivated in tropical regions. It is a herbaceous perennial shrub that produces large, heart-shaped leaves and yellow flowers. The plant's most economically important part is its swollen root, which is rich in starch and used as a food source. Cassava is also known for its ability to thrive in poor soil conditions, making it a staple crop in many developing countries. However, it contains cyanogenic glycosides, which can release toxic hydrogen cyanide if not properly processed.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus manihot"
    },
    "taxonomy_art_desc": "Abelmoschus manihot subsp. manihot belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and often possessing spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient lineages and is characterized by their diverse floral structures and reproductive systems. Its order is Malvales, which consists of flowering plants with a wide range of morphological features, including many economically important species. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and okra, characterized by their showy flowers and sometimes hairy leaves. Its genus is Abelmoschus, a group of flowering plants native to Africa and Asia, known for their edible seeds and use in traditional medicine. Its species is Abelmoschus manihot, commonly known as African breadfruit, a tropical plant valued for its starchy roots and used in various culinary and medicinal applications.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bangladesh",
        "China North-Central",
        "China South-Central",
        "China Southeast",
        "India",
        "Maluku",
        "Myanmar",
        "Nepal",
        "Sulawesi",
        "Vietnam"
    ],
    "distribution_introduced": [
        "Cameroon",
        "Cook Is.",
        "DR Congo",
        "Ecuador",
        "Fiji",
        "Gabon",
        "Guinea",
        "Korea",
        "Laos",
        "Liberia",
        "Line Is.",
        "Nansei-shoto",
        "New Caledonia",
        "Nigeria",
        "Oman",
        "Peru",
        "Réunion",
        "Santa Cruz Is.",
        "Sierra Leone",
        "Solomon Is.",
        "Togo",
        "Vanuatu",
        "Venezuela"
    ],
    "distribution_native_art_desc": "Abelmoschus manihot subsp. manihot is primarily native to Bangladesh, China North-Central, China South-Central, China Southeast, India, Maluku, Myanmar, Nepal, Sulawesi, and Vietnam. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in warm climates with well-drained soils, often growing in lowland areas. The subspecies is known for its use in traditional agriculture and as a source of food. Its native distribution reflects its adaptability to diverse environmental conditions in South and Southeast Asia.",
    "distribution_introduced_art_desc": "Abelmoschus manihot subsp. manihot was mainly introduced to Cameroon, Cook Is., DR Congo, Ecuador, Fiji, Gabon, Guinea, Korea, Laos, Liberia, Line Is., Nansei-shoto, New Caledonia, Nigeria, Oman, Peru, Réunion, Santa Cruz Is., Sierra Leone, Solomon Is., Togo, Vanuatu, and Venezuela. This plant is commonly found in tropical and subtropical regions, often cultivated for its starchy roots. It has been introduced for agricultural purposes, including as a food crop and for industrial use. The distribution suggests it has been widely adopted in various island and mainland countries across Africa, Asia, and the Pacific. Its introduction has likely contributed to local food security and economic development in these regions."
}
