{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata f. lucida",
    "plant_slug": "abelia-spathulata-f-lucida",
    "plant_name_scientific": "abelia spathulata f. lucida",
    "intro": "Abelia spathulata f. lucida, commonly known as the shining abelia, is a compact, evergreen shrub native to China. It features narrow, elliptical leaves that are glossy and dark green, giving it a striking appearance. The plant produces clusters of fragrant, white to pale pink flowers in the summer, which attract pollinators like bees and butterflies. It thrives in partial shade to full sun and prefers well-drained, acidic soil. This cultivar is valued for its ornamental appeal and adaptability in garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata f. lucida is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variety is found in moist, acidic soils within hardwood forests and along stream banks. It thrives in partial to full shade and is commonly associated with wetland habitats. The plant is known for its showy, white to pinkish flowers that bloom in the summer. It is often used in landscaping for its ornamental value and adaptability to humid climates.",
    "distribution_introduced_art_desc": "Abelia spathulata f. lucida was mainly introduced to the eastern United States as an ornamental plant due to its attractive, fragrant flowers and compact growth habit. It is commonly found in gardens and landscaped areas, particularly in regions with mild climates. This cultivar is valued for its ability to thrive in partial shade and its resistance to common pests and diseases. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has led to increased efforts in monitoring and managing its spread to protect local ecosystems."
}
