{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus vitifolius var. mollis",
    "plant_slug": "abelmoschus-vitifolius-var-mollis",
    "plant_name_scientific": "abelmoschus vitifolius var. mollis",
    "intro": "Abelmoschus vitifolius var. mollis, commonly known as velvetleaf okra, is a variant of the okra plant characterized by its soft, velvety foliage. It belongs to the Malvaceae family and is native to tropical and subtropical regions. The plant typically grows as an annual herb with sprawling stems and large, heart-shaped leaves. Its flowers are yellow with five petals, and it produces capsule fruits that contain numerous seeds. This variety is often cultivated for its ornamental value and as a source of edible pods in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus vitifolius var. mollis is primarily native to southern and eastern Africa, including countries such as South Africa, Kenya, Tanzania, and Mozambique. This variant is commonly found in dry savanna and woodland regions where it thrives in well-drained soils. It is often associated with disturbed habitats and can be found along roadsides and in agricultural areas. The plant is known for its hairy, heart-shaped leaves and yellow flowers. It plays a role in local ecosystems and has been used traditionally for various purposes.",
    "distribution_introduced_art_desc": "Abelmoschus vitifolius var. mollis was mainly introduced to tropical and subtropical regions for its ornamental value and potential as a vegetable crop. It is commonly found in parts of Southeast Asia, Africa, and the Caribbean where it thrives in warm climates. The plant is often cultivated in home gardens and small-scale farms due to its adaptability and aesthetic appeal. Its introduction has also been linked to traditional agricultural practices in these areas. However, its spread is limited by its preference for specific soil and climate conditions."
}
