{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata var. colorata",
    "plant_slug": "abelia-spathulata-var-colorata",
    "plant_name_scientific": "abelia spathulata var. colorata",
    "intro": "Abelia spathulata var. colorata, commonly known as the Chinese abelia or pink abelia, is a deciduous shrub native to China. It is characterized by its oval-shaped leaves and clusters of fragrant, tubular flowers that bloom in late spring to early summer. The flowers are typically pink or white, with a distinctive red throat, adding visual interest to the plant. It thrives in partial shade to full sun and prefers well-drained, moist soil. This ornamental plant is valued for its showy blooms and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Diabelia",
        "species": "Diabelia spathulata"
    },
    "taxonomy_art_desc": "Abelia spathulata var. colorata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and includes species with jointed stems and spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Dipsacales, which includes flowering plants such as honeysuckles and is known for its often showy flowers and sometimes aromatic leaves. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with opposite leaves and usually fragrant flowers. Its genus is Diabelia, a small genus of flowering plants native to South America, characterized by its shrub-like growth and showy, tubular flowers. Its species is Diabelia spathulata, a specific plant within the genus Diabelia, known for its distinctive leaf shape and colorful floral displays.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata var. colorata is primarily native to Japan. This variant of Abelia spathulata is found in specific regions of Japan, particularly in the southern and central parts of the country. It thrives in moist, well-drained soils and is commonly found in woodland areas and along stream banks. The plant is known for its vibrant pink and white flowers that bloom in late spring to early summer. It is a popular ornamental plant due to its attractive foliage and flowering habits.",
    "distribution_introduced_art_desc": "Abelia spathulata var. colorata was mainly introduced to the Pacific Northwest region of the United States. It was brought in during the late 19th century as an ornamental plant due to its attractive foliage and showy flowers. This variety is known for its compact growth habit and ability to thrive in partial shade to full sun conditions. It has become a popular choice for gardeners seeking a hardy, low-maintenance shrub. However, it is important to note that it can spread aggressively and may become invasive in certain environments."
}
