{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelicea cretica",
    "plant_slug": "abelicea-cretica",
    "plant_name_scientific": "abelicea cretica",
    "intro": "Abelicea cretica, commonly known as the Cretan bellflower, is a flowering plant native to the island of Crete in Greece. It belongs to the Campanulaceae family and is characterized by its bell-shaped, blue or purple flowers. The plant typically grows in rocky or limestone soils and thrives in sunny, well-drained environments. Abelicea cretica has narrow, lance-shaped leaves and produces small, clustered flowers that bloom in late spring to early summer. It is valued for its ornamental beauty and is often cultivated in gardens with suitable conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelicea cretica is primarily native to the Mediterranean region, particularly the island of Crete. It is found in the wild in various habitats across the island, including rocky areas and coastal regions. The plant thrives in dry, sunny conditions and is adapted to the specific climate of the Mediterranean. It is a rare and endemic species, meaning it is found nowhere else in the world. Its native distribution is limited to the southern part of the Greek island of Crete.",
    "distribution_introduced_art_desc": "Abelicea cretica was mainly introduced to coastal areas of the Mediterranean region, particularly in southern Europe and parts of North Africa. It thrives in sandy or gravelly soils near the shoreline, where it can receive ample sunlight and moderate moisture. This plant has been noted for its ability to stabilize dunes and prevent erosion, making it valuable for ecological restoration projects. However, its rapid growth and spread have also raised concerns about its impact on native plant species. Due to these characteristics, it is now considered both a beneficial and potentially invasive species in certain environments."
}
