{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia triflora",
    "plant_slug": "abelia-triflora",
    "plant_name_scientific": "abelia triflora",
    "intro": "Abelia triflora, commonly known as the three-flowered abelia, is a deciduous shrub native to eastern North America. It features showy clusters of fragrant, white to pinkish flowers that bloom in late spring to early summer. The plant has opposite, ovate leaves that are glossy and dark green, providing a striking contrast to its floral displays. It thrives in partial shade to full sun and prefers moist, well-drained soil. Abelia triflora is valued for its ornamental appeal and ability to attract pollinators like bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia triflora is primarily native to China, specifically the provinces of Yunnan and Guizhou. It is also found in parts of Southeast Asia, including Vietnam and Myanmar. This plant thrives in moist, shaded environments within mountainous regions. It is commonly found in forests and along stream banks. Its native range is limited to these specific geographic areas in East Asia.",
    "distribution_introduced_art_desc": "Abelia triflora was mainly introduced to North America as an ornamental plant due to its attractive flowers and hardy nature. It is commonly found in gardens and landscapes across the eastern United States. The plant prefers well-drained soil and partial to full sun, making it adaptable to various garden settings. Its introduction has led to its naturalization in some regions, where it can occasionally become invasive. Despite its beauty, it is important to manage its spread to prevent ecological disruption."
}
