{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus cubensis",
    "plant_slug": "abelmoschus-cubensis",
    "plant_name_scientific": "abelmoschus cubensis",
    "intro": "Abelmoschus cubensis, commonly known as the Cuban okra, is a flowering plant belonging to the Malvaceae family. It is native to the Caribbean and parts of Central and South America. The plant produces capsule fruits that contain numerous seeds, which are often used in traditional medicine. Its leaves are broad and heart-shaped, with a rough texture. Abelmoschus cubensis is valued for its edible pods, which are similar to those of okra but have a distinct flavor and texture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus cubensis is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Sudan, Ethiopia, and parts of East Africa. It is also found in some areas of southern Asia, including India and Sri Lanka. This plant thrives in warm climates with well-drained soil and ample sunlight. It is commonly grown for its edible seeds, which are used in cooking and traditional medicine. Its native distribution reflects its adaptation to arid and semi-arid environments.",
    "distribution_introduced_art_desc": "Abelmoschus cubensis was mainly introduced to regions with warm, tropical climates where it can thrive in well-drained soils. It is commonly found in areas of Southeast Asia, the Caribbean, and parts of Africa where its growth conditions are met. This plant has been introduced for its ornamental value and as a potential crop for its edible seeds. Its introduction has sometimes led to it becoming an invasive species in certain ecosystems. However, it is also valued for its ability to improve soil fertility through nitrogen fixation."
}
