{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus persicifolius",
    "plant_slug": "abelmoschus-persicifolius",
    "plant_name_scientific": "abelmoschus persicifolius",
    "intro": "Abelmoschus persicifolius, commonly known as the okra or lady's finger, is a flowering plant in the mallow family (Malvaceae). It is native to warm temperate and tropical regions of Africa and is widely cultivated for its edible pods. The plant features large, heart-shaped leaves and produces vibrant yellow flowers that bloom in clusters. Its fruit is a capsule that matures into the fibrous, pod-like structure used in cooking. The plant is drought-tolerant and thrives in well-drained soil, making it a popular choice for home gardens and commercial agriculture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus persicifolius is primarily native to tropical and subtropical regions of Asia, including India, China, and parts of Southeast Asia. It is commonly found in areas with warm climates and well-drained soils. This plant thrives in open fields and along riverbanks, where it can receive ample sunlight. It is often cultivated for its edible seeds and ornamental value. Its native range extends across several countries in South and Southeast Asia.",
    "distribution_introduced_art_desc": "Abelmoschus persicifolius was mainly introduced to regions with warm climates and well-drained soils, where it thrives as an annual herb. It is commonly cultivated in parts of Asia, Africa, and the Americas for its edible seeds and ornamental value. The plant prefers full sun and moderate water, making it suitable for tropical and subtropical environments. Due to its adaptability, it has been introduced to various agricultural systems for both food and horticultural purposes. However, its spread can sometimes lead to competition with native species in non-native regions."
}
