{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia floribunda var. foliacea",
    "plant_slug": "abelia-floribunda-var-foliacea",
    "plant_name_scientific": "abelia floribunda var. foliacea",
    "intro": "Abelia floribunda var. foliacea, commonly known as the broadleaf abelia, is a deciduous shrub native to the southeastern United States. It features ovate to elliptical leaves that are typically 2–4 inches long and have a smooth, glossy surface. The plant produces clusters of fragrant, white to pinkish flowers in the summer, which attract pollinators like bees and butterflies. It thrives in partial to full sun and prefers well-drained, moist soil. Its compact growth habit and ornamental foliage make it a popular choice for garden landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia floribunda var. foliacea is primarily native to eastern and southern Africa, including countries such as South Africa, Zimbabwe, and Mozambique. This variety is commonly found in coastal and lowland areas, often growing in sandy or rocky soils. It thrives in regions with warm, humid climates and is typically found in open woodlands or along riverbanks. The plant is well adapted to the local environmental conditions of its native range. It is known for its showy, fragrant flowers that bloom throughout the growing season.",
    "distribution_introduced_art_desc": "Abelia floribunda var. foliacea was mainly introduced to ornamental horticulture due to its attractive foliage and showy clusters of white to pink flowers. It is commonly cultivated in gardens and landscaped areas for its aesthetic value and relatively low maintenance requirements. This variety is particularly valued for its broad, heart-shaped leaves that provide a striking visual contrast to its flowering display. It thrives in partial shade to full sun and is adaptable to a range of soil types, making it a versatile choice for gardeners. However, it is important to note that it may become invasive in certain regions if not properly managed."
}
