{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abeliophyllum distichum f. lilacinum",
    "plant_slug": "abeliophyllum-distichum-f-lilacinum",
    "plant_name_scientific": "abeliophyllum distichum f. lilacinum",
    "intro": "Abeliophyllum distichum f. lilacinum, commonly known as the lilac-leafed abelia, is a compact shrub native to Japan. It features opposite, lance-shaped leaves that are typically a deep green with a slight bluish tinge. The plant produces clusters of small, fragrant flowers in shades of white to pale pink, often blooming in late spring to early summer. It prefers partial shade to full sun and well-drained soil, making it suitable for garden borders or containers. Its ornamental value comes from both its foliage and its delicate floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abeliophyllum distichum f. lilacinum is primarily native to the mountainous regions of central and southern China, particularly in provinces such as Sichuan, Yunnan, and Guizhou. This plant thrives in temperate climates with high humidity and well-drained soils. It is commonly found in forested areas and rocky slopes at elevations ranging from 1,500 to 3,000 meters. The f. lilacinum form is known for its striking lilac-colored flowers, which bloom in early spring. Due to its limited natural range, it is considered a rare and valuable species in botanical collections.",
    "distribution_introduced_art_desc": "Abeliophyllum distichum f. lilacinum was mainly introduced to ornamental horticulture and landscape design due to its attractive, fragrant flowers and compact growth habit. It is commonly cultivated in gardens and as a container plant because of its adaptability to various soil types and mild climates. This cultivar is valued for its early spring blooming period, which adds color to gardens when few other plants are in flower. It is often used in mixed borders, rock gardens, and as a specimen plant in smaller spaces. However, it is important to note that it may spread aggressively in certain conditions, requiring careful management in naturalized settings."
}
