{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot subsp. tetraphyllus",
    "plant_slug": "abelmoschus-manihot-subsp-tetraphyllus",
    "plant_name_scientific": "abelmoschus manihot subsp. tetraphyllus",
    "intro": "Abelmoschus manihot subsp. tetraphyllus, commonly known as the African eggplant, is a flowering plant native to tropical Africa. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its rough, hairy stems and alternate leaves. The plant produces yellow flowers that develop into fleshy, egg-shaped fruits containing numerous seeds. It is adapted to arid and semi-arid environments, making it a resilient crop in regions with limited water resources. The subspecies is closely related to the okra species but differs in its growth habits and fruit structure.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus manihot"
    },
    "taxonomy_art_desc": "Abelmoschus manihot subsp. tetraphyllus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cell structures and chloroplasts. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms, often with showy flowers and a wide range of growth forms. Its order is Malvales, which includes plants such as cotton and hibiscus, characterized by their floral structures and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often fibrous or spongy tissues. Its genus is Abelmoschus, a group of flowering plants native to Africa and Asia, known for their edible seeds and use in traditional medicine. Its species is Abelmoschus manihot, a plant commonly known as the African breadfruit, which is cultivated for its starchy roots and has several subspecies, including subsp. tetraphyllus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bismarck Archipelago",
        "China South-Central",
        "East Himalaya",
        "India",
        "Jawa",
        "Lesser Sunda Is.",
        "Maluku",
        "Myanmar",
        "New Guinea",
        "Pakistan",
        "Philippines",
        "Queensland",
        "Sulawesi"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus manihot subsp. tetraphyllus is primarily native to the Bismarck Archipelago, China South-Central, East Himalaya, India, Jawa, Lesser Sunda Is., Maluku, Myanmar, New Guinea, Pakistan, Philippines, Queensland, and Sulawesi. This subspecies is found across a wide geographic range spanning Southeast Asia, the Indian subcontinent, and parts of the Pacific Islands. It thrives in tropical and subtropical climates, often growing in moist, well-drained soils. The plant is commonly associated with wetland and riparian habitats. Its native distribution reflects its adaptability to diverse ecological conditions within these regions.",
    "distribution_introduced_art_desc": "Abelmoschus manihot subsp. tetraphyllus was mainly introduced to regions where its drought-resistant properties make it valuable for food security and soil stabilization. It is commonly found in tropical and subtropical areas, particularly in parts of Africa, Southeast Asia, and the Caribbean. This subspecies is often cultivated for its starchy roots, which are used as a staple food in many communities. Its introduction has also contributed to agricultural biodiversity and provided alternative crops in areas affected by climate change. However, its spread has raised concerns about potential ecological impacts in non-native environments."
}
