{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia adenotricha",
    "plant_slug": "abelia-adenotricha",
    "plant_name_scientific": "abelia adenotricha",
    "intro": "Abelia adenotricha, commonly known as the silky abelia, is a deciduous shrub native to the southeastern United States. It is characterized by its narrow, upright growth habit and its clusters of fragrant, white to pale pink flowers that bloom in late spring to early summer. The leaves are opposite, ovate, and have a soft, velvety texture, which contributes to its ornamental appeal. It thrives in partial to full sun and prefers well-drained, acidic soils. This plant is often used in gardens for its attractive foliage and long-lasting floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia adenotricha is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in moist, well-drained soils and is commonly found in wetlands, swamps, and along riverbanks. This shrub is adapted to the humid climate and often grows in areas with partial to full sunlight. It is an important plant in local ecosystems, providing habitat and nectar for various wildlife species. Its native range is limited, making it a regionally significant species in the southeastern U.S.",
    "distribution_introduced_art_desc": "Abelia adenotricha was mainly introduced to the southeastern United States as an ornamental plant due to its attractive foliage and showy flowers. It has been widely cultivated in gardens and landscapes for its hardiness and adaptability to various soil types. However, it has also become invasive in some regions, outcompeting native vegetation and altering local ecosystems. Its rapid spread has led to concerns among conservationists and land managers. Efforts are being made to control its spread and prevent further ecological disruption."
}
