{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia integerrima",
    "plant_slug": "abelia-integerrima",
    "plant_name_scientific": "abelia integerrima",
    "intro": "Abelia integerrima, commonly known as the smooth abelia, is a deciduous shrub native to eastern North America. It features attractive, fragrant, tubular flowers that bloom in late summer, typically in shades of pink and white. The plant has smooth, glossy leaves that provide ornamental value throughout the growing season. It thrives in partial shade to full sun and prefers moist, well-drained soil. Abelia integerrima is valued for its hardiness and ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia integerrima is primarily native to eastern and southern China, including regions such as Hubei, Sichuan, and Yunnan. It thrives in moist, shaded environments within mountainous areas and is commonly found in forests and along stream banks. This plant is well adapted to the humid climate and fertile soils of these regions. It is also occasionally found in parts of northern Vietnam and southern Korea. Abelia integerrima is valued for its ornamental flowers and is sometimes cultivated in gardens outside its native range.",
    "distribution_introduced_art_desc": "Abelia integerrima was mainly introduced to the southeastern United States, where it has become naturalized in moist, shaded areas. It is commonly found in the Carolinas, Georgia, and Florida, thriving in woodland and along stream banks. The plant is valued for its fragrant white flowers and its ability to tolerate partial shade. It has been used in ornamental landscaping due to its attractive appearance and hardiness. However, it is sometimes considered invasive in certain regions due to its rapid spread."
}
