{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus warreensis",
    "plant_slug": "abelmoschus-warreensis",
    "plant_name_scientific": "abelmoschus warreensis",
    "intro": "Abelmoschus warreensis, commonly known as the Warre's okra, is a flowering plant native to tropical and subtropical regions of Africa. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant produces capsule fruits that contain numerous seeds, and its flowers are typically yellow or orange with five petals. It thrives in warm climates with well-drained soil and requires a long growing season. The leaves are large, heart-shaped, and often have a velvety texture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus warreensis is primarily native to the tropical regions of Africa, particularly in countries such as Ghana, Nigeria, and Sudan. It thrives in warm, humid climates with well-drained soils, often found in savanna and forest margins. This plant is commonly associated with agricultural areas where it is cultivated for its edible seeds and fibrous stems. Its natural habitat includes both wild and cultivated environments across sub-Saharan Africa. It plays a significant role in local agriculture and traditional practices in these regions.",
    "distribution_introduced_art_desc": "Abelmoschus warreensis was mainly introduced to the African continent, particularly in regions with tropical and subtropical climates. It is commonly found in countries such as Sudan, Ethiopia, and parts of East Africa. The plant is valued for its edible pods, which are similar to okra and used in local cuisines. It thrives in well-drained soils and requires a warm climate with adequate rainfall. Its introduction has contributed to agricultural diversity and food security in these regions."
}
