{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia macrotera var. mairei",
    "plant_slug": "abelia-macrotera-var-mairei",
    "plant_name_scientific": "abelia macrotera var. mairei",
    "intro": "Abelia macrotera var. mairei, commonly known as Maire's abelia, is a compact, deciduous shrub native to China. It features fragrant, tubular flowers that range from white to pink, blooming in late summer. The plant has narrow, lance-shaped leaves that are dark green and slightly hairy. It thrives in partial shade to full sun and well-drained soil, making it suitable for garden borders or containers. Its ornamental value is enhanced by its attractive foliage and long-lasting blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia macrotera"
    },
    "taxonomy_art_desc": "Abelia macrotera var. mairei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Dipsacales, which consists of flowering plants often with opposite leaves and showy flowers. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with fragrant flowers. Its genus is Abelia, a group of flowering shrubs known for their showy, clustered flowers and often used in ornamental horticulture. Its species is Abelia macrotera, a specific type of Abelia known for its large, showy flowers and is a variant of Abelia macrotera var. mairei.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia macrotera var. mairei is primarily native to China South-Central. This plant is found in the mountainous regions of central China, including provinces such as Hunan, Hubei, and Guizhou. It thrives in humid, temperate climates with well-drained soil. The variety is known for its ornamental value, featuring clusters of fragrant white flowers. It is commonly found in forests and along stream banks in its native habitat.",
    "distribution_introduced_art_desc": "Abelia macrotera var. mairei was mainly introduced to enhance ornamental value in gardens and landscaping due to its attractive foliage and flowering habits. It is commonly found in regions with temperate climates where it thrives in partial shade to full sun conditions. This variety is prized for its compact growth and ability to adapt to various soil types, making it a versatile choice for gardeners. It has been widely cultivated in the Pacific Northwest and other regions with similar climates. However, it is important to note that it may naturalize in certain areas, requiring careful management to prevent unintended spread."
}
