{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot var. dissecta",
    "plant_slug": "abelmoschus-manihot-var-dissecta",
    "plant_name_scientific": "abelmoschus manihot var. dissecta",
    "intro": "Abelmoschus manihot var. dissecta, commonly known as the African arrowroot or telfairia, is a variant of the okra plant native to tropical Africa. It is characterized by its finely dissected leaves that give it a fern-like appearance, and its pale yellow flowers that bloom in clusters. The plant produces edible, starchy tuberous roots that are used as a food source in various cultures. It thrives in warm, humid climates and is often cultivated for its nutritional value and adaptability to different soil types. Its botanical features make it both an ornamental and a useful crop in agricultural systems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus manihot var. dissecta is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Sudan. It is also found in parts of southern and eastern Africa, including Kenya and Tanzania. This variant of the abelmoschus plant is commonly grown as a root crop for its starchy tubers. It thrives in warm climates with well-drained soils and is often cultivated for both subsistence and commercial purposes. The plant's native distribution reflects its adaptation to the diverse ecological conditions of sub-Saharan Africa.",
    "distribution_introduced_art_desc": "Abelmoschus manihot var. dissecta was mainly introduced to regions with tropical and subtropical climates where it can thrive in warm, humid conditions. It is commonly found in parts of Africa, Southeast Asia, and the Caribbean, where it is cultivated for its edible roots and ornamental value. This plant has been introduced to various parts of the world as a potential crop for food security and economic development. Its introduction has sometimes led to competition with native species, raising concerns about its ecological impact. Despite its benefits, careful management is needed to prevent its spread into natural habitats."
}
