{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia chinensis var. hanceana",
    "plant_slug": "abelia-chinensis-var-hanceana",
    "plant_name_scientific": "abelia chinensis var. hanceana",
    "intro": "Abelia chinensis var. hanceana, commonly known as the Hance's abelia, is a deciduous shrub native to China. It is characterized by its slender, arching stems and clusters of fragrant, white to pinkish flowers that bloom in late summer. The leaves are opposite, ovate, and have a glossy green upper surface with a lighter underside. It prefers well-drained soil and partial to full sun, making it a popular choice for garden landscapes. This variety is noted for its ornamental value and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia chinensis"
    },
    "taxonomy_art_desc": "Abelia chinensis var. hanceana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often having spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in temperate regions. Its order is Dipsacales, which includes flowering plants with usually opposite leaves and often showy inflorescences. Its family is Caprifoliaceae, commonly known as the honeysuckle family, characterized by opposite leaves and often fragrant flowers. Its genus is Abelia, a group of shrubs known for their ornamental value and showy, clustered flowers. Its species is Abelia chinensis, a specific type of shrub native to China, known for its attractive, fragrant flowers and adaptability to various growing conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia chinensis var. hanceana is primarily native to China Southeast. This variant of Abelia chinensis is found in the southern regions of China, particularly in provinces such as Guangdong, Guangxi, and Fujian. It thrives in humid, subtropical climates with well-drained soil. The plant is commonly found in forest understories and along stream banks. Its native distribution reflects its adaptation to the diverse ecosystems of southeastern China.",
    "distribution_introduced_art_desc": "Abelia chinensis var. hanceana was mainly introduced to the United States as an ornamental plant due to its attractive foliage and flowers. It is commonly found in gardens and landscapes in the southeastern and mid-Atlantic regions. This plant prefers well-drained soil and partial to full sun, making it adaptable to various garden settings. It has been used in both residential and public landscaping for its aesthetic value. However, it is important to note that it may spread aggressively in some environments if not properly managed."
}
