{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelemis petiolaris",
    "plant_slug": "abelemis-petiolaris",
    "plant_name_scientific": "abelemis petiolaris",
    "intro": "Abelemis petiolaris, commonly known as the slender-stemmed mistletoe, is a hemiparasitic plant that grows on the branches of host trees. It belongs to the family Viscaraceae and is characterized by its small, leathery leaves and clusters of white flowers. The plant produces small, fleshy berries that are a source of food for various bird species. It is typically found in tropical and subtropical regions, where it thrives in humid, shaded environments. Its parasitic nature allows it to draw water and nutrients from its host, while still performing photosynthesis.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelemis petiolaris is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid, shaded environments with well-drained soil. It is often associated with understory vegetation in tropical forests. Its distribution is limited to these specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Abelemis petiolaris was mainly introduced to control invasive plant species in agricultural areas. It is commonly used in regions where its native habitat includes disturbed soils and open habitats. The plant is known for its ability to thrive in poor soil conditions and its rapid growth rate. It has been introduced to several countries in the Pacific Islands and parts of Southeast Asia. However, its introduction has raised concerns about its potential to become an invasive species in new environments."
}
