{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia biflora var. coreana",
    "plant_slug": "abelia-biflora-var-coreana",
    "plant_name_scientific": "abelia biflora var. coreana",
    "intro": "Abelia biflora var. coreana, commonly known as the Korean abelia, is a deciduous shrub native to Korea. It features lance-shaped leaves that are dark green on top and lighter underneath. The plant produces clusters of fragrant, white to pinkish flowers in the summer. It thrives in partial shade to full sun and prefers well-drained soil. This variety is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia biflora var. coreana is primarily native to Korea. It is found in the mountainous regions of the Korean Peninsula, including both North and South Korea. This plant typically grows in woodland areas and rocky slopes at elevations ranging from 500 to 1,500 meters. It is a rare and endemic variant within the Abelia genus. Its natural habitat is characterized by cool, moist climates and well-drained soils.",
    "distribution_introduced_art_desc": "Abelia biflora var. coreana was mainly introduced to the United States as an ornamental plant due to its attractive white and pink flowers and compact growth habit. It is commonly found in gardens and landscapes in the southeastern United States, where it thrives in partial shade to full sun. This variety is often used in native plant gardens because it is relatively drought-tolerant and adaptable to various soil types. However, it has also been reported to naturalize in some areas, raising concerns about its potential invasiveness. Despite its ornamental value, its ecological impact remains a topic of ongoing study."
}
