{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia serrata f. obspathulata",
    "plant_slug": "abelia-serrata-f-obspathulata",
    "plant_name_scientific": "abelia serrata f. obspathulata",
    "intro": "Abelia serrata f. obspathulata, commonly known as the narrow-leaf abelia, is a compact, evergreen shrub native to China. It features small, ovate leaves that are serrated along the edges, giving it a distinctive texture. The plant produces clusters of fragrant, white to pinkish flowers in late spring to early summer. It thrives in partial shade to full sun and prefers well-drained soil. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Diabelia",
        "species": "Diabelia serrata"
    },
    "taxonomy_art_desc": "Abelia serrata f. obspathulata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Dipsacales, which consists of flowering plants with showy inflorescences, often found in temperate regions. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with fragrant flowers. Its genus is Diabelia, a small genus of flowering plants native to southern Africa, known for its ornamental value. Its species is Diabelia serrata, a specific plant within the genus Diabelia, characterized by its distinctive leaf shape and flowering habits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia serrata f. obspathulata is primarily native to Japan. This cultivar is found in various regions of Japan, including Honshu, Kyushu, and Shikoku. It thrives in temperate climates and is commonly found in woodland areas and along forest edges. The plant is well adapted to the moist, shaded environments of its native habitat. It is valued for its ornamental qualities and is often used in horticultural settings.",
    "distribution_introduced_art_desc": "Abelia serrata f. obspathulata was mainly introduced to enhance ornamental value in gardens and landscapes due to its attractive foliage and flowering characteristics. It is commonly found in regions with temperate climates where it thrives in partial shade to full sun conditions. This cultivar is valued for its compact growth habit and unique, elongated leaves that add visual interest. It has been widely cultivated in horticultural settings across North America and Europe. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
