{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus fusiformis",
    "plant_slug": "abelmoschus-fusiformis",
    "plant_name_scientific": "abelmoschus fusiformis",
    "intro": "Abelmoschus fusiformis, commonly known as the spindle gourds, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its slender, elongated fruits that resemble spindle shapes, hence its common name. The leaves are typically heart-shaped and have a hairy texture. It is often cultivated for its edible fruits and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus fusiformis is primarily native to tropical and subtropical regions of Africa, including countries such as Sudan, Ethiopia, and Kenya. It is also found in parts of southern Arabia and the Indian subcontinent. This species thrives in warm climates with well-drained soils and is commonly found in dry, open habitats. It is often associated with disturbed areas and can be seen growing along roadsides and in agricultural fields. The plant is known for its distinctive, elongated capsule fruits and is sometimes cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Abelmoschus fusiformis was mainly introduced to new regions as a potential crop for its edible seeds and ornamental value. It is commonly found in tropical and subtropical areas where it thrives in warm, humid climates. The plant has been introduced to several countries in Southeast Asia, Africa, and parts of the Americas. Its introduction has raised concerns about its potential to become an invasive species in non-native habitats. Proper management is essential to prevent ecological disruption in these regions."
}
