{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus aculeatus",
    "plant_slug": "abelmoschus-aculeatus",
    "plant_name_scientific": "abelmoschus aculeatus",
    "intro": "Abelmoschus aculeatus, commonly known as the spiny hibiscus, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family and is characterized by its rough, spiny stems and large, showy flowers. The plant produces capsule fruits that contain numerous seeds, which are dispersed by wind or animals. Its leaves are palmately lobed and often covered in fine hairs, contributing to its distinctive appearance. Abelmoschus aculeatus is also valued for its ornamental qualities and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus aculeatus is primarily native to tropical and subtropical regions of Asia, including India, China, and Southeast Asia. It thrives in warm climates with well-drained soils and is commonly found in areas with a monsoonal rainfall pattern. This plant is often associated with agricultural landscapes and can be found growing wild or cultivated in rural areas. It is particularly common in regions of India such as the Gangetic plains and southern states. Its native range also extends to parts of Africa and the Pacific Islands, where it has been introduced and naturalized.",
    "distribution_introduced_art_desc": "Abelmoschus aculeatus was mainly introduced to tropical and subtropical regions for its ornamental value and potential as a vegetable crop. It is commonly found in countries such as India, China, and parts of Africa where it thrives in warm climates. The plant is valued for its spiny leaves and edible pods, which are used in local cuisines. Its introduction has also been linked to horticultural trade and botanical gardens. However, it is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation."
}
