{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus laxiflorus",
    "plant_slug": "abelmoschus-laxiflorus",
    "plant_name_scientific": "abelmoschus laxiflorus",
    "intro": "Abelmoschus laxiflorus, commonly known as the slender hibiscus, is a flowering plant native to tropical and subtropical regions of Africa, Asia, and Australia. It belongs to the Malvaceae family, which includes hibiscus and cotton plants. The plant is characterized by its large, showy flowers that typically range in color from yellow to orange, with five petals and a prominent central stigma. Its leaves are broadly ovate with a rough texture, and it produces capsule fruits containing numerous seeds. Abelmoschus laxiflorus is often cultivated for its ornamental value and has been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus laxiflorus is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Malaysia. It thrives in warm climates with well-drained soil and is commonly found in areas with seasonal rainfall. This plant is often associated with wetlands, riverbanks, and disturbed habitats where it can spread easily. Its native range extends across parts of Africa and the Pacific Islands as well. It is known for its large, showy flowers and has been used in traditional medicine in some regions.",
    "distribution_introduced_art_desc": "Abelmoschus laxiflorus was mainly introduced to areas where it can thrive in warm, tropical climates with well-drained soil. It is commonly found in regions of Southeast Asia, including parts of India, Indonesia, and the Philippines. The plant is often cultivated for its ornamental value due to its showy yellow flowers. It has also been introduced to some parts of Africa and the Caribbean as a decorative species. However, its spread is limited compared to other members of the Malvaceae family."
}
