{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus vrieseanus",
    "plant_slug": "abelmoschus-vrieseanus",
    "plant_name_scientific": "abelmoschus vrieseanus",
    "intro": "Abelmoschus vrieseanus, commonly known as the African okra, is a flowering plant native to tropical Africa. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant is characterized by its large, palmately lobed leaves and showy, yellow flowers with prominent stamens. Its fruit is a capsule that splits open to release seeds, and it is often cultivated for its ornamental value. The plant thrives in warm, humid climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus vrieseanus is primarily native to tropical and subtropical regions of Asia, including India, Sri Lanka, and parts of Southeast Asia. It is commonly found in countries such as Thailand, Indonesia, and the Philippines. This plant thrives in humid climates with well-drained soil, often growing in open areas or along riverbanks. It is also known to occur in parts of Africa, particularly in regions with similar environmental conditions. Its native range extends to some islands in the Pacific Ocean as well.",
    "distribution_introduced_art_desc": "Abelmoschus vrieseanus was mainly introduced to the Pacific Islands, particularly in regions like Hawaii and the Mariana Islands. It was brought there as an ornamental plant due to its attractive yellow flowers and unique foliage. The introduction occurred during the 19th century through horticultural trade and botanical exploration. It has since become naturalized in some areas, thriving in tropical and subtropical climates. However, its spread has been limited compared to other introduced species in these regions."
}
