{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus theiodes",
    "plant_slug": "abelmoschus-theiodes",
    "plant_name_scientific": "abelmoschus theiodes",
    "intro": "Abelmoschus theiodes, commonly known as the Indian okra or velvetleaf, is a herbaceous annual plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant is characterized by its large, heart-shaped leaves and yellow flowers that bloom in clusters. Its fruit is a capsule that contains numerous seeds, and the plant is often cultivated for its edible seeds and ornamental value. Abelmoschus theiodes is also known for its ability to thrive in a variety of soil types and its resilience to drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus theiodes is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Southeast Asia. It thrives in warm climates with well-drained soils and is commonly found in open fields and along riverbanks. This plant is also present in parts of Africa and the Pacific Islands, where it has been introduced for its ornamental and medicinal uses. It is often cultivated for its edible seeds and as a decorative plant due to its vibrant flowers. Its natural range reflects its adaptability to diverse environmental conditions within its native habitat.",
    "distribution_introduced_art_desc": "Abelmoschus theiodes was mainly introduced to control weed competition in agricultural fields. It is commonly used as a cover crop to suppress weeds and improve soil structure. This plant is native to Africa but has been introduced to various regions for its ecological and agricultural benefits. It thrives in warm climates and is often planted in rotation with other crops. Its introduction has helped reduce the need for chemical herbicides in some farming systems."
}
