{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus panduriformis",
    "plant_slug": "abelmoschus-panduriformis",
    "plant_name_scientific": "abelmoschus panduriformis",
    "intro": "Abelmoschus panduriformis, commonly known as the African okra or Indian okra, is a flowering plant in the Malvaceae family. It is native to tropical and subtropical regions of Africa and Asia. The plant is characterized by its large, palmately lobed leaves and showy, yellow flowers. Its fruit is a capsule that contains numerous seeds, and it is often cultivated for its edible pods. The plant thrives in warm climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus panduriformis is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and parts of Southeast Asia. It is commonly found in areas with warm climates and well-drained soils. This plant thrives in open fields and along riverbanks where it can receive ample sunlight. It is often associated with agricultural landscapes and can be found in both wild and cultivated environments. Its native range extends to regions with a humid climate and seasonal rainfall patterns.",
    "distribution_introduced_art_desc": "Abelmoschus panduriformis was mainly introduced to tropical and subtropical regions for its ornamental value and potential agricultural use. It is commonly found in areas with warm climates, including parts of Southeast Asia, Africa, and the Caribbean. The plant's unique leaf shape and ability to thrive in diverse soil conditions contribute to its introduction in new environments. However, it is important to monitor its spread due to potential ecological impacts. Its introduction has also been linked to traditional medicine and culinary practices in some regions."
}
