{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia graebneriana var. deutziifolia",
    "plant_slug": "abelia-graebneriana-var-deutziifolia",
    "plant_name_scientific": "abelia graebneriana var. deutziifolia",
    "intro": "Abelia graebneriana var. deutziifolia, commonly known as the dwarf abelia or compact abelia, is a compact, shrub-like plant native to China. It features small, fragrant, white to pink flowers that bloom in late summer to early fall. The leaves are ovate to elliptic, with a glossy green surface and serrated edges. It prefers partial to full sun and well-drained soil, making it suitable for rock gardens or borders. This variety is prized for its hardiness and ornamental value in garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia graebneriana var. deutziifolia is primarily native to the mountainous regions of southern China, particularly in the provinces of Sichuan, Yunnan, and Guizhou. This variety is commonly found in humid, subtropical forests at elevations ranging from 1,000 to 2,500 meters. It thrives in well-drained soils and partial shade, often growing along stream banks or in rocky areas. The plant is known for its fragrant, white to pink flowers that bloom in late spring to early summer. It is a valued ornamental plant in its native habitat due to its attractive foliage and flowering habit.",
    "distribution_introduced_art_desc": "Abelia graebneriana var. deutziifolia was mainly introduced to the United States as an ornamental plant due to its attractive foliage and flowering habits. It is commonly found in gardens and landscapes in the southeastern region of the country. This plant is often used in mixed borders and as a shrub for its compact size and vibrant color. It prefers well-drained soil and partial to full sun, making it adaptable to various garden conditions. However, it is important to note that it may spread aggressively in some environments if not properly managed."
}
