{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus moschatus var. haenkeanus",
    "plant_slug": "abelmoschus-moschatus-var-haenkeanus",
    "plant_name_scientific": "abelmoschus moschatus var. haenkeanus",
    "intro": "Abelmoschus moschatus var. haenkeanus, commonly known as the African okra, is a variant of the okra species native to tropical Africa. It is a herbaceous annual plant characterized by its upright stems and large, heart-shaped leaves. The plant produces capsule fruits that contain numerous seeds, typical of the Malvaceae family. It thrives in warm, humid climates and requires well-drained soil for optimal growth. Its botanical features make it suitable for both ornamental and culinary purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus moschatus var. haenkeanus is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. This variant of the okra species is commonly found in tropical and subtropical regions with warm, humid climates. It thrives in areas with well-drained soil and ample sunlight, making it suitable for cultivation in coastal and lowland areas. The plant is often grown for its edible pods, which are used in various traditional cuisines. Its native distribution reflects its adaptation to the diverse ecological conditions of the region.",
    "distribution_introduced_art_desc": "Abelmoschus moschatus var. haenkeanus was mainly introduced to regions with warm, humid climates where it can thrive in tropical and subtropical environments. It is commonly found in parts of Southeast Asia, Africa, and the Caribbean, where it is cultivated for its edible seeds and ornamental value. The plant prefers well-drained soil and full sun exposure, making it suitable for both home gardens and commercial farming. Its introduction has sometimes led to it becoming an invasive species in certain areas, outcompeting native flora. Despite its potential as an invasive plant, it remains an important crop in many developing countries due to its nutritional and economic benefits."
}
