{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus genevei",
    "plant_slug": "abelmoschus-genevei",
    "plant_name_scientific": "abelmoschus genevei",
    "intro": "Abelmoschus genevei, commonly known as the African okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant produces capsule fruits that contain numerous seeds, and its leaves are alternate, ovate, and hairy. Abelmoschus genevei is often cultivated for its edible young pods, which are similar to okra but have a milder flavor. It thrives in warm climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus genevei is primarily native to southern Africa, specifically countries such as South Africa, Namibia, and Botswana. It thrives in arid and semi-arid regions, often found in rocky soils and along riverbanks. This plant is well adapted to dry climates and can survive with minimal water. It is commonly found in open grasslands and savanna environments. Its native range is limited to these specific regions in southern Africa.",
    "distribution_introduced_art_desc": "Abelmoschus genevei was mainly introduced to new agricultural regions for its potential as a vegetable crop. It is known for its edible pods, which are similar to okra but have a milder flavor. The plant has been cultivated in parts of Asia and Africa due to its adaptability to various soil types. However, its introduction has raised concerns about its potential to become an invasive species in non-native environments. Despite its benefits, careful management is required to prevent ecological disruption."
}
