{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot var. tetraphyllus",
    "plant_slug": "abelmoschus-manihot-var-tetraphyllus",
    "plant_name_scientific": "abelmoschus manihot var. tetraphyllus",
    "intro": "Abelmoschus manihot var. tetraphyllus, commonly known as the African arrowroot, is a tropical plant native to Africa. It belongs to the Malvaceae family and is characterized by its large, heart-shaped leaves and showy yellow flowers. The plant produces edible tubers that are rich in starch and used as a food source in various regions. It thrives in warm, humid climates and is often cultivated for its nutritional value. The variety tetraphyllus is distinguished by its unique leaf structure and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus manihot var. tetraphyllus is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Cameroon, and the Democratic Republic of the Congo. This variant of the abelmoschus species is commonly found in areas with warm, humid climates and well-drained soils. It is often cultivated for its starchy roots, which are used as a food source in local communities. The plant thrives in lowland areas and is adapted to grow in both wild and agricultural settings. Its native distribution reflects its historical use in traditional agriculture and cuisine across sub-Saharan Africa.",
    "distribution_introduced_art_desc": "Abelmoschus manihot var. tetraphyllus was mainly introduced to regions with warm climates and well-drained soils, where it can thrive as a tropical crop. It is commonly cultivated for its starchy roots, which are used as a food source in various parts of Africa and South America. The plant has been introduced to new areas to meet increasing demand for alternative carbohydrate sources. Its introduction has sometimes led to competition with native species, raising concerns about ecological impact. Despite this, it remains an important agricultural species in many tropical countries."
}
