{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia mosanensis",
    "plant_slug": "abelia-mosanensis",
    "plant_name_scientific": "abelia mosanensis",
    "intro": "Abelia mosanensis, commonly known as the Mosanensis abelia, is a flowering plant native to eastern China. It is a deciduous shrub that typically grows to a height of 1 to 3 meters. The plant produces clusters of fragrant, tubular flowers that range in color from white to pink, depending on the variety. Its leaves are opposite, ovate, and have a smooth texture with a slightly serrated edge. Abelia mosanensis thrives in partial shade to full sun and prefers well-drained, acidic soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia mosanensis is primarily native to Southeast Asia, specifically parts of China, Vietnam, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant thrives in areas with high humidity and well-drained soil. It is typically found in forests and along riverbanks. Its natural range includes regions with a warm climate and abundant rainfall.",
    "distribution_introduced_art_desc": "Abelia mosanensis was mainly introduced to ornamental horticulture due to its attractive flowering and adaptability to various growing conditions. It is commonly cultivated in gardens and landscapes for its clusters of fragrant, tubular flowers that bloom in late summer. The plant is native to tropical Africa but has been widely distributed in regions with warm climates, including parts of the southern United States. It thrives in well-drained soil and partial to full sun, making it a popular choice for gardeners seeking low-maintenance plants. However, its introduction has raised concerns about potential invasiveness in some non-native environments."
}
