{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia macrotera var. deutziifolia",
    "plant_slug": "abelia-macrotera-var-deutziifolia",
    "plant_name_scientific": "abelia macrotera var. deutziifolia",
    "intro": "Abelia macrotera var. deutziifolia, commonly known as the dwarf abelia, is a compact shrub native to China. It features small, oval-shaped leaves that are typically a deep green color. The plant produces clusters of fragrant, white to pale pink flowers during the summer months. It thrives in partial shade to full sun and prefers well-drained soil. This variety is prized for its ornamental value and hardy nature in garden settings.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia macrotera"
    },
    "taxonomy_art_desc": "Abelia macrotera var. deutziifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Dipsacales, which consists of flowering plants that often have opposite leaves and showy flowers, including some with tubular or clustered blooms. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with often fragrant flowers and berries. Its genus is Abelia, a group of shrubs known for their showy, often fragrant flowers and are typically found in temperate regions. Its species is Abelia macrotera, a specific type within the Abelia genus, characterized by its large, showy flowers and is a variant known as var. deutziifolia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia macrotera var. deutziifolia is primarily native to China South-Central. This variant of Abelia macrotera is found in the mountainous regions of central China. It thrives in humid climates with well-drained soil. The plant is commonly found in forests and shrublands at moderate elevations. Its native distribution is limited to specific areas within this region.",
    "distribution_introduced_art_desc": "Abelia macrotera var. deutziifolia was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils along streambanks and woodland edges. This variety is valued for its fragrant white to pink flowers and its ability to thrive in partial shade. It has been used in landscaping for its ornamental qualities and hardiness. However, it is important to monitor its spread due to its potential to naturalize in certain environments."
}
