{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia schischkinii",
    "plant_slug": "abelia-schischkinii",
    "plant_name_scientific": "abelia schischkinii",
    "intro": "Abelia schischkinii, commonly known as the Schischkin abelia, is a deciduous shrub native to China. It features showy, tubular flowers that range in color from white to pink, often with a red throat, blooming in late spring to early summer. The plant has lance-shaped leaves that are typically dark green and turn reddish in the fall. It thrives in partial to full sun and well-drained soil, making it a popular choice for gardens. Its compact growth habit and ornamental value make it suitable for borders or container gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia schischkinii is primarily native to eastern Asia, specifically China. It is found in regions such as the provinces of Heilongjiang, Jilin, and Liaoning. This plant grows in forested areas and along stream banks in its native habitat. It is known for its ornamental value and is often cultivated in gardens outside its native range. The species thrives in moist, well-drained soils and partial shade.",
    "distribution_introduced_art_desc": "Abelia schischkinii was mainly introduced to North America as an ornamental plant due to its attractive foliage and showy flowers. It is commonly found in gardens and landscaped areas, particularly in the eastern and central United States. The plant thrives in partial shade to full sun and prefers well-drained soil. It is valued for its ability to tolerate a variety of environmental conditions. However, it has also been reported as an invasive species in some regions, raising concerns about its ecological impact."
}
