{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus alboruber",
    "plant_slug": "abelmoschus-alboruber",
    "plant_name_scientific": "abelmoschus alboruber",
    "intro": "Abelmoschus alboruber, commonly known as the white-red okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family and is characterized by its hairy, spiny stems and heart-shaped leaves. The plant produces capsule fruits that contain numerous seeds, which are often used in culinary applications. Its flowers are typically yellow with a red or purple throat, adding visual appeal to gardens. Abelmoschus alboruber is valued for its edible pods, which are similar to other okra varieties in texture and flavor.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus alboruber is primarily native to tropical and subtropical regions of Asia, including parts of India, China, and Southeast Asia. It thrives in warm climates with well-drained soils and is commonly found in areas with a humid subtropical or tropical monsoon climate. This plant is often associated with regions that have a long growing season and adequate rainfall. It is typically found in open fields, along riverbanks, and in disturbed habitats. Its native range includes countries such as India, Thailand, Vietnam, and the Philippines.",
    "distribution_introduced_art_desc": "Abelmoschus alboruber was mainly introduced to regions with warm climates and well-drained soils, where it can thrive as an ornamental and potential medicinal plant. It is commonly found in parts of southern Asia, including India, Thailand, and Indonesia, where it has been cultivated for its unique flowers and medicinal properties. The plant's introduction has been driven by its ornamental value and the demand for traditional herbal remedies. It is often grown in gardens and botanical collections due to its striking appearance and adaptability. However, its spread is limited compared to other species in the Abelmoschus genus."
}
