{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata var. subtetrasepala",
    "plant_slug": "abelia-spathulata-var-subtetrasepala",
    "plant_name_scientific": "abelia spathulata var. subtetrasepala",
    "intro": "Abelia spathulata var. subtetrasepala, commonly known as the broad-leaf abelia, is a deciduous shrub native to eastern China. It features lance-shaped leaves that are typically 5 to 8 centimeters long and have a smooth, slightly glossy surface. The plant produces clusters of fragrant, white to pinkish flowers in late summer, which are borne on short pedicels. Its flowers have four sepals, giving it the specific epithet \"subtetrasepala,\" meaning \"almost four-sepaled.\" This variety is valued for its ornamental appeal and adaptability to a range of garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata var. subtetrasepala is primarily native to the southeastern United States, specifically in areas of Georgia, South Carolina, and Florida. This variant is typically found in moist, well-drained soils within woodland edges and along stream banks. It thrives in partial to full shade and is often associated with wetland or riparian habitats. The plant is known for its fragrant, white to pinkish flowers that bloom in late spring to early summer. Due to its specific habitat requirements, it is considered a relatively rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Abelia spathulata var. subtetrasepala was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and showy flowers. The distribution of this plant is primarily confined to cultivation in gardens and botanical collections. It has not become naturalized in the wild in New Zealand. However, it is occasionally found in areas where it has escaped from cultivation."
}
