{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus rhodopetalus",
    "plant_slug": "abelmoschus-rhodopetalus",
    "plant_name_scientific": "abelmoschus rhodopetalus",
    "intro": "Abelmoschus rhodopetalus, commonly known as the red lady's blush, is a flowering plant native to the Mediterranean region. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its showy, pink to red flowers that bloom in summer. Its leaves are palmately lobed and covered in fine hairs, while its stems are hairy and somewhat woody. Abelmoschus rhodopetalus is often cultivated for ornamental purposes due to its vibrant floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus rhodopetalus"
    },
    "taxonomy_art_desc": "Abelmoschus rhodopetalus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises vascular plants that include ferns and their allies, known for their spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide variety of floral structures. Its order is Malvales, which includes plants with showy flowers and often includes species that produce cotton or similar fibers. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abelmoschus, a group of flowering plants that typically have capsule fruits and are known for their economic importance, such as in the production of okra. Its species is Abelmoschus rhodopetalus, a specific type of plant within the genus Abelmoschus, characterized by its unique floral and morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cambodia",
        "China South-Central",
        "China Southeast",
        "Hainan",
        "India",
        "Jawa",
        "Laos",
        "Malaya",
        "Myanmar",
        "New Guinea",
        "Philippines",
        "Queensland",
        "Thailand",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus rhodopetalus is primarily native to Cambodia, China South-Central, China Southeast, Hainan, India, Jawa, Laos, Malaya, Myanmar, New Guinea, Philippines, Queensland, Thailand, and Vietnam. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in moist, fertile soils and is often associated with wetland or marshy habitats. The species is well-adapted to the warm and humid climates of its native range. It plays an important ecological role in its natural environment.",
    "distribution_introduced_art_desc": "Abelmoschus rhodopetalus was mainly introduced to areas with warm climates and well-drained soils, particularly in parts of Asia and the Mediterranean. It is commonly found in regions where it can thrive in full sun and has access to adequate water. This plant is often cultivated for its ornamental value due to its vibrant red flowers. It has also been introduced to some parts of the Americas as a decorative species. However, its spread is limited by its preference for specific environmental conditions."
}
