{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus sharpei",
    "plant_slug": "abelmoschus-sharpei",
    "plant_name_scientific": "abelmoschus sharpei",
    "intro": "Abelmoschus sharpei, commonly known as the Chinese okra or wild okra, is a flowering plant native to Southeast Asia. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant features palmate leaves with five to seven lobes and produces yellow flowers that develop into capsule fruits. Its seeds are often used in traditional medicine and cuisine. Abelmoschus sharpei is adapted to thrive in tropical and subtropical climates with well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus sharpei is primarily native to Southeast Asia, including countries such as Vietnam, Thailand, and Malaysia. It is commonly found in tropical and subtropical regions with warm, humid climates. This plant thrives in areas with well-drained soil and abundant sunlight. It is often associated with wetlands and riverbanks, where it can access the moisture it requires. Its natural range extends into parts of southern China and the Indian subcontinent as well.",
    "distribution_introduced_art_desc": "Abelmoschus sharpei was mainly introduced to regions with warm climates and well-drained soils, particularly in tropical and subtropical areas. It is commonly found in countries such as India, China, and parts of Southeast Asia. The plant is valued for its edible seeds and ornamental flowers, which contribute to its cultivation in both agricultural and horticultural settings. Its introduction has been driven by its adaptability and economic importance in local food systems. However, it is important to monitor its spread to prevent potential ecological impacts in new environments."
}
