{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia buddleioides var. stenantha",
    "plant_slug": "abelia-buddleioides-var-stenantha",
    "plant_name_scientific": "abelia buddleioides var. stenantha",
    "intro": "Abelia buddleioides var. stenantha, commonly known as the narrow-leaved abelia, is a deciduous shrub native to China. It features small, fragrant, white to pinkish flowers that bloom in late spring to early summer. The plant has narrow, elliptical leaves that are often covered in fine hairs. It prefers well-drained soil and partial to full sun, making it suitable for gardens in temperate climates. Its compact growth habit and ornamental flowers make it a popular choice for ornamental landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia buddleioides var. stenantha is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in moist, well-drained soils along stream banks, swamps, and other wetland habitats. This variety is known for its compact growth habit and showy white to pinkish flowers that bloom in the summer. It thrives in partial to full sun and is often used in native plant gardens for its ornamental value. Due to its specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abelia buddleioides var. stenantha was mainly introduced to the United States as an ornamental plant due to its attractive foliage and showy flowers. It is commonly found in gardens and landscapes in the southeastern region of the country. The plant is often cultivated for its ability to thrive in partial shade and its resistance to pests and diseases. It has become naturalized in some areas, leading to concerns about its potential invasiveness. Despite its popularity, its ecological impact remains a topic of ongoing study."
}
