{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus moschatus subsp. moschatus",
    "plant_slug": "abelmoschus-moschatus-subsp-moschatus",
    "plant_name_scientific": "abelmoschus moschatus subsp. moschatus",
    "intro": "Abelmoschus moschatus subsp. moschatus, commonly known as the musk okra, is a flowering plant in the mallow family. It is native to tropical and subtropical regions of Africa and Asia. The plant produces capsule fruits that contain numerous edible, fibrous seeds. Its leaves are palmately lobed and covered in fine hairs, while the flowers are yellow with five petals. It thrives in warm climates and is often cultivated for its seeds and as a ornamental plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus moschatus"
    },
    "taxonomy_art_desc": "Abelmoschus moschatus subsp. moschatus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their unique vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their complex floral structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include species like cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with velvety leaves and showy flowers. Its genus is Abelmoschus, a group of flowering plants native to tropical and subtropical regions, known for their edible and ornamental uses. Its species is Abelmoschus moschatus, a specific variety within the genus Abelmoschus that is notable for its use in traditional medicine and as a source of essential oils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "Bangladesh",
        "Borneo",
        "Cambodia",
        "China South-Central",
        "China Southeast",
        "Hainan",
        "India",
        "Jawa",
        "Laos",
        "Lesser Sunda Is.",
        "Malaya",
        "Maluku",
        "Myanmar",
        "New Guinea",
        "Philippines",
        "Sulawesi",
        "Sumatera",
        "Taiwan",
        "Thailand",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [
        "Aldabra",
        "Andaman Is.",
        "Angola",
        "Belize",
        "Benin",
        "Burkina",
        "Cabinda",
        "Cameroon",
        "Caroline Is.",
        "Cook Is.",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "DR Congo",
        "Ecuador",
        "El Salvador",
        "Fiji",
        "Ghana",
        "Guatemala",
        "Guinea",
        "Gulf of Guinea Is.",
        "Haiti",
        "Hawaii",
        "Honduras",
        "Ivory Coast",
        "Jamaica",
        "Kazan-retto",
        "Leeward Is.",
        "Liberia",
        "Maldives",
        "Marianas",
        "Mauritania",
        "Mexico Central",
        "Mexico Southwest",
        "Nansei-shoto",
        "New Caledonia",
        "Nigeria",
        "Niue",
        "Ogasawara-shoto",
        "Peru",
        "Puerto Rico",
        "Samoa",
        "Santa Cruz Is.",
        "Senegal",
        "Seychelles",
        "Sierra Leone",
        "Society Is.",
        "Solomon Is.",
        "Sri Lanka",
        "Tanzania",
        "Tonga",
        "Trinidad-Tobago",
        "Tuamotu",
        "Tubuai Is.",
        "Vanuatu",
        "Venezuela",
        "Wallis-Futuna Is.",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abelmoschus moschatus subsp. moschatus is primarily native to Assam, Bangladesh, Borneo, Cambodia, China South-Central, China Southeast, Hainan, India, Jawa, Laos, Lesser Sunda Is., Malaya, Maluku, Myanmar, New Guinea, Philippines, Sulawesi, Sumatera, Taiwan, Thailand, Vietnam, and West Himalaya. This species is commonly found in tropical and subtropical regions, often growing in moist, fertile soils. It is typically associated with riverine and coastal areas, as well as cultivated fields in its native range. The plant is known for its distinctive scent and is used in traditional medicine and as a vegetable in various cuisines. Its wide distribution across Southeast Asia and parts of South and East Asia reflects its adaptability to diverse environmental conditions.",
    "distribution_introduced_art_desc": "Abelmoschus moschatus subsp. moschatus was mainly introduced to a wide range of tropical and subtropical regions across the globe, including Aldabra, Andaman Is., Angola, Belize, Benin, Burkina, Cabinda, Cameroon, Caroline Is., Cook Is., Costa Rica, Cuba, Dominican Republic, DR Congo, Ecuador, El Salvador, Fiji, Ghana, Guatemala, Guinea, Gulf of Guinea Is., Haiti, Hawaii, Honduras, Ivory Coast, Jamaica, Kazan-retto, Leeward Is., Liberia, Maldives, Marianas, Mauritania, Mexico Central, Mexico Southwest, Nansei-shoto, New Caledonia, Nigeria, Niue, Ogasawara-shoto, Peru, Puerto Rico, Samoa, Santa Cruz Is., Senegal, Seychelles, Sierra Leone, Society Is., Solomon Is., Sri Lanka, Tanzania, Tonga, Trinidad-Tobago, Tuamotu, Tubuai Is., Vanuatu, Venezuela, Wallis-Futuna Is., and Windward Is. This plant has been established in many of these locations, often as an ornamental or for its economic value. Its introduction is likely due to human activity, including trade and horticultural exchanges. It thrives in warm climates with well-drained soils, making it adaptable to various island and coastal environments. The plant's widespread distribution highlights its ecological and economic significance in these regions."
}
