{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia speciosa",
    "plant_slug": "abelia-speciosa",
    "plant_name_scientific": "abelia speciosa",
    "intro": "Abelia speciosa, commonly known as the Chinese abelia, is a deciduous shrub native to eastern Asia. It features showy, tubular flowers that range in color from white to pink, blooming in late spring to early summer. The plant has opposite, ovate leaves that are typically glossy and dark green. It prefers partial to full sun and well-drained soil, making it suitable for a variety of garden settings. Abelia speciosa is valued for its ornamental appeal and relatively low maintenance requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia speciosa is primarily native to eastern North America, including the United States and parts of Canada. It thrives in woodland habitats and along stream banks, where it benefits from partial to full shade. This shrub is commonly found in the Appalachian region, stretching from New York to Florida. It prefers moist, well-drained soils and is often seen in mixed hardwood forests. Due to its ornamental value, it has been widely cultivated outside its native range.",
    "distribution_introduced_art_desc": "Abelia speciosa was mainly introduced to ornamental horticulture due to its attractive appearance and adaptability to various garden conditions. It is commonly cultivated in temperate regions for its showy flowers and compact growth habit. The plant is often used in landscaping for borders, shrub beds, and as a foundation plant. It thrives in partial shade to full sun and requires well-drained soil. However, it has been reported as an invasive species in some areas, raising concerns about its ecological impact."
}
