{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus aquaticus",
    "plant_slug": "abelmoschus-aquaticus",
    "plant_name_scientific": "abelmoschus aquaticus",
    "intro": "Abelmoschus aquaticus, commonly known as water hibiscus, is a flowering plant native to tropical regions. It is characterized by its large, showy flowers that range in color from white to pink and red. The plant typically grows in wet environments such as marshes and along the edges of water bodies. Its leaves are heart-shaped and have a rough texture, while its stems are often hairy. The plant is known for its ability to thrive in humid conditions and is sometimes cultivated for ornamental purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus aquaticus is primarily native to Southeast Asia, including countries such as India, Bangladesh, and Thailand. It is commonly found in wetland areas, rice paddies, and along the edges of water bodies. This plant thrives in warm, humid climates and is often associated with aquatic or semi-aquatic habitats. It is also known to grow in tropical and subtropical regions of Africa and parts of southern China. Its native distribution reflects its adaptation to moist environments and its historical use in traditional medicine and agriculture.",
    "distribution_introduced_art_desc": "Abelmoschus aquaticus was mainly introduced to new environments for its potential agricultural and medicinal uses. It is known for its ability to thrive in wetland areas, making it suitable for regions with high moisture levels. The plant's introduction has raised concerns due to its potential to become invasive in non-native habitats. Its rapid growth and adaptability have led to its spread in several parts of the world. However, its ecological impact remains a subject of ongoing research and monitoring."
}
