{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata f. duplex",
    "plant_slug": "abelia-spathulata-f-duplex",
    "plant_name_scientific": "abelia spathulata f. duplex",
    "intro": "Abelia spathulata f. duplex, commonly known as the double-flowered abelia, is a compact shrub characterized by its unique foliage and floral features. It features ovate to lance-shaped leaves that are typically dark green and slightly hairy. The plant produces clusters of small, double flowers with five petals, giving it a more elaborate appearance than the typical abelia. It thrives in partial shade to full sun and prefers well-drained soil. This cultivar is prized for its ornamental value and ability to add texture and color to garden landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata f. duplex is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This plant is commonly found in wetlands, marshes, and along the edges of water bodies in these regions. It thrives in moist, acidic soils and is often associated with swampy or coastal habitats. The variety is known for its distinctive double flowers and is a popular ornamental plant in gardens. However, it is important to note that its native range is limited and it is not widely distributed beyond its natural habitat.",
    "distribution_introduced_art_desc": "Abelia spathulata f. duplex was mainly introduced to enhance ornamental value in gardens and landscapes due to its unique foliage and flowering characteristics. It is commonly found in regions with temperate climates where it thrives in partial shade to full sun. This cultivar is valued for its compact growth habit and ability to tolerate a range of soil conditions. It has been widely cultivated in the United States and parts of Europe for its aesthetic appeal. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
