{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia onkocarpa",
    "plant_slug": "abelia-onkocarpa",
    "plant_name_scientific": "abelia onkocarpa",
    "intro": "Abelia onkocarpa, commonly known as the African abelia, is a shrub native to southern Africa. It features opposite, ovate leaves that are typically dark green and have a slightly hairy texture. The plant produces clusters of small, fragrant, white to pink flowers that bloom in late summer. These flowers are followed by red, fleshy fruits that are edible for some bird species. Abelia onkocarpa is often cultivated for its ornamental value and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia onkocarpa is primarily native to the tropical regions of Central and South America. It is found in countries such as Mexico, Guatemala, Belize, Honduras, El Salvador, Nicaragua, Costa Rica, and Panama. This plant thrives in humid, lowland areas with well-drained soil and partial to full sunlight. It is commonly found in forest understories and along stream banks. Abelia onkocarpa is known for its fragrant, tubular flowers that attract pollinators like hummingbirds and bees.",
    "distribution_introduced_art_desc": "Abelia onkocarpa was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It thrives in temperate climates and is commonly found in regions with mild winters and warm summers. This plant is often cultivated for its ornamental value, particularly its showy, fragrant flowers. It has been introduced to several parts of the United States, including the Pacific Northwest and the Southeast. Due to its adaptability, it has become a popular choice for gardeners seeking a hardy, low-maintenance shrub."
}
