{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia parvifolia",
    "plant_slug": "abelia-parvifolia",
    "plant_name_scientific": "abelia parvifolia",
    "intro": "Abelia parvifolia, commonly known as the small-leaved abelia, is a deciduous shrub native to eastern North America. It features slender, arching stems and small, elliptical leaves that are typically 2-4 cm in length. The plant produces clusters of fragrant, white to pinkish flowers in the summer, which attract pollinators such as bees and butterflies. It thrives in partial shade to full sun and prefers moist, well-drained soil. Abelia parvifolia is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia parvifolia"
    },
    "taxonomy_art_desc": "Abelia parvifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some primitive seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Dipsacales, which consists of flowering plants that typically have opposite leaves and showy flowers, often found in temperate regions. Its family is Caprifoliaceae, known as the honeysuckle family, which includes shrubs and vines with fragrant flowers and often edible fruits. Its genus is Abelia, a group of flowering shrubs native to Asia and eastern North America, characterized by their showy, clustered flowers. Its species is Abelia parvifolia, a specific type of Abelia with small, white flowers and is commonly found in woodland habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia parvifolia is primarily native to China South-Central. It is found in regions such as Hubei, Sichuan, and Guizhou provinces. This plant typically grows in moist, shaded areas within forests and mountainous regions. It is well adapted to the humid and temperate climate of its native habitat. Abelia parvifolia is valued for its ornamental flowers and is sometimes cultivated in gardens outside its natural range.",
    "distribution_introduced_art_desc": "Abelia parvifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive flowering and adaptability to various soil types. It has since become naturalized in certain regions, particularly in the North Island, where it thrives in moist, well-drained soils. The plant is often found in coastal and suburban areas, where it can spread along stream banks and in disturbed habitats. Its introduction has raised concerns among conservationists due to its potential to outcompete native species in some environments. Despite its beauty, Abelia parvifolia is classified as a potential environmental weed in parts of New Zealand."
}
