{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus splendens",
    "plant_slug": "abelmoschus-splendens",
    "plant_name_scientific": "abelmoschus splendens",
    "intro": "Abelmoschus splendens, commonly known as the Malabar spinach, is a flowering plant native to tropical and subtropical regions of Asia. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant is characterized by its heart-shaped leaves and showy yellow flowers that bloom in summer. It is often cultivated for its edible leaves, which are rich in nutrients and used in various cuisines. Additionally, the plant is valued for its ornamental appeal and ability to thrive in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus splendens is primarily native to tropical and subtropical regions of Asia, including India, China, and parts of Southeast Asia. It thrives in warm climates with well-drained soil and ample sunlight. This plant is commonly found in regions with a humid climate, such as the Indian subcontinent and southern China. It is often cultivated for its ornamental value and as a source of edible seeds. Its natural range extends to parts of Africa and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abelmoschus splendens was mainly introduced to tropical and subtropical regions for its ornamental value and edible seeds. It is commonly found in parts of Asia, Africa, and the Americas where it has been cultivated for both aesthetic and agricultural purposes. The plant thrives in warm climates with well-drained soil, making it adaptable to various environments. Its introduction has sometimes led to its naturalization in areas outside its native range. This distribution highlights its importance in both horticulture and local food systems."
}
