{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus zollingeri",
    "plant_slug": "abelmoschus-zollingeri",
    "plant_name_scientific": "abelmoschus zollingeri",
    "intro": "Abelmoschus zollingeri, commonly known as the African okra, is a flowering plant native to Africa and parts of Asia. It belongs to the Malvaceae family, which includes other plants like hibiscus and cotton. The plant produces capsule fruits that contain numerous seeds, and its flowers are typically yellow or white with five petals. Abelmoschus zollingeri is often cultivated for its edible pods, which are used in various culinary traditions. It thrives in warm climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus zollingeri is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Sudan, South Sudan, and parts of East Africa. It is also found in some areas of southern Arabia and the Horn of Africa. This plant typically grows in arid or semi-arid environments, often in rocky soils or along riverbanks. It is commonly associated with dry savannas and shrublands, where it thrives in warm climates with seasonal rainfall. Its distribution is closely linked to regions with low precipitation and high temperatures.",
    "distribution_introduced_art_desc": "Abelmoschus zollingeri was mainly introduced to new environments as an ornamental plant due to its unique appearance and potential for cultivation. It has been reported in several regions outside its native range, including parts of Southeast Asia and the Pacific Islands. The plant's introduction is often associated with horticultural trade and intentional planting for aesthetic purposes. However, it has not become invasive in most areas where it has been introduced. Its distribution remains limited and primarily confined to cultivated settings."
}
