{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia triflora var. parvifolia",
    "plant_slug": "abelia-triflora-var-parvifolia",
    "plant_name_scientific": "abelia triflora var. parvifolia",
    "intro": "Abelia triflora var. parvifolia, commonly known as the small-leaved abelia, is a deciduous shrub native to eastern Asia. It features slender, arching stems with ovate, glossy, dark green leaves that are smaller than those of the typical abelia. The plant produces clusters of fragrant, tubular white flowers in the summer, which attract pollinators like bees and butterflies. It thrives in partial shade to full sun and prefers well-drained, acidic soil. This variety is valued for its ornamental appeal and adaptability in garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia triflora var. parvifolia is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variety is commonly found in moist, well-drained soils in forested areas and along stream banks. It thrives in partial to full shade and is often seen in wetlands and swampy habitats. The plant is known for its fragrant, white to pink flowers that bloom in late spring to early summer. It is a popular ornamental plant due to its attractive appearance and adaptability to various growing conditions.",
    "distribution_introduced_art_desc": "Abelia triflora var. parvifolia was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in woodland and streamside habitats. This variety is known for its compact growth and showy clusters of white flowers that bloom in late spring. It is often used in landscaping for its ornamental value and adaptability to partial shade. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation."
}
