{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia biflora",
    "plant_slug": "abelia-biflora",
    "plant_name_scientific": "abelia biflora",
    "intro": "Abelia biflora, commonly known as the twinflower abelia, is a deciduous shrub native to the southeastern United States. It features slender, arching stems with opposite, ovate to elliptical leaves that are usually dark green and slightly hairy. The plant produces clusters of small, white, bell-shaped flowers in late spring to early summer, which are borne in pairs on short pedicels. Abelia biflora thrives in partial shade to full sun and prefers moist, well-drained soil. It is valued for its ornamental appeal and ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia biflora is primarily native to eastern North America, specifically the southeastern United States. It is found in states such as Alabama, Georgia, Florida, South Carolina, and Tennessee. This plant typically grows in moist, woodland habitats and along stream banks. It thrives in partial to full shade and is often found in rich, well-drained soils. Abelia biflora is known for its showy, pinkish-white flowers that bloom in late spring to early summer.",
    "distribution_introduced_art_desc": "Abelia biflora was mainly introduced to the southeastern United States, where it has become naturalized in various habitats. It is commonly found in moist, well-drained soils along stream banks, woodland edges, and garden landscapes. This plant is known for its showy clusters of fragrant white flowers that bloom in the spring and summer. It is often cultivated for its ornamental value and ability to thrive in partial shade. However, it has also been reported to spread into natural areas, raising concerns about its potential invasive behavior in some regions."
}
