{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia myrtilloides",
    "plant_slug": "abelia-myrtilloides",
    "plant_name_scientific": "abelia myrtilloides",
    "intro": "Abelia myrtilloides, commonly known as sweetbee or bluebees, is a deciduous shrub native to the southeastern United States. It features small, fragrant, white to pale blue flowers that bloom in the summer, attracting pollinators like bees and butterflies. The plant has opposite, ovate leaves with serrated edges and produces small, dark blue berries that are edible for birds. It thrives in partial shade to full sun and prefers moist, well-drained soil. Abelia myrtilloides is often used in gardens for its ornamental value and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia myrtilloides is primarily native to the southeastern United States, specifically from North Carolina to Florida. It is commonly found in moist, well-drained soils in woodland areas and along stream banks. This plant thrives in partial to full shade and is often seen in the understory of deciduous forests. It is also native to parts of Georgia and Alabama, where it grows in similar habitats. Abelia myrtilloides is valued for its ornamental value and ability to attract pollinators.",
    "distribution_introduced_art_desc": "Abelia myrtilloides was mainly introduced to the United States as an ornamental plant due to its attractive foliage and flowering habits. It is commonly found in the southeastern region, particularly in states like Florida, Georgia, and South Carolina. This plant has been reported in both natural and disturbed habitats, including wetlands and along roadsides. Its introduction has led to concerns about its potential invasiveness in certain ecosystems. Despite its ornamental value, management strategies are being developed to control its spread in native habitats."
}
