{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus ciliaris",
    "plant_slug": "abelmoschus-ciliaris",
    "plant_name_scientific": "abelmoschus ciliaris",
    "intro": "Abelmoschus ciliaris, commonly known as okra, is an annual herbaceous plant native to Africa and widely cultivated in tropical and subtropical regions. It belongs to the Malvaceae family and is characterized by its hairy stems, lobed leaves, and distinctive capsule fruits that contain numerous seeds. The plant typically grows to a height of 1–2 meters and thrives in warm climates with well-drained soil. Its flowers are yellow and pentagonal, and the fruit, which is the edible part, develops from the flower and matures into a fibrous pod. Abelmoschus ciliaris is valued not only for its culinary uses but also for its medicinal properties and ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus ciliaris is primarily native to tropical and subtropical regions of Asia, including India, Africa, and parts of Southeast Asia. It thrives in warm climates with well-drained soils and is commonly found in areas with a monsoonal rainfall pattern. This plant is particularly adapted to growing in open fields and along the edges of cultivated lands. Its native range extends across countries such as China, Sudan, and Nigeria, where it has been traditionally used for its edible seeds and medicinal properties. It is also known as the \"Chinese okra\" and has been cultivated for centuries in these regions.",
    "distribution_introduced_art_desc": "Abelmoschus ciliaris was mainly introduced to regions with warm climates and well-drained soils, where it can thrive and produce its characteristic pods. It is commonly cultivated in parts of Asia, Africa, and the Americas for its edible seeds and nutritional value. The plant's introduction has been driven by its adaptability to various soil types and its ability to withstand drought conditions. It is also valued for its use in traditional medicine and as a source of oil. Due to its resilience and productivity, it has been introduced to many tropical and subtropical areas for agricultural purposes."
}
