{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia curviflora",
    "plant_slug": "abelia-curviflora",
    "plant_name_scientific": "abelia curviflora",
    "intro": "Abelia curviflora, commonly known as the curlyflower abelia, is a deciduous shrub native to the southeastern United States. It features slender, arching stems with opposite, ovate leaves that are dark green and slightly hairy beneath. The plant produces clusters of fragrant, tubular flowers in shades of white to pink, which bloom in late spring to early summer. Abelia curviflora thrives in partial shade to full sun and prefers well-drained, acidic soil. It is often used in gardens for its ornamental value and ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia curviflora is primarily native to the southeastern United States. It can be found in states such as Florida, Georgia, Alabama, Mississippi, and South Carolina. This plant thrives in moist, well-drained soils and is commonly found in woodlands, swamps, and along stream banks. It is known for its fragrant, tubular flowers that bloom in the summer. Abelia curviflora is a valuable addition to native gardens due to its ornamental value and ecological benefits.",
    "distribution_introduced_art_desc": "Abelia curviflora was mainly introduced to the eastern and southeastern United States as an ornamental plant due to its attractive pink flowers and hardy nature. It is commonly found in gardens, parks, and along roadsides in these regions. The plant thrives in moist, well-drained soils and partial to full sunlight. It has been reported to naturalize in some areas, leading to its classification as an invasive species in certain states. Its rapid growth and ability to spread through both seeds and rhizomes make it a concern for native plant communities."
}
