{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia occidentalis",
    "plant_slug": "abelia-occidentalis",
    "plant_name_scientific": "abelia occidentalis",
    "intro": "Abelia occidentalis, commonly known as the western abelia, is a deciduous shrub native to the eastern United States. It features attractive, fragrant, tubular flowers that range from white to pink, typically blooming in late spring to early summer. The plant has opposite, ovate leaves that are dark green on top and lighter underneath. It thrives in partial shade to full sun and prefers moist, well-drained soil. Abelia occidentalis is valued for its ornamental appeal and ability to attract pollinators like bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia occidentalis is primarily native to the western United States, including parts of California, Oregon, and Washington. It is also found in some areas of northern Baja California, Mexico. This plant typically grows in moist, well-drained soils in woodland and forested areas. It thrives in partial to full shade and is often found in coastal regions. Its native range is characterized by a temperate climate with mild winters and cool, wet summers.",
    "distribution_introduced_art_desc": "Abelia occidentalis was mainly introduced to the United States as an ornamental plant due to its attractive flowers and hardy nature. It is commonly found in gardens and landscapes across the eastern and central regions of the country. The plant thrives in well-drained soil and partial to full sunlight, making it adaptable to a variety of garden conditions. It has been widely cultivated for its showy clusters of fragrant white to pink flowers. However, it is important to note that it can sometimes become invasive in certain regions if not managed properly."
}
