{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata var. sanguinea",
    "plant_slug": "abelia-spathulata-var-sanguinea",
    "plant_name_scientific": "abelia spathulata var. sanguinea",
    "intro": "Abelia spathulata var. sanguinea, commonly known as the redleaf abelia, is a deciduous shrub native to China. It features fragrant, tubular flowers that range in color from white to pink and red, blooming in late spring to early summer. The leaves are ovate to elliptical, with a dark green upper surface and a lighter underside, and they turn red in the fall. This plant thrives in partial shade to full sun and is valued for its ornamental appeal and hardiness. It is often used in gardens for its vibrant foliage and seasonal blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata var. sanguinea is primarily native to eastern North America, specifically the southeastern United States. It is found in states such as Georgia, Florida, and South Carolina. This variety thrives in moist, acidic soils and is often associated with wetlands and swampy areas. It is commonly found in the coastal plain regions of the southeastern U.S. and is known for its vibrant red flowers. The plant is well adapted to the humid climate and can tolerate partial shade to full sun.",
    "distribution_introduced_art_desc": "Abelia spathulata var. sanguinea was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in woodland areas and along stream banks. This variety is known for its showy, red-orange flowers that bloom in late summer. It has been cultivated for its ornamental value in gardens and landscapes. However, it is considered invasive in some areas due to its rapid spread and competitive nature."
}
