{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus crinitus",
    "plant_slug": "abelmoschus-crinitus",
    "plant_name_scientific": "abelmoschus crinitus",
    "intro": "Abelmoschus crinitus, commonly known as the hairy okra or Indian velvet, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family and is characterized by its hairy, lobed leaves and showy yellow flowers. The plant produces capsule fruits that contain numerous seeds, which are often used in traditional medicine. It thrives in warm climates and is cultivated for both ornamental and culinary purposes. Its botanical features make it a distinctive member of the mallow family.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus crinitus"
    },
    "taxonomy_art_desc": "Abelmoschus crinitus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their unique vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Malvales, which includes plants such as cotton and hibiscus, characterized by their showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a variety of economic uses. Its genus is Abelmoschus, which includes species known for their large, showy flowers and often edible fruits, such as okra. Its species is Abelmoschus crinitus, a specific plant within the genus Abelmoschus known for its distinctive appearance and potential horticultural value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "Bangladesh",
        "Cambodia",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "Hainan",
        "India",
        "Jawa",
        "Laos",
        "Malaya",
        "Myanmar",
        "Nepal",
        "Pakistan",
        "Philippines",
        "Thailand",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus crinitus is primarily native to Assam, Bangladesh, Cambodia, China South-Central, China Southeast, East Himalaya, Hainan, India, Jawa, Laos, Malaya, Myanmar, Nepal, Pakistan, Philippines, Thailand, Vietnam, West Himalaya. This species is commonly found in tropical and subtropical regions across these areas. It thrives in diverse habitats including forests, grasslands, and riverbanks. The plant is known for its ornamental value and is often cultivated for its unique foliage. Its native range spans a wide geographic area in South and Southeast Asia.",
    "distribution_introduced_art_desc": "Abelmoschus crinitus was mainly introduced to new regions for its ornamental value and potential medicinal properties. It is commonly found in tropical and subtropical areas where it thrives in warm, humid climates. The plant has been spread through horticultural trade and intentional cultivation in gardens and landscapes. Its introduction has sometimes led to it becoming naturalized in certain environments. However, it is generally not considered an invasive species in most regions."
}
