{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot var. timorensis",
    "plant_slug": "abelmoschus-manihot-var-timorensis",
    "plant_name_scientific": "abelmoschus manihot var. timorensis",
    "intro": "Abelmoschus manihot var. timorensis, commonly known as Timorensis cottonwood, is a variant of the cotton plant native to Indonesia. It is characterized by its large, heart-shaped leaves and produces fluffy, white seed pods. The plant is adapted to tropical and subtropical climates, thriving in warm, humid environments. It has fibrous roots and is often cultivated for its fibers, which are used in textile production. Its botanical features make it an important species in both ecological and agricultural contexts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus manihot var. timorensis is primarily native to the islands of Timor, including both East Timor (Timor-Leste) and the western part of the island of Timor. This variant of the African marshmallow plant is found in the tropical regions of Southeast Asia, particularly in the Indonesian archipelago. It thrives in humid, tropical climates and is commonly found in lowland areas with rich, moist soils. The plant is often associated with coastal and riverine environments due to its preference for waterlogged conditions. Its native range is limited to specific regions in Indonesia, where it has adapted to the local ecological conditions over time.",
    "distribution_introduced_art_desc": "Abelmoschus manihot var. timorensis was mainly introduced to regions with tropical and subtropical climates where it can thrive in warm, humid conditions. It is commonly found in parts of Southeast Asia, including Indonesia, Malaysia, and the Philippines. This variety is valued for its high starch content and is used in traditional food preparation. It has also been introduced to some parts of Africa and the Caribbean for agricultural and nutritional purposes. Its introduction has contributed to local food security and dietary diversity in these areas."
}
