{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus moschatus var. lanyunatus",
    "plant_slug": "abelmoschus-moschatus-var-lanyunatus",
    "plant_name_scientific": "abelmoschus moschatus var. lanyunatus",
    "intro": "Abelmoschus moschatus var. lanyunatus, commonly known as the Lanyunatok okra, is a variant of the okra plant native to China. It is characterized by its slender, elongated pods that are typically green when mature. The plant belongs to the Malvaceae family and is cultivated for its edible fruits, which are used in various culinary applications. It thrives in warm climates and requires well-drained soil for optimal growth. The flowers are usually yellow with five petals, and the plant is known for its ability to produce multiple harvests throughout the growing season.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus moschatus var. lanyunatus is primarily native to southern China, particularly the Yunnan Province. This variety is known for its unique characteristics and is often found in the mountainous regions of the area. It thrives in warm and humid climates, which are typical of the region's tropical and subtropical environments. The plant is commonly cultivated for its edible parts, including the flowers and seeds. Its native distribution is closely tied to the ecological conditions of southern China.",
    "distribution_introduced_art_desc": "Abelmoschus moschatus var. lanyunatus was mainly introduced to China, where it has been cultivated for its edible seeds and ornamental value. It is commonly grown in southern regions with warm climates, particularly in provinces like Guangdong, Guangxi, and Yunnan. The plant thrives in well-drained soils and requires a long growing season to produce its characteristic yellow flowers and pods. It is often used in traditional Chinese agriculture and has gained popularity for its high oil content. Due to its adaptability, it has been introduced to other parts of Southeast Asia as well."
}
