{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia tyaihyoni var. mosanensis",
    "plant_slug": "abelia-tyaihyoni-var-mosanensis",
    "plant_name_scientific": "abelia tyaihyoni var. mosanensis",
    "intro": "Abelia tyaihyoni var. mosanensis, commonly known as the Mosanensis Abelia, is a compact, flowering shrub native to China. It features narrow, dark green leaves that are typically arranged in opposite pairs along the stems. The plant produces clusters of fragrant, white to pinkish flowers in the summer, which attract pollinators such as bees and butterflies. It thrives in partial shade to full sun and prefers well-drained, moist soil. This variety is valued for its ornamental appeal and relatively low maintenance requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia tyaihyoni var. mosanensis is primarily native to the mountainous regions of southern China, specifically in the provinces of Guangdong, Guangxi, and Yunnan. This plant thrives in humid, subtropical climates with well-drained soil. It is commonly found in forest understories and along riverbanks in its native habitat. The variety is known for its ornamental value, particularly its fragrant, white to pink flowers. Due to its restricted range, it is considered a rare and endemic species in its native region.",
    "distribution_introduced_art_desc": "Abelia tyaihyoni var. mosanensis was mainly introduced to the southeastern United States, particularly in regions with moist, well-drained soils. It thrives in partial to full shade and is often used in landscaping for its ornamental value. This variety is known for its clusters of fragrant, white to pink flowers that bloom in late spring to early summer. It is relatively drought-tolerant once established and can tolerate a range of soil types. However, it is important to monitor its spread due to its potential to become invasive in certain environments."
}
