{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus angulosus",
    "plant_slug": "abelmoschus-angulosus",
    "plant_name_scientific": "abelmoschus angulosus",
    "intro": "Abelmoschus angulosus, commonly known as the angular okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant is characterized by its angular, ridged leaves and yellow flowers that bloom in clusters. Its fruit is a spiny capsule that contains numerous seeds, which are often used in traditional medicine. Abelmoschus angulosus is valued for its ornamental appeal and has some applications in herbal remedies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus angulosus"
    },
    "taxonomy_art_desc": "Abelmoschus angulosus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which comprises flowering plants that often have showy flowers and include families such as Malvaceae, Theaceae, and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems, capsule fruits, and often showy flowers. Its genus is Abelmoschus, a group of flowering plants commonly known as okra or gumbo, characterized by their capsule fruits and fibrous pods. Its species is Abelmoschus angulosus, a specific type of okra native to Africa, known for its angular, hairy pods and use in traditional cuisine and medicine.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cambodia",
        "India",
        "Jawa",
        "Laos",
        "Pakistan",
        "Sri Lanka",
        "Sumatera",
        "Thailand",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus angulosus is primarily native to Cambodia, India, Jawa, Laos, Pakistan, Sri Lanka, Sumatera, Thailand, and Vietnam. This species is commonly found in tropical and subtropical regions across these countries. It thrives in warm climates with well-drained soil, often growing in open areas or along roadsides. The plant is known for its distinctive angular leaves and is sometimes used in traditional medicine. Its native distribution reflects its adaptation to diverse ecological conditions in South and Southeast Asia.",
    "distribution_introduced_art_desc": "Abelmoschus angulosus was mainly introduced to new regions for its potential as an ornamental plant and for its edible seeds. It has been found growing in tropical and subtropical areas, including parts of Africa, Asia, and the Americas. The plant is often cultivated for its unique triangular leaves and its ability to thrive in poor soil conditions. Its introduction has sometimes led to it becoming an invasive species in certain ecosystems. Due to its adaptability, it has spread beyond its original range in some areas."
}
