{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia angustifolia",
    "plant_slug": "abelia-angustifolia",
    "plant_name_scientific": "abelia angustifolia",
    "intro": "Abelia angustifolia, commonly known as narrowleaf abelia, is a deciduous shrub native to eastern North America. It features slender, upright stems and opposite, narrow, elliptical leaves that are typically dark green and slightly hairy. The plant produces clusters of fragrant, bell-shaped flowers in shades of pink and white during the summer months. It is well-suited for partial shade and well-drained soil, making it a popular choice for garden borders and woodland gardens. Its ornamental value comes from its showy blooms and attractive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Zabelia",
        "species": "Zabelia angustifolia"
    },
    "taxonomy_art_desc": "Abelia angustifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Dipsacales, which consists of flowering plants often with opposite leaves and showy flowers, such as honeysuckles and elderberries. Its family is Caprifoliaceae, commonly known as the honeysuckle family, characterized by opposite leaves and usually showy, fragrant flowers. Its genus is Zabelia, a small group of flowering plants native to South America, known for their ornamental value and specific habitat preferences. Its species is Zabelia angustifolia, a specific type within the genus Zabelia, distinguished by its narrow leaves and flowering habits, making it a unique and valuable plant in botanical studies.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia angustifolia is primarily native to China South-Central. It is found in regions such as Hubei, Hunan, and Sichuan provinces. This plant typically grows in moist, shaded areas within forests and along stream banks. It is well adapted to the humid climate and fertile soils of its native habitat. Abelia angustifolia is often cultivated for its ornamental value due to its attractive foliage and flowering habits.",
    "distribution_introduced_art_desc": "Abelia angustifolia was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in woodland and streamside habitats. This plant is valued for its fragrant, tubular flowers and its ability to thrive in partial shade. It has been widely cultivated in gardens and naturalized in several areas. However, it is considered invasive in some regions due to its rapid spread and competition with native vegetation."
}
