{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus quinquelobus",
    "plant_slug": "abelmoschus-quinquelobus",
    "plant_name_scientific": "abelmoschus quinquelobus",
    "intro": "Abelmoschus quinquelobus, commonly known as the five-lobed okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family and is characterized by its distinctive five-lobed leaves and spiny calyces. The plant produces capsule fruits that contain numerous seeds, which are dispersed by wind or animals. It thrives in warm climates and requires well-drained soil for optimal growth. Abelmoschus quinquelobus is often cultivated for its edible pods, which are used in various culinary traditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus quinquelobus is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Southeast Asia. It is commonly found in areas with warm climates and well-drained soils. This plant thrives in open fields and along riverbanks, often growing in association with other wild vegetation. Its natural range extends from the Indian subcontinent to parts of Africa and the Pacific Islands. It is an important species in traditional agriculture and local ecosystems.",
    "distribution_introduced_art_desc": "Abelmoschus quinquelobus was mainly introduced to regions with warm climates and well-drained soils, where it can thrive as an ornamental and potential agricultural plant. It is commonly found in the southern United States, parts of Africa, and Southeast Asia. This species is valued for its unique, lobed leaves and its potential use in traditional medicine. Its introduction has been associated with both intentional cultivation and accidental spread through trade and human activity. Due to its adaptability, it has become naturalized in several areas outside its native range."
}
