{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus angulosus var. grandiflorus",
    "plant_slug": "abelmoschus-angulosus-var-grandiflorus",
    "plant_name_scientific": "abelmoschus angulosus var. grandiflorus",
    "intro": "Abelmoschus angulosus var. grandiflorus, commonly known as the giant African eggplant, is a variant of the okra species native to Africa. It is characterized by its large, angular, green pods that can grow up to 30 centimeters in length. The plant is a herbaceous annual with a bushy growth habit and can reach heights of up to 2 meters. Its flowers are yellow with five petals and are typically borne in the axils of the leaves. The fruit, which matures to a dark purple color, is edible and commonly used in various culinary traditions across Africa and the Middle East.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus angulosus var. grandiflorus is primarily native to southern and eastern Africa, including countries such as South Africa, Kenya, Tanzania, and Mozambique. This plant is commonly found in grassland and savanna habitats, where it thrives in well-drained soils. It is often associated with disturbed areas and can be seen growing along roadsides and in open fields. The species is also cultivated in some regions for its ornamental value due to its attractive yellow flowers. Its native range extends into parts of the Arabian Peninsula as well.",
    "distribution_introduced_art_desc": "Abelmoschus angulosus var. grandiflorus was mainly introduced to areas with warm climates and well-drained soils, where it can thrive and produce its characteristic large, showy flowers. It is commonly found in regions with tropical and subtropical conditions, such as parts of Southeast Asia, Africa, and the Caribbean. This variety is often cultivated for ornamental purposes due to its vibrant blooms and unique foliage. It has also been introduced to some parts of the United States, particularly in southern states with suitable growing conditions. However, its spread is limited by its specific environmental requirements and the need for careful cultivation."
}
