{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia hirsuta",
    "plant_slug": "abelia-hirsuta",
    "plant_name_scientific": "abelia hirsuta",
    "intro": "Abelia hirsuta, commonly known as hairy abelia, is a deciduous shrub native to eastern Asia. It features slender, arching stems covered in soft, fuzzy hair, which gives it its common name. The plant produces clusters of fragrant, bell-shaped flowers in shades of white to pink, typically blooming in late spring to early summer. Its leaves are opposite, ovate, and have a slightly serrated edge. Abelia hirsuta is well-suited for partial shade and is often used in ornamental gardening for its attractive foliage and flowering display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia hirsuta is primarily native to eastern and southern China, including regions such as Guangdong, Guangxi, Hubei, and Sichuan. It is also found in parts of Southeast Asia, including Vietnam and the Philippines. This plant thrives in moist, well-drained soils and is commonly found in forested areas and mountainous regions. It is known for its clusters of fragrant, white or pink flowers that bloom in late summer. Abelia hirsuta is often cultivated for its ornamental value in gardens and landscapes.",
    "distribution_introduced_art_desc": "Abelia hirsuta was mainly introduced to the Pacific Northwest region of the United States. It has been widely cultivated in gardens and landscapes due to its ornamental value and adaptability. The plant is commonly found in moist, well-drained soils in shaded to partially sunny conditions. It has been reported as an invasive species in some areas, outcompeting native vegetation. Its distribution has expanded beyond its original range due to its hardiness and aesthetic appeal."
}
