{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia serrata f. lucida",
    "plant_slug": "abelia-serrata-f-lucida",
    "plant_name_scientific": "abelia serrata f. lucida",
    "intro": "Abelia serrata f. lucida, commonly known as the shining abelia, is a hybrid shrub characterized by its striking, glossy, dark green leaves. It produces clusters of fragrant, tubular flowers in shades of white and pink, which bloom in late spring to early summer. The plant is native to the southeastern United States and thrives in partial shade to full sun, preferring well-drained, acidic soil. It is valued for its ornamental appeal and adaptability to various garden conditions. Its compact growth habit makes it suitable for borders, hedges, or container gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia serrata f. lucida is primarily native to southern China, including regions such as Guangdong, Guangxi, and Yunnan. This plant thrives in humid, subtropical climates with well-drained soil. It is commonly found in forest understories and along riverbanks in its native habitat. The species is also occasionally reported in northern Vietnam and eastern India. Its natural distribution is closely tied to mountainous and coastal areas with mild winters and warm, wet summers.",
    "distribution_introduced_art_desc": "Abelia serrata f. lucida was mainly introduced to ornamental horticulture due to its attractive, glossy foliage and showy flowers. It is commonly cultivated in gardens and landscapes for its aesthetic value. The plant is well-suited for USDA hardiness zones 6 through 9, making it adaptable to a variety of climates. It prefers partial to full sun and well-drained soil, contributing to its popularity among gardeners. Its introduction has expanded its presence beyond its native range, enhancing biodiversity in cultivated settings."
}
