{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus brevicapsulatus",
    "plant_slug": "abelmoschus-brevicapsulatus",
    "plant_name_scientific": "abelmoschus brevicapsulatus",
    "intro": "Abelmoschus brevicapsulatus, commonly known as the small-capsuled okra, is a species of flowering plant in the mallow family. It is native to tropical and subtropical regions of Asia, particularly India. The plant produces edible capsules that contain seeds, and it is cultivated for its嫩 pods, which are used in various cuisines. It thrives in warm climates and requires well-drained soil for optimal growth. The plant also has ornamental value due to its attractive foliage and flowers.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus brevicapsulatus is primarily native to southern Africa, including countries such as South Africa, Namibia, and Botswana. It is commonly found in grasslands and open habitats where it thrives in well-drained soils. This species is adapted to arid and semi-arid climates, making it a resilient plant in regions with limited rainfall. It is often seen growing along roadsides and in disturbed areas. The plant is known for its distinctive yellow flowers and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Abelmoschus brevicapsulatus was mainly introduced to areas with warm climates and well-drained soils, where it can thrive and spread. It is commonly found in regions of Africa, Asia, and parts of the Americas where it has been cultivated for its edible seeds and ornamental value. This plant has been introduced to new environments due to human activity, including trade and agricultural expansion. Its introduction has led to its establishment in various ecosystems, sometimes becoming invasive. Proper management is necessary to prevent its spread to native habitats."
}
