{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata f. micrantha",
    "plant_slug": "abelia-spathulata-f-micrantha",
    "plant_name_scientific": "abelia spathulata f. micrantha",
    "intro": "Abelia spathulata f. micrantha, commonly known as the narrow-leaved abelia, is a compact, deciduous shrub native to China. It features small, oval-shaped leaves that are typically a dark green on top and lighter underneath. The plant produces clusters of fragrant, white to pinkish flowers in the summer, which are attractive to pollinators. It thrives in partial shade to full sun and prefers well-drained, moist soil. This cultivar is valued for its ornamental appeal and relatively low maintenance requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata f. micrantha is primarily native to the southeastern United States, specifically occurring in states such as Georgia, South Carolina, and Florida. This plant is typically found in moist, well-drained soils in woodland areas and along stream banks. It thrives in partial to full shade and is commonly associated with humid climates. The subspecies is known for its compact growth habit and showy, fragrant flowers. It is often used in native plant gardens for its ornamental value and ecological benefits.",
    "distribution_introduced_art_desc": "Abelia spathulata f. micrantha was mainly introduced to ornamental horticulture for its attractive, fragrant flowers and compact growth habit. It is commonly cultivated in gardens and landscapes in temperate regions where it thrives in partial shade to full sun. This form is valued for its smaller, more delicate blooms compared to the typical species, making it a popular choice for borders and containers. It has been widely distributed across the United States and parts of Europe due to its adaptability and aesthetic appeal. However, it is important to note that it may become invasive in certain environments if not managed properly."
}
