{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus tuberculatus",
    "plant_slug": "abelmoschus-tuberculatus",
    "plant_name_scientific": "abelmoschus tuberculatus",
    "intro": "Abelmoschus tuberculatus, commonly known as the hairy crabapple, is a species of flowering plant in the Malvaceae family. It is native to tropical and subtropical regions of Asia, including India, China, and Southeast Asia. The plant is characterized by its hairy, glandular leaves and showy, yellow or orange flowers that bloom in summer. Its fruit is a small, round capsule that turns red when mature, containing several seeds. The plant is often grown for its ornamental value and has been used in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus tuberculatus is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Southeast Asia. It is commonly found in areas with warm climates and well-drained soils. This plant thrives in open fields and along the edges of forests. It is often associated with agricultural landscapes due to its use in traditional medicine and as a food source. Its native distribution reflects its adaptability to diverse environmental conditions within its range.",
    "distribution_introduced_art_desc": "Abelmoschus tuberculatus was mainly introduced to new regions for its ornamental value and potential as a vegetable crop. It is commonly found in tropical and subtropical areas, including parts of Southeast Asia, Africa, and the Americas. The plant's introduction has been associated with horticultural trade and agricultural expansion. However, it has also raised concerns due to its potential to become invasive in certain ecosystems. Its distribution highlights the impact of human activity on plant dispersal and ecological balance."
}
