{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus todayensis",
    "plant_slug": "abelmoschus-todayensis",
    "plant_name_scientific": "abelmoschus todayensis",
    "intro": "Abelmoschus todayensis, commonly known as the Ethiopian okra, is a flowering plant native to Ethiopia. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant produces capsule fruits that contain numerous seeds, and its leaves are hairy and lobed. It thrives in warm, tropical climates and is often cultivated for its edible pods. The botanical features of Abelmoschus todayensis make it an important species in regional agriculture and biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus todayensis is primarily native to eastern Africa, specifically countries such as Kenya, Tanzania, and Uganda. It is commonly found in regions with tropical and subtropical climates, often growing in open woodlands and along riverbanks. This plant thrives in well-drained soils and is adapted to the seasonal rainfall patterns of its native habitat. It is an important component of the local flora and has been traditionally used by indigenous communities for various purposes. Its distribution is largely restricted to these geographic areas, with limited occurrences in neighboring regions.",
    "distribution_introduced_art_desc": "Abelmoschus todayensis was mainly introduced to regions with warm, humid climates where it can thrive in well-drained soils. It is commonly found in parts of Southeast Asia, including Indonesia and the Philippines, where it has been cultivated for its edible seeds and ornamental value. The plant's introduction has been driven by both agricultural interests and its adaptability to tropical environments. It has also been reported in some areas of Africa and the Caribbean, likely through trade or intentional cultivation. Despite its introduction, it remains a relatively rare species in most regions outside its native range."
}
