{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia coreana",
    "plant_slug": "abelia-coreana",
    "plant_name_scientific": "abelia coreana",
    "intro": "Abelia coreana, commonly known as Korean abelia, is a deciduous shrub native to East Asia. It features showy, tubular flowers that range from white to pink, often with a red throat, blooming in late spring to early summer. The plant has opposite, ovate to elliptical leaves that are dark green on top and lighter underneath. It thrives in partial shade to full sun and prefers well-drained soil. Abelia coreana is valued for its ornamental appeal and adaptability in garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia coreana is primarily native to southern and eastern Asia, including China, Japan, and Korea. It thrives in temperate climates and is commonly found in forested areas and along stream banks. This plant prefers partial to full shade and well-drained soil, making it a popular choice for woodland gardens. It is also known for its fragrant, tubular flowers that bloom in late spring to early summer. Abelia coreana is valued for its ornamental qualities and is often used in horticultural landscapes.",
    "distribution_introduced_art_desc": "Abelia coreana was mainly introduced to the United States as an ornamental plant due to its attractive foliage and showy flowers. It is commonly found in gardens and landscaping in regions with mild climates, such as the southeastern and western states. The plant thrives in partial shade to full sun and prefers well-drained soil. It has been widely cultivated for its ability to tolerate urban conditions and its long blooming period. However, it is considered invasive in some areas, raising concerns about its ecological impact."
}
