{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus officinalis",
    "plant_slug": "abelmoschus-officinalis",
    "plant_name_scientific": "abelmoschus officinalis",
    "intro": "Abelmoschus officinalis, commonly known as okra, is a tropical and subtropical flowering plant belonging to the Malvaceae family. It is characterized by its capsule fruit, which contains numerous fibrous seeds, and its large, palmately lobed leaves. The plant is native to Africa but is now cultivated in many warm regions around the world. Okra is valued for its edible young fruits, which are used in various cuisines, and for its medicinal properties. It thrives in well-drained soil and requires a warm climate with adequate sunlight for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus officinalis is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Africa. It thrives in warm climates with well-drained soil and is commonly found in areas with a humid climate. This plant is often cultivated for its edible seeds and is also used in traditional medicine. It is particularly common in the Indian subcontinent and parts of Southeast Asia. Its natural habitat includes open fields, riverbanks, and disturbed soils where it can spread easily.",
    "distribution_introduced_art_desc": "Abelmoschus officinalis was mainly introduced to regions with warm climates and well-drained soils, where it can thrive and produce its edible pods. It is commonly cultivated in tropical and subtropical areas for its nutritional value and use in traditional medicine. The plant is valued for its high content of vitamins and minerals, making it an important crop in many developing countries. Its introduction has helped improve food security and dietary diversity in these regions. Additionally, it is used in both culinary and medicinal applications, contributing to local economies and health practices."
}
