{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus vitifolius",
    "plant_slug": "abelmoschus-vitifolius",
    "plant_name_scientific": "abelmoschus vitifolius",
    "intro": "Abelmoschus vitifolius, commonly known as the purple leaf okra, is a herbaceous annual plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant is characterized by its heart-shaped, velvety leaves that range in color from green to purple. Its flowers are typically yellow with a red center, and it produces capsule fruits containing numerous seeds. Abelmoschus vitifolius is often cultivated for its edible pods, which are used in various cuisines.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus vitifolius is primarily native to southern and eastern Africa, including countries such as South Africa, Kenya, Tanzania, and Mozambique. It thrives in tropical and subtropical regions with warm climates and well-drained soils. This plant is commonly found in savannahs, grasslands, and along riverbanks. It is often used for its edible seeds and has cultural significance in some local communities. Its natural range extends into parts of the Arabian Peninsula as well.",
    "distribution_introduced_art_desc": "Abelmoschus vitifolius was mainly introduced to areas with warm climates and well-drained soils, where it can thrive as an ornamental and potentially medicinal plant. It is often cultivated in regions of South Asia, the Middle East, and parts of Africa due to its adaptability to tropical and subtropical environments. The plant is valued for its large, heart-shaped leaves and its potential use in traditional medicine. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems. Despite its benefits, careful management is necessary to prevent unintended ecological impacts."
}
