{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia forrestii var. forrestii",
    "plant_slug": "abelia-forrestii-var-forrestii",
    "plant_name_scientific": "abelia forrestii var. forrestii",
    "intro": "Abelia forrestii var. forrestii, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features slender, arching stems with opposite, ovate to elliptic leaves that are dark green and slightly hairy on the underside. The plant produces clusters of fragrant, white to pinkish flowers in late summer, which are borne on short pedicels. It thrives in partial shade to full sun and prefers well-drained, moist soil. This ornamental plant is valued for its attractive foliage and showy blooms, making it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia forrestii"
    },
    "taxonomy_art_desc": "Abelia forrestii var. forrestii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with simple flower structures. Its order is Dipsacales, which consists of flowering plants often with showy, clustered flowers and includes the honeysuckle family. Its family is Caprifoliaceae, known as the honeysuckle family, which includes shrubs and vines with usually fragrant flowers. Its genus is Abelia, a group of shrubs known for their showy, tubular flowers and are often used in ornamental gardening. Its species is Abelia forrestii, a specific variety native to China, characterized by its pinkish-red flowers and evergreen foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia forrestii var. forrestii is primarily native to China South-Central. This plant is found in the mountainous regions of Sichuan and Hubei provinces. It thrives in humid, temperate climates with well-drained soils. The species is commonly found in forests and rocky areas at higher elevations. It is a hardy shrub that is well adapted to the local environmental conditions.",
    "distribution_introduced_art_desc": "Abelia forrestii var. forrestii was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in partial to full shade. This plant is often used in landscaping due to its attractive pink flowers and compact growth habit. It thrives in USDA hardiness zones 5 through 8. However, it is important to monitor its spread to prevent potential invasion of native habitats."
}
