{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus acuminatus",
    "plant_slug": "abelmoschus-acuminatus",
    "plant_name_scientific": "abelmoschus acuminatus",
    "intro": "Abelmoschus acuminatus, commonly known as the slender okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant produces capsule fruits that contain edible seeds, often used in culinary applications. Its leaves are ovate and hairy, while the stems are cylindrical and green. Abelmoschus acuminatus thrives in warm climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus acuminatus is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Thailand. It is commonly found in areas with warm climates and well-drained soils. This plant thrives in open fields and along the edges of forests. It is often cultivated for its edible pods and ornamental value. Its native range extends to parts of Africa and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abelmoschus acuminatus was mainly introduced to regions with warm climates and well-drained soils, where it can thrive as an annual herb. It is commonly found in tropical and subtropical areas, particularly in parts of Asia, Africa, and the Americas. This plant is often cultivated for its edible leaves and seeds, which are used in traditional cuisines. Its introduction has sometimes led to it becoming an invasive species in certain ecosystems. Due to its adaptability, it has been spread through agricultural practices and human activity."
}
