{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus sagittifolius var. septentrionalis",
    "plant_slug": "abelmoschus-sagittifolius-var-septentrionalis",
    "plant_name_scientific": "abelmoschus sagittifolius var. septentrionalis",
    "intro": "Abelmoschus sagittifolius var. septentrionalis, commonly known as the northern okra, is a variant of the okra species native to the eastern United States. It is a warm-season herbaceous plant characterized by its heart-shaped leaves and spiny stems. The plant produces capsule fruits that contain edible seeds, similar to other okra varieties. It thrives in full sun and well-drained soil, requiring consistent moisture for optimal growth. This variety is valued for its culinary uses and adaptability to temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus sagittifolius var. septentrionalis is primarily native to the southern United States, including Texas, Oklahoma, and parts of Louisiana. This variant of the okra plant thrives in warm, humid climates and is commonly found in coastal and riverine areas. It is often associated with disturbed soils and can be found in fields, roadsides, and along streams. The plant is known for its heart-shaped leaves and edible pods, which are used in traditional cuisines. Its distribution is closely linked to the availability of water and the presence of suitable growing conditions in the southeastern region of the United States.",
    "distribution_introduced_art_desc": "Abelmoschus sagittifolius var. septentrionalis was mainly introduced to the United States as an ornamental plant due to its unique foliage and adaptability to various climates. It is commonly found in regions with mild winters and warm summers, such as California and Texas. This variety is also valued for its potential use in traditional medicine and as a source of edible seeds. Despite its introduction, it has not become invasive and remains primarily cultivated in controlled environments. Its distribution is limited to areas where it can thrive without disrupting native ecosystems."
}
