{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus hostilis",
    "plant_slug": "abelmoschus-hostilis",
    "plant_name_scientific": "abelmoschus hostilis",
    "intro": "Abelmoschus hostilis, commonly known as the wild okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. The plant produces capsule fruits that contain numerous seeds, which are dispersed by wind and animals. Its leaves are palmately lobed and often have a hairy texture. Abelmoschus hostilis is characterized by its ability to thrive in poor soil conditions and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus hostilis"
    },
    "taxonomy_art_desc": "Abelmoschus hostilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often having spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with simple flower structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include economically important species such as cotton and okra. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and capsule fruits. Its genus is Abelmoschus, a group of flowering plants that are mostly herbaceous and include species known for their edible fruits and ornamental value. Its species is Abelmoschus hostilis, a specific plant within the genus known for its spiny fruits and native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bangladesh",
        "Myanmar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus hostilis is primarily native to Bangladesh and Myanmar. It is commonly found in the tropical and subtropical regions of these countries. The plant thrives in warm, humid climates with well-drained soil. It is often cultivated for its edible seeds and oil. Its natural habitat includes lowland areas and riverine regions.",
    "distribution_introduced_art_desc": "Abelmoschus hostilis was mainly introduced to new regions for its potential agricultural value and ornamental appeal. It is commonly found in tropical and subtropical climates where it thrives in warm, humid conditions. This plant has been introduced to various parts of Southeast Asia, Africa, and the Caribbean. Its introduction has sometimes led to ecological concerns due to its invasive growth habits. Proper management is essential to prevent it from outcompeting native flora in these areas."
}
