{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia chinensis",
    "plant_slug": "abelia-chinensis",
    "plant_name_scientific": "abelia chinensis",
    "intro": "Abelia chinensis, commonly known as Chinese abelia, is a deciduous shrub native to China. It features opposite, ovate leaves that are typically dark green and have a smooth texture. The plant produces clusters of fragrant, tubular flowers that range in color from white to pink, blooming in late summer. It thrives in partial shade to full sun and prefers well-drained soil. Abelia chinensis is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia chinensis"
    },
    "taxonomy_art_desc": "Abelia chinensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and produce flowers. Its order is Dipsacales, which includes plants with opposite leaves and often showy flowers, such as honeysuckles. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with fragrant flowers. Its genus is Abelia, a group of flowering shrubs known for their showy, clustered flowers and are often used in ornamental gardening. Its species is Abelia chinensis, a specific type of Abelia native to China, known for its pink or white flowers and is commonly cultivated for its ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast",
        "Nansei-shoto",
        "Taiwan",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia chinensis is primarily native to China South-Central, China Southeast, Nansei-shoto, Taiwan, and Vietnam. This plant is commonly found in regions with temperate to subtropical climates. It thrives in moist, well-drained soils and is often seen in forest understories or along stream banks. Abelia chinensis is known for its fragrant, tubular flowers that bloom in the summer. Its natural range reflects its adaptability to diverse environmental conditions across these geographic areas.",
    "distribution_introduced_art_desc": "Abelia chinensis was mainly introduced to the southeastern United States as an ornamental plant due to its attractive foliage and showy flowers. It has been widely cultivated in gardens and landscapes for its adaptability to various soil types and climate conditions. The plant is often used in mixed borders, as a hedge, or in containers because of its compact growth habit. It prefers partial shade to full sun and is relatively drought-tolerant once established. However, it has also become naturalized in some areas, raising concerns about its potential invasive behavior."
}
