{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia splendens",
    "plant_slug": "abelia-splendens",
    "plant_name_scientific": "abelia splendens",
    "intro": "Abelia splendens, commonly known as the Chinese abelia, is a deciduous shrub native to eastern Asia. It features clusters of fragrant, tubular flowers that range in color from white to pink, depending on the cultivar. The plant has opposite, ovate leaves that are typically dark green and glossy. It thrives in partial shade to full sun and prefers well-drained, acidic soil. Abelia splendens is valued for its ornamental appeal and ability to attract pollinators like bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia splendens is primarily native to the southeastern United States, including states such as Georgia, Florida, South Carolina, and Alabama. It thrives in woodland edges, moist soils, and partial shade environments. This plant is commonly found in the Appalachian region and along the Atlantic Coastal Plain. It is well adapted to the humid climate and is often used in landscaping for its ornamental value. Abelia splendens is also found in parts of Mexico, where it grows in similar ecological conditions.",
    "distribution_introduced_art_desc": "Abelia splendens was mainly introduced to the eastern and southern regions of the United States. It is commonly found in gardens and naturalized areas where it thrives in partial shade to full sun. This plant prefers well-drained soil and is known for its showy, fragrant flowers that bloom in late spring to early summer. It is often used as an ornamental plant due to its attractive foliage and long flowering period. However, it has also been reported to spread beyond cultivated areas in some regions."
}
