{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus multilobatus",
    "plant_slug": "abelmoschus-multilobatus",
    "plant_name_scientific": "abelmoschus multilobatus",
    "intro": "Abelmoschus multilobatus, commonly known as the Chinese okra or Indian spinach, is a flowering plant in the mallow family. It is native to tropical and subtropical regions of Asia and is characterized by its hairy, lobed leaves and yellow flowers. The plant produces edible pods that are similar in appearance to okra but have a milder flavor. It thrives in warm climates and requires well-drained soil for optimal growth. Abelmoschus multilobatus is often cultivated for both its nutritional value and ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus multilobatus is primarily native to southern and eastern Asia, including countries such as India, China, and Thailand. It is commonly found in tropical and subtropical regions, particularly in areas with warm, humid climates. This plant typically grows in open fields, along roadsides, and in disturbed habitats. It is often seen in regions with well-drained soils and充足 sunlight. Its native range extends across parts of Africa as well, where it is also adapted to similar environmental conditions.",
    "distribution_introduced_art_desc": "Abelmoschus multilobatus was mainly introduced to regions with warm, humid climates where it can thrive in well-drained soils. It is commonly found in parts of Southeast Asia, Africa, and the Caribbean, where it has been cultivated for its edible seeds and ornamental value. This plant has been introduced as both a crop and a decorative species in various tropical and subtropical areas. Its introduction has sometimes led to it becoming naturalized in local ecosystems. However, it is generally not considered an invasive species in most of these regions."
}
