{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia coriacea var. subcoriacea",
    "plant_slug": "abelia-coriacea-var-subcoriacea",
    "plant_name_scientific": "abelia coriacea var. subcoriacea",
    "intro": "Abelia coriacea var. subcoriacea, commonly known as the rough abelia, is a deciduous shrub native to the southeastern United States. It is characterized by its small, oval, dark green leaves that are covered in a fine, rough texture. The plant produces clusters of fragrant, white to pale pink flowers in the summer, which attract pollinators such as bees and butterflies. It prefers well-drained soil and partial to full sunlight, making it suitable for a variety of garden settings. Its compact growth habit and ornamental value make it a popular choice for landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia coriacea var. subcoriacea is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This variant is often associated with forest understories and is adapted to humid climates with high rainfall. It thrives in partial to full shade and is often seen in secondary growth forests. Its native range extends to parts of Indonesia and the Philippines as well.",
    "distribution_introduced_art_desc": "Abelia coriacea var. subcoriacea was mainly introduced to North America as an ornamental plant due to its attractive foliage and flowers. It is commonly found in gardens and landscaped areas, particularly in the eastern United States. This variety is known for its dense, compact growth habit and its ability to thrive in a variety of soil conditions. It is often used in shrub borders and as a foundation plant. However, it has also been noted to spread aggressively in some regions, raising concerns about its potential invasiveness."
}
