{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot var. luzonensis",
    "plant_slug": "abelmoschus-manihot-var-luzonensis",
    "plant_name_scientific": "abelmoschus manihot var. luzonensis",
    "intro": "Abelmoschus manihot var. luzonensis, commonly known as Luzon bitter melon, is a variant of the bitter melon species native to the Philippines. It is a herbaceous vine characterized by its hairy stems and heart-shaped leaves. The plant produces yellowish-green flowers followed by elongated, bitter-tasting fruits. It thrives in warm, humid climates and is often cultivated for its edible fruit, though it requires careful handling due to its sharp, spiny skin. This variety is valued for its culinary uses and is also studied for its potential medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus manihot var. luzonensis is primarily native to the Philippines, specifically the island of Luzon. This variant of the abelmoschus manihot species is commonly found in the lowland areas of Luzon, particularly in regions with tropical and subtropical climates. It thrives in moist, well-drained soils and is often cultivated for its starchy roots, which are used in local cuisine. The plant is also known for its ornamental value, with its large, heart-shaped leaves and yellow flowers. Its native distribution is limited to specific ecological zones within Luzon, where it has adapted to the local environmental conditions.",
    "distribution_introduced_art_desc": "Abelmoschus manihot var. luzonensis was mainly introduced to the Philippines. It is commonly found in the Luzon region, particularly in the provinces of Nueva Ecija and La Union. This variant is often cultivated for its starchy roots, which are used as a food source. It thrives in tropical climates with well-drained soils. The plant has been integrated into local agricultural systems and is valued for its nutritional and economic benefits."
}
