{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata var. tetrasepala",
    "plant_slug": "abelia-spathulata-var-tetrasepala",
    "plant_name_scientific": "abelia spathulata var. tetrasepala",
    "intro": "Abelia spathulata var. tetrasepala, commonly known as the four-lobed abelia, is a shrub native to China. It is characterized by its lance-shaped leaves and clusters of fragrant, white to pink flowers that bloom in late summer. The plant typically grows to a height of 3 to 6 feet and has a compact, rounded form. Its flowers have four sepals, which is a distinguishing feature of this variety. It prefers partial shade to full sun and well-drained soil, making it suitable for a variety of garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata var. tetrasepala is primarily native to the southeastern United States, specifically occurring in parts of Georgia, Florida, and South Carolina. This variant is typically found in moist, shaded habitats such as woodlands and thickets. It thrives in areas with well-drained to moderately wet soils. The plant is often associated with pine flatwoods and cypress swamps. Due to its specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abelia spathulata var. tetrasepala was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils along stream banks and in woodland areas. This variety is valued for its ornamental value, featuring showy white to pink flowers and attractive foliage. It has been widely cultivated in gardens and naturalized in some areas. However, it is considered a non-native species in its introduced range."
}
