{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia ionandra",
    "plant_slug": "abelia-ionandra",
    "plant_name_scientific": "abelia ionandra",
    "intro": "Abelia ionandra, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features showy, tubular flowers that range in color from white to pink, blooming in late spring to early summer. The plant has opposite, ovate leaves that are typically dark green and slightly hairy. It thrives in partial shade to full sun and prefers well-drained soil. Abelia ionandra is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia ionandra is primarily native to the eastern and southeastern United States, specifically found in regions of Georgia, South Carolina, and Florida. It thrives in moist, well-drained soils and is commonly found in woodland edges, thickets, and along streams. This plant is adapted to humid climates and partial to full sunlight. It is often found in the coastal plain and piedmont regions of its native range. Abelia ionandra is a valuable species for its ornamental value and ecological benefits in native habitats.",
    "distribution_introduced_art_desc": "Abelia ionandra was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and flowering habit. It was first recorded in the 19th century and has since become established in various regions of the country. The plant is commonly found in gardens and along the margins of forests, where it thrives in moist, shaded environments. Its introduction has raised concerns among conservationists due to its potential to become invasive in native ecosystems. Despite its aesthetic value, efforts are being made to monitor and manage its spread to protect local biodiversity."
}
