{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus moschatus var. rugosus",
    "plant_slug": "abelmoschus-moschatus-var-rugosus",
    "plant_name_scientific": "abelmoschus moschatus var. rugosus",
    "intro": "Abelmoschus moschatus var. rugosus, commonly known as the rough hibiscus, is a variant of the okra plant characterized by its rugged, textured leaves and showy, trumpet-shaped flowers. It is native to warm climates and thrives in tropical and subtropical regions. The plant produces edible pods similar to other okra varieties, though its unique leaf structure sets it apart botanically. Its flowers are typically pink or red, attracting pollinators like bees and butterflies. The species is valued both for its ornamental appeal and its potential as a food crop in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus moschatus var. rugosus is primarily native to southern and eastern Asia, including regions such as India, China, and parts of Southeast Asia. This variety is commonly found in tropical and subtropical climates, often growing in open fields and along riverbanks. It is well adapted to warm, humid environments and thrives in well-drained soils. The plant is known for its distinctive rough, hairy leaves and is often cultivated for its edible fruits. It plays an important role in traditional agriculture and local ecosystems in its native range.",
    "distribution_introduced_art_desc": "Abelmoschus moschatus var. rugosus was mainly introduced to regions with warm climates and well-drained soils, where it can thrive and produce its characteristic spicy pods. This variety is commonly cultivated in parts of Asia, Africa, and the Americas for its culinary and medicinal uses. It is valued for its high nutrient content and unique flavor profile, making it a popular crop in local agriculture. The plant's introduction has contributed to dietary diversity and economic opportunities in many tropical and subtropical areas. However, its spread has also raised concerns about potential ecological impacts in non-native environments."
}
