{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia chinensis var. chinensis",
    "plant_slug": "abelia-chinensis-var-chinensis",
    "plant_name_scientific": "abelia chinensis var. chinensis",
    "intro": "Abelia chinensis var. chinensis, commonly known as Chinese abelia, is a deciduous shrub native to China. It features fragrant, tubular flowers that bloom in clusters, typically in shades of pink and white. The plant has opposite, ovate leaves that are usually glossy and dark green. It thrives in partial shade to full sun and prefers well-drained soil. This species is often cultivated for its ornamental value and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia chinensis"
    },
    "taxonomy_art_desc": "Abelia chinensis var. chinensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Dipsacales, which includes flowering plants with usually showy flowers and often includes species with aromatic properties. Its family is Caprifoliaceae, a family of flowering plants commonly known as the honeysuckle family, characterized by opposite leaves and tubular or clustered flowers. Its genus is Abelia, a group of flowering shrubs known for their showy, fragrant flowers and are often used in ornamental horticulture. Its species is Abelia chinensis, a specific type of shrub native to China, known for its ornamental value and adaptability to various growing conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast",
        "Taiwan",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia chinensis var. chinensis is primarily native to China South-Central, China Southeast, Taiwan, and Vietnam. This plant is commonly found in regions with warm, humid climates and is often associated with forest understories or rocky slopes. It thrives in areas with well-drained soil and partial to full sunlight. The species is valued for its ornamental qualities, including its fragrant flowers and attractive foliage. It plays an important ecological role in its native habitats by providing food and shelter for local wildlife.",
    "distribution_introduced_art_desc": "Abelia chinensis var. chinensis was mainly introduced to ornamental horticulture and landscape design due to its attractive flowering and hardy nature. It is commonly cultivated in gardens and public spaces for its showy clusters of fragrant, tubular flowers. The plant thrives in partial shade to full sun and is known for its adaptability to various soil types. Its introduction has expanded its geographic range beyond its native habitat in China. It is valued for its ability to provide seasonal color and its relatively low maintenance requirements."
}
