{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus praecox var. hispidus",
    "plant_slug": "abelmoschus-praecox-var-hispidus",
    "plant_name_scientific": "abelmoschus praecox var. hispidus",
    "intro": "Abelmoschus praecox var. hispidus, commonly known as the Chinese okra, is a variant of the okra species native to Asia. It is a herbaceous annual plant characterized by its hairy stems and broad, heart-shaped leaves. The plant produces capsule fruits that contain edible seeds, often used in culinary applications. It thrives in warm climates and requires well-drained soil for optimal growth. Its botanical features make it a versatile and economically important crop in various regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus praecox var. hispidus is primarily native to southern and eastern Asia, including countries such as China, India, and Indonesia. This variant is commonly found in tropical and subtropical regions with warm climates and well-drained soils. It thrives in areas with ample sunlight and moderate rainfall, making it well-suited for cultivation in regions with a long growing season. The plant is often grown for its edible seeds, which are used in various culinary and medicinal applications. Its natural habitat includes both cultivated fields and wild environments in its native range.",
    "distribution_introduced_art_desc": "Abelmoschus praecox var. hispidus was mainly introduced to areas with warm, temperate climates that support its growth. It is commonly found in regions with well-drained soils and sufficient sunlight. This variety is valued for its edible pods and is often cultivated in agricultural settings. Its introduction has expanded its geographic range beyond its native habitat. It has been successfully integrated into local farming practices in several countries."
}
