{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus hainanensis",
    "plant_slug": "abelmoschus-hainanensis",
    "plant_name_scientific": "abelmoschus hainanensis",
    "intro": "Abelmoschus hainanensis, commonly known as Hainan okra, is a flowering plant native to southern China, particularly Hainan Island. It belongs to the Malvaceae family, which includes other well-known plants like cotton and hibiscus. The plant is characterized by its hairy, ridged stems and large, heart-shaped leaves. Its flowers are typically yellow with five petals, and it produces capsule fruits containing numerous seeds. This species is valued for its ornamental qualities and has some traditional uses in local herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus hainanensis is primarily native to southern China, particularly the island of Hainan. It is also found in parts of Southeast Asia, including Vietnam and the Philippines. This species thrives in tropical and subtropical climates with high humidity and well-drained soil. It is commonly found in lowland areas and is often associated with disturbed habitats such as roadsides and abandoned fields. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abelmoschus hainanensis was mainly introduced to tropical and subtropical regions for its ornamental value and potential agricultural use. It thrives in warm climates with well-drained soil and adequate sunlight. The plant is often cultivated in gardens and botanical collections due to its unique foliage and flowering characteristics. Its introduction has been documented in several countries in Southeast Asia and the Pacific Islands. However, its natural distribution remains limited to its native habitat in southern China."
}
