{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus cryptocarpos",
    "plant_slug": "abelmoschus-cryptocarpos",
    "plant_name_scientific": "abelmoschus cryptocarpos",
    "intro": "Abelmoschus cryptocarpos, commonly known as the narrow-leaf okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant features hairy, ovate leaves and produces yellow flowers that develop into capsule fruits. Its botanical characteristics include a woody stem and fibrous roots, making it adaptable to various soil types. It is often cultivated for its edible pods, which are used in culinary and medicinal applications.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus cryptocarpos is primarily native to the Arabian Peninsula, including parts of Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, often growing in rocky soils and along coastal areas. This plant thrives in warm, dry climates and is adapted to low water availability. It is often seen in coastal dunes and sandy wastelands, where it plays a role in stabilizing the soil. Its native range is limited to specific areas within the Middle East, where it has evolved to survive in harsh environmental conditions.",
    "distribution_introduced_art_desc": "Abelmoschus cryptocarpos was mainly introduced to control weed competition in agricultural fields. It is commonly used as a cover crop to suppress weeds and improve soil structure. The plant is known for its rapid growth and dense foliage, which helps in reducing erosion. It thrives in warm climates and is often planted in the fall or early spring. However, it can become invasive if not managed properly, posing a challenge in some ecosystems."
}
