{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia sanguinea var. purpurascens",
    "plant_slug": "abelia-sanguinea-var-purpurascens",
    "plant_name_scientific": "abelia sanguinea var. purpurascens",
    "intro": "Abelia sanguinea var. purpurascens, commonly known as the roseum abelia, is a deciduous shrub native to eastern North America. It features attractive, fragrant, tubular flowers that range from white to pink, often with a hint of red, blooming in late spring to early summer. The plant has opposite, ovate leaves that are usually dark green and turn reddish in the fall. It prefers well-drained soil and partial to full sun, making it a versatile addition to gardens. Its ornamental value comes from both its foliage and its showy, long-lasting blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia sanguinea var. purpurascens is primarily native to eastern North America. It can be found in the United States, particularly in the southeastern region. This variety is commonly associated with the Appalachian Mountains and the coastal areas of the Carolinas. It thrives in moist, well-drained soils and is often found in woodland edges and stream banks. Its native range extends from Virginia to Florida and westward to Texas.",
    "distribution_introduced_art_desc": "Abelia sanguinea var. purpurascens was mainly introduced to the northeastern United States and parts of Canada as an ornamental plant due to its attractive pink and white flowers. It is commonly found in gardens and landscaped areas where it thrives in partial shade to full sun. The plant prefers well-drained soil and is relatively drought-tolerant once established. It has become naturalized in some regions, spreading beyond cultivated areas. Its introduction has led to concerns about its potential impact on native plant communities in certain habitats."
}
