{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia densipila",
    "plant_slug": "abelia-densipila",
    "plant_name_scientific": "abelia densipila",
    "intro": "Abelia densipila, commonly known as the denseleaf abelia, is a deciduous shrub native to China. It features small, fragrant, white to pinkish flowers that bloom in late summer. The plant has dense, dark green foliage that provides a lush appearance throughout the growing season. It thrives in partial to full sun and well-drained soil, making it suitable for garden landscapes. Abelia densipila is valued for its ornamental appeal and relatively low maintenance requirements.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Zabelia",
        "species": "Zabelia densipila"
    },
    "taxonomy_art_desc": "Abelia densipila belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with complex floral structures. Its order is Dipsacales, which consists of flowering plants often with opposite leaves and showy flowers, including some familiar genera like Verbena. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and herbs with usually fragrant flowers. Its genus is Zabelia, a group of flowering plants typically found in tropical and subtropical regions, characterized by their ornamental flowers. Its species is Zabelia densipila, a specific plant within the genus Zabelia known for its dense, hairy leaves and attractive floral display.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Korea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia densipila is primarily native to Korea. It is commonly found in the mountainous regions of the country. This plant thrives in shaded to semi-shaded environments. It is often seen growing in forests and along stream banks. Its distribution is limited to specific habitats within Korea.",
    "distribution_introduced_art_desc": "Abelia densipila was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in woodland and streamside habitats. This plant is often used in landscaping due to its attractive foliage and fragrant flowers. It has been reported to spread aggressively in some areas, raising concerns about its invasive potential. However, it is generally considered a non-native species with limited ecological impact in its introduced range."
}
