{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus decandrus",
    "plant_slug": "abelmoschus-decandrus",
    "plant_name_scientific": "abelmoschus decandrus",
    "intro": "Abelmoschus decandrus, commonly known as the five-seed okra, is a flowering plant native to Africa and parts of Asia. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant produces capsule fruits that contain five to ten seeds, hence its common name. Its leaves are ovate and hairy, while the flowers are yellow with five petals. Abelmoschus decandrus is cultivated for its edible seeds and has traditional uses in herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus decandrus is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Southeast Asia. It thrives in warm climates with well-drained soils and is commonly found in open fields, along roadsides, and in disturbed habitats. This plant is also present in parts of Africa and the Pacific Islands, where it has been introduced either intentionally or accidentally. It is often regarded as a weed in agricultural areas due to its rapid growth and adaptability. Despite its invasive tendencies, it has cultural and traditional significance in some regions.",
    "distribution_introduced_art_desc": "Abelmoschus decandrus was mainly introduced to regions where it is cultivated for its edible seeds and ornamental value. It is commonly found in tropical and subtropical areas, including parts of Africa, Asia, and the Americas. The plant thrives in warm climates with well-drained soil and adequate sunlight. It is often grown in home gardens and small-scale farms due to its relatively low maintenance requirements. Its introduction has been driven by both agricultural and horticultural interests."
}
