{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata f. rubescens",
    "plant_slug": "abelia-spathulata-f-rubescens",
    "plant_name_scientific": "abelia spathulata f. rubescens",
    "intro": "Abelia spathulata f. rubescens, commonly known as the red-leaf abelia, is a compact, deciduous shrub native to China. It is characterized by its narrow, elliptical leaves that turn a striking red or bronze color in the fall. The plant produces clusters of fragrant, white to pink flowers in the summer, which attract pollinators such as bees and butterflies. It thrives in partial shade to full sun and prefers well-drained, moist soil. This cultivar is valued for its ornamental foliage and is often used in gardens for its seasonal color changes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata f. rubescens is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This plant thrives in moist, well-drained soils and is often found in woodland edges, swamps, and along streams. It is known for its vibrant red foliage, which makes it a striking addition to native gardens. The variety is a cultivar of Abelia spathulata, which is part of the honeysuckle family. It is well adapted to the humid climate and can tolerate partial shade to full sun.",
    "distribution_introduced_art_desc": "Abelia spathulata f. rubescens was mainly introduced to the United States as an ornamental plant due to its attractive red-tinged foliage and showy flowers. It is commonly found in gardens and landscapes in regions with temperate climates, particularly in the eastern and southern parts of the country. This cultivar is valued for its compact growth habit and ability to thrive in partial shade to full sun conditions. It has been widely cultivated for its aesthetic appeal and is often used in border plantings and container gardens. However, it is important to note that it may spread aggressively in certain environments if not properly managed."
}
