{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus praecox",
    "plant_slug": "abelmoschus-praecox",
    "plant_name_scientific": "abelmoschus praecox",
    "intro": "Abelmoschus praecox, commonly known as okra, is an annual herbaceous plant native to warm temperate regions. It belongs to the Malvaceae family and is characterized by its upright stems, palmately lobed leaves, and green, spiny capsules that contain edible seeds. The plant produces showy yellow flowers with five petals, which are typically followed by the distinctive pod-like fruits. Okra is widely cultivated for its edible pods, which are rich in mucilage and used in various culinary traditions around the world. It thrives in well-drained soil and requires a long growing season with adequate sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus praecox is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Southeast Asia. It thrives in warm climates with well-drained soils and is commonly found in areas with a monsoonal rainfall pattern. This plant is often cultivated for its edible pods, which are used in various culinary traditions across its native range. It is also found in parts of Africa and the Middle East, where it has been introduced for agricultural purposes. Its natural habitat includes open fields, riverbanks, and disturbed soils, where it can grow rapidly and spread easily.",
    "distribution_introduced_art_desc": "Abelmoschus praecox was mainly introduced to regions with warm climates and well-drained soils, where it thrives as an annual herb. It is commonly cultivated for its edible pods, which are used in various culinary preparations. The plant is particularly suited for tropical and subtropical areas, making it a valuable crop in many parts of Asia and Africa. Its introduction has contributed to food security and agricultural diversity in these regions. However, it requires careful management to prevent potential weediness in non-crop areas."
}
