{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus angustifolius",
    "plant_slug": "abelmoschus-angustifolius",
    "plant_name_scientific": "abelmoschus angustifolius",
    "intro": "Abelmoschus angustifolius, commonly known as narrow-leaf okra, is an annual herbaceous plant native to Africa. It belongs to the Malvaceae family and is characterized by its slender, lance-shaped leaves and spiny calyces. The plant produces capsule fruits that contain numerous edible seeds, which are often used in culinary applications. It thrives in warm climates and requires well-drained soil for optimal growth. Its botanical features make it a valuable crop for both food and medicinal purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus angustifolius is primarily native to southern and eastern Asia, including countries such as India, China, and parts of Southeast Asia. It is commonly found in tropical and subtropical regions, where it thrives in warm climates with well-drained soils. This species is particularly associated with the Indian subcontinent, where it has been cultivated for centuries. It is often grown as a vegetable, known for its edible pods and seeds. The plant's native range also extends to parts of Africa and the Middle East, where it has been introduced and naturalized.",
    "distribution_introduced_art_desc": "Abelmoschus angustifolius was mainly introduced to regions with warm climates and well-drained soils, where it can thrive as an annual herb. It is commonly cultivated for its edible seeds, which are used in various cuisines around the world. The plant is often grown in tropical and subtropical areas, including parts of Africa, Asia, and the Americas. Its introduction has been facilitated by its adaptability to different soil types and its ability to withstand drought conditions. However, it requires adequate sunlight and careful management to prevent weed competition."
}
