{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia serrata var. integerrima",
    "plant_slug": "abelia-serrata-var-integerrima",
    "plant_name_scientific": "abelia serrata var. integerrima",
    "intro": "Abelia serrata var. integerrima, commonly known as the smooth abelia, is a deciduous shrub native to eastern Asia. It features upright stems with opposite, ovate to elliptic leaves that are typically smooth and dark green on top. The plant produces clusters of tubular, white to pale pink flowers in the summer, which attract pollinators like bees and butterflies. It thrives in partial to full sun and well-drained soil, making it suitable for garden landscapes. Its compact growth habit and ornamental value make it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia serrata var. integerrima is primarily native to the southern and eastern regions of China, including provinces such as Guangdong, Guangxi, Fujian, and Hainan. It is also found in parts of Vietnam and the island of Hainan. This plant typically grows in moist, shaded environments such as forests and mountainous areas. It is well adapted to humid climates and thrives in well-drained soils. Its natural range is limited to these specific geographic regions within Southeast Asia.",
    "distribution_introduced_art_desc": "Abelia serrata var. integerrima was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering habits. The introduction occurred in the 19th century during the period of extensive botanical exchanges between Europe and the Pacific. It has since naturalized in some areas, particularly in coastal and lowland regions. However, it is not considered invasive and is generally managed as a non-native species."
}
