{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia biflora f. minor",
    "plant_slug": "abelia-biflora-f-minor",
    "plant_name_scientific": "abelia biflora f. minor",
    "intro": "Abelia biflora f. minor, commonly known as the dwarf abelia, is a compact, evergreen shrub native to the southeastern United States. It features small, oval-shaped leaves that are typically a deep green color, providing a dense, foliage-filled appearance. The plant produces clusters of fragrant, white to pale pink flowers in the summer, which attract pollinators like bees and butterflies. It thrives in partial to full sun and well-drained soil, making it a versatile choice for gardens and landscapes. Due to its ornamental value and adaptability, it is often used in mixed borders or as a foundation plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia biflora f. minor is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in moist, acidic soils and is commonly found in swampy areas and along the edges of wetlands. This variety is known for its compact growth and is often used in horticulture for its ornamental value. It is particularly adapted to the humid climate and frequent rainfall of its native habitat. Due to its specific environmental requirements, it is not commonly found outside of its native range.",
    "distribution_introduced_art_desc": "Abelia biflora f. minor was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in the southeastern United States, particularly in Georgia and Florida. This plant thrives in humid climates and is often used in landscaping for its ornamental value. It is valued for its fragrant white flowers and compact growth habit. However, it may spread aggressively and requires careful management in natural habitats."
}
