{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus coccineus",
    "plant_slug": "abelmoschus-coccineus",
    "plant_name_scientific": "abelmoschus coccineus",
    "intro": "Abelmoschus coccineus, commonly known as red okra, is a flowering plant native to Africa and Asia. It is characterized by its upright, branched stems and heart-shaped leaves with a velvety texture. The plant produces distinctive pods that are typically red or orange when mature, though they can also be green. These pods are edible and are commonly used in various cuisines for their mucilaginous texture and nutritional value. The plant thrives in warm climates and is often cultivated for both its ornamental and culinary uses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus coccineus is primarily native to southern and eastern Asia, including regions such as India, China, and Southeast Asia. It is commonly found in tropical and subtropical climates, thriving in warm, humid environments. This plant is often cultivated for its edible pods, which are used in various culinary traditions across its native range. It prefers well-drained soils and is typically found in open fields or along riverbanks. Its natural distribution includes parts of Africa and the Middle East as well.",
    "distribution_introduced_art_desc": "Abelmoschus coccineus was mainly introduced to tropical and subtropical regions for its ornamental value and edible pods. It is commonly found in parts of Asia, Africa, and the Caribbean, where it has been cultivated for centuries. The plant thrives in warm climates with well-drained soil and full sunlight. Its introduction has been largely due to horticultural interest and culinary use. However, it is not considered invasive in most of its introduced ranges."
}
