{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus tulipiflorus",
    "plant_slug": "abelmoschus-tulipiflorus",
    "plant_name_scientific": "abelmoschus tulipiflorus",
    "intro": "Abelmoschus tulipiflorus, commonly known as the tulip flower okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant is characterized by its showy, trumpet-shaped flowers that range in color from yellow to orange. Its leaves are palmately lobed, and the fruit is a capsule that contains numerous seeds. It is often cultivated for both ornamental purposes and as a source of edible seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus tulipiflorus is primarily native to southern and eastern Asia, including countries such as India, China, and Thailand. It thrives in tropical and subtropical climates, often found in moist, well-drained soils. This plant is commonly associated with regions that have warm temperatures and a distinct wet season. It is frequently cultivated for its ornamental value due to its vibrant, tulip-shaped flowers. Its natural range extends into parts of Southeast Asia and the Indian subcontinent.",
    "distribution_introduced_art_desc": "Abelmoschus tulipiflorus was mainly introduced to areas with warm climates and well-drained soils, where it can thrive as an ornamental plant. It is commonly found in gardens and landscapes in regions such as southern United States, parts of Australia, and Southeast Asia. The plant is valued for its showy, tulip-like flowers that bloom in late summer. Due to its adaptability, it has been cultivated in various tropical and subtropical environments. However, it is considered an invasive species in some regions where it outcompetes native flora."
}
