{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus tuberculatus var. deltoidefolius",
    "plant_slug": "abelmoschus-tuberculatus-var-deltoidefolius",
    "plant_name_scientific": "abelmoschus tuberculatus var. deltoidefolius",
    "intro": "Abelmoschus tuberculatus var. deltoidefolius, commonly known as the deltoid-leaf okra, is a variant of the okra species native to tropical and subtropical regions. It is characterized by its distinctive deltoid-shaped leaves, which are broad and triangular in appearance. The plant produces capsule fruits that contain edible, fibrous seeds, similar to other okra varieties. It thrives in warm climates with well-drained soil and requires consistent moisture for optimal growth. This variant is valued for its ornamental qualities as well as its culinary uses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus tuberculatus var. deltoidefolius is primarily native to Southeast Asia, including regions such as Malaysia, Indonesia, and the Philippines. This variant of the abelmoschus species is commonly found in tropical and subtropical areas with warm, humid climates. It thrives in lowland regions and is often associated with wetland or riparian habitats. The plant is known for its distinctive heart-shaped leaves and is sometimes cultivated for its ornamental value. Its natural range extends into parts of northern Australia and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abelmoschus tuberculatus var. deltoidefolius was mainly introduced to new regions for its ornamental value and potential use in traditional medicine. It is known for its distinctive heart-shaped leaves and vibrant flowers, making it a popular choice for gardeners and landscapers. The plant has been introduced to several tropical and subtropical areas, including parts of Southeast Asia and the Pacific Islands. Its introduction has raised concerns due to its potential to become invasive in non-native environments. Proper management is essential to prevent ecological disruption in areas where it is not native."
}
