{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus manihot var. pungens",
    "plant_slug": "abelmoschus-manihot-var-pungens",
    "plant_name_scientific": "abelmoschus manihot var. pungens",
    "intro": "Abelmoschus manihot var. pungens, commonly known as the prickly sida, is a tropical shrub native to Africa and parts of Asia. It is characterized by its hairy, spiny stems and heart-shaped leaves that are often covered in fine, stiff hairs. The plant produces small, yellowish flowers that are followed by capsule fruits containing numerous seeds. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Due to its hardy nature, it is sometimes considered a weed in agricultural areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abelmoschus",
        "species": "Abelmoschus manihot"
    },
    "taxonomy_art_desc": "Abelmoschus manihot var. pungens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often includes economically important species. Its family is Malvaceae, commonly known as the mallow family, which includes plants with sympetalous flowers and cotton-like fibers. Its genus is Abelmoschus, a group of flowering plants native to Africa and Asia, known for their edible parts and medicinal uses. Its species is Abelmoschus manihot, a plant commonly known as the African eggplant, which is a variant of the manihot species with distinctive spiny features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "China South-Central",
        "China Southeast",
        "Christmas I.",
        "East Himalaya",
        "India",
        "Laos",
        "Lesser Sunda Is.",
        "Myanmar",
        "Nepal",
        "Pakistan",
        "Philippines",
        "Sumatera",
        "Thailand",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [
        "Central African Republic",
        "Taiwan"
    ],
    "distribution_native_art_desc": "Abelmoschus manihot var. pungens is primarily native to Assam, China South-Central, China Southeast, Christmas I., East Himalaya, India, Laos, Lesser Sunda Is., Myanmar, Nepal, Pakistan, Philippines, Sumatera, Thailand, Vietnam, West Himalaya. This variant is commonly found in tropical and subtropical regions across these areas. It thrives in warm climates with well-drained soils. The plant is often associated with disturbed habitats and can be found in both wild and cultivated environments. Its native range spans a wide geographic area across Asia and parts of the Pacific.",
    "distribution_introduced_art_desc": "Abelmoschus manihot var. pungens was mainly introduced to Central African Republic and Taiwan. It is a variant of the abelmoschus manihot species, commonly known as the African wood apple. This plant is typically found in tropical and subtropical regions. Its introduction to these areas may be due to agricultural or ornamental purposes. However, its ecological impact in these regions is still being studied."
}
