{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia sanguinea",
    "plant_slug": "abelia-sanguinea",
    "plant_name_scientific": "abelia sanguinea",
    "intro": "Abelia sanguinea, commonly known as the redleaf abelia, is a deciduous shrub native to eastern North America. It features attractive, fragrant, tubular flowers that bloom in late spring to early summer. The plant has opposite, ovate leaves that turn vibrant red in the fall, adding ornamental value. It prefers partial shade to full sun and well-drained soil. Abelia sanguinea is often used in gardens for its ornamental appeal and moderate care requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia sanguinea is primarily native to eastern North America, including the United States and Canada. It is commonly found in moist, woodland areas and along stream banks. This plant thrives in partial to full shade and is often seen in the southeastern United States. It is known for its showy clusters of pinkish-white flowers that bloom in late spring to early summer. Abelia sanguinea is a popular ornamental plant due to its attractive foliage and flowering habits.",
    "distribution_introduced_art_desc": "Abelia sanguinea was mainly introduced to North America as an ornamental plant due to its attractive pink flowers and hardy nature. It was first brought to the United States in the early 19th century by botanists and horticulturists who admired its aesthetic qualities. The plant has since been widely cultivated in gardens and landscapes across the eastern and central regions of the country. Its introduction has led to its naturalization in some areas, where it can sometimes compete with native plant species. Despite its ornamental value, its spread has raised concerns among conservationists."
}
