{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus luzonensis",
    "plant_slug": "abelmoschus-luzonensis",
    "plant_name_scientific": "abelmoschus luzonensis",
    "intro": "Abelmoschus luzonensis, commonly known as the Luzon okra, is a flowering plant native to the Philippines. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant is characterized by its hairy stems, large heart-shaped leaves, and showy yellow flowers. Its fruit is a capsule that splits open to release seeds, a common feature in the genus Abelmoschus. This species is adapted to tropical climates and is often found in moist, shaded environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus luzonensis is primarily native to the Philippines, specifically the island of Luzon. It is found in the mountainous regions of the northern part of Luzon, including areas such as the Cordillera Administrative Region. This plant thrives in humid, tropical climates and is commonly found in forested areas and along riverbanks. It is an important species in the local ecosystem and has been recognized for its potential medicinal properties. Due to habitat loss, it is also considered a threatened species in its native range.",
    "distribution_introduced_art_desc": "Abelmoschus luzonensis was mainly introduced to the Philippines. It is commonly found in the lowland areas of Luzon, particularly in the provinces of Quezon, Nueva Ecija, and La Union. This plant thrives in tropical and subtropical climates with well-drained soil. It is often cultivated for its edible seeds and ornamental value. However, its distribution is limited due to specific environmental requirements and human activities."
}
