{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata",
    "plant_slug": "abelia-spathulata",
    "plant_name_scientific": "abelia spathulata",
    "intro": "Abelia spathulata, commonly known as the broadleaf abelia, is a deciduous shrub native to the southeastern United States. It features showy, tubular flowers that range in color from white to pink, blooming in late spring to early summer. The plant has ovate to elliptic leaves that are often hairy on the underside, giving it a distinctive appearance. It thrives in partial shade to full sun and prefers well-drained, acidic soil. Abelia spathulata is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Diabelia",
        "species": "Diabelia spathulata"
    },
    "taxonomy_art_desc": "Abelia spathulata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar families such as Magnoliaceae and Lauraceae. Its order is Dipsacales, which consists of flowering plants with typically showy flowers and often includes plants with opposite leaves. Its family is Caprifoliaceae, known as the honeysuckle family, which includes shrubs and vines with fragrant flowers. Its genus is Diabelia, a small genus of flowering plants native to southern Africa, characterized by its distinctive leaf and flower structures. Its species is Diabelia spathulata, a specific plant within the genus Diabelia, known for its unique morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan",
        "Korea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata is primarily native to Japan and Korea. It is commonly found in the mountainous regions of these countries. This plant thrives in humid, shaded environments. It is often associated with forests and rocky slopes. Its natural range is limited to these specific geographic areas.",
    "distribution_introduced_art_desc": "Abelia spathulata was mainly introduced to the southeastern United States, particularly in states like Georgia, Florida, and South Carolina. It was brought in during the 19th century as an ornamental plant due to its attractive foliage and showy flowers. The distribution has expanded beyond its original range, with sightings in parts of the eastern and midwestern United States. It thrives in moist, well-drained soils and partial to full sun, making it adaptable to various garden settings. However, it is considered invasive in some areas, outcompeting native vegetation and altering local ecosystems."
}
