{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia shikokiana",
    "plant_slug": "abelia-shikokiana",
    "plant_name_scientific": "abelia shikokiana",
    "intro": "Abelia shikokiana, commonly known as the Japanese abelia, is a deciduous shrub native to Japan. It features slender, arching stems and lance-shaped leaves that are typically dark green and glossy. The plant produces clusters of fragrant, white to pinkish flowers in the summer, which attract pollinators such as bees and butterflies. It thrives in partial shade to full sun and prefers well-drained, acidic soil. Abelia shikokiana is valued for its ornamental appeal and adaptability to a variety of garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia shikokiana is primarily native to the Ryukyu Islands, which include Okinawa and other southern islands of Japan. This plant is found in the subtropical and tropical regions of this area. It typically grows in moist, shaded environments such as forests and rocky slopes. Its native range is limited to these specific islands in the western Pacific Ocean. Abelia shikokiana is a rare and endemic species within this region.",
    "distribution_introduced_art_desc": "Abelia shikokiana was mainly introduced to the United States and Canada as an ornamental plant due to its attractive foliage and flowers. It is commonly found in gardens and landscapes in these regions, particularly in the southeastern and eastern parts of the United States. The plant thrives in partial shade to full sun and is often used in border plantings and as a shrub in mixed borders. Its introduction has led to its establishment in some natural areas, raising concerns about its potential invasiveness. Despite its beauty, it is important to monitor its spread to prevent ecological disruption."
}
