{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia insularis",
    "plant_slug": "abelia-insularis",
    "plant_name_scientific": "abelia insularis",
    "intro": "Abelia insularis, commonly known as the island abelia, is a deciduous shrub native to the southeastern United States. It features showy, tubular flowers that range in color from white to pink, typically blooming in late spring to early summer. The plant has opposite, ovate leaves with serrated edges, and it produces small, red berries in the fall. It thrives in partial shade to full sun and prefers well-drained soil. Abelia insularis is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia insularis is primarily native to the tropical regions of Southeast Asia, including parts of the Philippines, Indonesia, and Malaysia. This plant thrives in humid, tropical climates and is commonly found in coastal areas and lowland forests. It is well adapted to the warm, moist conditions typical of these regions. Abelia insularis is often seen growing in shaded undergrowth or along riverbanks. Its natural habitat reflects its preference for rich, well-drained soils and consistent moisture.",
    "distribution_introduced_art_desc": "Abelia insularis was mainly introduced to coastal areas and disturbed sites in the southeastern United States. It thrives in well-drained soils and partial to full sun, making it adaptable to various environmental conditions. This plant is often found in sandy or rocky habitats, where it can establish itself quickly. Due to its ornamental value, it has been planted in gardens and landscapes across its range. However, it is considered invasive in some regions, outcompeting native vegetation."
}
