{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia integrifolia",
    "plant_slug": "abelia-integrifolia",
    "plant_name_scientific": "abelia integrifolia",
    "intro": "Abelia integrifolia, commonly known as the smooth abelia, is a deciduous shrub native to the southeastern United States. It features fragrant, tubular flowers that range in color from white to pink, typically blooming in late spring to early summer. The plant has lance-shaped, dark green leaves that are smooth and slightly glossy. It thrives in partial shade to full sun and prefers well-drained, acidic soil. Abelia integrifolia is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Zabelia",
        "species": "Zabelia integrifolia"
    },
    "taxonomy_art_desc": "Abelia integrifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often possessing true leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Dipsacales, which consists of flowering plants that typically have opposite leaves and showy flowers, often found in temperate regions. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with fragrant flowers and often used in horticulture. Its genus is Zabelia, a group of flowering plants native to certain regions of Africa, characterized by their specific floral structures and growth habits. Its species is Zabelia integrifolia, a specific plant within the genus Zabelia, distinguished by its leaf shape and floral characteristics, and is typically found in particular ecological niches.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan",
        "Korea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia integrifolia is primarily native to Japan and Korea. It is commonly found in the temperate regions of these countries. This plant typically grows in woodland areas and along stream banks. It is well adapted to the climate and soil conditions of its native habitat. Its natural distribution is limited to these specific geographic locations.",
    "distribution_introduced_art_desc": "Abelia integrifolia was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in shaded to partially shaded environments. This plant is often used in landscaping for its ornamental value, including its fragrant flowers and attractive foliage. It has been reported to spread aggressively in some areas, leading to concerns about its invasive potential. However, it is generally considered a non-native species with limited impact in its introduced range."
}
