{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia serrata var. sanguinea",
    "plant_slug": "abelia-serrata-var-sanguinea",
    "plant_name_scientific": "abelia serrata var. sanguinea",
    "intro": "Abelia serrata var. sanguinea, commonly known as the redleaf abelia, is a deciduous shrub native to China. It is characterized by its attractive, serrated leaves that turn a striking red or orange-red in the fall. The plant produces clusters of fragrant, tubular flowers that are typically pink or white, blooming in the summer. It thrives in full sun to partial shade and prefers well-drained soil. This ornamental plant is popular in gardens for its vibrant foliage and showy blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia serrata var. sanguinea is primarily native to the southern and eastern regions of China, including the provinces of Guangdong, Guangxi, Fujian, and Zhejiang. It is also found in parts of Vietnam and the island of Hainan. This plant thrives in moist, shaded environments, often growing in mountainous forests and along stream banks. It is known for its vibrant red flowers that bloom in late spring to early summer. The variety is valued for its ornamental qualities and is sometimes cultivated in gardens outside its native range.",
    "distribution_introduced_art_desc": "Abelia serrata var. sanguinea was mainly introduced to ornamental horticulture due to its attractive red flowers and compact growth habit. It is commonly cultivated in gardens and landscapes for its ornamental value. This variety is particularly favored in temperate climates for its ability to thrive in partial shade. Its introduction has expanded its geographic range beyond its native habitat. However, it is important to monitor its spread to prevent potential ecological impacts in non-native regions."
}
