{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia buddleioides var. intercedens",
    "plant_slug": "abelia-buddleioides-var-intercedens",
    "plant_name_scientific": "abelia buddleioides var. intercedens",
    "intro": "Abelia buddleioides var. intercedens, commonly known as the Chinese abelia, is a deciduous shrub native to China. It features fragrant, white to pinkish flowers that bloom in late summer, attracting pollinators such as bees and butterflies. The plant has lance-shaped, dark green leaves that turn reddish in the fall. It thrives in partial shade to full sun and prefers well-drained soil. Its compact growth habit and ornamental value make it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia buddleioides var. intercedens is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variety is found in wetlands, swamps, and other moist habitats within its native range. It is commonly associated with the Florida scrub ecosystem, where it thrives in sandy, well-drained soils. The plant is also occasionally found in coastal areas and along waterways. Its native distribution is limited to these specific regions, making it a regionally significant species in the southeastern U.S. flora.",
    "distribution_introduced_art_desc": "Abelia buddleioides var. intercedens was mainly introduced to enhance ornamental value in gardens and landscapes due to its attractive foliage and showy flowers. It is commonly found in USDA hardiness zones 5 through 9, where it thrives in partial to full sun. The plant is often used in mixed borders, as a hedge, or in containers because of its compact growth habit. Its ability to tolerate a range of soil types makes it a versatile choice for landscaping. However, it is important to note that it may spread aggressively in certain conditions, requiring regular pruning to maintain control."
}
