{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus cruentus",
    "plant_slug": "abelmoschus-cruentus",
    "plant_name_scientific": "abelmoschus cruentus",
    "intro": "Abelmoschus cruentus, commonly known as red okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family and is characterized by its hairy, spiny stems and large, heart-shaped leaves. The plant produces capsule fruits that contain edible, mucilaginous seeds, which are often used in culinary applications. It thrives in warm climates with well-drained soil and requires a long growing season. Red okra is also valued for its ornamental qualities and traditional medicinal uses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus cruentus is primarily native to tropical and subtropical regions of Africa, southern Asia, and parts of the Middle East. It is commonly found in countries such as India, Sudan, Egypt, and Nigeria. This plant thrives in warm climates with well-drained soils and is often cultivated for its edible seeds and ornamental value. It is also known as the red lady's finger or red okra. Its native distribution includes areas with a long growing season and adequate sunlight.",
    "distribution_introduced_art_desc": "Abelmoschus cruentus was mainly introduced to regions where its heat-tolerant properties and adaptability to poor soil conditions make it a valuable crop. It is commonly found in tropical and subtropical areas, particularly in parts of Africa, Asia, and the Americas. The plant is known for its high seed yield and nutritional value, contributing to food security in arid and semi-arid regions. Its introduction has also supported local agricultural practices and traditional farming systems. Due to its resilience, it has become an important crop in climate change adaptation strategies."
}
