{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia schumannii",
    "plant_slug": "abelia-schumannii",
    "plant_name_scientific": "abelia schumannii",
    "intro": "Abelia schumannii, commonly known as Schumann's abelia, is a deciduous shrub native to China. It features showy, tubular flowers that range in color from white to pink, blooming in late summer. The plant has opposite, ovate leaves that are typically dark green and covered in fine hairs. It thrives in partial shade to full sun and prefers well-drained soil. Abelia schumannii is valued for its ornamental appeal and adaptability to various garden conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia schumannii"
    },
    "taxonomy_art_desc": "Abelia schumannii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Dipsacales, which consists of flowering plants typically with opposite leaves and showy flowers, often found in temperate regions. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with fragrant flowers and often edible fruits. Its genus is Abelia, a group of shrubs known for their showy, clustered flowers and are often used in ornamental horticulture. Its species is Abelia schumannii, a specific type of Abelia native to China, characterized by its compact growth and pink to white flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia schumannii is primarily native to China North-Central and China South-Central. This plant is commonly found in regions with temperate climates, including parts of eastern and central China. It thrives in moist, well-drained soils and is often found in forested areas or along stream banks. The species is known for its attractive clusters of fragrant flowers and is popular in horticulture. Its natural range reflects its adaptation to the diverse ecosystems within these regions.",
    "distribution_introduced_art_desc": "Abelia schumannii was mainly introduced to the United States as an ornamental plant due to its attractive foliage and showy flowers. It is commonly found in gardens and landscaped areas, particularly in the southeastern region of the country. The plant has been reported in several states, including Florida, Georgia, and Texas, where it thrives in moist, well-drained soils. Although it is not considered invasive, it has the potential to spread in natural areas if not managed properly. Its introduction has raised concerns about its impact on native plant communities in certain regions."
}
