{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia spathulata var. stenophylla",
    "plant_slug": "abelia-spathulata-var-stenophylla",
    "plant_name_scientific": "abelia spathulata var. stenophylla",
    "intro": "Abelia spathulata var. stenophylla, commonly known as the narrow-leaf abelia, is a deciduous shrub native to the southeastern United States. It features lance-shaped, dark green leaves that are narrower than those of the typical spathulata variety. The plant produces clusters of fragrant, white to pinkish flowers in the summer, which attract pollinators such as bees and butterflies. It thrives in partial to full sun and prefers moist, well-drained soil. This variety is valued for its ornamental appeal and adaptability to various garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia spathulata var. stenophylla is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variant is commonly found in wetland habitats such as swamps, marshes, and the edges of ponds. It thrives in moist, acidic soils and is often associated with coastal and inland wetlands. The plant is well adapted to humid climates and can tolerate periodic flooding. It is a valuable component of the native flora in these regions, contributing to local biodiversity.",
    "distribution_introduced_art_desc": "Abelia spathulata var. stenophylla was mainly introduced to the eastern United States as an ornamental plant due to its attractive foliage and flowering habits. It is commonly found in gardens and landscaped areas where it thrives in partial shade to full sun conditions. This variety is known for its narrow, elliptical leaves and clusters of white flowers that bloom in late spring to early summer. It has been cultivated for its aesthetic value and is sometimes used in native plant gardens. However, it is important to note that it is not native to the region and can sometimes spread beyond cultivated areas."
}
