{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus pseudabelmoschus",
    "plant_slug": "abelmoschus-pseudabelmoschus",
    "plant_name_scientific": "abelmoschus pseudabelmoschus",
    "intro": "Abelmoschus pseudabelmoschus, commonly known as the Chinese okra, is a flowering plant native to Southeast Asia. It belongs to the Malvaceae family and is characterized by its upright, branched stems and large, heart-shaped leaves. The plant produces showy yellow flowers that are followed by capsule fruits containing numerous seeds. It thrives in warm climates and is often cultivated for its edible pods, which are used in various culinary dishes. The plant also has ornamental value due to its vibrant foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus pseudabelmoschus is primarily native to tropical and subtropical regions of Asia, including countries such as India, China, and Thailand. It is commonly found in areas with warm climates and well-drained soils. This plant thrives in regions with high humidity and moderate rainfall. It is often cultivated for its ornamental value and edible seeds. Its native range extends to parts of Africa and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abelmoschus pseudabelmoschus was mainly introduced to regions where its heat-tolerant properties and potential as a vegetable crop are valued. It is commonly found in tropical and subtropical areas, including parts of Asia, Africa, and the Americas. The plant's introduction is often associated with agricultural expansion and the search for drought-resistant crops. It has been cultivated in countries like India, Nigeria, and Brazil for its edible pods and nutritional benefits. Its distribution highlights its adaptability to diverse environmental conditions and its importance in local food systems."
}
