{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelicea davidii",
    "plant_slug": "abelicea-davidii",
    "plant_name_scientific": "abelicea davidii",
    "intro": "Abelicea davidii, commonly known as the David's abelicea, is a species of flowering plant native to southern Africa. It belongs to the family Rubiaceae, which includes a diverse group of flowering plants. The plant is characterized by its small, clustered flowers that typically bloom in shades of white and pink. Its leaves are generally elliptical and have a smooth, glossy surface. Abelicea davidii is often found in woodland and shrubland habitats, thriving in well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelicea davidii is primarily native to the Mediterranean region, particularly in southern Europe. It is found in countries such as Spain, France, and Italy. This plant thrives in rocky and coastal areas, often growing on cliffs and slopes. It is well adapted to the dry and sunny conditions typical of the Mediterranean climate. Its distribution is limited to specific habitats within this geographic range.",
    "distribution_introduced_art_desc": "Abelicea davidii was mainly introduced to new habitats in tropical and subtropical regions due to its ornamental value and adaptability. It has been widely cultivated in gardens and greenhouses across Southeast Asia, the Pacific Islands, and parts of the Americas. The plant thrives in warm climates with well-drained soil and full sunlight, making it a popular choice for landscapers and horticulturists. Its introduction has led to its naturalization in several areas, sometimes outcompeting native species. However, its spread is generally limited by its specific environmental requirements and human management."
}
