{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus ficulneoides",
    "plant_slug": "abelmoschus-ficulneoides",
    "plant_name_scientific": "abelmoschus ficulneoides",
    "intro": "Abelmoschus ficulneoides, commonly known as the African okra, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant features large, heart-shaped leaves and produces yellow flowers that give way to edible, fibrous pods. It thrives in warm climates with well-drained soil and requires regular watering. Abelmoschus ficulneoides is valued for its nutritional content and is used in various cuisines across Africa and Asia.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus ficulneoides is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Sudan, Ethiopia, and parts of East Africa. It is commonly found in areas with warm climates and well-drained soils. This plant thrives in open habitats, including grasslands and disturbed areas. It is often associated with human settlements and agricultural landscapes. Its native range extends into parts of the Middle East and southern Arabia as well.",
    "distribution_introduced_art_desc": "Abelmoschus ficulneoides was mainly introduced to new agricultural regions for its potential as a vegetable crop due to its edible pods and nutritional value. It is often cultivated in tropical and subtropical areas where it thrives in warm climates with well-drained soil. The plant has been introduced to several countries in Southeast Asia, Africa, and parts of the Americas as a promising alternative to other leafy vegetables. Its introduction has also been driven by its adaptability to different soil types and relatively low maintenance requirements. However, its spread has raised concerns about potential ecological impacts in non-native environments."
}
