{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia cavaleriei",
    "plant_slug": "abelia-cavaleriei",
    "plant_name_scientific": "abelia cavaleriei",
    "intro": "Abelia cavaleriei, commonly known as Chinese abelia, is a deciduous shrub native to China. It features fragrant, tubular flowers that range in color from white to pink, blooming in late summer. The plant has opposite, ovate leaves that are dark green and glossy. It thrives in partial shade to full sun and prefers well-drained soil. Abelia cavaleriei is valued for its ornamental appeal and adaptability in garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia cavaleriei is primarily native to China, specifically the provinces of Sichuan and Yunnan. It grows in mountainous regions at elevations ranging from 1,500 to 3,000 meters. This plant is commonly found in moist, well-drained soils within temperate forests and shrublands. It thrives in partial shade to full sun conditions. Its native habitat is characterized by cool, humid climates with distinct seasonal variations.",
    "distribution_introduced_art_desc": "Abelia cavaleriei was mainly introduced to the United States as an ornamental plant due to its attractive foliage and flowering habits. It was first brought to North America in the early 20th century by botanists and horticulturists interested in cultivating exotic species. The plant thrives in moist, well-drained soils and partial shade, making it suitable for gardens in temperate climates. It has been widely used in landscaping for its ability to add color and texture to shaded areas. However, it is considered an invasive species in some regions, where it can outcompete native vegetation."
}
