{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelmoschus marianus",
    "plant_slug": "abelmoschus-marianus",
    "plant_name_scientific": "abelmoschus marianus",
    "intro": "Abelmoschus marianus, commonly known as the Indian okra or Marian's okra, is a flowering plant in the mallow family. It is characterized by its hairy, ridged leaves and yellow flowers that bloom in clusters. The plant produces capsule fruits that contain numerous seeds, which are often used in traditional medicine. Native to tropical and subtropical regions, it thrives in warm climates with well-drained soil. Its botanical features make it a valuable species for both ornamental and agricultural purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelmoschus marianus is primarily native to southern and eastern Asia, including countries such as India, China, and Southeast Asia. It is commonly found in regions with tropical and subtropical climates. This plant thrives in warm, humid environments and is often associated with wetlands and riverbanks. It has been historically used in traditional medicine and as a source of fiber. Its native distribution reflects its adaptability to diverse ecological conditions across these regions.",
    "distribution_introduced_art_desc": "Abelmoschus marianus was mainly introduced to areas with warm climates and well-drained soils, where it can thrive and produce its edible pods. It is commonly found in regions such as Southeast Asia, Africa, and parts of the Americas. The plant is valued for its nutritional content, including high levels of vitamins and minerals. Its introduction has often been associated with agricultural expansion and trade activities. However, it has also been noted as an invasive species in some regions, outcompeting native flora."
}
