{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia engleriana",
    "plant_slug": "abelia-engleriana",
    "plant_name_scientific": "abelia engleriana",
    "intro": "Abelia engleriana, commonly known as Engler's abelia, is a deciduous shrub native to tropical and subtropical regions of Africa. It features showy, tubular flowers that range in color from white to pink, attracting pollinators such as bees and butterflies. The plant has opposite, ovate leaves that are usually hairy beneath, and it produces small, capsule-like fruits containing seeds. It thrives in well-drained soil and partial to full sunlight, making it suitable for garden cultivation. Its ornamental value is enhanced by its attractive foliage and prolonged flowering period.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia engleriana is primarily native to eastern and southern Africa, including countries such as Tanzania, Kenya, Uganda, and Mozambique. It is commonly found in tropical and subtropical regions, often growing in moist, well-drained soils. This plant thrives in shaded to semi-shaded environments, typically along stream banks or in forest understories. It is known for its fragrant, tubular flowers that bloom in clusters. Abelia engleriana is a popular ornamental plant due to its attractive appearance and adaptability to various garden conditions.",
    "distribution_introduced_art_desc": "Abelia engleriana was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in forested areas. This plant is often used in landscaping due to its attractive foliage and flowers. It has become naturalized in some areas, leading to concerns about its invasive potential. However, it is generally considered a moderate threat to native plant communities."
}
