{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia chinensis var. ionandra",
    "plant_slug": "abelia-chinensis-var-ionandra",
    "plant_name_scientific": "abelia chinensis var. ionandra",
    "intro": "Abelia chinensis var. ionandra, commonly known as the Chinese abelia or red abelia, is a deciduous shrub native to China. It features narrow, elliptical leaves that are glossy and dark green, with a slightly serrated edge. The plant produces clusters of showy, tubular flowers that range from white to pink, often with a red throat, blooming in late spring to early summer. It thrives in partial to full sun and well-drained soil, making it a versatile choice for gardens. Its ornamental value is enhanced by its attractive foliage and long-lasting blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia chinensis"
    },
    "taxonomy_art_desc": "Abelia chinensis var. ionandra belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species, such as roses and magnolias, and is defined by their floral structures. Its order is Dipsacales, which consists of flowering plants with showy flowers, often found in temperate regions, and includes plants like honeysuckle and elderberry. Its family is Caprifoliaceae, commonly known as the honeysuckle family, which includes shrubs and vines with fragrant flowers and often edible fruits. Its genus is Abelia, a group of shrubs known for their ornamental value, with showy, clustered flowers and a wide range of colors. Its species is Abelia chinensis, a specific type of abelia native to China, known for its attractive appearance and adaptability to various growing conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Nansei-shoto",
        "Taiwan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia chinensis var. ionandra is primarily native to Nansei-shoto, Taiwan. This variant of Abelia chinensis is found in the mountainous regions of Taiwan, where it thrives in humid, temperate climates. It is commonly associated with forest understories and rocky slopes in its native habitat. The plant is well adapted to the specific environmental conditions of the Nansei-shoto archipelago. Its native distribution is limited to these regions, making it a regionally significant species in Taiwanese flora.",
    "distribution_introduced_art_desc": "Abelia chinensis var. ionandra was mainly introduced to the Pacific Northwest of the United States. It was brought there for its ornamental value, particularly its fragrant, showy flowers. This plant thrives in moist, well-drained soils and partial to full sun. It has become naturalized in some areas, raising concerns about its potential invasiveness. Due to its adaptability, it is now commonly found in gardens and wetland environments across the region."
}
