{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abelia macrotera var. macrotera",
    "plant_slug": "abelia-macrotera-var-macrotera",
    "plant_name_scientific": "abelia macrotera var. macrotera",
    "intro": "Abelia macrotera var. macrotera, commonly known as the largeflower abelia, is a shrub native to eastern Asia, particularly China. It features showy, tubular flowers that are typically pink or red, blooming in late spring to early summer. The plant has opposite, ovate leaves that are usually dark green and glossy. It thrives in partial shade to full sun and prefers well-drained soil. This variety is valued for its ornamental value and ability to attract pollinators like bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Dipsacales",
        "family": "Caprifoliaceae",
        "genus": "Abelia",
        "species": "Abelia macrotera"
    },
    "taxonomy_art_desc": "Abelia macrotera var. macrotera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient lineages with diverse morphological adaptations. Its order is Dipsacales, which consists of flowering plants often with showy flowers and includes several economically important genera. Its family is Caprifoliaceae, commonly known as the honeysuckle family, characterized by opposite leaves and often fragrant flowers. Its genus is Abelia, a group of flowering shrubs known for their showy, clustered flowers and are often used in ornamental gardening. Its species is Abelia macrotera, a specific variety within the genus Abelia, distinguished by its particular floral and vegetative characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abelia macrotera var. macrotera is primarily native to China North-Central, China South-Central, and China Southeast. This plant is commonly found in regions with temperate climates and well-drained soils. It thrives in woodland edges and open areas where it receives partial to full sunlight. The variety is known for its compact growth habit and showy, fragrant flowers. It is often used in landscaping due to its ornamental value and adaptability to various garden conditions.",
    "distribution_introduced_art_desc": "Abelia macrotera var. macrotera was mainly introduced to the United States as an ornamental plant due to its attractive foliage and showy flowers. It is commonly found in gardens and landscaped areas, particularly in the southeastern region of the country. This plant thrives in partial to full sun and well-drained soil, making it adaptable to various garden settings. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns among ecologists about its potential impact on local ecosystems."
}
