{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abena jamaicensis",
    "plant_slug": "abena-jamaicensis",
    "plant_name_scientific": "abena jamaicensis",
    "intro": "Abena jamaicensis, commonly known as Jamaican abena, is a flowering plant native to the Caribbean region. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its palmate leaves and showy, trumpet-shaped flowers that are typically pink or red. It thrives in tropical and subtropical climates, often found in coastal areas and disturbed soils. The plant is sometimes used in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abena jamaicensis is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is commonly found in Jamaica, Cuba, Hispaniola, and the Bahamas. This plant thrives in tropical and subtropical climates, often growing in coastal areas and dry forests. It is adapted to sandy soils and can tolerate salt spray, making it a common species in coastal ecosystems. Its native distribution is closely linked to the island environments of the Caribbean.",
    "distribution_introduced_art_desc": "Abena jamaicensis was mainly introduced to the Caribbean region, particularly in the Lesser Antilles, as an ornamental plant due to its attractive foliage. It has since spread to other tropical and subtropical areas, including parts of Florida and the southern United States. The plant thrives in moist, well-drained soils and is often found near water bodies or in disturbed habitats. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, careful management is needed to prevent its spread beyond controlled environments."
}
