{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa microphylla",
    "plant_slug": "aberemoa-microphylla",
    "plant_name_scientific": "aberemoa microphylla",
    "intro": "Aberemoa microphylla, commonly known as the dwarf sedge, is a flowering plant native to South America. It belongs to the Cyperaceae family, which includes sedges and grass-like plants. The plant is characterized by its small, narrow leaves and produces tiny, clustered flowers that are typically green or brown. It thrives in wet or moist environments, such as marshes and along stream banks. Aberemoa microphylla is often used in ecological restoration projects due to its ability to stabilize soil and support local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa microphylla is primarily native to the eastern and southern regions of South America, including countries such as Brazil, Paraguay, Argentina, and Uruguay. It is commonly found in tropical and subtropical areas, particularly in regions with moist, well-drained soils. This plant thrives in open woodlands, grasslands, and along riverbanks. It is known for its small, delicate leaves and is often used in traditional medicine by local communities. Its distribution is closely linked to the climate and ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Aberemoa microphylla was mainly introduced to control erosion and stabilize soil in coastal and sandy areas. It is commonly found in regions with sandy or gravelly soils along the coastline. The plant thrives in full sun and is drought-tolerant, making it suitable for harsh environments. It has been used in restoration projects to prevent wind and water erosion. However, its spread can sometimes lead to competition with native vegetation."
}
