{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa argentea",
    "plant_slug": "aberemoa-argentea",
    "plant_name_scientific": "aberemoa argentea",
    "intro": "Aberemoa argentea, commonly known as silverleaf sedge, is a perennial herb native to parts of Africa and Asia. It is characterized by its narrow, silver-tomentose leaves that give it its common name. The plant typically grows in wetland or marshy environments, thriving in moist, well-drained soils. Its flowering stems produce small, inconspicuous flowers arranged in spikelets, which are characteristic of the Cyperaceae family. The plant is often used in traditional medicine for its purported healing properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa argentea is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is commonly found in the tropical and subtropical areas of the western Atlantic Ocean. This plant thrives in coastal and lowland habitats, often growing in sandy or limestone soils. It is particularly associated with the islands of Cuba, Hispaniola, Jamaica, and the Bahamas. Its distribution is limited to these specific regions, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Aberemoa argentea was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in disturbed habitats such as roadsides, clearings, and along stream banks. This plant is often spread through seed dispersal by wind, water, and animals. It has become naturalized in several regions outside its native range. Its rapid growth and adaptability make it a potential invasive species in some environments."
}
