{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa guianensis var. glabrescens",
    "plant_slug": "aberemoa-guianensis-var-glabrescens",
    "plant_name_scientific": "aberemoa guianensis var. glabrescens",
    "intro": "Aberemoa guianensis var. glabrescens, commonly known as the Guianan Aberemoa, is a species of flowering plant in the family Malvaceae. It is native to the tropical regions of South America, particularly in Guyana and Suriname. The plant is characterized by its smooth, glabrous stems and broad, heart-shaped leaves. It produces showy, pinkish-white flowers that bloom in clusters, attracting various pollinators. This variant is distinguished by its reduced pubescence compared to other varieties within the species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa guianensis var. glabrescens is primarily native to the tropical regions of South America, particularly the Amazon Basin and surrounding areas. This variant is found in countries such as Brazil, Colombia, and Venezuela. It thrives in humid lowland forests and is commonly associated with riverine and floodplain habitats. The plant is well adapted to the warm and moist climate of these regions. Its distribution is closely linked to the dense vegetation and rich biodiversity of the Amazon rainforest.",
    "distribution_introduced_art_desc": "Aberemoa guianensis var. glabrescens was mainly introduced to tropical regions of South America, particularly in Brazil, Colombia, and Venezuela. It is commonly found in lowland rainforests and along riverbanks where the climate is warm and humid. This variant is valued for its ornamental qualities, including its striking red flowers and unique leaf structure. It has been cultivated in botanical gardens and private collections for its aesthetic appeal. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
