{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberia zeyheri",
    "plant_slug": "aberia-zeyheri",
    "plant_name_scientific": "aberia zeyheri",
    "intro": "Aberia zeyheri, commonly known as the Zeyher's honeysuckle, is a flowering plant native to South Africa. It belongs to the Caprifoliaceae family and is characterized by its fragrant, tubular flowers that bloom in clusters. The plant typically grows as a shrub, reaching heights of up to 2 meters, with opposite, ovate leaves. Its flowers are usually yellow or orange, attracting pollinators such as bees and butterflies. The fruit is a small, fleshy berry that ripens to a red or orange color, providing food for birds and small mammals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberia zeyheri is primarily native to the Canary Islands, specifically Tenerife, La Gomera, and El Hierro. It is commonly found in coastal areas and rocky habitats, often growing on cliffs and slopes. This plant thrives in the unique microclimates of these islands, characterized by high humidity and mild temperatures. It is adapted to the volcanic soils and can tolerate salt spray from the Atlantic Ocean. Due to its limited distribution, Aberia zeyheri is considered a rare and endemic species within the Canary Islands.",
    "distribution_introduced_art_desc": "Aberia zeyheri was mainly introduced to South Africa, particularly in the Western Cape region. It was brought there for ornamental purposes due to its attractive yellow flowers and drought-resistant characteristics. The plant has since become naturalized in certain areas, spreading along roadsides and in disturbed soils. Its introduction has led to concerns about its potential invasiveness in local ecosystems. Despite its beauty, careful management is recommended to prevent it from becoming a weed."
}
