{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa furfuracea var. jonasiana",
    "plant_slug": "aberemoa-furfuracea-var-jonasiana",
    "plant_name_scientific": "aberemoa furfuracea var. jonasiana",
    "intro": "Aberemoa furfuracea var. jonasiana, commonly known as the Jonas's velvetleaf, is a tropical plant native to Central and South America. It is characterized by its broad, heart-shaped leaves that are covered in a dense layer of fine, velvety hairs. The plant produces small, yellowish-green flowers that are typically clustered in leaf axils. Its growth habit is herbaceous, with a sprawling or upright form depending on environmental conditions. The species is often found in moist, shaded habitats such as forests and wetlands.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa furfuracea var. jonasiana is primarily native to the Caribbean region, particularly the islands of the Lesser Antilles. This variant is found in countries such as St. Lucia, St. Vincent, and Grenada. It thrives in moist, tropical environments, often growing in coastal areas or near rivers. The plant is commonly associated with limestone soils and is often found in disturbed or secondary growth habitats. Its distribution is limited to specific islands where the climate and soil conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Aberemoa furfuracea var. jonasiana was mainly introduced to control erosion and stabilize soil in coastal and sandy areas. It is commonly used in restoration projects due to its ability to thrive in harsh, saline environments. The plant's rapid growth and extensive root system make it effective for preventing land degradation. However, its invasive nature has led to concerns about its impact on native ecosystems. It is now considered a potential weed in some regions where it has spread beyond its intended planting sites."
}
