{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa lanceolata var. glabriuscula",
    "plant_slug": "aberemoa-lanceolata-var-glabriuscula",
    "plant_name_scientific": "aberemoa lanceolata var. glabriuscula",
    "intro": "Aberemoa lanceolata var. glabriuscula, commonly known as the smoothleaf aberemoa, is a flowering plant native to parts of Southeast Asia. It is characterized by its lance-shaped leaves that are smooth and often glossy in appearance. The plant produces small, clustered flowers that are typically white or pale yellow in color. It thrives in moist, well-drained soils and is often found in forest understories. Due to its ornamental value, it is occasionally cultivated in gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa lanceolata var. glabriuscula is primarily native to the eastern United States, specifically the southeastern region. It is found in states such as North Carolina, South Carolina, Georgia, and Florida. This plant typically grows in moist, sandy soils along the edges of swamps and in pine flatwoods. It is often associated with wetland habitats and is commonly found in areas with high humidity. The species is well adapted to the warm, humid climate of the southeastern U.S. and thrives in partial to full shade.",
    "distribution_introduced_art_desc": "Aberemoa lanceolata var. glabriuscula was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and growth habit. The introduction occurred in the late 19th century, primarily through horticultural trade. Despite its aesthetic appeal, it has since become invasive in certain regions, outcompeting native vegetation. Its spread has raised concerns among conservationists due to its potential ecological impact."
}
