{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa lanceolata",
    "plant_slug": "aberemoa-lanceolata",
    "plant_name_scientific": "aberemoa lanceolata",
    "intro": "Aberemoa lanceolata, commonly known as the lanceleaf everlet, is a flowering plant native to the tropical regions of South America. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its elongated, lance-shaped leaves and showy, trumpet-like flowers that range in color from pink to red. It typically grows in moist, shaded environments and is often found in forest understories. The plant is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa lanceolata is primarily native to the eastern United States, specifically the coastal regions of South Carolina and Georgia. It thrives in sandy soils along the Atlantic coast, often found in dune environments and maritime forests. This plant is well adapted to salt spray and can tolerate periodic flooding from high tides. It plays an important role in stabilizing dune systems and providing habitat for native wildlife. Its distribution is limited to these specific coastal areas, making it a characteristic species of the southeastern U.S. coastline.",
    "distribution_introduced_art_desc": "Aberemoa lanceolata was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and forest edges. It thrives in regions with moderate to high rainfall and full sun exposure. This plant is often found in the southeastern United States, particularly in states like Florida and Georgia. Its rapid growth and ability to spread through seeds make it a common invasive species in these regions. It competes with native plants, altering local ecosystems and reducing biodiversity."
}
