{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberia mollis var. lanceolata",
    "plant_slug": "aberia-mollis-var-lanceolata",
    "plant_name_scientific": "aberia mollis var. lanceolata",
    "intro": "Aberia mollis var. lanceolata, commonly known as the lanceleaf evergreen holly, is a variant of the evergreen holly species characterized by its lance-shaped leaves. It is a deciduous shrub or small tree native to the eastern United States, typically found in moist, well-drained soils. The plant features small, white flowers that bloom in spring, followed by red, fleshy berries in the fall. Its foliage remains dense and glossy throughout the growing season, making it a popular ornamental plant. It is often used in landscaping for its hardiness and aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberia mollis var. lanceolata is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variant is commonly found in wetland habitats such as marshes, swamps, and along the edges of ponds. It thrives in moist to wet soil conditions and is often associated with coastal and inland wetlands. The plant is known for its distinctive lance-shaped leaves and is an important species in the local ecosystem. It is also occasionally found in nearby regions of the Carolinas.",
    "distribution_introduced_art_desc": "Aberia mollis var. lanceolata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. The plant has since become naturalized in certain regions, particularly in the North Island. It is commonly found in disturbed areas such as roadsides and forest margins. However, its spread is limited compared to other introduced species in the region."
}
