{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberia gardneri",
    "plant_slug": "aberia-gardneri",
    "plant_name_scientific": "aberia gardneri",
    "intro": "Aberia gardneri, commonly known as the Gardner's evergreen hibiscus, is a flowering plant native to the tropical regions of Africa. It is characterized by its evergreen foliage and showy, trumpet-shaped flowers that range in color from yellow to red. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its leaves are simple, alternate, and often have a waxy texture, while its flowers bloom throughout the year in warm climates. Aberia gardneri is valued for its ornamental appeal and is often cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberia gardneri is primarily native to the eastern United States, specifically the Appalachian Mountains. It is found in regions of Virginia, West Virginia, and North Carolina. This plant typically grows in moist, well-drained soils along stream banks and in forested areas. It is commonly associated with mixed hardwood forests and is often found in shaded environments. Aberia gardneri is a rare and endangered species, with limited distribution and specific habitat requirements.",
    "distribution_introduced_art_desc": "Aberia gardneri was mainly introduced to the eastern United States as an ornamental plant due to its unique appearance and hardiness. It was first documented in the 19th century and has since spread beyond its original cultivation sites. This plant is now considered invasive in several states, outcompeting native vegetation in forest understories. Its rapid growth and ability to thrive in shaded conditions contribute to its spread. Conservation efforts are underway to control its population and protect local ecosystems."
}
