{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa asterotricha",
    "plant_slug": "aberemoa-asterotricha",
    "plant_name_scientific": "aberemoa asterotricha",
    "intro": "Aberemoa asterotricha, commonly known as the velvetleaf tree, is a tropical plant native to Southeast Asia. It is characterized by its large, heart-shaped leaves that are covered in fine, silky hairs, giving it a velvety texture. The plant produces small, yellow flowers that are clustered in panicles, and it is often found in moist, lowland areas. Its bark is thick and fibrous, and it has a moderate growth rate. The plant is sometimes used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa asterotricha is primarily native to the island of Madagascar. It is found in the eastern and southern regions of the island, particularly in humid lowland and montane forest areas. This plant thrives in shaded, moist environments and is often associated with secondary growth and disturbed habitats. It is part of the Rubiaceae family and is known for its distinctive floral morphology. Due to habitat loss, Aberemoa asterotricha is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Aberemoa asterotricha was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. Despite its aesthetic value, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shaded environments, making it particularly problematic in forested regions. Efforts are ongoing to control its spread and protect local biodiversity."
}
