{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa dioica",
    "plant_slug": "aberemoa-dioica",
    "plant_name_scientific": "aberemoa dioica",
    "intro": "Aberemoa dioica, commonly known as the two-lobed broom, is a flowering plant native to the southern United States. It is characterized by its erect, branched stems and pairs of opposite, lance-shaped leaves. The plant produces small, yellowish-green flowers that are clustered in dense inflorescences. It thrives in sandy or loamy soils and is often found in open woodlands or along roadsides. The species is notable for its dioecious nature, with separate male and female plants.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa dioica is primarily native to the Caribbean region, including parts of the Greater and Lesser Antilles. It is commonly found in tropical and subtropical areas, particularly in coastal and lowland habitats. This plant thrives in sandy or rocky soils and is often associated with disturbed or open environments. It is also present in some regions of southern Florida and the Bahamas. Its distribution is limited to specific islands where it has adapted to the local climate and ecological conditions.",
    "distribution_introduced_art_desc": "Aberemoa dioica was mainly introduced to control invasive plant species in disturbed areas. It is commonly used in ecological restoration projects due to its rapid growth and ability to stabilize soil. The plant thrives in full sun to partial shade and prefers moist, well-drained soils. It is often found in wetlands, stream banks, and along roadsides. However, its aggressive growth can sometimes lead to unintended spread in non-target areas."
}
