{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberia edulis",
    "plant_slug": "aberia-edulis",
    "plant_name_scientific": "aberia edulis",
    "intro": "Aberia edulis, commonly known as the edible euphorbia, is a shrub native to parts of Africa. It belongs to the Euphorbiaceae family and is characterized by its thick, succulent stems and lobed leaves. The plant produces small, greenish-yellow flowers that are clustered in cyathia, typical of the genus. Its latex contains toxic compounds, but certain parts of the plant are used in traditional medicine. Despite its toxicity, it plays a role in local ecosystems and has cultural significance in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberia edulis is primarily native to the tropical rainforests of Southeast Asia, particularly in countries such as Malaysia, Indonesia, and Thailand. It thrives in humid, shaded environments within these dense forest ecosystems. The plant is commonly found in lowland and hill forest areas, often growing along the forest floor or in undergrowth. It plays an important ecological role in supporting local biodiversity. Due to habitat loss, Aberia edulis is now considered a threatened species in its native range.",
    "distribution_introduced_art_desc": "Aberia edulis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and agricultural fields. It thrives in regions with moderate to high rainfall and well-drained soils. The plant is often found in tropical and subtropical climates, particularly in Southeast Asia and parts of Africa. Its rapid growth and ability to colonize new areas make it a common invasive species in these regions. Due to its adaptability, it can outcompete native vegetation, leading to ecological concerns in some areas."
}
