{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa odorata",
    "plant_slug": "aberemoa-odorata",
    "plant_name_scientific": "aberemoa odorata",
    "intro": "Aberemoa odorata, commonly known as the fragrant evergreen, is a flowering plant native to tropical regions of the Americas. It is characterized by its glossy, dark green leaves and clusters of small, fragrant white flowers that bloom throughout the year. The plant produces small, round, red fruits that contain seeds. It thrives in moist, well-drained soil and partial to full sunlight. Aberemoa odorata is often cultivated for its ornamental value and pleasant scent.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa odorata is primarily native to the Caribbean islands, including Cuba, Jamaica, and the Bahamas. It is also found in parts of Central America, such as Belize and Honduras. This plant thrives in tropical and subtropical climates, often growing in coastal areas and moist lowland regions. It is commonly associated with mangrove ecosystems and saltwater environments. Its native range extends to some regions of South America, particularly the northern coast of Brazil.",
    "distribution_introduced_art_desc": "Aberemoa odorata was mainly introduced to tropical and subtropical regions for its ornamental value and potential medicinal properties. It is commonly found in countries such as India, Sri Lanka, and parts of Southeast Asia. The plant thrives in warm, humid climates with well-drained soil. It has been cultivated in gardens and botanical collections due to its attractive foliage and fragrant flowers. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
