{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa marcgraviana",
    "plant_slug": "aberemoa-marcgraviana",
    "plant_name_scientific": "aberemoa marcgraviana",
    "intro": "Aberemoa marcgraviana, commonly known as the Brazilian nightshade, is a tropical shrub native to South America. It belongs to the Solanaceae family, which includes other nightshades like tomatoes and peppers. The plant is characterized by its simple, alternate leaves and small, star-shaped flowers that bloom in clusters. Its fruits are berries that change color from green to yellow as they mature. The plant contains alkaloids and has been studied for potential medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa marcgraviana is primarily native to the Amazon Basin, specifically in parts of northern South America. It is found in countries such as Brazil, Colombia, and Venezuela. This plant thrives in humid tropical environments with rich, well-drained soils. It is commonly found in lowland rainforests and along riverbanks. Its native distribution is closely associated with the dense vegetation of the Amazonian region.",
    "distribution_introduced_art_desc": "Aberemoa marcgraviana was mainly introduced to the tropical and subtropical regions of South America, particularly Brazil, where it has become naturalized in certain areas. It is commonly found in wetlands, marshes, and along riverbanks, thriving in moist, nutrient-rich soils. The plant is known for its striking red flowers and has been used in ornamental horticulture. However, its introduction has raised concerns due to its potential to become invasive in non-native habitats. Despite its aesthetic appeal, its ecological impact remains a topic of ongoing study."
}
