{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberia verrucosa",
    "plant_slug": "aberia-verrucosa",
    "plant_name_scientific": "aberia verrucosa",
    "intro": "Aberia verrucosa, commonly known as the rough-leaved alder, is a deciduous shrub or small tree native to parts of Asia and Europe. It is characterized by its rough, bark-like leaves that are often covered in small, raised bumps. The plant typically grows in moist, well-drained soils and is often found in forested areas or along stream banks. Its flowers are small and inconspicuous, appearing in catkins, while its fruits are three-winged samaras. The species is valued for its ecological role in stabilizing soil and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberia verrucosa is primarily native to Southeast Asia, including countries such as Thailand, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant is typically associated with lowland rainforests and is sometimes seen in disturbed or secondary forest areas. It plays a role in local ecosystems by providing habitat and food for various wildlife species. Its distribution is largely confined to the Asian continent, with limited presence in other tropical regions.",
    "distribution_introduced_art_desc": "Aberia verrucosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, warty appearance. However, it has since become invasive, outcompeting native species in certain regions. Its rapid growth and ability to spread through seeds have led to concerns about its ecological impact. Efforts are now being made to control its spread and prevent further invasion of natural habitats."
}
