{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa furfuracea",
    "plant_slug": "aberemoa-furfuracea",
    "plant_name_scientific": "aberemoa furfuracea",
    "intro": "Aberemoa furfuracea, commonly known as the velvetleaf, is a tropical plant belonging to the Malvaceae family. It is characterized by its large, heart-shaped leaves that are covered in a dense layer of fine, velvety hairs. The plant produces showy, yellow flowers that are often clustered in terminal inflorescences. It is native to Central and South America and thrives in warm, humid climates. Due to its invasive nature, it is often considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa furfuracea is primarily native to the Caribbean region, including parts of the Greater and Lesser Antilles. It is commonly found in the islands of Cuba, Hispaniola, Jamaica, and Puerto Rico. This plant thrives in tropical and subtropical environments, often growing in moist, shaded areas within forests. It is also present in some regions of South America, particularly in Brazil and Venezuela. Its native distribution is closely tied to the humid climates and diverse ecosystems of these islands and coastal areas.",
    "distribution_introduced_art_desc": "Aberemoa furfuracea was mainly introduced to control erosion and stabilize soil in coastal and sandy areas. It is commonly found in dune environments where it helps prevent wind erosion. The plant thrives in well-drained soils and full sun conditions. It has become a valuable species for ecological restoration projects. However, its rapid growth can sometimes lead to the displacement of native vegetation if not managed properly."
}
