{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberemoa brevipedunculata",
    "plant_slug": "aberemoa-brevipedunculata",
    "plant_name_scientific": "aberemoa brevipedunculata",
    "intro": "Aberemoa brevipedunculata, commonly known as the short-stemmed fern, is a species of flowering plant native to tropical regions of South America. It belongs to the family Araceae and is characterized by its compact growth habit and distinctive, arrow-shaped leaves. The plant produces small, inconspicuous flowers that are typically clustered in spadices, a common feature in the Araceae family. It thrives in moist, shaded environments and is often found in humid lowland forests. Due to its unique morphology and limited distribution, it is of interest to botanists and conservationists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberemoa brevipedunculata is primarily native to the eastern and southeastern United States, including states such as Florida, Georgia, South Carolina, and parts of Alabama. It is commonly found in wetland habitats, including swamps, marshes, and along the edges of ponds and lakes. This species thrives in moist to wet soils and is often associated with forested wetlands. It is also occasionally found in coastal areas, particularly in the southeastern region of the country. The plant plays an important ecological role in these wetland ecosystems by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Aberemoa brevipedunculata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and hardy nature. The distribution of this species is primarily confined to the North Island, where it has been cultivated in gardens and along roadsides. Despite its introduction, it has not become invasive and remains a relatively rare plant in the wild. Its presence is more commonly associated with human activity rather than natural spread."
}
