{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aberia macrocalyx",
    "plant_slug": "aberia-macrocalyx",
    "plant_name_scientific": "aberia macrocalyx",
    "intro": "Aberia macrocalyx, commonly known as the large-flowered aberia, is a member of the Fabaceae family. It is characterized by its distinctive, showy white or pale purple flowers that bloom in clusters. The plant features palmately compound leaves with five to seven leaflets. Native to tropical regions, it thrives in warm, humid climates with well-drained soil. Its botanical structure supports its role as both an ornamental plant and a potential source of medicinal compounds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aberia macrocalyx is primarily native to the eastern and southeastern United States, including states such as Florida, Georgia, and South Carolina. It is commonly found in wetlands, marshes, and along the edges of water bodies. This plant thrives in moist to wet soil conditions and is often associated with riparian habitats. It is an important component of the wetland ecosystem, providing habitat and food for various wildlife species. Its distribution is largely limited to the southeastern coastal plain region of North America.",
    "distribution_introduced_art_desc": "Aberia macrocalyx was mainly introduced to the Pacific Northwest region of the United States. It was brought in for its ornamental value due to its attractive, large white flowers. The plant has since spread beyond its original planting sites, becoming established in natural areas. It is now considered a potential invasive species in some parts of its range. Land managers are monitoring its spread to prevent ecological harm."
}
