{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fabri subsp. minensis",
    "plant_slug": "abies-fabri-subsp-minensis",
    "plant_name_scientific": "abies fabri subsp. minensis",
    "intro": "Abies fabri subsp. minensis, commonly known as the Min Mountains fir, is a rare and endemic coniferous species native to the mountainous regions of southern China. It is characterized by its narrow, needle-like leaves and conical shape, typical of the fir genus. The plant thrives in cool, moist climates at high altitudes, often found in forested areas with well-drained soils. Its cones are small and typically hang downward, releasing seeds that are dispersed by wind. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from habitat loss and climate change.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fabri subsp. minensis is primarily native to the mountainous regions of southern China, particularly in Yunnan Province. This subspecies is found in high-altitude forests within the Hengduan Mountains. It thrives in cool, moist climates with well-drained soils. The plant is often associated with mixed coniferous forests at elevations ranging from 2,000 to 3,500 meters. Its distribution is limited to specific microhabitats in this region, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Abies fabri subsp. minensis was mainly introduced to China, where it has been cultivated for its ornamental value and ecological benefits. It is commonly found in mountainous regions with a temperate climate, particularly in the eastern and southern parts of the country. This subspecies is valued for its dense foliage and ability to thrive in well-drained soils. It has been used in reforestation projects and as a decorative tree in urban landscapes. However, its introduction has raised concerns about potential impacts on native plant communities."
}
