{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba subsp. equi-trojani",
    "plant_slug": "abies-alba-subsp-equi-trojani",
    "plant_name_scientific": "abies alba subsp. equi-trojani",
    "intro": "Abies alba subsp. equi-trojani, commonly known as the Carpathian fir, is a subspecies of the European silver fir native to the Carpathian Mountains. It is a coniferous evergreen tree characterized by its slender, pyramidal shape and needle-like leaves. The foliage is typically dark green, with a silvery-white underside, giving it a distinctive appearance. It produces cones that are cylindrical and often hang downward, containing seeds that are dispersed by wind. This subspecies is adapted to cold, mountainous climates and plays an important role in the forest ecosystems of Central and Eastern Europe.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba subsp. equi-trojani is primarily native to the Carpathian Mountains, including parts of Romania, Ukraine, and Slovakia. This subspecies is found in the higher elevations of these regions, typically in mountainous forests. It thrives in cool, moist climates with well-drained soils. The plant is often associated with mixed coniferous and broadleaf forests. Its distribution is limited to specific ecological niches within the Carpathian range.",
    "distribution_introduced_art_desc": "Abies alba subsp. equi-trojani was mainly introduced to regions with temperate climates and well-drained soils, particularly in Central and Southeast Europe. It thrives in areas with moderate rainfall and sufficient sunlight, making it suitable for reforestation and ornamental purposes. This subspecies is often planted in urban landscapes due to its adaptability and aesthetic appeal. It has been introduced to several countries outside its native range, including parts of North America and Asia. However, its introduction has raised concerns about potential ecological impacts on native flora."
}
