{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea var. fraseri",
    "plant_slug": "abies-balsamea-var-fraseri",
    "plant_name_scientific": "abies balsamea var. fraseri",
    "intro": "Abies balsamea var. fraseri, commonly known as Fraser fir, is a coniferous evergreen tree native to the Appalachian Mountains of eastern North America. It is characterized by its dense, conical shape and dark green, needle-like leaves that are shorter and more pointed than those of the typical balsam fir. The tree produces small, cone-like structures that contain winged seeds, which are dispersed by wind. Fraser fir thrives in cool, moist environments with well-drained soil, often found at high elevations. It is valued for its ornamental appeal and is also used in the production of Christmas trees.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamea var. fraseri is primarily native to the northeastern United States and southeastern Canada. It is found in regions such as New York, Vermont, New Hampshire, and parts of Quebec. This variety thrives in cool, moist environments, often in mountainous or boreal forest areas. It is commonly associated with acidic soils and is a component of mixed coniferous forests. Its range extends into the Appalachian Mountains and the Canadian Shield.",
    "distribution_introduced_art_desc": "Abies balsamea var. fraseri was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in higher elevations or northern regions. It is commonly found in the northeastern United States and southeastern Canada, where it thrives in forested environments. This variety is often used in landscaping due to its ornamental value and ability to tolerate a range of soil conditions. It has been introduced to various regions beyond its native range, including parts of Europe and Asia, for ornamental and reforestation purposes. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
