{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. conica",
    "plant_slug": "abies-excelsa-var-conica",
    "plant_name_scientific": "abies excelsa var. conica",
    "intro": "Abies excelsa var. conica, commonly known as the Colombian fir, is a variant of the white fir native to the Andes Mountains of South America. It is characterized by its conical shape and dense, dark green foliage. The tree typically grows in high-altitude regions, thriving in cool, moist climates with well-drained soil. Its cones are slender and elongated, containing small, winged seeds. This variety is valued for its ornamental appeal and ecological importance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. conica is primarily native to the high mountain regions of the Western Himalayas, including parts of northern India, Nepal, and Bhutan. This variety is typically found in elevations ranging from 2,500 to 4,500 meters above sea level. It thrives in cool, moist climates with well-drained soils, often growing in mixed forests alongside other coniferous species. The plant is adapted to harsh alpine conditions and plays a significant role in the ecological balance of these regions. Its distribution is relatively restricted, making it a rare and specialized species in its native habitat.",
    "distribution_introduced_art_desc": "Abies excelsa var. conica was mainly introduced to specific regions with high altitude and cool climates, where it thrives in moist, well-drained soils. This variety is commonly found in mountainous areas, particularly in the Himalayas and other parts of South Asia. It is often cultivated for its ornamental value due to its distinctive conical shape and evergreen foliage. The plant is also valued for its timber, which is used in construction and furniture-making. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
