{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies hickelii subsp. oaxacana",
    "plant_slug": "abies-hickelii-subsp-oaxacana",
    "plant_name_scientific": "abies hickelii subsp. oaxacana",
    "intro": "Abies hickelii subsp. oaxacana, commonly known as the Oaxaca fir, is a coniferous tree native to the mountainous regions of southern Mexico. It belongs to the genus Abies, which includes other fir species characterized by their needle-like leaves and cone-bearing structures. This subspecies is distinguished by its narrow, conical shape and dark green, slender needles. It thrives in cool, moist environments at high altitudes, often growing in cloud forests. The bark is typically reddish-brown and becomes fissured with age, contributing to its distinctive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies hickelii subsp. oaxacana is primarily native to southern Mexico, specifically in the states of Oaxaca, Chiapas, and southern Puebla. It is found in high-altitude cloud forests and montane regions, typically between 1,500 and 3,000 meters above sea level. This subspecies thrives in cool, moist climates with well-drained soils, often growing in mixed coniferous forests. Its distribution is limited to specific ecological niches in the Sierra Madre del Sur and other mountainous areas of the region. It is an important component of the local biodiversity and plays a key role in the ecosystem of its native habitat.",
    "distribution_introduced_art_desc": "Abies hickelii subsp. oaxacana was mainly introduced to areas with temperate to subtropical climates, particularly in regions with high rainfall and well-drained soils. It thrives in mountainous environments where it can receive ample sunlight and moderate temperatures. This subspecies is commonly found in the Sierra Madre mountains of Mexico, where it has been cultivated for its ornamental value and ecological benefits. Its introduction has also been noted in some parts of the United States, especially in regions with similar climatic conditions. However, its spread is limited by its specific habitat requirements and sensitivity to environmental changes."
}
