{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cranstonii",
    "plant_slug": "abies-cranstonii",
    "plant_name_scientific": "abies cranstonii",
    "intro": "Abies cranstonii, commonly known as the Cranston fir, is a rare and endemic conifer native to the mountainous regions of western China. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged spirally along the shoots. The tree produces small, cone-like structures that contain seeds, typical of the Pinaceae family. It thrives in high-altitude environments with cool, moist climates and well-drained soils. Due to its limited distribution and habitat specificity, the Cranston fir is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cranstonii is primarily native to the western United States, specifically in California and Oregon. It is found in high-elevation areas, typically in coniferous forests. This species is adapted to cool, moist climates and grows in rocky or mountainous terrain. It is often associated with other high-altitude conifers such as Douglas fir and lodgepole pine. Due to its limited range, it is considered a rare and endemic species within its native habitat.",
    "distribution_introduced_art_desc": "Abies cranstonii was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is often found in elevations ranging from 1,500 to 3,000 meters. This species thrives in environments with high humidity and moderate temperatures. It is commonly associated with mixed coniferous forests. Its introduction has been noted in several regions outside its native range, including parts of Europe and Asia."
}
