{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo var. tazaotana",
    "plant_slug": "abies-pinsapo-var-tazaotana",
    "plant_name_scientific": "abies pinsapo var. tazaotana",
    "intro": "Abies pinsapo var. tazaotana, commonly known as the Tazaotan fir, is a rare and endemic species native to the Sierra Nevada mountain range in Spain. It is a coniferous evergreen tree characterized by its narrow, needle-like leaves and conical shape. The tree produces small, cylindrical cones that contain seeds, typical of the fir genus. It thrives in cool, moist environments at high altitudes, often growing in rocky or mountainous terrain. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from climate change and habitat loss.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo var. tazaotana is primarily native to the mountainous regions of North Africa, particularly in the Rif Mountains of northern Morocco. This variety of the Spanish fir is found in high-altitude areas with cool, moist climates. It thrives in rocky and well-drained soils, often growing in dense forests or on steep slopes. The plant is adapted to the harsh conditions of its native habitat, including strong winds and limited sunlight. Its distribution is relatively restricted, making it a rare and endemic species in its region.",
    "distribution_introduced_art_desc": "Abies pinsapo var. tazaotana was mainly introduced to specific regions in North Africa, particularly in the Atlas Mountains of Morocco. This variety is known for its unique ecological adaptations to the arid and semi-arid environments of the region. It has been cultivated for its ornamental value and its ability to thrive in rocky and well-drained soils. The introduction of this plant has contributed to local biodiversity and provided habitat for various wildlife species. However, its spread is limited due to its specific climatic and soil requirements."
}
