{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies durangensis subsp. neodurangensis",
    "plant_slug": "abies-durangensis-subsp-neodurangensis",
    "plant_name_scientific": "abies durangensis subsp. neodurangensis",
    "intro": "Abies durangensis subsp. neodurangensis, commonly known as the Durango fir, is a rare and endemic conifer native to the high-altitude regions of Mexico. It is characterized by its narrow, needle-like leaves and conical shape, typical of the fir genus. The plant thrives in cool, moist environments with well-drained soils, often found in cloud forests. Its cones are small and erect, containing winged seeds that are dispersed by wind. Due to habitat loss and limited distribution, this subspecies is considered endangered and requires conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies durangensis subsp. neodurangensis is primarily native to the mountainous regions of central Mexico, specifically in the states of Durango and Zacatecas. This subspecies is found in high-altitude pine forests, typically at elevations ranging from 2,000 to 3,500 meters. It thrives in areas with cool, moist climates and well-drained soils. The plant is adapted to the rugged terrain and variable weather conditions of the Sierra Madre Occidental. Its distribution is limited to these specific ecological zones, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Abies durangensis subsp. neodurangensis was mainly introduced to areas with temperate climates characterized by high humidity and moderate temperatures. It thrives in well-drained soils and is often found in mountainous regions. This subspecies is particularly adapted to high-altitude environments, where it forms dense forests. Its introduction has been noted in several regions of Mexico, particularly in the Sierra Madre mountains. Due to its ecological importance, it is considered a valuable component of local biodiversity."
}
