{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies minima",
    "plant_slug": "abies-minima",
    "plant_name_scientific": "abies minima",
    "intro": "Abies minima, commonly known as the dwarf fir, is a small evergreen conifer native to the mountainous regions of central and southern China. It typically grows to a height of only 1 to 2 meters, making it one of the smallest species in the genus Abies. The plant has needle-like leaves that are dark green and densely packed, with a waxy coating that helps reduce water loss. Its cones are small and cylindrical, maturing to a reddish-brown color, and it produces both male and female cones on the same plant. Abies minima is well adapted to cold, humid climates and is often found in forested areas at high altitudes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies minima is primarily native to the mountainous regions of eastern Asia, including parts of China, Japan, and Korea. It thrives in cool, moist climates at high elevations, often found in coniferous forests. This species is particularly common in the Himalayas and the northern regions of the Korean Peninsula. It prefers well-drained soils and is adapted to the harsh conditions of its mountainous habitat. Due to its limited range, it is considered a rare and endemic species in these areas.",
    "distribution_introduced_art_desc": "Abies minima was mainly introduced to areas with cool, moist climates and well-drained soils, typically in higher elevation regions. It is often found in mountainous environments where it thrives in partial shade and cooler temperatures. This species is commonly used in horticulture for its ornamental value, particularly its compact size and attractive foliage. Its introduction has been noted in regions outside its native range, such as parts of North America and Europe. However, it is important to monitor its spread to prevent potential ecological impacts on local flora."
}
