{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies microsperma",
    "plant_slug": "abies-microsperma",
    "plant_name_scientific": "abies microsperma",
    "intro": "Abies microsperma, commonly known as the dwarf fir, is a coniferous evergreen tree native to the mountainous regions of central and southern Mexico. It is characterized by its compact growth habit, with short, densely packed branches that form a rounded or conical shape. The foliage consists of needle-like leaves that are dark green and arranged in spirals along the branches. Its cones are small and typically shed their seeds when mature, contributing to its role in local ecosystems. The plant is adapted to high-altitude environments, thriving in cool, moist conditions with well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies microsperma is primarily native to the high elevation regions of the western United States, particularly in California, Oregon, and Nevada. It thrives in cool, moist environments found in mountainous areas, often growing at elevations between 2,000 and 7,000 feet. This species is commonly found in mixed coniferous forests, often alongside other fir species such as Abies concolor and Abies lasiocarpa. It prefers well-drained soils and is adapted to the harsh conditions of its alpine habitat. Due to its specific ecological requirements, its distribution is limited to these particular regions in the western U.S.",
    "distribution_introduced_art_desc": "Abies microsperma was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is commonly found in the Pacific Northwest of the United States and parts of western Canada. This species thrives in elevations ranging from 1,000 to 2,500 meters. It is often used in reforestation efforts due to its adaptability and ecological benefits. However, its introduction has raised concerns about potential impacts on native plant communities."
}
