{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. brevifolia",
    "plant_slug": "abies-excelsa-var-brevifolia",
    "plant_name_scientific": "abies excelsa var. brevifolia",
    "intro": "Abies excelsa var. brevifolia, commonly known as the dwarf white fir, is a variant of the white fir species native to the high-altitude regions of the Himalayas. It is characterized by its compact growth habit and shorter, more densely packed needles compared to the typical white fir. The plant exhibits a conical shape with a broad, rounded crown, and its foliage is typically a dark green color. It thrives in cool, moist environments and is often found in mountainous forests at elevations ranging from 2,500 to 4,500 meters. This variety is valued for its ornamental appeal and ecological importance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. brevifolia is primarily native to the high mountain regions of central and southern Mexico. This variety is found in the Sierra Madre Occidental and the Trans-Mexican Volcanic Belt. It typically grows at elevations between 2,000 and 3,500 meters. The plant thrives in cool, moist climates with well-drained soils. It is commonly found in cloud forests and pine-oak woodlands.",
    "distribution_introduced_art_desc": "Abies excelsa var. brevifolia was mainly introduced to specific regions with suitable high-altitude environments, such as mountainous areas with cool, moist climates. It is typically found in areas with well-drained soils and ample sunlight, which are essential for its growth. This variant is often cultivated in botanical gardens and conservation areas due to its ornamental value and ecological significance. Its introduction has been primarily for horticultural purposes and to enhance biodiversity in certain ecosystems. However, it is not widely naturalized outside its native range."
}
