{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor",
    "plant_slug": "abies-concolor",
    "plant_name_scientific": "abies concolor",
    "intro": "Abies concolor, commonly known as the white fir, is a coniferous evergreen tree native to western North America. It is characterized by its tall, slender form and its distinctive silver-blue needles that are closely arranged along the branches. The cones of Abies concolor are typically short and cylindrical, maturing to a reddish-brown color. This species thrives in cool, moist climates and is often found in mountainous regions. Its ecological importance includes providing habitat for various wildlife species and contributing to forest biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies concolor"
    },
    "taxonomy_art_desc": "Abies concolor belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their complex vascular systems. Its subclass is Pinidae, which is a group of coniferous plants that includes pines, firs, and cedars, known for their needle-like leaves and cone-bearing reproduction. Its order is Pinales, a group of coniferous plants that includes various species such as pines, spruces, and firs, all of which are adapted to a wide range of environments. Its family is Pinaceae, commonly known as the pine family, which includes over 250 species of coniferous trees and shrubs characterized by their cone-bearing structures and needle-like leaves. Its genus is Abies, which consists of species commonly known as firs, characterized by their slender, conical shape and flat, needle-like leaves. Its species is Abies concolor, a specific type of fir tree native to western North America, known for its silver-blue needles and its ability to thrive in mountainous regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Colorado",
        "Idaho",
        "Mexico Northeast",
        "Mexico Northwest",
        "Nevada",
        "New Mexico",
        "Oregon",
        "Utah",
        "Wyoming"
    ],
    "distribution_introduced": [
        "Bulgaria",
        "Czechia-Slovakia",
        "Denmark",
        "Germany",
        "Norway",
        "Sweden",
        "Vermont"
    ],
    "distribution_native_art_desc": "Abies concolor is primarily native to Arizona, California, Colorado, Idaho, Mexico Northeast, Mexico Northwest, Nevada, New Mexico, Oregon, Utah, and Wyoming. This species is commonly found in mountainous regions across these areas. It thrives in high elevations with cool, moist climates. The plant is well adapted to the varied topography of its native range. It plays an important ecological role in the forests of the western United States and northern Mexico.",
    "distribution_introduced_art_desc": "Abies concolor was mainly introduced to Bulgaria, Czechia-Slovakia, Denmark, Germany, Norway, Sweden, and Vermont. It was likely introduced for ornamental purposes due to its attractive appearance and hardiness. The distribution suggests it has been cultivated in various regions across Europe and North America. It thrives in temperate climates with well-drained soil. This introduction has led to its presence in both natural and managed landscapes in these areas."
}
