{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fabri subsp. fabri",
    "plant_slug": "abies-fabri-subsp-fabri",
    "plant_name_scientific": "abies fabri subsp. fabri",
    "intro": "Abies fabri subsp. fabri, commonly known as the Chinese fir, is a coniferous evergreen tree native to eastern Asia. It is characterized by its conical shape, dark green needles, and distinctive, flattened, scale-like bark. The tree produces cones that are typically reddish-brown and contain winged seeds. It thrives in temperate climates and is often found in mountainous regions. This species is valued for its timber and is also cultivated as an ornamental plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fabri subsp. fabri is primarily native to the mountainous regions of eastern China, particularly in the provinces of Zhejiang, Fujian, and Anhui. This species thrives in cool, moist climates at high altitudes, often growing in mixed forests with other coniferous and broadleaf species. It is commonly found in areas with well-drained soils and sufficient rainfall, which supports its growth in these specific habitats. The plant is adapted to the temperate climate of these regions, where it plays an important ecological role. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abies fabri subsp. fabri was mainly introduced to ornamental horticulture and landscaping due to its attractive conical shape and dense foliage. It is commonly cultivated in gardens and parks for its aesthetic value and ability to thrive in a variety of soil conditions. This subspecies is valued for its hardiness and adaptability, making it a popular choice in temperate climates. However, it is important to note that it may spread aggressively in natural areas if not properly managed. Its introduction has raised concerns about its potential impact on native ecosystems."
}
