{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies hanburyana",
    "plant_slug": "abies-hanburyana",
    "plant_name_scientific": "abies hanburyana",
    "intro": "Abies hanburyana, commonly known as the Hanbury fir, is a species of evergreen conifer native to the Himalayas. It is characterized by its tall, slender trunk and dense, pyramidal crown. The needles are dark green and have a waxy coating, while the cones are typically pendulous and have a distinctive shape. It thrives in cool, moist environments at high altitudes. Due to its rarity and habitat specificity, it is considered an endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies hanburyana is primarily native to the mountainous regions of western Yunnan Province in China. It is found in the Hengduan Mountains, where it grows at high elevations in cool, moist climates. This species is also known to occur in parts of northern Myanmar and possibly in the eastern Himalayas. It thrives in temperate forests with well-drained soils and is often associated with other coniferous species. Due to its limited range and specific habitat requirements, it is considered a rare and endangered plant.",
    "distribution_introduced_art_desc": "Abies hanburyana was mainly introduced to the temperate forests of the eastern Himalayas, where it thrives in cool, moist climates. It is commonly found at high altitudes, typically between 2,500 and 4,000 meters above sea level. This species is known for its tall, slender trunk and dense, pyramidal crown. It plays an important role in the ecosystem by providing habitat for various wildlife species. However, it is considered vulnerable due to habitat loss and climate change."
}
