{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba var. caerulea",
    "plant_slug": "abies-alba-var-caerulea",
    "plant_name_scientific": "abies alba var. caerulea",
    "intro": "Abies alba var. caerulea, commonly known as the blue spruce, is a variant of the white fir native to the mountainous regions of Central Europe. It is characterized by its striking blue-gray foliage, which is due to a waxy coating on the needles. The tree typically grows to a height of 15–25 meters, with a conical shape and a dense crown. Its cones are small, woody, and measure up to 2 centimeters in length. This variety is often cultivated for ornamental purposes in gardens and parks due to its aesthetic appeal and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba var. caerulea is primarily native to the mountainous regions of Central and Eastern Europe, including parts of the Carpathian Mountains and the Alps. This variety of the silver fir is found in high-altitude forests where the climate is cool and moist. It thrives in areas with well-drained soils and is often associated with mixed coniferous forests. The plant is particularly common in countries such as Romania, Hungary, and Austria. Its distribution is limited to specific ecological niches that provide the necessary conditions for its growth.",
    "distribution_introduced_art_desc": "Abies alba var. caerulea was mainly introduced to Europe, particularly in Central and Northern regions, as an ornamental tree due to its striking blue foliage. It has been cultivated in gardens and parks for its aesthetic value, especially in areas with cooler climates. The plant's introduction has sometimes led to its escape into the wild, raising concerns about its potential impact on native ecosystems. Despite its beauty, it is not widely naturalized and remains primarily a cultivated species. Its distribution is limited to regions where it is intentionally planted."
}
