{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies densa",
    "plant_slug": "abies-densa",
    "plant_name_scientific": "abies densa",
    "intro": "Abies densa, commonly known as the dense fir, is a coniferous evergreen tree native to the mountainous regions of Central Asia. It is characterized by its dense, dark green foliage and slender, pyramidal shape. The needles are short, stiff, and arranged in compact clusters along the branches. It produces small, spherical cones that mature to a reddish-brown color. This species is adapted to cold climates and is often found in high-altitude forests.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies densa"
    },
    "taxonomy_art_desc": "Abies densa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and clubmosses. Its subclass is Pinidae, which refers to a group of coniferous plants that includes pines, firs, and cedars. Its order is Pinales, which consists of coniferous evergreen trees and shrubs, typically with needle-like leaves. Its family is Pinaceae, known as the pine family, which includes various coniferous trees such as pines, spruces, and firs. Its genus is Abies, commonly known as firs, which are coniferous trees with cylindrical cones and flat, spruce-like leaves. Its species is Abies densa, a specific type of fir characterized by its dense foliage and specific geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "East Himalaya",
        "Nepal",
        "Tibet"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies densa is primarily native to Assam, East Himalaya, Nepal, and Tibet. This species is commonly found in the mountainous regions of these areas. It typically grows in temperate to cold climates at high altitudes. The plant thrives in areas with moist, well-drained soils. Its native distribution is closely associated with the Himalayan mountain range.",
    "distribution_introduced_art_desc": "Abies densa was mainly introduced to areas with moist, well-drained soils and cool, temperate climates. It is commonly found in mountainous regions where it thrives in shaded, forested environments. This species is often used in landscaping for its dense, pyramidal shape and evergreen foliage. However, it can become invasive in certain regions if not managed properly. Its introduction has raised concerns about its impact on native ecosystems and biodiversity."
}
