{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nigra var. nana",
    "plant_slug": "abies-nigra-var-nana",
    "plant_name_scientific": "abies nigra var. nana",
    "intro": "Abies nigra var. nana, commonly known as the dwarf fir, is a compact evergreen shrub native to the northeastern United States. It features dense, dark green foliage that is shorter and more rounded compared to the typical fir species. The plant produces small, cone-like structures that mature to a reddish-brown color, typical of the fir genus. It thrives in moist, acidic soils and prefers partial to full shade. Its slow growth rate makes it an ideal choice for rock gardens or as a decorative plant in woodland settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nigra var. nana is primarily native to the northeastern United States and southeastern Canada. It is found in regions such as New York, Vermont, New Hampshire, and parts of Ontario. This variety thrives in cool, moist environments, typically in mountainous or boreal forest areas. It is often found in rocky or well-drained soils at higher elevations. Its small size and dense growth make it a distinctive component of its native habitat.",
    "distribution_introduced_art_desc": "Abies nigra var. nana was mainly introduced to North America, particularly in the northeastern United States and southeastern Canada. It was introduced for ornamental purposes due to its compact size and attractive foliage. This variety is often used in landscaping and as a specimen plant in gardens. It has been cultivated in regions with moist, well-drained soils and cool climates. However, it is not considered invasive and remains a popular choice for decorative planting."
}
