{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo f. glauca",
    "plant_slug": "abies-pinsapo-f-glauca",
    "plant_name_scientific": "abies pinsapo f. glauca",
    "intro": "Abies pinsapo f. glauca, commonly known as the glaucous fir, is a rare and unique variant of the Canary Island fir. It is characterized by its distinctive blue-gray foliage, which gives it a striking appearance in its natural habitat. This plant is native to the Canary Islands and thrives in high-altitude environments with cool, moist conditions. Its cones are typically small and reddish-brown, maturing in the second year. The species is of particular interest to botanists due to its limited distribution and unique adaptations to its mountainous ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo f. glauca is primarily native to the mountainous regions of the Iberian Peninsula, particularly in southern Spain. This variety of the Swiss stone pine is found in areas with high altitudes and a Mediterranean climate. It thrives in rocky soils and is often associated with other endemic plant species in the region. The distribution is limited to specific microhabitats that provide the necessary conditions for its growth. Due to its restricted range, it is considered a rare and vulnerable plant species.",
    "distribution_introduced_art_desc": "Abies pinsapo f. glauca was mainly introduced to areas with a Mediterranean climate characterized by mild, wet winters and hot, dry summers. This distribution is primarily found in southern Europe, particularly in Spain and Portugal, where the plant thrives in rocky and well-drained soils. It is often found in mountainous regions, such as the Sierra Nevada and the Iberian Peninsula, where it adapts to harsh environmental conditions. The introduction of this subspecies has been limited to specific ecological niches that match its natural habitat. Its presence in these regions highlights its adaptability to specific climatic and soil conditions."
}
