{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies leptolepis",
    "plant_slug": "abies-leptolepis",
    "plant_name_scientific": "abies leptolepis",
    "intro": "Abies leptolepis, commonly known as the Japanese white pine, is a coniferous evergreen tree native to Japan. It is characterized by its slender, pyramidal shape and its long, needle-like leaves that are bluish-green in color. The tree produces cones that are typically 5 to 8 centimeters in length, containing seeds that are dispersed by wind. It thrives in cool, moist climates and is often found in mountainous regions. The bark of Abies leptolepis is thick and scaly, providing protection against environmental stress.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies leptolepis is primarily native to the mountainous regions of eastern Asia, including Japan, China, and the Korean Peninsula. It is commonly found in temperate forest ecosystems at high elevations. This species thrives in cool, moist climates with well-drained soils. It is often associated with mixed coniferous forests and is a key component of the flora in these regions. Its distribution is largely limited to the northern and central parts of its native range.",
    "distribution_introduced_art_desc": "Abies leptolepis was mainly introduced to regions where its cold-hardy characteristics are beneficial for reforestation and ornamental purposes. It is commonly found in temperate and subalpine climates, thriving in well-drained soils and full sun. This species has been introduced to parts of North America, particularly in the western United States, for its ecological and aesthetic value. Its distribution has expanded due to both natural dispersal and human-assisted planting efforts. However, it is important to monitor its spread to prevent potential impacts on native ecosystems."
}
