{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies olcayana",
    "plant_slug": "abies-olcayana",
    "plant_name_scientific": "abies olcayana",
    "intro": "Abies olcayana, commonly known as the Turkish fir, is a coniferous tree native to Turkey. It belongs to the genus Abies, which includes various species of fir trees. The plant is characterized by its conical shape, dark green needles, and distinctive cones. It typically grows in mountainous regions with cool, moist climates. The botanical features of Abies olcayana make it an important species in its native ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies olcayana is primarily native to the high-altitude regions of the Taurus Mountains in southern Turkey. This species is found in the eastern part of the country, particularly in the provinces of Mersin, Adana, and Kahramanmaraş. It thrives in cool, moist climates at elevations ranging from 1,500 to 3,000 meters. The plant is commonly found in mixed forests and mountainous areas with well-drained soils. It plays an important ecological role in its native habitat by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Abies olcayana was mainly introduced to areas with temperate climates and high altitudes, where it thrives in cool, moist environments. It is commonly found in mountainous regions with well-drained soils and moderate precipitation. This species is often planted for its ornamental value due to its attractive conical shape and evergreen foliage. However, its introduction has raised concerns about its potential impact on native ecosystems. Despite its aesthetic appeal, Abies olcayana is considered an invasive species in some regions where it outcompetes local flora."
}
