{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pectinata var. pyramidalis",
    "plant_slug": "abies-pectinata-var-pyramidalis",
    "plant_name_scientific": "abies pectinata var. pyramidalis",
    "intro": "Abies pectinata var. pyramidalis, commonly known as the pyramidal white fir, is a variant of the white fir native to the western United States. It is characterized by its conical shape and dense, dark green needles that are shorter than those of the typical white fir. The tree produces cylindrical cones that hang downward, containing winged seeds dispersed by the wind. Its bark is thick and furrowed, providing a rugged texture. This variety is often cultivated for its ornamental value in gardens and landscapes due to its compact form and evergreen foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pectinata var. pyramidalis is primarily native to the western United States, specifically California and Oregon. This variant of the white fir is found in high elevation areas, typically above 1,500 meters. It grows in moist, well-drained soils within coniferous forests. The plant thrives in cool, humid climates with significant annual precipitation. Its distribution is limited to specific mountain ranges where suitable habitat conditions exist.",
    "distribution_introduced_art_desc": "Abies pectinata var. pyramidalis was mainly introduced to ornamental horticulture and landscaping due to its distinctive pyramidal shape and evergreen foliage. It is commonly cultivated in gardens and as a decorative plant in urban environments. The variety is favored for its compact growth habit, making it suitable for small spaces and rock gardens. However, it is not native to North America and has been introduced primarily in regions with temperate climates. Its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
