{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × insignis var. mastersiana",
    "plant_slug": "abies-×-insignis-var-mastersiana",
    "plant_name_scientific": "abies × insignis var. mastersiana",
    "intro": "Abies × insignis var. mastersiana, commonly known as the Masters' fir, is a hybrid coniferous tree native to the western United States. It is a cross between Abies balsamea and Abies lasiocarpa, resulting in a species with unique botanical characteristics. The tree typically grows in high-altitude environments, such as mountainous regions, where it thrives in cool, moist conditions. Its foliage consists of needle-like leaves that are dark green on top and whitish underneath, providing a striking visual contrast. The cones are usually small and conical, maturing to release seeds that aid in its propagation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × insignis var. mastersiana is primarily native to the mountainous regions of western North America, particularly in the western United States and southern British Columbia. This hybrid fir species is found in areas with high elevation and cool, moist climates. It typically grows in coniferous forests and is adapted to rocky or well-drained soils. The plant's native range includes parts of California, Oregon, and Washington. It is often found in the Sierra Nevada and Cascade mountain ranges.",
    "distribution_introduced_art_desc": "Abies × insignis var. mastersiana was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in areas with moist, well-drained soils and cool, temperate climates. This hybrid fir is valued for its ornamental qualities, including its compact growth habit and attractive foliage. It has been widely used in landscaping and reforestation projects due to its adaptability. However, it is important to monitor its spread to prevent potential ecological impacts in native habitats."
}
