{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies decidua",
    "plant_slug": "abies-decidua",
    "plant_name_scientific": "abies decidua",
    "intro": "Abies decidua, commonly known as the Serbian fir, is a coniferous evergreen tree native to the mountainous regions of Southeast Europe. It is characterized by its slender, conical shape and dark green, needle-like leaves that are typically arranged in spirals along the branches. The tree produces cone-like structures that contain seeds, which are dispersed by wind. Its bark is reddish-brown and becomes fissured with age, while its roots are adapted to thrive in well-drained, acidic soils. The Serbian fir is often found in high-altitude forests and is valued for its ornamental appeal and ecological importance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies decidua is primarily native to the mountainous regions of central and eastern Europe, including countries such as Austria, Czech Republic, Germany, Italy, Poland, and Slovakia. It thrives in high-altitude environments, typically found in alpine and subalpine forests. This species is commonly found in areas with cool, moist climates and well-drained soils. It is often associated with mixed coniferous forests and can be found at elevations ranging from 1,200 to 2,500 meters. The plant plays an important ecological role in these mountain ecosystems.",
    "distribution_introduced_art_desc": "Abies decidua was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is commonly planted in gardens and parks for its ornamental value and ability to thrive in shaded conditions. This species is particularly suited for USDA hardiness zones 4 through 7. Its introduction has been noted in several regions of North America, where it has been cultivated for both aesthetic and ecological purposes. However, it is important to monitor its spread to prevent potential invasiveness in native ecosystems."
}
