{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies communis",
    "plant_slug": "abies-communis",
    "plant_name_scientific": "abies communis",
    "intro": "Abies communis, commonly known as the European fir, is a coniferous evergreen tree native to Europe and western Asia. It typically grows to a height of 20–30 meters, featuring a conical shape with dense, dark green needles. The tree produces cones that hang downward, containing seeds surrounded by a papery wing. Its bark is thin and smooth, becoming fissured with age, and it thrives in temperate climates with well-drained soil. The European fir is valued for its timber and is also an important species in forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies communis is primarily native to eastern Asia, including regions such as China, Korea, and Japan. It is commonly found in mountainous areas with cool, moist climates. This species thrives in temperate forests at elevations ranging from 1,000 to 3,000 meters. It is particularly associated with the Korean Peninsula and parts of northeastern China. The plant is well adapted to acidic soils and is often a dominant tree species in its native habitat.",
    "distribution_introduced_art_desc": "Abies communis was mainly introduced to the data as a key species in high-altitude forest ecosystems. It is commonly found in mountainous regions with cool, moist climates. The distribution data highlights its presence in areas with well-drained soils and sufficient rainfall. This plant plays a vital role in maintaining biodiversity and soil stability in its native habitats. Its introduction to the dataset helps in understanding the ecological dynamics of alpine environments."
}
