{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba f. compacta",
    "plant_slug": "abies-alba-f-compacta",
    "plant_name_scientific": "abies alba f. compacta",
    "intro": "Abies alba f. compacta, commonly known as the compact form of the European silver fir, is a unique variant characterized by its dense, slow-growing foliage. This form exhibits a more rounded and compact growth habit compared to the typical straight trunk of the species. It features needle-like leaves that are shorter and more closely packed, giving it a bushy appearance. The plant retains its needles year-round, making it an evergreen with a distinctive visual appeal. It is often cultivated as an ornamental plant in gardens and landscapes due to its aesthetic value and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba f. compacta is primarily native to the mountainous regions of Central Europe, particularly in the Alps and Carpathian Mountains. This compact form of the European silver fir is found in high-altitude areas where the climate is cool and moist. It thrives in well-drained soils and is often found in mixed forests alongside other coniferous species. The plant is adapted to harsh environmental conditions, including strong winds and limited sunlight. Its native range includes parts of Germany, Austria, Italy, and Romania.",
    "distribution_introduced_art_desc": "Abies alba f. compacta was mainly introduced to ornamental horticulture and landscape design due to its compact growth habit and aesthetic appeal. It is often used in gardens and urban environments where space is limited. This form of the European silver fir is valued for its dense foliage and ability to thrive in a variety of soil conditions. However, it is important to note that its introduction may have ecological implications in non-native regions. Its distribution is primarily restricted to cultivation rather than natural wild populations."
}
