{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies dammara",
    "plant_slug": "abies-dammara",
    "plant_name_scientific": "abies dammara",
    "intro": "Abies dammara, commonly known as the Dammara fir, is a coniferous evergreen tree native to the mountainous regions of Southeast Asia. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The tree produces small, spherical cones that contain seeds surrounded by a papery covering. It thrives in cool, moist climates and is often found in high-altitude forests. The bark of Abies dammara is typically smooth and reddish-brown, becoming fissured with age.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies dammara is primarily native to Southeast Asia, specifically found in countries such as Myanmar, Thailand, and Vietnam. It thrives in mountainous regions with cool, moist climates. This species is commonly found in primary and secondary forests at elevations ranging from 1,000 to 2,500 meters. It plays an important ecological role in these forest ecosystems. Due to habitat loss, it is also considered a vulnerable species in some areas.",
    "distribution_introduced_art_desc": "Abies dammara was mainly introduced to specific regions in Southeast Asia, including parts of Indonesia and the Philippines. It was brought there for its ornamental value and potential for reforestation efforts. The plant thrives in cool, moist climates with well-drained soil, making it suitable for mountainous areas. Its introduction has led to both ecological benefits and concerns about invasive growth in non-native habitats. Conservationists are monitoring its spread to ensure it does not disrupt local ecosystems."
}
