{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies shastensis",
    "plant_slug": "abies-shastensis",
    "plant_name_scientific": "abies shastensis",
    "intro": "Abies shastensis, commonly known as the Shasta fir, is a coniferous evergreen tree native to the western United States. It is characterized by its conical shape, dark green foliage, and distinctive blue-green needles. The tree produces cones that are typically 5 to 8 centimeters long, containing winged seeds. It thrives in cool, moist climates at high elevations, often found in mountainous regions. The Shasta fir is valued for its ornamental beauty and plays a significant role in the ecosystems of its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies shastensis is primarily native to the mountainous regions of western North America, specifically in the states of California, Oregon, and Washington. It is commonly found in the Sierra Nevada and Cascade mountain ranges, where it thrives in cool, moist environments. This species is typically associated with high elevation forests and is often found in association with other coniferous trees. It prefers well-drained soils and is adapted to the harsh climatic conditions of its native habitat. Abies shastensis is an important component of the subalpine and alpine ecosystems in these regions.",
    "distribution_introduced_art_desc": "Abies shastensis was mainly introduced to specific regions in the western United States, particularly in California and Oregon, where it thrives in high elevation environments. This plant is commonly found in areas with moist, well-drained soils and cool, temperate climates. It is often cultivated in botanical gardens and conservation areas due to its ecological significance and ornamental value. The distribution of Abies shastensis is largely restricted to its native habitat, with limited introduction outside of these regions. Its presence in these areas supports local biodiversity and plays a role in forest ecosystems."
}
