{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies falcata",
    "plant_slug": "abies-falcata",
    "plant_name_scientific": "abies falcata",
    "intro": "Abies falcata, commonly known as the sawtooth fir, is a coniferous evergreen tree native to the eastern United States. It is characterized by its distinctive, saw-toothed leaf margins, which give it its common name. The tree has needle-like leaves that are typically blue-green in color and are arranged in spirals along the branches. Its cones are elongated and cylindrical, maturing to a reddish-brown color. The sawtooth fir thrives in moist, acidic soils and is often found in mountainous regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies falcata is primarily native to the mountainous regions of Southeastern United States, specifically in the Appalachian Mountains. It is found in states such as Georgia, North Carolina, South Carolina, Tennessee, and Virginia. This species thrives in cool, moist climates at high elevations, typically in forested areas with well-drained soils. It is commonly associated with mixed hardwood and coniferous forests. The plant's range is limited and it is considered a rare and endangered species in its native habitat.",
    "distribution_introduced_art_desc": "Abies falcata was mainly introduced to areas with temperate climates that provide suitable growing conditions for its growth. It is commonly found in regions with well-drained soils and moderate rainfall. This plant has been introduced to parts of North America, particularly in the eastern United States. Its introduction has sometimes led to ecological impacts due to its ability to thrive in diverse environments. It is often cultivated for its ornamental value and timber production."
}
