{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies vejarii var. mexicana",
    "plant_slug": "abies-vejarii-var-mexicana",
    "plant_name_scientific": "abies vejarii var. mexicana",
    "intro": "Abies vejarii var. mexicana, commonly known as the Mexican fir, is a rare and endemic conifer native to the Sierra Madre Occidental in Mexico. It is characterized by its slender, pyramidal shape and needle-like leaves that are blue-green in color. The tree produces cones that are typically pendulous and contain edible seeds. It thrives in cool, moist, high-altitude environments and is adapted to rocky soils. Due to habitat loss and limited distribution, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies vejarii var. mexicana is primarily native to the highlands of central Mexico, particularly in the states of Guanajuato, Hidalgo, and San Luis Potosí. This variety of the white fir is typically found in mountainous regions with elevations ranging from 1,500 to 3,000 meters above sea level. It thrives in temperate climates with high humidity and well-drained soils. The plant is commonly associated with cloud forests and mixed coniferous forests. Due to habitat loss and climate change, its native distribution has become increasingly fragmented.",
    "distribution_introduced_art_desc": "Abies vejarii var. mexicana was mainly introduced to the western United States, particularly in regions with high elevation and cool, moist climates. It is commonly found in mountainous areas of California, Oregon, and Washington. This variety is valued for its ornamental qualities, including its dense foliage and pyramidal shape. It has been planted in both natural and cultivated landscapes due to its adaptability and aesthetic appeal. However, its introduction has raised concerns about potential impacts on native ecosystems."
}
