{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies apollinis var. reginae-amaliae",
    "plant_slug": "abies-apollinis-var-reginae-amaliae",
    "plant_name_scientific": "abies apollinis var. reginae-amaliae",
    "intro": "Abies apollinis var. reginae-amaliae, commonly known as the Queen Amalia fir, is a rare and ornamental conifer native to the mountainous regions of Central Europe. It is characterized by its slender, pyramidal shape and its distinctive, dark green needles that are slightly twisted. The cones are typically small and cylindrical, maturing to a reddish-brown color. This variety is prized for its aesthetic appeal and is often cultivated in botanical gardens and private collections. Due to its limited natural range and specific habitat requirements, it is considered a rare and endangered species in the wild.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies apollinis var. reginae-amaliae is primarily native to the southern Carpathian Mountains in Romania. This rare and endemic subspecies is found in specific elevations within the Făgăraș and Retezat mountain ranges. It thrives in cool, moist microhabitats such as north-facing slopes and rocky outcrops. The plant is closely associated with ancient forests and is considered a relict species from the Tertiary period. Due to its restricted distribution and habitat specificity, it is highly vulnerable to environmental changes and human disturbance.",
    "distribution_introduced_art_desc": "Abies apollinis var. reginae-amaliae was mainly introduced to ornamental horticulture and botanical gardens due to its unique aesthetic appeal and compact growth habit. It is valued for its dense, pyramidal shape and vibrant needle color, making it a desirable specimen for landscape design. The variety is also appreciated for its cold hardiness and ability to thrive in a range of soil conditions. It has been cultivated in several regions with temperate climates, including parts of Europe and North America. However, its introduction has raised concerns about its potential invasiveness in non-native environments."
}
