{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies forrestii subsp. chayuensis",
    "plant_slug": "abies-forrestii-subsp-chayuensis",
    "plant_name_scientific": "abies forrestii subsp. chayuensis",
    "intro": "Abies forrestii subsp. chayuensis, commonly known as the Chayu fir, is a rare and endemic conifer native to the eastern Himalayas. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in a compact, sub-opposite pattern. The tree produces cone-like structures that contain both male and female reproductive organs, typical of the Pinaceae family. Its bark is thick and scaly, providing protection against harsh environmental conditions. This subspecies is of significant botanical interest due to its limited distribution and unique adaptations to high-altitude ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies forrestii subsp. chayuensis is primarily native to the eastern Himalayas, including regions in Nepal, Bhutan, and northern India. It is found in the subtropical and temperate forest zones at elevations ranging from 1,500 to 3,500 meters. This subspecies typically grows in moist, well-drained soils within mountainous areas. It is often associated with mixed coniferous forests and is adapted to the cool, humid climate of its native habitat. The plant plays an important ecological role in these high-altitude ecosystems.",
    "distribution_introduced_art_desc": "Abies forrestii subsp. chayuensis was mainly introduced to regions with high altitudes and cool, moist climates, typically found in mountainous areas of China. It thrives in well-drained soils and requires partial to full shade, making it suitable for forested environments. This subspecies is valued for its ornamental appeal and ecological benefits, such as providing habitat for wildlife. It has been introduced to various botanical gardens and conservation sites to promote biodiversity. However, its distribution remains limited due to specific environmental requirements and potential threats from climate change."
}
