{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies picea var. leioclada",
    "plant_slug": "abies-picea-var-leioclada",
    "plant_name_scientific": "abies picea var. leioclada",
    "intro": "Abies picea var. leioclada, commonly known as the white fir, is a variant of the balsam fir native to the mountainous regions of western North America. It is characterized by its slender, conical shape and dense, dark green foliage that is often covered with a waxy coating. The needles are typically shorter and more rigid compared to other fir species, and they emit a strong, resinous fragrance. The cones are small, cylindrical, and often remain attached to the branches for years. This variety is well adapted to cold climates and is often found in high-altitude forests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies picea var. leioclada is primarily native to the mountainous regions of western North America, particularly in the western United States and southern British Columbia. This variety is commonly found in coniferous forests at high elevations, where it thrives in cool, moist climates. It is often associated with other subalpine and alpine tree species, forming part of the forest ecosystem in these areas. The plant is adapted to rocky and well-drained soils, making it a characteristic species of mountainous terrain. Its distribution is limited to specific geographic regions where the climate and soil conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Abies picea var. leioclada was mainly introduced to ornamental horticulture and forestry due to its aesthetic appeal and hardiness. It is valued for its dense foliage, pyramidal shape, and ability to thrive in a variety of soil conditions. This variety is often used in landscaping for its visual impact and as a windbreak in agricultural settings. Its introduction has expanded its range beyond its native habitat in the Pacific Northwest of North America. However, it is important to monitor its spread to prevent potential ecological impacts in non-native regions."
}
