{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor var. martinezii",
    "plant_slug": "abies-concolor-var-martinezii",
    "plant_name_scientific": "abies concolor var. martinezii",
    "intro": "Abies concolor var. martinezii, commonly known as the Martinez's white fir, is a rare and distinctive variant of the white fir species. It is native to the high elevations of the western United States, particularly in California and Nevada. This evergreen conifer has needle-like leaves that are typically light green with a subtle blue tint. Its cones are cylindrical and have a distinctive shape, often maturing to a reddish-brown color. The plant is characterized by its slow growth rate and is adapted to cold, moist environments with well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor var. martinezii is primarily native to the western United States, specifically in California and northern Baja California. It is found in high-elevation mountainous regions, particularly in the Sierra Nevada and Peninsular Ranges. This variety thrives in cool, moist environments with well-drained soils. It is commonly associated with coniferous forests and is often found at elevations between 1,500 and 3,000 meters. Due to its limited range, it is considered a rare and endemic species within its habitat.",
    "distribution_introduced_art_desc": "Abies concolor var. martinezii was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in high elevation forests and mountainous regions where it thrives in cool, moist environments. This variant is known for its distinctive blue-green foliage and conical shape, making it a popular ornamental plant. It has been introduced to various ecological zones, including mixed coniferous forests. However, its introduction has raised concerns about its potential impact on native plant communities."
}
