{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fargesii subsp. faxoniana",
    "plant_slug": "abies-fargesii-subsp-faxoniana",
    "plant_name_scientific": "abies fargesii subsp. faxoniana",
    "intro": "Abies fargesii subsp. faxoniana, commonly known as the Farges' fir, is a coniferous evergreen tree native to the mountainous regions of western China. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are arranged spirally along the branches. The cones of this subspecies are typically pendulous and can reach lengths of up to 15 centimeters. It thrives in cool, moist environments and is often found at high elevations in forested areas. The plant is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fargesii subsp. faxoniana is primarily native to the mountainous regions of western China, including the Hengduan Mountains and the eastern Himalayas. It is commonly found in the provinces of Sichuan, Yunnan, and Tibet. This subspecies thrives in cool, moist climates at high altitudes, typically between 2,000 and 3,500 meters. It is often found in mixed forests alongside other coniferous species. Its natural range extends into northern India and Nepal as well.",
    "distribution_introduced_art_desc": "Abies fargesii subsp. faxoniana was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It thrives in elevations ranging from 1,500 to 3,500 meters, where it forms dense forests or stands. This subspecies is commonly found in regions of China, particularly in the Hengduan Mountains and eastern Tibet. It is valued for its ornamental qualities and has been introduced to other parts of the world for horticultural purposes. However, it is not widely naturalized outside its native range."
}
