{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea f. phanerolepis",
    "plant_slug": "abies-balsamea-f-phanerolepis",
    "plant_name_scientific": "abies balsamea f. phanerolepis",
    "intro": "Abies balsamea f. phanerolepis, commonly known as the balsam fir, is a variant of the balsam fir tree native to eastern North America. It is characterized by its conical shape, dark green needles, and distinctive aromatic resin. The foliage is typically dense and has a slightly rough texture, with the needles arranged in two rows along the branches. This form is often found in forested areas, growing in acidic, well-drained soils. It plays an important ecological role, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamea f. phanerolepis is primarily native to the northeastern United States and southeastern Canada. It is found in regions such as New England, New York, and the Canadian provinces of Quebec and Ontario. This subspecies typically grows in moist, acidic soils in coniferous forests. It thrives in cooler climates and is often associated with boreal and mixed forest ecosystems. The distribution of this plant is largely limited to areas with a temperate to subarctic climate.",
    "distribution_introduced_art_desc": "Abies balsamea f. phanerolepis was mainly introduced to areas with moist, well-drained soils and cool climates, typically in northern regions of North America. It is often found in forested areas where it can thrive under the canopy of larger trees. This form is characterized by its more pronounced leaf arrangement and is sometimes cultivated for ornamental purposes. It has been introduced to several regions beyond its native range, including parts of Europe and Asia. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
