{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fraseri var. hudsonia",
    "plant_slug": "abies-fraseri-var-hudsonia",
    "plant_name_scientific": "abies fraseri var. hudsonia",
    "intro": "Abies fraseri var. hudsonia, commonly known as the Hudson's fir, is a variant of the Fraser fir native to the Appalachian Mountains. It is a coniferous evergreen tree characterized by its dense, pyramidal shape and needle-like leaves. The foliage is typically dark green with a silvery-white underside, providing a striking visual contrast. It produces cone-like structures that contain seeds, which are dispersed by wind. This plant thrives in cool, moist environments and is often found in high-elevation forests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fraseri var. hudsonia is primarily native to the western coast of North America, specifically in British Columbia, Canada. It is found in the coastal rainforests of the Pacific Northwest, including areas along the mainland and the islands of Vancouver Island and the Queen Charlotte Islands. This variety thrives in moist, temperate climates with high rainfall and cool temperatures. It is commonly found in mountainous regions and along river valleys. Its natural range extends from the coastal areas of British Columbia southward into parts of Washington State.",
    "distribution_introduced_art_desc": "Abies fraseri var. hudsonia was mainly introduced to specific regions in North America, particularly in the Pacific Northwest. It was brought in for its ornamental value due to its attractive pyramidal shape and vibrant foliage. This variety is commonly found in urban and suburban landscapes where it is used as a decorative tree. It has also been introduced to some parts of Europe for similar landscaping purposes. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
