{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies kaempferi",
    "plant_slug": "abies-kaempferi",
    "plant_name_scientific": "abies kaempferi",
    "intro": "Abies kaempferi, commonly known as the Japanese fir, is a coniferous evergreen tree native to Japan. It belongs to the family Pinaceae and is characterized by its tall, slender trunk and dense, pyramidal crown. The tree has needle-like leaves that are dark green and arranged in spirals along the branches. Its cones are typically cylindrical and hang downward, containing seeds that are dispersed by wind. Abies kaempferi is valued for its ornamental appeal and is often cultivated in gardens and landscapes for its aesthetic and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies kaempferi is primarily native to Japan, specifically the southern regions of Honshu, Shikoku, and Kyushu. It is commonly found in mountainous areas with cool, moist climates. This species thrives in temperate forests at elevations ranging from 600 to 1,500 meters. It is well adapted to acidic soils and is often part of the understory in mixed coniferous forests. Due to its ornamental value, it has also been introduced to other parts of the world, but its natural range remains largely confined to Japan.",
    "distribution_introduced_art_desc": "Abies kaempferi was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is commonly found in temperate forests where it thrives in partial shade and moderate temperatures. This species is often planted for its ornamental value due to its attractive pyramidal shape and evergreen foliage. It has been introduced to several countries outside its native range, including parts of Europe and North America. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
