{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abietia fortunei",
    "plant_slug": "abietia-fortunei",
    "plant_name_scientific": "abietia fortunei",
    "intro": "Abietia fortunei, commonly known as the Chinese fir, is a coniferous evergreen tree native to eastern Asia. It belongs to the family Pinaceae and is characterized by its needle-like leaves and cone-bearing structure. The tree can grow up to 30 meters tall, with a straight trunk and a conical crown. Its bark is thick and fissured, providing protection against environmental stress. The plant is valued for its timber and is also used in traditional Chinese medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abietia fortunei is primarily native to China, specifically the provinces of Yunnan and Sichuan. It grows in the mountainous regions of these areas, often in humid and cool climates. This plant is commonly found in secondary forests and along stream banks at elevations ranging from 1,500 to 3,000 meters. It is well adapted to the temperate and subtropical conditions of its native habitat. Due to its ornamental value, it has also been introduced to other parts of the world.",
    "distribution_introduced_art_desc": "Abietia fortunei was mainly introduced to the southern United States, particularly in Texas and Louisiana, as an ornamental plant due to its attractive foliage and resilience. It has since spread into nearby regions, including parts of Oklahoma and Arkansas, where it thrives in similar environmental conditions. This plant is often found in disturbed soils and along roadsides, contributing to the ecological dynamics of these areas. Its introduction has raised concerns about its potential invasiveness in native ecosystems. Despite its ornamental appeal, it is important to monitor its spread to prevent negative impacts on local biodiversity."
}
