{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × arnoldiana",
    "plant_slug": "abies-×-arnoldiana",
    "plant_name_scientific": "abies × arnoldiana",
    "intro": "Abies × arnoldiana, commonly known as the Colorado blue spruce, is a hybrid conifer resulting from the cross between Abies concolor and Abies lasiocarpa. It is characterized by its distinctive bluish-green needles and a conical shape that becomes more compact with age. The plant is native to the western United States, particularly in higher elevations of the Rocky Mountains. Its foliage is dense and often used in ornamental landscaping due to its aesthetic appeal. The cones are small and typically disintegrate into a fluffy mass, releasing seeds that can germinate in suitable conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × arnoldiana is primarily native to the mountainous regions of the western United States, particularly in California, Oregon, and Washington. It is a hybrid species resulting from the cross between Abies magnifica and Abies concolor. This plant typically grows in high elevation forests at altitudes ranging from 1,500 to 3,000 meters. It thrives in cool, moist climates with well-drained soils. Due to its hybrid nature, it is often found in areas where the parent species overlap geographically.",
    "distribution_introduced_art_desc": "Abies × arnoldiana was mainly introduced to ornamental horticulture and forestry due to its attractive foliage and adaptability to various climates. It is commonly found in temperate regions where it is cultivated for its aesthetic value in gardens and landscapes. This hybrid species is often used in reforestation projects because of its hardiness and ability to thrive in different soil conditions. Its introduction has expanded its natural range beyond its native habitats in North America and Europe. However, its spread has raised concerns about potential invasiveness in non-native environments."
}
