{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies eremita",
    "plant_slug": "abies-eremita",
    "plant_name_scientific": "abies eremita",
    "intro": "Abies eremita, commonly known as the Mexican fir, is a species of evergreen conifer native to the highlands of Mexico. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The tree produces small, spherical cones that mature to a reddish-brown color, containing winged seeds. It thrives in cool, moist climates and is often found in cloud forests at elevations above 2,000 meters. Due to its limited range and habitat specificity, Abies eremita is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies eremita is primarily native to the Sierra Madre Occidental and Sierra Madre del Sur mountain ranges in Mexico. It is found in the states of Sinaloa, Nayarit, Jalisco, Michoacán, and Guerrero. This species thrives in high-altitude cloud forests, typically between 1,500 and 3,000 meters above sea level. It is a rare and endemic conifer, often growing in rocky soils and steep slopes. Due to its limited range and habitat specificity, it is considered vulnerable to environmental changes and habitat loss.",
    "distribution_introduced_art_desc": "Abies eremita was mainly introduced to the western United States, particularly in areas with high elevation and cold climates. It is commonly found in mountainous regions of California, Nevada, and Utah. This species thrives in well-drained soils and full sun exposure. It is often planted as an ornamental tree due to its unique shape and evergreen foliage. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
