{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies harryana",
    "plant_slug": "abies-harryana",
    "plant_name_scientific": "abies harryana",
    "intro": "Abies harryana, commonly known as the Harry's fir, is a species of evergreen conifer native to the mountainous regions of central Asia. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are arranged in spirals along the branches. The cones of Abies harryana are typically small and cylindrical, maturing to a reddish-brown color. This plant thrives in cool, moist environments and is often found at high altitudes where it forms part of the alpine ecosystem. Its botanical features make it a distinctive and valuable component of its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies harryana is primarily native to the mountainous regions of central and southern China, specifically in the provinces of Sichuan, Yunnan, and Guizhou. It thrives in high-altitude forests at elevations ranging from 2,500 to 4,000 meters. This species is also found in parts of northern Vietnam and northern Myanmar. It prefers cool, moist climates with well-drained soils. Abies harryana is commonly associated with mixed coniferous forests in these regions.",
    "distribution_introduced_art_desc": "Abies harryana was mainly introduced to North America, particularly in the United States and Canada, during the late 19th and early 20th centuries. It was brought for ornamental purposes due to its attractive pyramidal shape and dense foliage. The plant has been cultivated in gardens and landscapes, especially in regions with cool, moist climates. However, it is not commonly found in the wild and remains largely a cultivated species. Its introduction has been limited to specific horticultural settings rather than natural ecosystems."
}
