{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea subsp. phanerolepis",
    "plant_slug": "abies-balsamea-subsp-phanerolepis",
    "plant_name_scientific": "abies balsamea subsp. phanerolepis",
    "intro": "Abies balsamea subsp. phanerolepis, commonly known as the eastern white fir, is a coniferous tree native to eastern North America. It is characterized by its slender, conical shape and needle-like leaves that are typically bluish-green in color. The tree produces small, spherical cones that mature to a reddish-brown color, containing winged seeds. It thrives in moist, well-drained soils and is often found in mixed forests. This subspecies is known for its ornamental value and is sometimes cultivated for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamea subsp. phanerolepis is primarily native to eastern North America, specifically the northeastern United States and southeastern Canada. This subspecies is found in regions characterized by cool, moist climates and well-drained soils. It typically grows in mountainous areas and boreal forests, often at elevations ranging from 600 to 2,000 meters. The plant thrives in areas with acidic soil and is commonly associated with mixed coniferous forests. Its distribution includes states such as Maine, New Hampshire, and Vermont, as well as provinces like Quebec and New Brunswick.",
    "distribution_introduced_art_desc": "Abies balsamea subsp. phanerolepis was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in higher elevations. It is commonly found in regions with temperate to subarctic conditions, such as parts of North America and Europe. This subspecies is often cultivated for its ornamental value due to its distinctive foliage and conical shape. It has been introduced to various horticultural gardens and landscapes where it thrives in partial shade. However, its introduction has raised concerns about its potential impact on native ecosystems in non-native regions."
}
