{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor f. globosa",
    "plant_slug": "abies-concolor-f-globosa",
    "plant_name_scientific": "abies concolor f. globosa",
    "intro": "Abies concolor f. globosa, commonly known as the white fir dwarf form, is a compact variant of the white fir tree native to the western United States. It is characterized by its dense, spherical growth habit and short, stout branches that give it a rounded appearance. The foliage consists of scale-like leaves that are typically a silvery-blue to gray-green color, providing year-round visual interest. This form is often cultivated in gardens for its ornamental value and ability to thrive in well-drained soils. It prefers cooler climates and partial shade, making it suitable for rock gardens or as a specimen plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor f. globosa is primarily native to the western United States, particularly in California and Oregon. This subspecies is found in high elevation areas, typically in the Sierra Nevada and Cascade mountain ranges. It thrives in cool, moist climates with well-drained soils. The plant is commonly associated with mixed coniferous forests and is often found alongside other species like Douglas fir and white fir. Its distribution is limited to specific ecological niches that provide the necessary conditions for its growth.",
    "distribution_introduced_art_desc": "Abies concolor f. globosa was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in areas with moist, well-drained soils and cool, temperate climates. This variant is known for its dense, spherical shape and is often used as an ornamental tree in landscaping. Its introduction has been primarily for horticultural purposes due to its aesthetic appeal. However, it has also raised concerns about its potential impact on native ecosystems if it spreads beyond cultivated areas."
}
