{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies georgei subsp. smithii",
    "plant_slug": "abies-georgei-subsp-smithii",
    "plant_name_scientific": "abies georgei subsp. smithii",
    "intro": "Abies georgei subsp. smithii, commonly known as the Smith's fir, is a rare and endemic subspecies native to the mountainous regions of northern Vietnam. It is a coniferous evergreen tree characterized by its slender, conical shape and dark green, needle-like leaves. The cones are typically small and cylindrical, maturing to a reddish-brown color. This subspecies thrives in cool, moist climates at high altitudes, often in areas with well-drained soils. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from deforestation and climate change.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies georgei subsp. smithii is primarily native to the eastern Himalayas, including parts of Nepal, Bhutan, and northern India. It is commonly found in the higher elevations of these regions, typically between 2,500 and 3,500 meters above sea level. This subspecies thrives in cool, moist climates with well-drained soils, often growing in mixed coniferous forests. It is particularly associated with areas that have a temperate climate with distinct seasons. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abies georgei subsp. smithii was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is often cultivated in gardens and landscapes where it can thrive in partial shade to full sun. This subspecies is valued for its ornamental qualities, including its conical shape and attractive foliage. It is commonly used as a decorative evergreen in temperate regions. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
