{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cephalonica var. peloponnesiaca",
    "plant_slug": "abies-cephalonica-var-peloponnesiaca",
    "plant_name_scientific": "abies cephalonica var. peloponnesiaca",
    "intro": "Abies cephalonica var. peloponnesiaca, commonly known as the Peloponnesian fir, is a rare and endemic conifer native to the mountainous regions of the Peloponnese in southern Greece. It is a variant of the Cephalonica fir, characterized by its narrow, conical shape and dark green, needle-like leaves. The plant thrives in cool, moist climates at high altitudes, often growing in rocky or mountainous terrain. Its cones are typically small and cylindrical, containing winged seeds that are dispersed by wind. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from climate change and habitat loss.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cephalonica var. peloponnesiaca is primarily native to the Peloponnese region of southern Greece. This variety is found in the mountainous areas of the Peloponnese, particularly in the Taygetus and Parnon mountain ranges. It thrives in the humid, temperate climates of these regions, often growing in mixed forests. The plant is adapted to the specific soil and elevation conditions of its native habitat. It is a rare and endemic subspecies, reflecting the unique biodiversity of the southern Greek landscape.",
    "distribution_introduced_art_desc": "Abies cephalonica var. peloponnesiaca was mainly introduced to ornamental horticulture and landscape design due to its unique appearance and hardiness. It is often cultivated in gardens and parks for its aesthetic value, particularly its conical shape and silver-blue foliage. This variety is also valued for its ability to thrive in a variety of soil types and climates, making it a popular choice for urban and suburban settings. Its introduction has expanded its geographic range beyond its native habitat in the Peloponnese region of Greece. However, its non-native status raises concerns about potential ecological impacts in new environments."
}
