{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies lasiocarpa var. arizonica",
    "plant_slug": "abies-lasiocarpa-var-arizonica",
    "plant_name_scientific": "abies lasiocarpa var. arizonica",
    "intro": "Abies lasiocarpa var. arizonica, commonly known as the Arizona white fir, is a variant of the white fir species native to the southwestern United States. It is characterized by its dense, conical crown and dark green, needle-like leaves that are typically shorter and more rigid than those of the typical white fir. The tree produces small, cylindrical cones that mature to a reddish-brown color, and its bark is thick, furrowed, and grayish in appearance. It thrives in high-altitude environments with cool, moist conditions, often found in mountainous regions of Arizona and New Mexico. This variant is valued for its ornamental appeal and ecological importance in forest ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies lasiocarpa"
    },
    "taxonomy_art_desc": "Abies lasiocarpa var. arizonica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for its vascular system and spore reproduction. Its subclass is Pinidae, which is a group of coniferous plants that includes pines, firs, and cedars, and is distinguished by needle-like leaves and cone-bearing structures. Its order is Pinales, which consists of coniferous evergreens and is characterized by the production of cones and needle-like or scale-like leaves. Its family is Pinaceae, commonly known as the pine family, which includes trees with needle-like leaves and woody cones, often found in temperate and boreal regions. Its genus is Abies, commonly known as firs, which are coniferous trees with slender, often drooping branches and flat, spruce-like needles. Its species is Abies lasiocarpa, a type of subalpine fir known for its distinctive silvery-blue foliage and is native to the western United States and parts of Canada.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Colorado",
        "New Mexico"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies lasiocarpa var. arizonica is primarily native to Arizona, Colorado, and New Mexico. This variant of the subalpine fir is found in high-elevation regions across these southwestern U.S. states. It typically grows in mountainous areas with cool, moist climates. The plant thrives in forested habitats, often forming dense stands in the higher elevations of its native range. Its distribution is closely tied to the specific environmental conditions of these regions.",
    "distribution_introduced_art_desc": "Abies lasiocarpa var. arizonica was mainly introduced to areas with cool, moist climates and well-drained soils, typically in higher elevation regions. It is commonly found in the mountainous areas of the western United States, particularly in Arizona and New Mexico. This variety is adapted to rocky and open sites, often growing in mixed coniferous forests. Its introduction has been primarily for ornamental purposes and reforestation efforts. However, it is considered an invasive species in some regions where it outcompetes native vegetation."
}
