{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor aurea",
    "plant_slug": "abies-concolor-aurea",
    "plant_name_scientific": "abies concolor aurea",
    "intro": "Abies concolor aurea, commonly known as the golden fir, is a variant of the white fir species native to the western United States. It is characterized by its striking golden-yellow foliage, which contrasts beautifully with its silvery-blue bark. The plant has a conical shape with dense, needle-like leaves that are shorter and more flexible than those of typical firs. It thrives in well-drained soil and full sun to partial shade, making it a popular choice for ornamental landscaping. Due to its slow growth rate, it is often used as a specimen tree in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor aurea is primarily native to the western United States, specifically in areas of California, Oregon, and Washington. It is commonly found in high elevation forests and mountainous regions within these states. This plant thrives in cool, moist climates with well-drained soils. It is often associated with mixed coniferous forests and can be found at elevations ranging from 1,500 to 3,000 meters. Its golden foliage makes it a distinctive and popular ornamental species in horticulture.",
    "distribution_introduced_art_desc": "Abies concolor aurea was mainly introduced to enhance the aesthetic value of landscapes and gardens due to its unique golden foliage. It is commonly found in ornamental horticulture, particularly in regions with temperate climates. This plant is often used in parks, residential areas, and public spaces for its visual appeal. However, its introduction has raised concerns about its potential invasiveness in non-native environments. Proper management is recommended to prevent ecological disruption."
}
