{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies picea",
    "plant_slug": "abies-picea",
    "plant_name_scientific": "abies picea",
    "intro": "Abies picea, commonly known as the white spruce, is a coniferous evergreen tree native to the northern hemisphere. It is characterized by its slender, conical shape and dark green, needle-like leaves that are typically arranged in spirals along the branches. The tree produces small, cone-like structures that contain seeds, which are dispersed by wind. Its bark is thick and scaly, providing protection against harsh environmental conditions. Abies picea is often found in boreal forests and is valued for its timber and ecological role in supporting various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies picea is primarily native to North America, particularly in the northern regions of the United States and Canada. It is commonly found in the boreal forests and mountainous areas of these regions. This species thrives in cold climates with ample rainfall and well-drained soils. It is also present in parts of Europe, including the Alps and Carpathian Mountains. Abies picea is often associated with coniferous forests and can be found at elevations ranging from lowlands to subalpine zones.",
    "distribution_introduced_art_desc": "Abies picea was mainly introduced to North America, Europe, and parts of Asia as an ornamental and timber species. It has been widely planted in urban and suburban landscapes due to its aesthetic appeal and hardiness. The distribution of Abies picea has expanded beyond its native range in Europe, particularly in regions with temperate climates. It is often found in parks, along roadsides, and in managed forests. However, its introduction has raised concerns about its potential impact on native ecosystems in non-native regions."
}
