{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies americana",
    "plant_slug": "abies-americana",
    "plant_name_scientific": "abies americana",
    "intro": "Abies americana, commonly known as the American fir, is a coniferous evergreen tree native to eastern North America. It is characterized by its conical shape, dense foliage, and needle-like leaves that are typically dark green with a white stomatal band. The tree produces small, spherical cones that mature to a reddish-brown color. It thrives in cool, moist climates and is often found in mountainous regions. The American fir plays an important role in forest ecosystems and is valued for its ornamental and ecological significance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies americana is primarily native to the eastern United States, including parts of Canada. It is commonly found in the Appalachian Mountains and the northeastern regions of the country. This species thrives in moist, well-drained soils and cooler climates. It is often found in mixed forests alongside other coniferous and deciduous trees. The range of Abies americana extends from New Brunswick and Nova Scotia in Canada down to Georgia in the United States.",
    "distribution_introduced_art_desc": "Abies americana was mainly introduced to North America, particularly in the eastern United States and southeastern Canada. It is commonly found in mountainous regions and along the Appalachian Mountains. This species thrives in cool, moist environments with well-drained soil. It has been widely planted for ornamental purposes due to its attractive conical shape and evergreen foliage. However, its introduction has also led to concerns about its impact on native ecosystems in certain areas."
}
