{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies dayuanensis",
    "plant_slug": "abies-dayuanensis",
    "plant_name_scientific": "abies dayuanensis",
    "intro": "Abies dayuanensis, commonly known as the Yunnan fir, is a coniferous tree native to the mountainous regions of Yunnan Province in China. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in a spiral pattern along the branches. The tree produces small, yellowish cones that mature to a reddish-brown color, typically containing two seeds. Abies dayuanensis thrives in cool, moist climates at high altitudes, often growing in forested areas with well-drained soils. Its botanical features make it an important species for ecological studies and conservation efforts in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies dayuanensis is primarily native to the mountainous regions of western China, specifically in the provinces of Sichuan and Yunnan. It is commonly found in the eastern Himalayas and the eastern part of the Tibetan Plateau. This species grows in high-altitude forests, typically at elevations ranging from 2,500 to 4,000 meters. It thrives in cool, moist climates with well-drained soils. The plant is an important component of the local ecosystem and is adapted to the harsh environmental conditions of its native habitat.",
    "distribution_introduced_art_desc": "Abies dayuanensis was mainly introduced to regions with temperate climates and high altitudes, where it thrives in cool, moist environments. It is commonly found in mountainous areas with well-drained soils, making it suitable for reforestation projects. This species is valued for its ornamental qualities and its ability to provide habitat for various wildlife species. Its introduction has also contributed to local biodiversity in areas where native coniferous forests have been degraded. However, it requires careful management to ensure it does not outcompete native flora in new environments."
}
