{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies hispanica",
    "plant_slug": "abies-hispanica",
    "plant_name_scientific": "abies hispanica",
    "intro": "Abies hispanica, commonly known as the Spanish fir, is a coniferous evergreen tree native to the mountainous regions of southern Europe. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are arranged in a flat, two-ranked pattern. The tree produces cone-like structures that contain seeds, typical of the Pinaceae family. Its bark is thick and scaly, providing protection against harsh environmental conditions. Abies hispanica is often found in high-altitude forests, where it plays a significant role in the local ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies hispanica is primarily native to the Iberian Peninsula, specifically in Spain and Portugal. It is found in the mountainous regions of southern Spain, particularly in the Sierra de Cazorla, Sierra de Grazalema, and the Sierra de Almendral. This species thrives in areas with a Mediterranean climate, characterized by warm, dry summers and mild, wet winters. It is commonly associated with rocky slopes and forested areas at higher elevations. Due to its limited range and habitat specificity, it is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Abies hispanica was mainly introduced to regions with temperate climates, particularly in Europe and parts of Asia. It is commonly found in mountainous areas where it thrives in well-drained soils and cooler temperatures. This species is often cultivated in botanical gardens and as an ornamental tree due to its attractive conical shape and evergreen foliage. Its introduction has been driven by both horticultural interest and ecological restoration efforts. However, it is not widely naturalized outside its native range."
}
