{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies beshanzuensis var. ziyuanensis",
    "plant_slug": "abies-beshanzuensis-var-ziyuanensis",
    "plant_name_scientific": "abies beshanzuensis var. ziyuanensis",
    "intro": "Abies beshanzuensis var. ziyuanensis, commonly known as the Ziyuan fir, is a rare and endemic coniferous species native to China. It belongs to the genus Abies, which includes various species of fir trees characterized by their cone-shaped crowns and needle-like leaves. The plant is distinguished by its unique foliage, which features short, stiff needles with a bluish-green hue. It thrives in high-altitude environments, typically found in mountainous regions with cool, moist climates. Due to its limited distribution and ecological significance, it is considered a valuable subject for botanical research and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies beshanzuensis var. ziyuanensis is primarily native to the mountainous regions of central and southern China, particularly in the provinces of Sichuan, Yunnan, and Guizhou. This variant is found in high-altitude forests, often growing at elevations between 2,000 and 3,500 meters. It thrives in cool, moist climates with well-drained soils, typically in areas with dense canopy cover. The plant is often associated with mixed coniferous forests and is an important component of the local biodiversity. Due to its limited distribution and habitat specificity, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abies beshanzuensis var. ziyuanensis was mainly introduced to the data as a rare and endemic variant found in the Ziyuan area of China. This variant is characterized by its unique morphological features, including specific leaf and cone structures. It is primarily documented in botanical databases and conservation records due to its limited distribution. The introduction of this variant into the data highlights its ecological significance and conservation status. It serves as an important reference for studies on the genetic diversity of the Abies genus."
}
