{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies recurvata var. salouenensis",
    "plant_slug": "abies-recurvata-var-salouenensis",
    "plant_name_scientific": "abies recurvata var. salouenensis",
    "intro": "Abies recurvata var. salouenensis, commonly known as the Salouenensis fir, is a rare and endemic conifer native to the mountainous regions of northeastern Spain. It is characterized by its slender, conical shape and dark green, needle-like leaves that are slightly curved. The plant produces cone-like structures that contain seeds, typical of the Pinaceae family. It thrives in cool, moist climates and is often found in high-altitude forests. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies recurvata var. salouenensis is primarily native to the mountainous regions of central and eastern Turkey. This variant of the silver fir is found in the Taurus and Pontic mountain ranges. It thrives in humid, temperate climates at high altitudes. The plant is typically found in mixed forests alongside other coniferous species. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abies recurvata var. salouenensis was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It thrives in high-altitude environments where temperatures are moderate and there is sufficient precipitation. This variety is often planted in gardens and parks for its ornamental value and ability to provide year-round interest. It is also used in reforestation projects due to its hardiness and ecological benefits. However, its introduction has raised concerns about its potential impact on native plant communities."
}
