{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies chiloensis",
    "plant_slug": "abies-chiloensis",
    "plant_name_scientific": "abies chiloensis",
    "intro": "Abies chiloensis, commonly known as the Chilean fir, is a coniferous evergreen tree native to southern South America. It is characterized by its slender, pyramidal shape and needle-like leaves that are blue-green in color. The tree produces small, yellowish cones that mature to a reddish-brown hue. It prefers cool, moist climates and is often found in mountainous regions. Its wood is valued for its strength and is used in construction and furniture-making.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies chiloensis is primarily native to South America, specifically Chile and Argentina. It is commonly found in the temperate rainforests of the Andes Mountains. This species thrives in cool, moist climates with well-drained soils. It is often associated with mountainous regions at elevations ranging from 500 to 2,500 meters. The tree is an important part of the native flora in these regions, contributing to local biodiversity.",
    "distribution_introduced_art_desc": "Abies chiloensis was mainly introduced to areas with temperate climates, particularly in regions with well-drained soils and moderate precipitation. It thrives in cooler, higher elevation environments where it can form dense forests or groves. This species is often planted for its ornamental value due to its attractive conical shape and evergreen foliage. It has been introduced to several parts of the world, including North America and Europe, as a landscape tree. However, its introduction has raised concerns about its potential invasiveness in non-native habitats."
}
