{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cephalonica subsp. peloponnesiaca",
    "plant_slug": "abies-cephalonica-subsp-peloponnesiaca",
    "plant_name_scientific": "abies cephalonica subsp. peloponnesiaca",
    "intro": "Abies cephalonica subsp. peloponnesiaca, commonly known as the Peloponnesian fir, is a rare and endemic subspecies native to the mountainous regions of the Peloponnese in southern Greece. It is a coniferous evergreen tree characterized by its narrow, conical shape and dark green, needle-like leaves. The cones are typically pendulous and contain small, winged seeds. This subspecies thrives in cool, moist environments at high altitudes, often growing in association with other endemic flora. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from habitat loss and climate change.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cephalonica subsp. peloponnesiaca is primarily native to the southern regions of the Greek peninsula, specifically the Peloponnese and parts of the Aegean islands. This subspecies is found in the mountainous areas of Greece, including the Pindus Mountains and the Taygetos range. It thrives in cool, moist climates at elevations ranging from 800 to 1,800 meters. The plant is adapted to rocky and well-drained soils, often growing in mixed forests with other coniferous species. Its distribution is limited to a relatively small geographic area within southern Greece.",
    "distribution_introduced_art_desc": "Abies cephalonica subsp. peloponnesiaca was mainly introduced to areas with moist, well-drained soils and cool, temperate climates. It thrives in regions with high humidity and moderate temperatures, making it suitable for mountainous and forested landscapes. This subspecies is often planted in urban environments for its ornamental value and ability to tolerate pollution. It has been introduced to several parts of Europe, including the United Kingdom and parts of Germany. However, its spread is limited due to its specific ecological requirements."
}
