{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor f. aurea",
    "plant_slug": "abies-concolor-f-aurea",
    "plant_name_scientific": "abies concolor f. aurea",
    "intro": "Abies concolor f. aurea, commonly known as the white fir with golden foliage, is a variant of the white fir native to the western United States. This coniferous tree is characterized by its striking golden-yellow needles, which contrast sharply with its silver-blue bark. The plant exhibits a pyramidal shape with a broad, spreading crown, typical of many fir species. It thrives in cool, moist climates and is often found in mountainous regions. The golden foliage makes it a popular ornamental plant in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor f. aurea is primarily native to the western United States, particularly in areas of California, Oregon, and northern Nevada. This plant is found in high elevation forests and mountainous regions where it thrives in cool, moist environments. It is commonly associated with coniferous forests and grows at elevations ranging from 1,500 to 3,000 meters. The golden foliage of this variety makes it a distinctive feature in its natural habitat. It is often found in association with other conifer species such as Douglas fir and white fir.",
    "distribution_introduced_art_desc": "Abies concolor f. aurea was mainly introduced to ornamental horticulture due to its attractive golden foliage. It is commonly cultivated in gardens and landscapes for its aesthetic value. This variety is particularly valued for its ability to thrive in cooler climates. It is often used as a specimen tree or in mixed borders. However, it may pose a risk to native ecosystems if introduced outside its controlled environment."
}
