{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cephalonica var. reginae-amaliae",
    "plant_slug": "abies-cephalonica-var-reginae-amaliae",
    "plant_name_scientific": "abies cephalonica var. reginae-amaliae",
    "intro": "Abies cephalonica var. reginae-amaliae, commonly known as the Queen Amalia fir, is a rare and endemic conifer native to the mountainous regions of northern Greece. It is characterized by its narrow, pyramidal shape and dark green, needle-like foliage. The cones are typically small and cylindrical, maturing to a reddish-brown color. This variety is distinguished by its unique leaf morphology and is highly valued for its ornamental appeal. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in the wild.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cephalonica var. reginae-amaliae is primarily native to the mountainous regions of northern Greece, specifically the Pindus Mountains. This variety of the Greek fir is found in the higher elevations of this area, where the climate is cooler and more humid. It thrives in forested habitats, often growing in association with other coniferous species. The plant is adapted to the specific ecological conditions of this region, including well-drained soils and high altitudes. Its limited distribution makes it a notable and rare species within its native range.",
    "distribution_introduced_art_desc": "Abies cephalonica var. reginae-amaliae was mainly introduced to ornamental horticulture due to its unique aesthetic qualities, including its dense foliage and distinctive cone shape. It is often cultivated in gardens and as a landscape plant for its visual appeal and adaptability to various soil conditions. This variety is particularly valued for its compact growth habit, making it suitable for smaller spaces and container gardening. However, it is important to note that its introduction has raised concerns about potential ecological impacts in non-native regions. Despite its ornamental value, careful management is recommended to prevent unintended spread and competition with native flora."
}
