{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibirica f. pendula",
    "plant_slug": "abies-sibirica-f-pendula",
    "plant_name_scientific": "abies sibirica f. pendula",
    "intro": "Abies sibirica f. pendula, commonly known as the weeping Siberian fir, is a unique variant of the Siberian fir, characterized by its drooping branches that create a cascading effect. This form is a natural mutation of the species, often found in its native habitat of eastern Siberia. The tree has needle-like leaves that are dark green and slightly glossy, providing a striking visual contrast against its hanging foliage. It is a slow-growing evergreen conifer that thrives in cool, moist climates with well-drained soil. Due to its ornamental appearance, it is occasionally cultivated in botanical gardens and as a landscape plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sibirica f. pendula is primarily native to the mountainous regions of eastern Europe and western Siberia. This unique form of the Siberian fir is found in areas with cold climates and high altitudes. It thrives in forested habitats, often growing in association with other coniferous species. The plant is particularly common in the Russian Far East and parts of Mongolia. Its distribution is limited to specific ecological niches where it can withstand harsh environmental conditions.",
    "distribution_introduced_art_desc": "Abies sibirica f. pendula was mainly introduced to ornamental horticulture and landscape design due to its unique weeping growth habit. It is valued for its aesthetic appeal, making it a popular choice for gardens and public spaces. This variety is often used in urban environments to add visual interest and soften architectural structures. However, it requires well-drained soil and full sun to thrive. Its introduction has raised concerns about potential invasiveness in non-native regions."
}
