{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies faxoniana",
    "plant_slug": "abies-faxoniana",
    "plant_name_scientific": "abies faxoniana",
    "intro": "Abies faxoniana, commonly known as the Faxon's fir, is a species of evergreen conifer native to the mountainous regions of central China. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The tree produces small, cylindrical cones that mature to a reddish-brown color, containing seeds that are dispersed by wind. It thrives in cool, moist climates with well-drained soil, often found in forested areas at high altitudes. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies faxoniana is primarily native to China, specifically in the provinces of Sichuan and Yunnan. It is found in the mountainous regions of these areas, growing at elevations ranging from 2,500 to 3,800 meters. This species is typically found in moist, cool climates with well-drained soils. It is commonly found in mixed forests alongside other coniferous species. The plant is known for its ornamental value and is sometimes cultivated in horticulture outside its native range.",
    "distribution_introduced_art_desc": "Abies faxoniana was mainly introduced to regions with temperate climates characterized by high precipitation and well-drained soils. It thrives in areas with moderate temperatures and sufficient sunlight, making it suitable for mountainous or high-altitude environments. This species is often planted in urban landscapes for its ornamental value and ability to tolerate pollution. It has been introduced to several countries in Asia, including China, Korea, and Japan, where it is valued for its ecological and aesthetic benefits. However, its introduction has raised concerns about potential invasiveness in non-native habitats."
}
