{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies trigona",
    "plant_slug": "abies-trigona",
    "plant_name_scientific": "abies trigona",
    "intro": "Abies trigona, commonly known as the narrowleaf fir, is a species of evergreen conifer native to the mountainous regions of Southeast Asia. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in a spiral pattern along the branches. The tree produces small, spherical cones that hang downward, containing winged seeds dispersed by wind. It thrives in cool, moist climates and is often found in high-altitude forests. The narrowleaf fir is valued for its timber and is also an important component of its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies trigona is primarily native to the mountainous regions of Southeast Asia, including parts of China, Vietnam, and Myanmar. It is commonly found in temperate forests at high elevations, where it thrives in cool and moist conditions. This species is particularly associated with the Hengduan Mountains and the western regions of Yunnan Province in China. It grows in areas with well-drained soils and is often part of the understory in mixed coniferous forests. Due to its restricted habitat, Abies trigona is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abies trigona was mainly introduced to areas with temperate climates and well-drained soils, often in forested regions. It is commonly found in regions where it has been planted for ornamental purposes or for reforestation efforts. The plant thrives in areas with moderate rainfall and cool summers. Its introduction has sometimes led to ecological impacts in non-native habitats. It is important to monitor its spread to prevent potential invasiveness in new environments."
}
