{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies veitchii f. olivacea",
    "plant_slug": "abies-veitchii-f-olivacea",
    "plant_name_scientific": "abies veitchii f. olivacea",
    "intro": "Abies veitchii f. olivacea, commonly known as the olive-foliage white fir, is a rare and ornamental variant of the white fir. It is characterized by its striking silvery-green foliage, which gives it a distinctive appearance compared to the typical dark green needles of the species. The plant is native to the mountainous regions of western China, where it thrives in cool, moist environments. It is often cultivated in gardens for its aesthetic value and unique coloration. Due to its limited natural range and specific habitat requirements, it is considered a rare and somewhat challenging plant to grow.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies veitchii f. olivacea is primarily native to the mountainous regions of eastern Asia, specifically China. It is found in the provinces of Yunnan and Sichuan, where it grows in temperate and subtropical climates. This variety thrives in high-altitude areas with well-drained soils and cool, moist conditions. It is often associated with mixed coniferous forests and is adapted to the rugged terrain of its native habitat. The plant's natural range is limited, making it a rare and specialized species in its native environment.",
    "distribution_introduced_art_desc": "Abies veitchii f. olivacea was mainly introduced to ornamental horticulture due to its unique aesthetic qualities. It is prized for its dense, dark green foliage and compact growth habit, making it a desirable addition to gardens and landscapes. This form is often cultivated as a dwarf or slow-growing variant, suitable for smaller spaces. It is commonly used in rock gardens, as a hedge, or in containers. However, it requires well-drained soil and full sun to thrive, limiting its natural range in wild settings."
}
