{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × kentiana",
    "plant_slug": "abies-×-kentiana",
    "plant_name_scientific": "abies × kentiana",
    "intro": "Abies × kentiana, commonly known as the Colorado blue spruce, is a hybrid conifer resulting from the cross between *Abies lasiocarpa* and *Abies concolor*. It is characterized by its dense, dark blue-green foliage and a pyramidal shape, which makes it a popular ornamental tree. The needles are stiff and often have a bluish tinge due to a waxy coating, and the cones are typically short and cylindrical. It thrives in well-drained soils and full sun, making it suitable for colder climates. This hybrid is valued for its aesthetic appeal and hardiness in northern regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × kentiana is primarily native to the mountainous regions of western North America, particularly in the Pacific Northwest. It occurs naturally in areas spanning from British Columbia through Idaho and into northern California. This hybrid species is commonly found in coniferous forests at elevations ranging from 1,000 to 2,500 meters. It thrives in cool, moist environments with well-drained soils. Its natural range includes regions where the parent species, Abies amabilis and Abies lasiocarpa, overlap.",
    "distribution_introduced_art_desc": "Abies × kentiana was mainly introduced to the United States and Europe as an ornamental tree due to its aesthetic appeal and adaptability to various climates. It is a hybrid between Abies amabilis and Abies alba, combining the characteristics of both parent species. This plant is commonly found in botanical gardens and landscaped areas where it is valued for its pyramidal shape and dense foliage. It prefers well-drained soil and full sun to partial shade, making it suitable for a range of garden settings. However, it is not commonly found in the wild and is primarily cultivated for decorative purposes."
}
