{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abietia douglasii",
    "plant_slug": "abietia-douglasii",
    "plant_name_scientific": "abietia douglasii",
    "intro": "Abietia douglasii, commonly known as Douglas fir, is a coniferous evergreen tree native to western North America. It is characterized by its long, slender cones and needle-like leaves that are arranged in spirals along the branches. The tree can grow to heights of up to 60 meters, making it one of the tallest species in the pine family. Its bark is thick and scaly, providing protection against forest fires and extreme weather conditions. The wood of Douglas fir is highly valued for its strength and durability, making it a popular choice for construction and furniture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abietia douglasii is primarily native to the western United States, particularly in areas of California and Oregon. It is commonly found in the coastal regions and mountainous areas of these states. This plant thrives in moist, cool climates and is often associated with coastal forests and chaparral habitats. It is also present in parts of northern California and southern Oregon. Abietia douglasii is well adapted to the temperate climate of the Pacific Northwest.",
    "distribution_introduced_art_desc": "Abietia douglasii was mainly introduced to specific regions in the western United States, particularly in areas with moist, temperate climates. It was initially brought in for its ornamental value due to its attractive foliage and cone-like structures. The plant has been cultivated in gardens and landscapes where it thrives in well-drained soil and partial shade. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems. Despite its beauty, careful management is recommended to prevent it from spreading beyond controlled environments."
}
