{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba var. compacta",
    "plant_slug": "abies-alba-var-compacta",
    "plant_name_scientific": "abies alba var. compacta",
    "intro": "Abies alba var. compacta, commonly known as the compact fir, is a compact, slow-growing variant of the European silver fir. It is characterized by its dense, pyramidal shape and dark green, needle-like foliage. The plant features short, stout shoots and cones that are typically reddish-brown in color. It is native to the mountainous regions of Central and Southern Europe. This variety is often cultivated as an ornamental plant in gardens and landscapes due to its unique appearance and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba var. compacta is primarily native to the mountainous regions of Central and Eastern Europe, including parts of the Carpathian Mountains and the Alps. This variety of the European silver fir is typically found in high-altitude forests where the climate is cool and moist. It thrives in well-drained soils and is often associated with mixed coniferous forests. The plant is adapted to harsher environmental conditions compared to its standard form. Its compact growth habit makes it a distinctive feature in its natural habitat.",
    "distribution_introduced_art_desc": "Abies alba var. compacta was mainly introduced to Europe for ornamental purposes due to its unique compact growth form and aesthetic appeal. It is commonly found in gardens and parks, where it serves as a decorative evergreen shrub. This variety is also valued for its ability to thrive in a range of soil types and its resistance to certain pests and diseases. Its introduction has contributed to the diversity of coniferous plants in horticultural settings across the continent. However, it is not typically found in the wild in its native range."
}
