{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo var. marocana",
    "plant_slug": "abies-pinsapo-var-marocana",
    "plant_name_scientific": "abies pinsapo var. marocana",
    "intro": "Abies pinsapo var. marocana, commonly known as the Atlas cedar, is a rare and ancient conifer native to the Atlas Mountains of North Africa. It is characterized by its slender, pyramidal shape and dark green, needle-like foliage. The tree produces small, reddish-brown cones that mature in the second year. It thrives in cool, moist environments and is often found in rocky or mountainous terrain. Due to its limited distribution and habitat threats, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo var. marocana is primarily native to the mountainous regions of North Africa, specifically Morocco. It is found in the Atlas Mountains, where it thrives in high-altitude environments. This variety of the Swiss stone pine is adapted to the cool, moist conditions of these areas. It is often found in mixed forests alongside other coniferous species. Its distribution is limited to specific microhabitats within the Moroccan mountain ranges.",
    "distribution_introduced_art_desc": "Abies pinsapo var. marocana was mainly introduced to specific regions in the Mediterranean, particularly in southern Spain and northern Africa. It is often cultivated in botanical gardens and private collections due to its ornamental value and unique appearance. This variety is adapted to rocky and arid environments, making it suitable for xeriscaping and landscape design in drought-prone areas. Its introduction has been driven by both horticultural interest and conservation efforts to preserve its genetic diversity. However, it is not widely naturalized outside its native range."
}
