{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies yunnanensis",
    "plant_slug": "abies-yunnanensis",
    "plant_name_scientific": "abies yunnanensis",
    "intro": "Abies yunnanensis, commonly known as the Yunnan fir, is a coniferous tree native to the mountainous regions of southwestern China. It is characterized by its slender, conical shape and its dark green, needle-like leaves that are typically arranged in spirals along the branches. The tree produces small, spherical cones that mature to a reddish-brown color, containing seeds surrounded by a wing for wind dispersal. It thrives in cool, moist climates at high elevations, often growing in dense forests with other coniferous species. The Yunnan fir is valued for its ornamental appeal and its role in maintaining ecological balance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies yunnanensis is primarily native to the mountainous regions of Yunnan Province in southwestern China. It is commonly found in temperate forests at elevations ranging from 2,000 to 3,500 meters. This species thrives in areas with high humidity and cool temperatures, often growing in mixed coniferous forests. It is also occasionally found in neighboring regions of Sichuan and Tibet. The plant plays an important ecological role in these high-altitude ecosystems.",
    "distribution_introduced_art_desc": "Abies yunnanensis was mainly introduced to regions with temperate climates and high altitudes, particularly in mountainous areas of China. It thrives in well-drained soils and requires moderate to high levels of precipitation. This species is often cultivated for its ornamental value and ecological benefits in reforestation projects. Its introduction has also been noted in parts of North America and Europe as part of ornamental horticulture. However, its natural range remains primarily in the Yunnan province of China."
}
