{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies guatemalensis var. ixtepejiensis",
    "plant_slug": "abies-guatemalensis-var-ixtepejiensis",
    "plant_name_scientific": "abies guatemalensis var. ixtepejiensis",
    "intro": "Abies guatemalensis var. ixtepejiensis, commonly known as the Ixtepejiensis fir, is a rare and endemic conifer native to high-altitude regions of Guatemala. It is characterized by its slender, conical shape and dark green, needle-like leaves that are typically arranged in a flat, spreading pattern. The tree produces small, rounded cones that mature to a reddish-brown color, containing winged seeds. It thrives in cool, moist climates with well-drained soil, often found in cloud forests. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from deforestation and climate change.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies guatemalensis var. ixtepejiensis is primarily native to the highlands of southern Mexico, specifically in the states of Chiapas, Oaxaca, and Veracruz. This variant is found in cloud forests and montane regions at elevations ranging from 1,500 to 3,000 meters above sea level. It thrives in humid, temperate climates with well-drained soils. The plant is adapted to the unique ecological conditions of these regions, which support its growth and survival. It plays an important role in the biodiversity and ecological balance of its native habitat.",
    "distribution_introduced_art_desc": "Abies guatemalensis var. ixtepejiensis was mainly introduced to areas with high elevation and cool, moist climates, typically found in mountainous regions of Central America. It thrives in well-drained soils and requires ample sunlight for optimal growth. This variety is often cultivated for its ornamental value and ecological benefits in reforestation projects. Its introduction has contributed to biodiversity in regions where it has been planted. However, it is important to monitor its impact on native ecosystems to prevent potential invasive behavior."
}
