{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies salouenensis",
    "plant_slug": "abies-salouenensis",
    "plant_name_scientific": "abies salouenensis",
    "intro": "Abies salouenensis, commonly known as the Salouen fir, is a rare and endemic species native to the mountainous regions of eastern Spain. It is a coniferous evergreen tree characterized by its conical shape and dark green, needle-like leaves. The tree produces cones that are typically reddish-brown and contain seeds surrounded by a papery wing. It thrives in cool, moist climates with well-drained soils, often found in high-altitude forests. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from climate change and habitat loss.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies salouenensis is primarily native to the mountainous regions of Central America, specifically in parts of southern Mexico and northern Guatemala. This species is commonly found in cloud forests at high elevations, where it thrives in cool, moist climates. It is particularly associated with the Sierra Madre de Chiapas and the surrounding highland areas. The plant is adapted to nutrient-poor soils and requires a humid environment for optimal growth. Due to habitat loss and climate change, its distribution is becoming increasingly restricted.",
    "distribution_introduced_art_desc": "Abies salouenensis was mainly introduced to specific regions in Southeast Asia, particularly in parts of Vietnam and Laos. It was brought there for its ornamental value and potential for reforestation efforts. The plant thrives in temperate to subtropical climates with high humidity and well-drained soil. Its introduction has raised concerns about its potential impact on native ecosystems. Despite its beauty, it requires careful management to prevent it from becoming invasive."
}
