{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × insignis var. beissneriana",
    "plant_slug": "abies-×-insignis-var-beissneriana",
    "plant_name_scientific": "abies × insignis var. beissneriana",
    "intro": "Abies × insignis var. beissneriana, commonly known as the Beissner's fir, is a hybrid conifer native to the mountainous regions of western North America. It is characterized by its slender, pyramidal shape and dark green, needle-like foliage that is often slightly twisted. The cones are typically slender and upright, maturing to a reddish-brown color. This variety is valued for its ornamental appeal and is often cultivated in gardens for its hardiness and aesthetic qualities. It prefers well-drained soil and full sun to partial shade, making it a versatile choice for landscaping in cooler climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × insignis var. beissneriana is primarily native to the mountainous regions of central and southern Europe, particularly in the Alps and Carpathian Mountains. This hybrid fir species is found in areas with cool, moist climates and well-drained soils. It thrives in high-altitude forests where it forms part of the subalpine vegetation. The plant is commonly encountered in countries such as Germany, Austria, Switzerland, and Romania. Its natural range reflects its adaptation to the specific ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Abies × insignis var. beissneriana was mainly introduced to the United States as an ornamental tree due to its aesthetic appeal and adaptability to various climates. It is commonly found in botanical gardens and private collections, particularly in regions with temperate to subalpine conditions. This hybrid fir is valued for its unique foliage and cone structure, which make it a popular choice for landscape design. However, its introduction has raised concerns about potential ecological impacts in native habitats. Despite its ornamental value, it is not widely naturalized in the wild."
}
