{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nigra var. pumila",
    "plant_slug": "abies-nigra-var-pumila",
    "plant_name_scientific": "abies nigra var. pumila",
    "intro": "Abies nigra var. pumila, commonly known as the dwarf fir, is a compact evergreen conifer native to the northeastern United States. It is characterized by its slow growth rate and dense, pyramidal shape, making it well-suited for rock gardens or as a specimen plant. The foliage consists of dark green, needle-like leaves that are short and stiff, providing a textured appearance. It produces small, cylindrical cones that mature to a reddish-brown color, and it is relatively cold-hardy, thriving in USDA hardiness zones 3 to 7. This variety is prized for its ornamental value and ability to thrive in shaded, moist environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nigra var. pumila is primarily native to the eastern United States, specifically the Appalachian Mountains. It is found in regions of North Carolina, Tennessee, Virginia, and West Virginia. This variety of the eastern white fir thrives in cool, moist, and well-drained soils. It is commonly found in mixed hardwood forests and along stream valleys. Its native range is limited to specific elevations and microclimates within these areas.",
    "distribution_introduced_art_desc": "Abies nigra var. pumila was mainly introduced to the eastern United States as an ornamental tree due to its compact size and attractive appearance. It is commonly found in gardens and landscaped areas where its unique form and evergreen foliage are appreciated. This variety is often used in urban settings because it tolerates a range of soil conditions and has moderate water needs. However, it is not native to the region and has been introduced primarily for horticultural purposes rather than ecological reasons. Its distribution is limited to areas where it has been intentionally planted by humans."
}
