{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fabri subsp. ziyuanensis",
    "plant_slug": "abies-fabri-subsp-ziyuanensis",
    "plant_name_scientific": "abies fabri subsp. ziyuanensis",
    "intro": "Abies fabri subsp. ziyuanensis, commonly known as the Ziyuan fir, is a rare and endemic coniferous species native to China. It belongs to the genus Abies, which includes various fir trees characterized by their needle-like leaves and cone-bearing structure. This subspecies is distinguished by its unique morphological features, including its foliage and cone morphology. It typically grows in high-altitude regions, preferring cool and moist environments. Due to its limited distribution and habitat specificity, it is considered a valuable subject for botanical research and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fabri subsp. ziyuanensis is primarily native to the eastern Himalayas, specifically in regions of China, including Sichuan, Yunnan, and Tibet. It grows in high-altitude forest ecosystems, typically at elevations between 2,500 and 4,000 meters. This subspecies is commonly found in mixed coniferous forests, often alongside other species such as Picea and Pinus. Its natural habitat includes areas with cool, moist climates and well-drained soils. Due to its limited distribution, it is considered a rare and endemic species in these mountainous regions.",
    "distribution_introduced_art_desc": "Abies fabri subsp. ziyuanensis was mainly introduced to the study of its unique ecological niche and conservation status in the mountainous regions of China. This subspecies is characterized by its distinct morphology and habitat preferences, making it an important subject for botanical research. Its introduction to scientific databases has facilitated better understanding of its distribution patterns and genetic diversity. The plant's limited range and specific environmental requirements highlight the need for targeted conservation efforts. Researchers continue to monitor its population to ensure its survival in the face of environmental changes."
}
