{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo var. numidica",
    "plant_slug": "abies-pinsapo-var-numidica",
    "plant_name_scientific": "abies pinsapo var. numidica",
    "intro": "Abies pinsapo var. numidica, commonly known as the Atlas cedar, is a rare and ancient conifer native to the Atlas Mountains of North Africa. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The tree produces small, inconspicuous cones that contain winged seeds, typical of the Cupressaceae family. It thrives in cool, moist climates and is adapted to rocky, mountainous terrain. Due to its limited distribution and habitat threats, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo var. numidica is primarily native to the Atlas Mountains of North Africa, specifically spanning parts of Morocco and Algeria. This variety of the silver fir is adapted to the unique climatic and geological conditions of the region. It thrives in the humid and temperate climates found in the mountainous areas of the Mediterranean. The plant is commonly found in forested slopes and rocky terrain within these regions. Its distribution is limited to this specific geographic area, making it a rare and endemic species.",
    "distribution_introduced_art_desc": "Abies pinsapo var. numidica was mainly introduced to areas with a Mediterranean climate, characterized by mild, wet winters and hot, dry summers. It is typically found in rocky or mountainous regions where it can thrive in well-drained soils. This variety is known for its ability to adapt to harsh environmental conditions, making it suitable for reforestation projects. Its introduction has been primarily for ornamental purposes and ecological restoration in southern Europe. However, its spread is limited due to specific climatic and soil requirements."
}
