{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies firma var. brachyphylla",
    "plant_slug": "abies-firma-var-brachyphylla",
    "plant_name_scientific": "abies firma var. brachyphylla",
    "intro": "Abies firma var. brachyphylla, commonly known as the dwarf fir, is a variant of the fir tree native to the mountainous regions of eastern Asia. It is characterized by its compact growth habit and dense, conical shape, making it a striking ornamental plant. The foliage consists of short, stiff needles that are typically dark green, often with a silvery underside. It thrives in cool, moist climates and is well-suited for rock gardens or as a container plant. This variety is valued for its hardiness and ability to maintain its form even in harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies firma var. brachyphylla is primarily native to the mountainous regions of central and southern China, particularly in the provinces of Sichuan, Yunnan, and Tibet. This variety of fir is commonly found in high-altitude forests at elevations ranging from 2,500 to 4,000 meters. It thrives in cool, moist climates with well-drained soils, often growing in mixed coniferous forests. The plant is adapted to the harsh environmental conditions of its native habitat, including strong winds and limited sunlight. Its natural range is limited to specific mountainous areas where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abies firma var. brachyphylla was mainly introduced to ornamental horticulture due to its unique appearance and cold-hardy characteristics. It is often cultivated in gardens and landscapes for its compact growth habit and attractive foliage. This variety is particularly valued in regions with colder climates where traditional fir species may not thrive. Its introduction has expanded the diversity of coniferous plants available for landscaping purposes. However, it is important to note that it is not native to the areas where it is commonly planted."
}
