{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. chlorocarpa",
    "plant_slug": "abies-excelsa-var-chlorocarpa",
    "plant_name_scientific": "abies excelsa var. chlorocarpa",
    "intro": "Abies excelsa var. chlorocarpa, commonly known as the green-barked fir, is a rare and distinctive variant of the white fir. It is characterized by its unique dark green bark, which contrasts with the typical silver-gray bark of the standard species. The tree has conical, dense foliage with needle-like leaves that are typically blue-green in color. It thrives in cool, moist environments and is often found in high-altitude regions of the Andes. This variant is of particular interest to botanists due to its limited distribution and unique morphological traits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. chlorocarpa is primarily native to the mountainous regions of Southeast Asia, including countries such as Bhutan, India, and Nepal. This variety is typically found in temperate to subtropical forests at elevations ranging from 1,500 to 3,500 meters. It thrives in areas with high humidity and well-drained soils, often growing in mixed coniferous forests. The plant is particularly common in the Eastern Himalayas, where it forms part of the local biodiversity. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Abies excelsa var. chlorocarpa was mainly introduced to specific regions with suitable high-altitude environments, including parts of the Himalayas and the Tibetan Plateau. This variety is typically found in areas with cool, moist climates and well-drained soils. It is often cultivated in botanical gardens and conservation areas due to its unique characteristics and ecological significance. The plant's introduction has been primarily for ornamental purposes and ecological restoration projects. However, its natural distribution remains limited to its native habitats in Asia."
}
