{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibirica var. alpina",
    "plant_slug": "abies-sibirica-var-alpina",
    "plant_name_scientific": "abies sibirica var. alpina",
    "intro": "Abies sibirica var. alpina, commonly known as the Alpine Siberian fir, is a variant of the Siberian fir native to high-altitude regions of Central Asia. It is a coniferous evergreen tree characterized by its narrow, pyramidal shape and needle-like leaves. The needles are dark green, glossy, and arranged in spirals along the shoots. It produces cones that are typically 5–8 cm long, containing seeds that are dispersed by wind. This plant is adapted to cold, mountainous climates and thrives in well-drained, acidic soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sibirica var. alpina is primarily native to the mountainous regions of Central Asia, including the Tien Shan, Pamir, and昆仑 (Kunlun) mountain ranges. It is also found in parts of eastern Siberia and northern China. This variant thrives in high-altitude environments, typically above 2,000 meters, where it forms dense forests or groves. It is well adapted to cold climates and is often found in alpine and subalpine zones. The plant is an important component of the local ecosystems in these regions.",
    "distribution_introduced_art_desc": "Abies sibirica var. alpina was mainly introduced to areas with cold, high-altitude environments, particularly in mountainous regions of Europe and Asia. It thrives in well-drained, acidic soils and requires full sun to partial shade for optimal growth. This variety is often used in horticulture for its ornamental value and ability to withstand harsh climatic conditions. It has been introduced to various regions as a decorative and ecological plant in landscaping projects. However, its introduction has raised concerns about its potential impact on native flora in certain ecosystems."
}
