{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies columbaria",
    "plant_slug": "abies-columbaria",
    "plant_name_scientific": "abies columbaria",
    "intro": "Abies columbaria, commonly known as the dwarf fir, is a small evergreen conifer native to the mountainous regions of central and southern Europe. It typically grows to a height of only 1 to 2 meters, making it one of the smallest species in the fir genus. The plant has a dense, conical shape with needle-like leaves that are dark green on top and whitish underneath. Its cones are small and cylindrical, maturing to a reddish-brown color. Abies columbaria is well adapted to harsh alpine environments, thriving in poor soils and cold climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies columbaria is primarily native to the northern regions of North America, including parts of Canada and the northern United States. It is commonly found in the boreal forest and subarctic zones, where it thrives in cold, moist environments. This species is particularly associated with mountainous areas, such as the Appalachian Mountains and the Canadian Shield. It prefers well-drained, acidic soils and is often found in association with other coniferous trees. Due to its limited range, it is considered a rare and relict species in certain parts of its native habitat.",
    "distribution_introduced_art_desc": "Abies columbaria was mainly introduced to specific regions in North America and Europe as an ornamental tree due to its unique appearance and hardiness. It is commonly found in gardens and parks where it is valued for its pyramidal shape and evergreen foliage. The plant has also been introduced to parts of Asia, where it is cultivated for its aesthetic appeal and adaptability to different climates. Despite its ornamental use, it has not become invasive in most areas where it has been introduced. Its distribution is largely limited to human-modified landscapes rather than natural habitats."
}
