{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pectinata",
    "plant_slug": "abies-pectinata",
    "plant_name_scientific": "abies pectinata",
    "intro": "Abies pectinata, commonly known as the silver fir, is a coniferous evergreen tree native to the mountainous regions of central and eastern Asia. It is characterized by its slender, conical shape and its dark green, needle-like leaves that are coated with a silvery-white bloom, giving it a distinctive appearance. The tree produces small, cylindrical cones that mature to a reddish-brown color, containing winged seeds dispersed by the wind. Abies pectinata thrives in cool, moist climates and is often found in high-altitude forests. Its wood is valued for its strength and durability, making it useful in construction and furniture-making.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pectinata is primarily native to the mountainous regions of eastern Asia, including China, Korea, and Japan. It is commonly found in temperate coniferous forests at high altitudes. This species thrives in cool, moist climates with well-drained soils. It is particularly associated with the Himalayan range and the Japanese archipelago. Its natural habitat includes areas with significant elevation and limited human disturbance.",
    "distribution_introduced_art_desc": "Abies pectinata was mainly introduced to areas with moist, well-drained soils and cool climates, typically found in mountainous regions. It is commonly cultivated in gardens and parks for its ornamental value and ability to thrive in shaded environments. The plant prefers moderate temperatures and is often used in horticultural landscapes for its aesthetic appeal. Its introduction has been primarily for ornamental purposes rather than for ecological or agricultural reasons. However, it is important to monitor its spread to prevent potential invasiveness in local ecosystems."
}
