{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sacra",
    "plant_slug": "abies-sacra",
    "plant_name_scientific": "abies sacra",
    "intro": "Abies sacra, commonly known as the white fir, is a coniferous evergreen tree native to the mountainous regions of western North America. It is characterized by its tall, slender form and dense, dark green needles that are typically two to three inches long. The tree produces small, spherical cones that mature to a reddish-brown color, and its bark is smooth and grayish-white, especially on younger trees. Abies sacra thrives in cool, moist climates and is often found in subalpine and high-elevation forests. It plays an important role in its ecosystem by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sacra is primarily native to the western United States, particularly in the mountainous regions of California, Nevada, and Oregon. It is commonly found in the Sierra Nevada and other high elevation areas where the climate is cool and moist. This species thrives in subalpine and alpine habitats, often growing at elevations between 1,800 and 3,500 meters. It is also present in parts of northern Mexico, such as Baja California. The tree is well adapted to rocky soils and is a key component of the local forest ecosystems.",
    "distribution_introduced_art_desc": "Abies sacra was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is often cultivated in gardens and landscapes for its ornamental value and ability to thrive in temperate zones. The plant prefers partial to full shade and is known for its cone-like appearance and aromatic foliage. It has been introduced to several regions outside its native range, including parts of Europe and Asia. However, its spread is limited due to its specific environmental requirements."
}
