{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea f. compacta",
    "plant_slug": "abies-balsamea-f-compacta",
    "plant_name_scientific": "abies balsamea f. compacta",
    "intro": "Abies balsamea f. compacta, commonly known as the dwarf balsam fir, is a compact, slow-growing evergreen shrub that forms a dense, low-growing mound. It is a naturally occurring form of the balsam fir, characterized by its tightly packed, dark green needles and small, conical cones. This variety thrives in cool, moist environments, typically in shaded forest understories. Its dense foliage makes it an excellent choice for rock gardens or as a ground cover in woodland settings. The plant is valued for its ornamental appearance and its ability to tolerate poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamea f. compacta is primarily native to the northeastern United States and southeastern Canada. It is found in regions such as New England, New York, and parts of the Appalachian Mountains. This compact form of the balsam fir is adapted to grow in cooler, moist environments. It typically thrives in rocky or well-drained soils at higher elevations. The plant's distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abies balsamea f. compacta was mainly introduced to the northeastern United States and southeastern Canada. It is commonly found in forested areas with moist, well-drained soils. This compact form of the balsam fir is often used in horticulture for its ornamental value. It thrives in cooler climates and can tolerate partial shade. However, it is less hardy than the typical form and is susceptible to environmental stressors."
}
