{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo subsp. hispanica",
    "plant_slug": "abies-pinsapo-subsp-hispanica",
    "plant_name_scientific": "abies pinsapo subsp. hispanica",
    "intro": "Abies pinsapo subsp. hispanica, commonly known as the Spanish fir, is a rare and endemic species native to the Sierra Nevada mountains in southern Spain. It is a coniferous evergreen tree characterized by its slender, pyramidal shape and dark green, needle-like leaves. The cones are typically small and cylindrical, maturing to a reddish-brown color. It thrives in high-altitude environments with cool, moist conditions and well-drained soils. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo subsp. hispanica is primarily native to the Iberian Peninsula, specifically southern Spain. It is found in the Sierra de Cazorla, Sierra de Los Filabres, and other mountain ranges in Andalusia. This subspecies thrives in mountainous regions with a Mediterranean climate, characterized by dry summers and wet winters. It grows in rocky soils and is often found in mixed forests with other coniferous species. Due to its limited range and habitat specificity, it is considered a rare and endemic plant in southern Spain.",
    "distribution_introduced_art_desc": "Abies pinsapo subsp. hispanica was mainly introduced to regions with temperate climates, particularly in southern Europe. It thrives in areas with well-drained soils and moderate rainfall. This subspecies is often planted for its ornamental value and ability to provide habitat for local wildlife. It has been introduced to parts of Spain and southern France. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
