{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. baldensis",
    "plant_slug": "abies-excelsa-var-baldensis",
    "plant_name_scientific": "abies excelsa var. baldensis",
    "intro": "Abies excelsa var. baldensis, commonly known as the Bald Mountain fir, is a variant of the white fir native to the high elevations of the Appalachian Mountains. It is characterized by its slender, conical shape and dark green, needle-like foliage. The tree typically grows in cool, moist environments with well-drained soil. Its cones are small and cylindrical, maturing to a reddish-brown color. This variety is adapted to harsh alpine conditions, making it a resilient and ecologically significant species in its habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. baldensis is primarily native to the mountainous regions of the Carpathian Basin, specifically in parts of Hungary, Slovakia, and Ukraine. This variety is found in high-altitude forests where the climate is cool and moist. It thrives in well-drained soils and is often associated with mixed coniferous-deciduous forests. The plant is adapted to the unique ecological conditions of its native habitat. Its distribution is limited to specific elevations and microclimates within this region.",
    "distribution_introduced_art_desc": "Abies excelsa var. baldensis was mainly introduced to specific regions in Europe, particularly in the Czech Republic and parts of Germany. It was introduced as an ornamental plant due to its attractive appearance and unique characteristics. The distribution is limited to areas where it has been cultivated in gardens and parks. It is not native to these regions but has been deliberately planted for aesthetic purposes. However, its naturalization in the wild is rare and mostly confined to isolated locations."
}
