{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea var. macrocarpa",
    "plant_slug": "abies-balsamea-var-macrocarpa",
    "plant_name_scientific": "abies balsamea var. macrocarpa",
    "intro": "Abies balsamea var. macrocarpa, commonly known as the balsam fir, is a coniferous evergreen tree native to eastern North America. It is characterized by its pyramidal shape, dark green needles, and distinctive cone-like structures that mature to a reddish-brown color. The tree produces small, fragrant white flowers that develop into woody cones containing seeds. It thrives in cool, moist environments and is often found in boreal and mixed forests. The balsam fir plays an important ecological role, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamea var. macrocarpa is primarily native to the northeastern United States and eastern Canada. It is found in regions such as New York, Vermont, New Hampshire, and parts of Quebec. This variety thrives in cool, moist environments, typically in mountainous or boreal forest areas. It is commonly associated with acidic soils and is often found in mixed coniferous forests. The plant is well adapted to the cold climate of its native range.",
    "distribution_introduced_art_desc": "Abies balsamea var. macrocarpa was mainly introduced to North America, particularly in the eastern United States and eastern Canada. It is commonly found in forested areas with moist, well-drained soils. This variety is often cultivated for its ornamental value due to its pyramidal shape and fragrant resin. It has been used in reforestation projects and as a landscape plant. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
