{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sachalinensis var. mayriana",
    "plant_slug": "abies-sachalinensis-var-mayriana",
    "plant_name_scientific": "abies sachalinensis var. mayriana",
    "intro": "Abies sachalinensis var. mayriana, commonly known as the Mayrian fir, is a rare variant of the sachalin fir native to the Korean Peninsula. It is characterized by its narrow, conical shape and dark green, needle-like leaves. The tree produces small, cylindrical cones that mature to a reddish-brown color. It thrives in cool, moist environments and is often found in mountainous regions. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies sachalinensis"
    },
    "taxonomy_art_desc": "Abies sachalinensis var. mayriana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae, characterized by their ability to perform photosynthesis and their complex cellular structure. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Pinidae, which is a group of coniferous plants that includes pines, firs, and spruces. Its order is Pinales, which consists of coniferous evergreen trees and shrubs, typically with needle-like leaves and cones. Its family is Pinaceae, known as the pine family, which includes various coniferous trees such as pines, firs, and cedars. Its genus is Abies, commonly known as firs, which are coniferous trees with flat, spirally arranged needles and cone-like fruit. Its species is Abies sachalinensis, a type of fir native to the island of Sakhalin, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Japan",
        "Sakhalin"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sachalinensis var. mayriana is primarily native to Japan and Sakhalin. This variant of the Sakhalin fir is found in the mountainous regions of these areas. It thrives in cool, humid climates with well-drained soils. The plant is typically found in forested areas at higher elevations. Its distribution is limited to specific geographic regions within Japan and the Russian island of Sakhalin.",
    "distribution_introduced_art_desc": "Abies sachalinensis var. mayriana was mainly introduced to ornamental horticulture and landscape design due to its attractive conical shape and slow growth rate. It is often cultivated in gardens and parks for its aesthetic value and ability to thrive in cooler climates. This variant is particularly valued for its dense foliage and unique appearance, making it a popular choice for specimen planting. However, it is important to note that it is not commonly found in the wild and is mostly grown in controlled environments. Its introduction has been limited to specific regions where it can be maintained under suitable conditions."
}
