{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor subsp. viridula",
    "plant_slug": "abies-concolor-subsp-viridula",
    "plant_name_scientific": "abies concolor subsp. viridula",
    "intro": "Abies concolor subsp. viridula, commonly known as the white fir, is a coniferous evergreen tree native to the western United States. It is characterized by its slender, pyramidal shape and its distinctive blue-green needles that are flat and have a waxy coating. The cones are typically short and cylindrical, maturing to a reddish-brown color. This subspecies is often found in high-elevation forests and is adapted to cold, moist environments. Its botanical features make it an important species in both ecological and horticultural contexts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor subsp. viridula is primarily native to the western United States, specifically in California and Oregon. It grows in high elevation areas, typically in coniferous forests. This subspecies is found in regions with cool, moist climates and well-drained soils. It is commonly associated with mixed coniferous stands and is often found at elevations between 1,500 and 3,000 meters. The plant is well adapted to the mountainous environments of these regions.",
    "distribution_introduced_art_desc": "Abies concolor subsp. viridula was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various climates. It is commonly cultivated in gardens and parks for its aesthetic value and ability to thrive in different soil conditions. This subspecies has been widely distributed across North America, particularly in regions with temperate to subalpine climates. Its introduction has led to its establishment in some natural areas, raising concerns about its potential impact on native ecosystems. Despite its ornamental appeal, its invasive potential remains a topic of ongoing ecological study."
}
