{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. argentea",
    "plant_slug": "abies-excelsa-var-argentea",
    "plant_name_scientific": "abies excelsa var. argentea",
    "intro": "Abies excelsa var. argentea, commonly known as the silver firs, is a variant of the white fir species native to the Andes Mountains. This plant is characterized by its striking silver-gray foliage, which results from dense, overlapping scales on the needles. The leaves are typically shorter and more densely packed compared to the standard variety, giving it a distinctive appearance. It thrives in high-altitude environments with cool, moist climates and well-drained soil. The plant is valued for its ornamental qualities and is often cultivated in botanical gardens and as a landscape plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. argentea is primarily native to the mountainous regions of Southeast Asia, particularly in countries such as Myanmar, Thailand, and Vietnam. This variety is typically found in subtropical and temperate forests at elevations ranging from 1,000 to 3,000 meters. It thrives in areas with high humidity and well-drained soils, often growing in mixed coniferous-deciduous forests. The plant is adapted to cool, moist climates and is commonly associated with cloud forests. Due to its restricted habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abies excelsa var. argentea was mainly introduced to ornamental horticulture due to its striking silvery-white foliage. It is commonly cultivated in gardens and parks for its aesthetic appeal and unique appearance. This variety is particularly valued for its ability to thrive in cooler climates and its ability to tolerate partial shade. It has been introduced to several regions outside its native habitat, including parts of Europe and North America. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
