{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fabri var. ziyuanensis",
    "plant_slug": "abies-fabri-var-ziyuanensis",
    "plant_name_scientific": "abies fabri var. ziyuanensis",
    "intro": "Abies fabri var. ziyuanensis, commonly known as the Ziyuan fir, is a rare and endemic conifer native to the mountainous regions of China. It belongs to the genus Abies, which includes various species of fir trees characterized by their conical shape and needle-like leaves. The foliage of this variety is typically dark green and densely packed, contributing to its ornamental value. It thrives in cool, moist environments and is often found in high-altitude forests. Due to its limited distribution and habitat specificity, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fabri var. ziyuanensis is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Hubei, and Hunan. It thrives in temperate climates with high elevation and cool, moist conditions. This variety is commonly found in forested areas at altitudes ranging from 1,500 to 3,000 meters. It is often associated with mixed coniferous and broadleaf forests. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abies fabri var. ziyuanensis was mainly introduced to regions with high humidity and moderate temperatures, typically found in subtropical mountainous areas. This plant thrives in well-drained soils and requires ample sunlight for optimal growth. It is commonly found in natural forest ecosystems where it contributes to biodiversity and ecological stability. Due to its ornamental value, it has also been cultivated in botanical gardens and private collections. However, its introduction to new environments requires careful management to prevent potential ecological disruption."
}
