{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pseudochensiensis",
    "plant_slug": "abies-pseudochensiensis",
    "plant_name_scientific": "abies pseudochensiensis",
    "intro": "Abies pseudochensiensis, commonly known as the Chinese fir, is a coniferous evergreen tree native to China. It belongs to the family Pinaceae and is characterized by its slender, conical shape and dark green, needle-like leaves. The tree produces small, spherical cones that mature to a reddish-brown color. It thrives in temperate climates with well-drained soil and is often found in mountainous regions. This species is valued for its timber and is also cultivated for ornamental purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pseudochensiensis is primarily native to the eastern Himalayas, including regions in India, Nepal, and Bhutan. It is found in high-altitude areas, typically between 2,500 and 3,500 meters above sea level. This species thrives in cool, moist climates with well-drained soils, often growing in mixed coniferous forests. Its distribution is limited to specific mountainous regions where the climate and terrain support its growth. Due to its restricted range, it is considered a rare and endemic species in these areas.",
    "distribution_introduced_art_desc": "Abies pseudochensiensis was mainly introduced to the data as a rare and endemic species native to China. It is characterized by its unique morphological features and ecological adaptations. The introduction of this plant into the dataset highlights its importance in botanical research and conservation efforts. It provides valuable insights into the biodiversity of its native habitat. This distribution data aids in understanding its potential for cultivation and ecological role in different environments."
}
