{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea var. nana",
    "plant_slug": "abies-balsamea-var-nana",
    "plant_name_scientific": "abies balsamea var. nana",
    "intro": "Abies balsamea var. nana, commonly known as the dwarf balsam fir, is a compact evergreen shrub native to the northeastern United States and eastern Canada. It features dense, dark green needles that are shorter and more clustered than those of the standard balsam fir. The plant produces small, spherical cones that release seeds in the spring, contributing to its reproductive cycle. Its slow growth rate and low stature make it well-suited for rock gardens and woodland settings. The foliage retains its color year-round, providing evergreen interest in shaded landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamea var. nana is primarily native to the northeastern United States and southeastern Canada. It is found in regions such as New York, Vermont, New Hampshire, and parts of Quebec. This variety thrives in cool, moist environments, typically in boreal and montane forests. It is commonly associated with acidic soils and is often found in rocky or mountainous terrain. Its small size makes it well adapted to harsher climatic conditions compared to the typical balsam fir.",
    "distribution_introduced_art_desc": "Abies balsamea var. nana was mainly introduced to areas with moist, well-drained soils and partial to full shade, typically in northern temperate regions. It is often found in forested areas where it forms dense thickets, especially in the northeastern United States and southeastern Canada. This variety is characterized by its dwarf growth habit and is commonly used in horticulture for its ornamental value. It has been introduced to gardens and landscapes where it serves as a low-maintenance ground cover. Due to its adaptability, it has become established in some regions beyond its native range."
}
