{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies gordoniana",
    "plant_slug": "abies-gordoniana",
    "plant_name_scientific": "abies gordoniana",
    "intro": "Abies gordoniana, commonly known as the Gordon fir, is a species of evergreen conifer native to the eastern Himalayas. It is characterized by its tall, slender form and conical shape, with dark green, needle-like leaves that are arranged in spirals along the shoots. The cones are typically pendulous, maturing to a reddish-brown color, and contain seeds surrounded by a thin, papery wing. This species thrives in cool, moist climates at high altitudes, often growing in mountainous regions with well-drained soils. Its botanical features make it an important component of high-altitude forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies gordoniana is primarily native to the mountainous regions of Central Asia, including parts of Afghanistan, Pakistan, and northern India. It is commonly found in the western Himalayas, particularly in the Kashmir region and the Karakoram Mountains. This species thrives in high-altitude environments, typically at elevations between 2,500 and 4,000 meters. It is often associated with cold, moist climates and grows in forested areas with well-drained soils. The plant is well adapted to the harsh conditions of its native habitat, making it a resilient and characteristic species of the region.",
    "distribution_introduced_art_desc": "Abies gordoniana was mainly introduced to Europe and parts of Asia during the 19th century as an ornamental tree. It was widely cultivated in botanical gardens and public parks for its attractive conical shape and evergreen foliage. The plant is particularly favored in colder climates due to its hardiness and ability to thrive in well-drained soils. Its introduction has led to its establishment in some regions beyond its native range in the Eastern Himalayas. However, it is not considered invasive in most areas where it is planted."
}
