{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. pendula",
    "plant_slug": "abies-excelsa-var-pendula",
    "plant_name_scientific": "abies excelsa var. pendula",
    "intro": "Abies excelsa var. pendula, commonly known as the weeping fir, is a striking variant of the silver fir. It is characterized by its cascading, drooping branches that give it a unique, almost ethereal appearance. The plant has needle-like leaves that are typically a dark green color, with a slightly bluish tinge. It thrives in cool, moist environments and is often cultivated as an ornamental tree. This variety is relatively slow-growing and can reach heights of up to 20 meters in optimal conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. pendula is primarily native to the high-altitude regions of the Himalayas, including parts of Nepal, Bhutan, and northern India. This variety is commonly found in mountainous areas with cool, moist climates and well-drained soils. It thrives in elevations ranging from 2,500 to 4,500 meters above sea level. The plant is often associated with mixed forests and is a characteristic component of the alpine vegetation in these regions. Its pendulous branches make it a distinctive and ornamental species in its natural habitat.",
    "distribution_introduced_art_desc": "Abies excelsa var. pendula was mainly introduced to ornamental horticulture due to its unique weeping form and aesthetic appeal. It is commonly cultivated in gardens and parks as a decorative tree. The variety is favored for its ability to thrive in temperate climates with well-drained soil. However, it requires protection from harsh winter conditions to ensure survival. Its introduction has expanded its presence beyond its native range in the Himalayas."
}
