{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies chengii",
    "plant_slug": "abies-chengii",
    "plant_name_scientific": "abies chengii",
    "intro": "Abies chengii, commonly known as the Cheng's fir, is a coniferous evergreen tree native to the mountainous regions of western China. It is characterized by its slender, conical shape and dense, dark green foliage. The needles are flat, soft, and slightly glossy, with two white stomatal bands on their upper surface. Its cones are cylindrical, woody, and typically hang downward from the branches. This species is valued for its ornamental appeal and is often cultivated in gardens for its aesthetic and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies chengii is primarily native to the eastern and central regions of China, including provinces such as Sichuan, Yunnan, and Hubei. It grows in mountainous areas at high elevations, typically between 1,500 and 3,500 meters above sea level. This species is commonly found in temperate forests with moist, well-drained soils. It is adapted to cool and humid climates, often forming part of mixed coniferous forests. The plant plays an important ecological role in its native habitat, providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Abies chengii was mainly introduced to regions with temperate climates that provide suitable conditions for its growth, such as high altitudes and well-drained soils. It is often found in mountainous areas where it thrives in cooler temperatures and moderate precipitation. This species is valued for its ornamental qualities and timber, which has led to its introduction in various horticultural and reforestation projects. However, its introduction has raised concerns about its potential impact on native ecosystems. Proper management is essential to ensure it does not become invasive in new environments."
}
