{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fraseri f. prostrata",
    "plant_slug": "abies-fraseri-f-prostrata",
    "plant_name_scientific": "abies fraseri f. prostrata",
    "intro": "Abies fraseri f. prostrata, commonly known as the prostrate Fraser fir, is a rare and unique form of the Fraser fir. It is characterized by its low-growing, creeping habit, which distinguishes it from the typical upright growth of the species. The plant features scale-like leaves that are densely packed, giving it a dense, mat-like appearance. It produces small, inconspicuous cones that mature to release seeds, contributing to its reproductive cycle. This variant is often found in specific microhabitats, reflecting its adaptation to particular environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fraseri f. prostrata is primarily native to the coastal regions of British Columbia and the adjacent areas of Washington state in western North America. This subspecies is typically found in moist, temperate rainforests along the Pacific coast. It thrives in areas with high humidity and mild temperatures, often growing in association with other coniferous species. The plant is commonly seen in valleys and lowlands where the climate supports its growth. Its distribution is limited to specific microhabitats that provide the right combination of soil and moisture conditions.",
    "distribution_introduced_art_desc": "Abies fraseri f. prostrata was mainly introduced to ornamental horticulture and landscaping due to its unique prostrate growth habit and aesthetic appeal. It is often used in rock gardens, as a ground cover, or in shaded areas where traditional shrubs may not thrive. The introduction of this plant has expanded its geographic range beyond its native habitat in western North America. However, its spread has raised concerns about potential invasiveness in non-native environments. Despite its ornamental value, careful management is recommended to prevent ecological disruption."
}
