{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fordei",
    "plant_slug": "abies-fordei",
    "plant_name_scientific": "abies fordei",
    "intro": "Abies fordei, commonly known as the Forde's fir, is a species of evergreen conifer native to the high-altitude regions of the Andes in South America. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are typically shorter than those of other fir species. The cones of Abies fordei are pendulous and mature to a reddish-brown color, releasing seeds in the fall. This plant thrives in cool, moist environments and is adapted to the harsh conditions of its mountainous habitat. Its botanical features make it an important component of the alpine ecosystems where it is found.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fordei is primarily native to the mountainous regions of central and southern Chile. It is found in the Andes, specifically in the provinces of Linares, San Ignacio, and Ovalle. This species thrives in high-altitude forests, typically between 1,500 and 2,500 meters above sea level. It is adapted to the cool, moist climate of these areas with well-drained soils. Due to its restricted range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abies fordei was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in areas with moist, well-drained soils and cool, humid climates. This species is often planted in urban landscapes for its ornamental value and dense foliage. However, it can become invasive in certain environments if not managed properly. Its introduction has raised concerns about its potential impact on native ecosystems."
}
