{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies glehnii",
    "plant_slug": "abies-glehnii",
    "plant_name_scientific": "abies glehnii",
    "intro": "Abies glehnii, commonly known as the Glehn's fir, is a species of conifer native to the mountainous regions of eastern Asia. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves. The cones of Abies glehnii are typically elongated and hang downward, containing edible seeds. This plant thrives in cool, moist climates and is often found in high-altitude forests. Its botanical features make it an important species for ecological studies and horticultural interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies glehnii is primarily native to the mountainous regions of central and southern Japan. It is found in the Japanese Archipelago, particularly in the islands of Honshu, Shikoku, and Kyushu. This species thrives in cool, humid climates at elevations ranging from 1,000 to 2,500 meters. It is commonly associated with mixed forests and grows in areas with well-drained soils. Abies glehnii is an important component of the temperate coniferous forests in its native range.",
    "distribution_introduced_art_desc": "Abies glehnii was mainly introduced to North America as an ornamental tree due to its attractive conical shape and dense foliage. It has been planted in various regions, including the northeastern United States and parts of Canada, where it is cultivated for its aesthetic value. However, it is not native to these areas and has not established itself as a widespread invasive species. The plant prefers cool, moist climates and is often found in shaded, well-drained sites. Its introduction has raised concerns about its potential impact on local ecosystems if it were to spread beyond managed landscapes."
}
