{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nobilis f. robusta",
    "plant_slug": "abies-nobilis-f-robusta",
    "plant_name_scientific": "abies nobilis f. robusta",
    "intro": "Abies nobilis f. robusta, commonly known as the White Fir, is a subspecies of the Noble Fir native to the western United States. It is characterized by its conical shape, dark green, needle-like leaves, and distinctive cones that hang from the branches. The tree can reach heights of up to 80 meters, making it one of the tallest fir species. Its bark is thick and scaly, providing some protection against forest fires. This evergreen is often found in high-altitude forests and is valued for its ornamental and ecological significance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nobilis f. robusta is primarily native to the western United States, particularly in regions of California, Oregon, and Nevada. This subspecies is commonly found in mountainous areas with high elevations and cool, moist climates. It thrives in coniferous forests and is often associated with other native evergreen species. The plant is well adapted to rocky soils and can tolerate harsh environmental conditions. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abies nobilis f. robusta was mainly introduced to areas with cooler climates and higher elevations where it can thrive in well-drained soils. This subspecies is often cultivated for its ornamental value due to its dense foliage and conical shape. It has been introduced to various regions in North America, including parts of the Pacific Northwest and the Rocky Mountains. The plant is relatively hardy but requires protection from extreme weather conditions. Its introduction has sometimes led to competition with native species in certain ecosystems."
}
