{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies microcarpa",
    "plant_slug": "abies-microcarpa",
    "plant_name_scientific": "abies microcarpa",
    "intro": "Abies microcarpa, commonly known as the Mexican fir, is a coniferous evergreen tree native to central Mexico. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are shorter than those of many other fir species. The tree produces small, cylindrical cones that mature to a reddish-brown color, and it is typically found in high-altitude regions with cool, moist climates. Abies microcarpa is valued for its ornamental appeal and is often cultivated in gardens and parks. Its botanical features make it a distinctive member of the Pinaceae family.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies microcarpa is primarily native to the western United States, particularly in California, Oregon, and Nevada. It thrives in high-altitude regions, often found in coniferous forests at elevations between 1,500 and 3,000 meters. This species is commonly associated with moist, well-drained soils in mountainous areas. It is also found in parts of northern Mexico, including the states of Sonora and Chihuahua. Due to its specific habitat requirements, it is often limited to isolated mountain ranges and is considered a rare and endemic species in its range.",
    "distribution_introduced_art_desc": "Abies microcarpa was mainly introduced to specific regions with suitable cool and moist climates, often as an ornamental or timber species. It is typically found in areas with well-drained soils and elevations ranging from lowlands to subalpine zones. The plant's distribution has been expanded through human activities such as horticulture and reforestation efforts. However, its introduction has sometimes led to ecological impacts in non-native environments. It is important to monitor its spread to manage potential invasiveness in new habitats."
}
