{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies veitchii var. nikkoensis",
    "plant_slug": "abies-veitchii-var-nikkoensis",
    "plant_name_scientific": "abies veitchii var. nikkoensis",
    "intro": "Abies veitchii var. nikkoensis, commonly known as the Nikko fir, is a variant of the Veitch fir native to Japan. It is a coniferous evergreen tree characterized by its slender, pyramidal shape and dark green, needle-like leaves. The foliage is typically arranged in two ranks, giving the tree a distinctive appearance. It produces cone-like structures that contain seeds, which are dispersed by wind. This species thrives in cool, moist climates and is often found in mountainous regions with well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies veitchii var. nikkoensis is primarily native to the Japanese islands of Honshu, Shikoku, and Kyushu. This variant of the Japanese fir is found in temperate forest regions, typically at elevations between 1,000 and 2,000 meters. It thrives in cool, moist climates with well-drained soil, often growing in mixed coniferous forests. The plant is particularly common in the central and northern parts of Honshu, where it forms part of the natural vegetation. Its distribution is limited to specific microhabitats that provide the necessary environmental conditions for its growth.",
    "distribution_introduced_art_desc": "Abies veitchii var. nikkoensis was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, well-drained soils in mountainous areas. This variant is valued for its ornamental qualities, including its dense foliage and pyramidal shape. It has been cultivated in botanical gardens and private landscapes due to its adaptability. However, it is considered an invasive species in some regions, posing a threat to native plant communities."
}
