{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies yoneyamae",
    "plant_slug": "abies-yoneyamae",
    "plant_name_scientific": "abies yoneyamae",
    "intro": "Abies yoneyamae, commonly known as Yoneyama's fir, is a rare and endemic species native to Japan. It belongs to the genus Abies, which includes various species of fir trees, and is characterized by its conical shape and needle-like leaves. The plant typically grows in high-altitude regions, thriving in cool, moist environments with well-drained soil. Its cones are small and often hang in clusters, contributing to its unique appearance. Due to its limited distribution and habitat specificity, Abies yoneyamae is considered a valuable subject for botanical research and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies yoneyamae is primarily native to the Japanese islands of Honshu, Shikoku, and Kyushu. It is found in the mountainous regions of these islands, particularly in areas with cool, moist climates. This species thrives in high-altitude forests and is often associated with other coniferous trees. Its natural habitat includes areas with well-drained soil and ample sunlight. Due to its limited range, it is considered a rare and endemic species within Japan.",
    "distribution_introduced_art_desc": "Abies yoneyamae was mainly introduced to regions with high elevation and cool, moist climates, typically found in mountainous areas. It thrives in environments with well-drained soils and moderate to high levels of precipitation. This species is often cultivated in botanical gardens and conservation areas due to its unique ecological and ornamental value. Its introduction has been limited to specific locations where its natural habitat can be replicated. However, it remains a rare and endangered species in the wild."
}
