{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibirica f. parvula",
    "plant_slug": "abies-sibirica-f-parvula",
    "plant_name_scientific": "abies sibirica f. parvula",
    "intro": "Abies sibirica f. parvula, commonly known as the dwarf Siberian fir, is a compact form of the Siberian fir, characterized by its small stature and dense, pyramidal shape. It is a variant of the species Abies sibirica, native to the mountainous regions of eastern Siberia and northern Mongolia. The plant features scale-like leaves that are dark green on top and whitish underneath, giving it a distinctive appearance. It thrives in cool, moist environments and is often found in coniferous forests. This ornamental variety is valued for its hardiness and ability to adapt to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sibirica f. parvula is primarily native to the mountainous regions of eastern Europe and western Siberia. This subspecies is commonly found in the taiga biome, where it thrives in cool, moist climates. It is particularly prevalent in the Altai Mountains, the Ural Mountains, and parts of the Russian Far East. The plant grows in well-drained soils and is often found in mixed coniferous forests. Its distribution is limited to high-altitude areas where it can withstand harsh climatic conditions.",
    "distribution_introduced_art_desc": "Abies sibirica f. parvula was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It thrives in environments with moderate temperatures and high humidity. This distribution is often found in the northern hemisphere, particularly in regions of Europe and Asia. The plant is commonly cultivated in gardens and parks for its ornamental value. Its introduction has been largely driven by horticultural interest and ecological restoration efforts."
}
