{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies firma var. bifida",
    "plant_slug": "abies-firma-var-bifida",
    "plant_name_scientific": "abies firma var. bifida",
    "intro": "Abies firma var. bifida, commonly known as the twin-leaf fir, is a rare and unique variant of the fir tree native to the mountainous regions of China. It is characterized by its distinctive bifid (split) leaves, which give it a striking appearance compared to typical fir species. The plant exhibits a conical shape with dense, dark green foliage that turns a silvery-blue hue during the winter months. It thrives in cool, moist environments and is often found at high elevations where it forms part of the subalpine forest ecosystem. Due to its rarity and ornamental value, it is a subject of interest for botanists and horticulturists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies firma var. bifida is primarily native to the mountainous regions of central and southern China, particularly in the provinces of Sichuan, Yunnan, and Guizhou. It thrives in cool, moist climates at high altitudes, often found in mixed forests. This variety is adapted to rocky and well-drained soils, making it a common sight in mountainous terrain. It is also occasionally found in parts of northern Vietnam and eastern Tibet. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abies firma var. bifida was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is commonly cultivated in gardens and parks for its ornamental value, particularly its dense, pyramidal shape and fragrant foliage. This variety is often used as a windbreak or to provide privacy due to its size and growth habit. It thrives in USDA hardiness zones 4 through 7, making it suitable for a range of temperate climates. However, it requires protection from strong winds and is sensitive to urban pollution."
}
