{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies lowiana var. pendula",
    "plant_slug": "abies-lowiana-var-pendula",
    "plant_name_scientific": "abies lowiana var. pendula",
    "intro": "Abies lowiana var. pendula, commonly known as the weeping fir, is a variant of the lowiana fir native to the mountainous regions of central Mexico. This evergreen conifer is characterized by its pendulous branches that droop gracefully, giving it a distinctive, cascading appearance. Its needles are dark green and densely packed, providing a lush, textured foliage. The tree typically grows to a moderate height, with a broad, rounded crown. It thrives in well-drained soils and cooler climates, making it a popular ornamental plant in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies lowiana var. pendula is primarily native to the western United States, specifically in California and Nevada. This variety of the white fir is typically found in high elevation areas, often in mountainous regions with cool, moist climates. It thrives in areas with well-drained soils and is commonly associated with mixed coniferous forests. The plant is adapted to the specific environmental conditions of its native range, including limited sunlight and seasonal temperature variations. Due to its limited distribution, it is considered a rare and localized species within its native habitat.",
    "distribution_introduced_art_desc": "Abies lowiana var. pendula was mainly introduced to ornamental horticulture and landscaping due to its unique weeping form and aesthetic appeal. It is often cultivated in gardens and parks for its visual interest and ability to thrive in cooler climates. This variety is particularly valued for its ability to add a dramatic, sculptural element to landscapes. However, it requires well-drained soil and protection from strong winds to ensure optimal growth. Its introduction has expanded the diversity of coniferous plants available for garden design."
}
