{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies rinzii",
    "plant_slug": "abies-rinzii",
    "plant_name_scientific": "abies rinzii",
    "intro": "Abies rinzii, commonly known as the Rinzii fir, is a species of conifer native to the mountainous regions of Southeast Asia. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves. The tree produces cones that are typically reddish-brown and contain winged seeds, which are dispersed by wind. It thrives in cool, moist climates and is often found in high-altitude forests. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies rinzii is primarily native to the mountainous regions of central and eastern China, including parts of Sichuan, Yunnan, and Guizhou provinces. It thrives in high-altitude forests where the climate is cool and moist. This species is often found in mixed coniferous forests at elevations ranging from 2,000 to 3,500 meters. It is adapted to the rugged terrain and nutrient-poor soils typical of these regions. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abies rinzii was mainly introduced to specific regions in China, particularly in the provinces of Sichuan and Yunnan. It is commonly found in high-altitude areas with cool and moist climates. This plant is often cultivated for its ornamental value due to its attractive conical shape and dense foliage. It has also been used in reforestation projects to stabilize soil in mountainous regions. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
