{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies batavorum",
    "plant_slug": "abies-batavorum",
    "plant_name_scientific": "abies batavorum",
    "intro": "Abies batavorum, commonly known as the Batawa fir, is a species of fir native to the mountainous regions of southern China. It is a coniferous evergreen tree characterized by its conical shape and needle-like leaves. The tree produces cones that mature in the second year, typically releasing seeds in the autumn. Its foliage is dark green and dense, providing habitat for various wildlife species. The Batawa fir is valued for its timber and is often found in mixed forests at higher elevations.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies batavorum is primarily native to the Caribbean islands, specifically the Greater Antilles. This species is found in regions such as Cuba, Hispaniola, Jamaica, and Puerto Rico. It thrives in humid, mountainous environments with well-drained soils. The plant is commonly found in cloud forests and other high-altitude ecosystems. Due to habitat loss and environmental changes, its distribution has become increasingly restricted.",
    "distribution_introduced_art_desc": "Abies batavorum was mainly introduced to North America during the 19th century as part of ornamental horticulture. It was cultivated for its attractive conical shape and evergreen foliage, making it a popular choice for landscaping. Despite its aesthetic appeal, it has not established itself as a widespread invasive species in the region. The plant's introduction was largely confined to controlled garden environments rather than natural ecosystems. However, there are concerns about its potential for spread in areas with suitable climatic conditions."
}
