{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nigra",
    "plant_slug": "abies-nigra",
    "plant_name_scientific": "abies nigra",
    "intro": "Abies nigra, commonly known as the black fir, is a coniferous evergreen tree native to eastern North America. It is characterized by its dark, glossy needles and conical shape, with bark that becomes furrowed and dark as it matures. The tree produces small, yellowish-green cones that mature to a reddish-brown color, containing seeds dispersed by wind. It thrives in moist, acidic soils and is often found in mixed forests. The black fir is valued for its ornamental appeal and ecological importance in forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nigra is primarily native to the eastern United States, including parts of Canada. It is found in the Appalachian Mountains and extends into the Midwest. This species thrives in cool, moist environments with well-drained soil. It is commonly found in mixed hardwood forests and along stream valleys. Its range includes states such as Tennessee, Virginia, and New York.",
    "distribution_introduced_art_desc": "Abies nigra was mainly introduced to areas with moist, well-drained soils and cool climates, typically found in higher elevations or northern latitudes. It thrives in environments with partial to full shade and is often found in mixed forests. This species is commonly used in landscaping for its ornamental value and ability to form dense, evergreen canopies. However, its introduction can sometimes lead to competition with native plant species. It is important to monitor its spread to ensure it does not disrupt local ecosystems."
}
