{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nordmanniana var. equi-trojani",
    "plant_slug": "abies-nordmanniana-var-equi-trojani",
    "plant_name_scientific": "abies nordmanniana var. equi-trojani",
    "intro": "Abies nordmanniana var. equi-trojani, commonly known as the Trojani fir, is a rare and distinctive variety of the Nordmann fir. It is characterized by its dense, conical shape and dark green needles that are shorter and stiffer than those of the typical Nordmann fir. The tree produces small, cylindrical cones that are typically blue-green in color. It is native to the Caucasus region and is adapted to high-altitude environments with cold climates. Due to its limited natural range and slow growth, it is considered a valuable and often rare ornamental tree in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nordmanniana var. equi-trojani is primarily native to the Caucasus region, including parts of southern Russia, Georgia, and northern Armenia. This variety is found in mountainous areas with a temperate climate, typically at elevations between 1,500 and 2,500 meters. It thrives in well-drained soils and is often found in mixed forests alongside other coniferous species. The plant is adapted to the cool, humid conditions of its native habitat. Due to its limited range, it is considered a rare and endemic species in the Caucasus.",
    "distribution_introduced_art_desc": "Abies nordmanniana var. equi-trojani was mainly introduced to ornamental horticulture and landscape design due to its attractive conical shape and dense foliage. It is commonly cultivated in gardens and parks for its aesthetic value and ability to thrive in temperate climates. This variety is also valued for its hardiness and adaptability to a range of soil conditions. Its introduction has expanded its presence beyond its native range in the Caucasus region. However, its non-native status raises concerns about potential ecological impacts in new environments."
}
