{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abietia douglasii var. pendula",
    "plant_slug": "abietia-douglasii-var-pendula",
    "plant_name_scientific": "abietia douglasii var. pendula",
    "intro": "Abietia douglasii var. pendula, commonly known as the weeping white fir, is a unique variant of the white fir tree native to the western United States. It is characterized by its drooping branches that create a distinctive, cascading appearance. The plant has needle-like leaves that are dark green on top and whitish underneath, providing a striking visual contrast. It thrives in moist, well-drained soils and is often found in mountainous regions. This variety is valued for its ornamental appeal and ecological role in forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abietia douglasii var. pendula is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal areas and mountainous regions with moist, temperate climates. This variety is often associated with mixed evergreen forests and grows in areas with well-drained soils. It thrives in regions with high humidity and moderate temperatures. The plant is well adapted to the specific ecological conditions of its native range.",
    "distribution_introduced_art_desc": "Abietia douglasii var. pendula was mainly introduced to the Pacific Northwest region of the United States. It was brought there for its ornamental value due to its unique weeping form and attractive foliage. This variety is commonly found in gardens and landscaped areas in Washington and Oregon. It thrives in well-drained soils and partial to full sun conditions. However, it is considered a non-native species and can sometimes outcompete local vegetation if not managed properly."
}
