{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies brevifolia",
    "plant_slug": "abies-brevifolia",
    "plant_name_scientific": "abies brevifolia",
    "intro": "Abies brevifolia, commonly known as the shortleaf fir, is a coniferous evergreen tree native to the mountainous regions of central and southern Mexico. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are short and thick. The tree produces cones that are typically reddish-brown and contain edible seeds, which are an important food source for various wildlife species. Abies brevifolia thrives in cool, moist climates and is often found in high-altitude forests. Its ecological significance lies in its role as a habitat provider and its contribution to the biodiversity of its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies brevifolia is primarily native to the western United States, particularly in California, Oregon, and Nevada. It is commonly found in high elevation areas, such as the Sierra Nevada and the Cascade Range. This species thrives in cool, moist environments and is often associated with mixed coniferous forests. It is also found in parts of northern Baja California, Mexico. The plant is well adapted to the rugged terrain and climate of these regions.",
    "distribution_introduced_art_desc": "Abies brevifolia was mainly introduced to specific regions with suitable climates for its growth, such as temperate forests. It is typically found in areas with high precipitation and cool temperatures. The plant's distribution has been expanded through human activities, including horticultural and reforestation efforts. It thrives in well-drained soils and often grows in mixed coniferous forests. Its introduction has had both ecological and economic impacts in the regions where it has been established."
}
