{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies kawakamii",
    "plant_slug": "abies-kawakamii",
    "plant_name_scientific": "abies kawakamii",
    "intro": "Abies kawakamii, commonly known as the Kawakamii fir, is a rare and endemic species native to Taiwan. It is a coniferous evergreen tree that typically grows in high-altitude forests, reaching heights of up to 20 meters. The tree has needle-like leaves that are dark green on top and whitish underneath, with a distinctive aromatic scent. Its cones are small and cylindrical, maturing to release seeds that are dispersed by wind. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies kawakamii"
    },
    "taxonomy_art_desc": "Abies kawakamii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails and some mosses. Its subclass is Pinidae, a group that includes conifers such as pines, firs, and cedars. Its order is Pinales, which consists of coniferous plants that produce cones and have needle-like or scale-like leaves. Its family is Pinaceae, known as the pine family, which includes various coniferous trees such as pines, spruces, and firs. Its genus is Abies, commonly known as firs, which are evergreen coniferous trees with conical crowns and flat, needle-like leaves. Its species is Abies kawakamii, a rare and endemic fir species native to Taiwan, characterized by its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Taiwan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies kawakamii is primarily native to Taiwan. It is found in the central and southern mountainous regions of the island. This species grows in humid, cool climates at elevations ranging from 1,500 to 3,000 meters. It is commonly found in mixed forests alongside other coniferous species. Due to its limited range, it is considered a rare and endangered plant.",
    "distribution_introduced_art_desc": "Abies kawakamii was mainly introduced to areas with high elevation and cool, moist climates, typically found in mountainous regions. It is commonly found in regions such as Japan, Taiwan, and parts of Southeast Asia. This plant thrives in well-drained soils and requires ample sunlight for optimal growth. Its introduction has been largely for ornamental purposes due to its attractive foliage and cone structure. However, it is not widely cultivated outside its native range."
}
