{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies lasiocarpa f. compacta",
    "plant_slug": "abies-lasiocarpa-f-compacta",
    "plant_name_scientific": "abies lasiocarpa f. compacta",
    "intro": "Abies lasiocarpa f. compacta, commonly known as the dwarf white fir, is a compact form of the white fir native to the western United States. It is characterized by its dense, conical shape and dark green, needle-like leaves. The plant features small, rounded cones that mature to a reddish-brown color. It thrives in cooler, moist environments and is often found in mountainous regions. Its compact growth habit makes it a popular choice for ornamental landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies lasiocarpa f. compacta is primarily native to the western United States and parts of Canada. It is found in high-elevation areas, including the Rocky Mountains and the Sierra Nevada. This subspecies thrives in subalpine and alpine environments, often growing on rocky slopes and in open forested areas. It is commonly associated with other coniferous species such as Douglas fir and lodgepole pine. Its distribution is limited to regions with cold, moist climates and well-drained soils.",
    "distribution_introduced_art_desc": "Abies lasiocarpa f. compacta was mainly introduced to specific regions with cooler climates and higher elevations, where it can thrive in well-drained soils. This distribution is primarily found in the western United States, particularly in areas like Colorado and Wyoming. It is often cultivated in gardens and parks for its ornamental value and compact growth habit. The plant's introduction has been limited to areas that mimic its native habitat, ensuring its survival in non-native environments. Its presence in these regions is a result of intentional planting by horticulturists and conservationists."
}
