{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies mariesii var. kawakamii",
    "plant_slug": "abies-mariesii-var-kawakamii",
    "plant_name_scientific": "abies mariesii var. kawakamii",
    "intro": "Abies mariesii var. kawakamii, commonly known as the Kawakamii fir, is a rare variant of the Mariesii fir native to Japan. It is a coniferous evergreen tree characterized by its narrow, conical shape and dark green, needle-like leaves. The foliage is typically arranged in spirals along the branches, and the cones are small and cylindrical. This variety is adapted to cool, humid climates and is often found in mountainous regions. Its botanical significance lies in its unique morphology and limited distribution, making it a subject of interest in botanical studies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies mariesii var. kawakamii is primarily native to the mountainous regions of Taiwan. This variety of the Formosan fir is found in the central and eastern parts of the island, particularly in the Central Mountain Range. It grows at elevations ranging from 1,500 to 3,000 meters above sea level. The plant thrives in cool, moist climates with well-drained soils. It is an important component of the temperate coniferous forests in its native habitat.",
    "distribution_introduced_art_desc": "Abies mariesii var. kawakamii was mainly introduced to regions with temperate climates and high elevation, where it thrives in moist, well-drained soils. It is commonly found in areas with cool summers and cold winters, making it suitable for mountainous and subalpine environments. This variety is often planted in landscapes for its ornamental value, including its conical shape and attractive foliage. It has been introduced to several parts of North America, particularly in the western United States. However, its natural range is limited, and it is not widely distributed beyond its native habitat in Japan."
}
