{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies coerulea",
    "plant_slug": "abies-coerulea",
    "plant_name_scientific": "abies coerulea",
    "intro": "Abies coerulea, commonly known as the blue spruce, is a coniferous tree native to the mountainous regions of central Asia. It is characterized by its striking bluish-gray needles and conical shape, which contribute to its ornamental value. The tree produces small, dark blue to black cones that mature in the second year. Its foliage is dense and provides habitat for various wildlife species. Abies coerulea is well adapted to cold climates and is often used in landscaping for its aesthetic appeal and hardiness.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies coerulea is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Tibet. It thrives in high-altitude forests at elevations ranging from 2,500 to 4,000 meters. This species is commonly found in areas with cool, moist climates and well-drained soils. It is often associated with mixed coniferous forests and is an important component of the alpine ecosystem. Due to its limited distribution and specific habitat requirements, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abies coerulea was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is commonly found in regions with high elevations and temperate conditions. This plant thrives in environments where there is ample sunlight but also some shade. It is often used in landscaping for its ornamental value and ability to withstand colder temperatures. The distribution of Abies coerulea is largely limited to its native habitat in East Asia."
}
