{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies khutrow",
    "plant_slug": "abies-khutrow",
    "plant_name_scientific": "abies khutrow",
    "intro": "Abies khutrow, commonly known as the Khutrow fir, is a coniferous tree native to the mountainous regions of Central Asia. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are arranged spirally along its branches. The tree produces cones that are typically cylindrical and contain seeds enclosed in woody scales. Its bark is smooth and reddish-brown, becoming fissured with age. Abies khutrow is adapted to high-altitude environments and plays a significant role in the ecosystems of its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies khutrow is primarily native to the mountainous regions of central and southern Mexico. It is commonly found in the states of Oaxaca, Chiapas, and Puebla. This species thrives in high-altitude forests, typically between 1,500 and 3,000 meters above sea level. It prefers moist, well-drained soils and is often part of mixed coniferous forests. Abies khutrow is an important component of the cloud forest ecosystems in these areas.",
    "distribution_introduced_art_desc": "Abies khutrow was mainly introduced to North America as an ornamental tree due to its aesthetic appeal and adaptability to various climates. It is commonly found in gardens and landscaped areas across the eastern United States. The distribution of this species has expanded beyond its native range in Europe, where it is native to the Carpathian Mountains. It is often planted for its dense evergreen foliage and ability to thrive in moist, well-drained soils. However, its introduction has raised concerns about potential ecological impacts in non-native regions."
}
