{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba subsp. apennina",
    "plant_slug": "abies-alba-subsp-apennina",
    "plant_name_scientific": "abies alba subsp. apennina",
    "intro": "Abies alba subsp. apennina, commonly known as the Apennine fir, is a subspecies of the silver fir native to the mountainous regions of southern Europe. It is characterized by its slender, conical shape and dark green, needle-like leaves that are typically shorter than those of the typical silver fir. The cones are slender and usually hang downward, with distinctive bract-like structures. This subspecies thrives in cool, moist environments at high altitudes, often forming dense forests in the Apennine Mountains. Its ecological importance includes providing habitat for various mountain species and contributing to soil stabilization in alpine regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba subsp. apennina is primarily native to the Apennine Mountains of southern Italy. This subspecies is found in the central and southern regions of the Italian peninsula, particularly in the Apennines. It thrives in mountainous areas with a temperate climate and well-drained soils. The plant is adapted to the specific environmental conditions of this region, including its altitude and precipitation patterns. It is an important component of the local forest ecosystems in these areas.",
    "distribution_introduced_art_desc": "Abies alba subsp. apennina was mainly introduced to regions of southern Europe, particularly in Italy and the Balkans, where it has been cultivated for its ornamental value and ecological benefits. It is commonly found in mountainous areas with a temperate climate, thriving in well-drained soils and moderate precipitation. This subspecies is often used in reforestation projects due to its resilience and ability to stabilize soil. Its introduction has contributed to the biodiversity of these regions, although it is not native to all areas where it is now established. Despite its non-native status in some regions, it has become an integral part of local ecosystems."
}
