{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibiriconephrolepis",
    "plant_slug": "abies-sibiriconephrolepis",
    "plant_name_scientific": "abies sibiriconephrolepis",
    "intro": "Abies sibiriconephrolepis, commonly known as the Siberian fir, is a coniferous evergreen tree native to the mountainous regions of Central Asia. It is characterized by its conical shape, dark green needles, and distinctive cone structure. The tree typically grows in cold, high-altitude environments, preferring well-drained soils. Its bark is thick and scaly, providing protection against harsh weather conditions. The plant plays an important ecological role in its native habitat, supporting various wildlife species and contributing to forest biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sibiriconephrolepis is primarily native to the mountainous regions of eastern Siberia, including parts of the Russian Federation. It is commonly found in the taiga biome, where it thrives in cold, moist climates with well-drained soil. This species is particularly associated with the Altai Mountains and the Sayano-Shushenskaya region. It grows at elevations ranging from 1,500 to 3,000 meters above sea level. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abies sibiriconephrolepis was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is commonly found in regions of eastern Asia, including parts of China, Russia, and Mongolia. This species is often cultivated in botanical gardens and as an ornamental tree due to its attractive appearance and adaptability. It prefers partial shade to full sun and can tolerate a range of soil types. However, it is not widely naturalized outside its native range."
}
