{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies argentea",
    "plant_slug": "abies-argentea",
    "plant_name_scientific": "abies argentea",
    "intro": "Abies argentea, commonly known as the silver fir, is a coniferous evergreen tree native to the mountainous regions of central and southern Europe. It is characterized by its narrow, needle-like leaves that are coated with a silvery-white wax, giving it its common name. The tree produces cone-like structures that contain seeds, typical of the conifer family. Its bark is typically smooth and gray, becoming fissured with age. Abies argentea thrives in cool, moist climates and is often found in high-altitude forests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies argentea is primarily native to the mountainous regions of central and southern Europe, including countries such as Italy, France, Spain, and parts of the Balkans. It thrives in temperate climates with well-drained soil and is commonly found in high-altitude forests. This species is often associated with the Alps and the Carpathian Mountains, where it grows in mixed coniferous forests. It prefers cool, moist environments and is typically found at elevations between 1,000 and 2,500 meters. Due to its specific habitat requirements, it is relatively rare and is considered a relict species in some areas.",
    "distribution_introduced_art_desc": "Abies argentea was mainly introduced to Europe and parts of Asia during the 19th century as an ornamental tree due to its attractive silver foliage. It has since been planted in various regions for landscaping and forestry purposes. The distribution includes countries such as Germany, France, Italy, and the United Kingdom. It thrives in temperate climates with well-drained soil and moderate rainfall. However, its spread has been limited by its specific environmental requirements and susceptibility to certain pests and diseases."
}
