{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies forrestii var. smithii",
    "plant_slug": "abies-forrestii-var-smithii",
    "plant_name_scientific": "abies forrestii var. smithii",
    "intro": "Abies forrestii var. smithii, commonly known as the Smith's fir, is a rare and highly sought-after variant of the Himalayan fir. It is native to the eastern Himalayas, particularly in regions of Nepal and Bhutan, where it thrives in cool, moist, and high-altitude environments. This variant is characterized by its narrow, conical shape and dark green, needle-like leaves that are slightly twisted. Its cones are typically reddish-brown and release seeds in the fall, contributing to its ecological role in forest ecosystems. Due to its limited distribution and habitat specificity, it is considered a valuable species for botanical study and conservation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies forrestii"
    },
    "taxonomy_art_desc": "Abies forrestii var. smithii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for having vascular tissue. Its subclass is Pinidae, a group that includes conifers and other gymnosperms, characterized by needle-like leaves and cone-bearing reproduction. Its order is Pinales, which consists of coniferous evergreen trees and shrubs, typically with needle-like leaves and woody cones. Its family is Pinaceae, commonly known as the pine family, which includes various coniferous trees such as pines, firs, and spruces. Its genus is Abies, which refers to the genus of fir trees, known for their pyramidal shape and needle-like leaves. Its species is Abies forrestii, a species of fir tree native to eastern Asia, characterized by its distinctive foliage and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies forrestii var. smithii is primarily native to China South-Central. This variant of the Chinese fir is found in the mountainous regions of central China, particularly in provinces such as Sichuan and Hubei. It thrives in cool, moist climates at high altitudes, often in mixed forests with other coniferous species. The plant is well adapted to the specific ecological conditions of its native habitat. Its distribution is limited to these areas, making it a regionally significant species in the flora of China.",
    "distribution_introduced_art_desc": "Abies forrestii var. smithii was mainly introduced to the mountainous regions of the eastern United States, particularly in areas with high elevations and cool, moist climates. This variety is often found in mixed forests alongside other coniferous species such as fir and spruce. It thrives in well-drained, acidic soils and requires partial to full shade for optimal growth. The plant is valued for its ornamental qualities, including its dense foliage and attractive cone structure. Due to its specific habitat requirements, it is not commonly found outside of its native range in the wild."
}
