{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor f. conica",
    "plant_slug": "abies-concolor-f-conica",
    "plant_name_scientific": "abies concolor f. conica",
    "intro": "Abies concolor f. conica, commonly known as the white fir, is a cultivar of the white fir tree native to the western United States. It is characterized by its conical shape and dense, dark green foliage that remains throughout the year. The cones are typically reddish-brown and hang downward, adding visual interest to the tree. It thrives in cooler climates and well-drained soil, making it a popular choice for ornamental landscaping. This cultivar is valued for its hardiness and ability to provide year-round visual appeal in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor f. conica is primarily native to the western United States, including parts of California, Nevada, and Utah. This subspecies is commonly found in high-elevation mountainous regions, particularly in the Sierra Nevada and other ranges in the western states. It thrives in cool, moist climates with well-drained soils, often growing in forested areas at elevations ranging from 1,500 to 3,000 meters. The plant is adapted to harsh alpine conditions and is often found in association with other coniferous species. Its natural range reflects its preference for specific ecological niches in the western mountainous regions of North America.",
    "distribution_introduced_art_desc": "Abies concolor f. conica was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in areas with moist, well-drained soils and cool, temperate climates. This fir variety is often planted as an ornamental tree due to its conical shape and dense foliage. It has been used in landscaping and reforestation projects in regions where it can thrive. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
