{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies douglasii var. stairii",
    "plant_slug": "abies-douglasii-var-stairii",
    "plant_name_scientific": "abies douglasii var. stairii",
    "intro": "Abies douglasii var. stairii, commonly known as the Stair's fir, is a variant of the Douglas fir native to the western United States. It is a coniferous evergreen tree characterized by its narrow, conical shape and dark green, needle-like leaves. The bark of this species is typically reddish-brown and becomes furrowed with age. It produces cones that hang downward, containing seeds dispersed by wind. This variety is adapted to high-altitude environments and is often found in mountainous regions with cool, moist conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies douglasii var. stairii is primarily native to the western United States, specifically found in California and Oregon. This variant of the Douglas fir is typically located in mountainous regions, particularly in the Sierra Nevada and Cascade mountain ranges. It thrives in cool, moist climates at high elevations, often in areas with well-drained soils. The plant is commonly found in coniferous forests and is adapted to the harsh conditions of its native habitat. Its distribution is limited to specific ecological zones where it can receive adequate moisture and sunlight.",
    "distribution_introduced_art_desc": "Abies douglasii var. stairii was mainly introduced to areas with moist, well-drained soils and cool, temperate climates. It is commonly found in mountainous regions where it thrives in partial to full shade. This variant is known for its dense foliage and is often used in landscaping for its ornamental value. It has been introduced to several regions outside its native range, including parts of the Pacific Northwest and other temperate zones. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
