{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies delavayi var. faxoniana",
    "plant_slug": "abies-delavayi-var-faxoniana",
    "plant_name_scientific": "abies delavayi var. faxoniana",
    "intro": "Abies delavayi var. faxoniana, commonly known as the Faxon's fir, is a variant of the Delavay fir native to the Himalayas and southwestern China. It is a coniferous evergreen tree characterized by its pyramidal shape and dense, dark green foliage. The needles are typically short, flat, and have a distinctive white stomatal band underneath. It produces small, yellow-green cones that mature to a reddish-brown color. This species is valued for its ornamental appeal and is often cultivated in gardens for its aesthetic and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies delavayi var. faxoniana is primarily native to the eastern Himalayas, including parts of India, Nepal, Bhutan, and China. It is commonly found in the regions of Sichuan and Yunnan in China. This plant grows in temperate to subtropical climates, typically in mountainous areas with high elevation. It is often associated with mixed forests and prefers well-drained soils. Its native distribution spans across the southern and central parts of the Himalayan range.",
    "distribution_introduced_art_desc": "Abies delavayi var. faxoniana was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is commonly found in the eastern Himalayas, including parts of China, Nepal, and Bhutan. This variant is known for its slow growth and ability to thrive in high-altitude environments. It is often used in horticulture for its ornamental value and ecological benefits. The distribution of this plant is limited to specific geographic regions due to its climatic requirements."
}
