{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cephalonica var. arcadica",
    "plant_slug": "abies-cephalonica-var-arcadica",
    "plant_name_scientific": "abies cephalonica var. arcadica",
    "intro": "Abies cephalonica var. arcadica, commonly known as the Arcadian fir, is a rare and endemic subspecies native to the mountainous regions of Greece. It is a coniferous evergreen tree characterized by its narrow, conical shape and dark green, needle-like foliage. The tree produces small, spherical cones that release seeds, contributing to its reproductive cycle. Its habitat is typically found in high-altitude forests with cool, moist climates. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cephalonica var. arcadica is primarily native to the mountainous regions of the western Balkans, specifically in Albania, northwestern Greece, and southern Italy. This variety is found in the Apennines and Dinaric Alps, where it thrives in cool, moist climates at high altitudes. It is commonly associated with mixed forests and grows on rocky or well-drained soils. The plant is adapted to temperate and subalpine environments, often occurring in association with other coniferous species. Its distribution is limited to specific geographic areas, reflecting its ecological requirements and historical range.",
    "distribution_introduced_art_desc": "Abies cephalonica var. arcadica was mainly introduced to ornamental horticulture and botanical gardens due to its unique appearance and cold hardiness. It is often cultivated for its conical shape and silver-blue foliage, making it a popular choice for landscaping in temperate regions. The variety is also valued for its ability to thrive in a range of soil types and its resistance to certain pests and diseases. However, its introduction has raised concerns about potential invasiveness in non-native environments. Despite its aesthetic appeal, careful management is recommended to prevent unintended ecological impacts."
}
