{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies peloponnesica",
    "plant_slug": "abies-peloponnesica",
    "plant_name_scientific": "abies peloponnesica",
    "intro": "Abies peloponnesica, commonly known as the Peloponnesian fir, is a rare and endemic species native to the southern Greek region of Peloponnese. It is a coniferous evergreen tree characterized by its narrow, conical shape and dark green, needle-like leaves. The plant produces small, spherical cones that contain seeds, typical of the fir genus. It thrives in cool, moist climates and is often found in mountainous areas with well-drained soil. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies peloponnesica is primarily native to the Peloponnese region of southern Greece. It is found in the mountainous areas of this region, particularly in the forests of the Taygetos and Parnon mountain ranges. This species thrives in temperate climates with well-drained soils and is often associated with other coniferous species. It is a rare and endemic tree, with a limited geographic range. Due to its restricted habitat, it is considered vulnerable to environmental changes and habitat loss.",
    "distribution_introduced_art_desc": "Abies peloponnesica was mainly introduced to regions with temperate climates, particularly in the Mediterranean basin. It is commonly found in areas with well-drained soils and moderate rainfall. This plant has been introduced to parts of Europe, including southern France, Italy, and Spain. It thrives in elevated areas and is often used in landscaping due to its ornamental value. However, its introduction has raised concerns about potential ecological impacts in non-native habitats."
}
