{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies wilsonii",
    "plant_slug": "abies-wilsonii",
    "plant_name_scientific": "abies wilsonii",
    "intro": "Abies wilsonii, commonly known as the Wilson's fir, is a coniferous evergreen tree native to the mountainous regions of central and southern China. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The tree produces cones that are typically 5–8 centimeters long, containing seeds that are dispersed by wind. It thrives in cool, moist climates and is often found in forested areas at elevations ranging from 1,500 to 3,000 meters. Due to its ornamental value and ecological importance, it is sometimes cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies wilsonii is primarily native to the mountainous regions of southwestern China, particularly in the provinces of Sichuan, Yunnan, and Tibet. It thrives in high-altitude areas with cool, moist climates and well-drained soils. This species is commonly found in coniferous forests at elevations ranging from 2,500 to 4,000 meters. It is also occasionally reported in northern Myanmar and northern India. Due to its specific habitat requirements, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abies wilsonii was mainly introduced to North America, particularly in the United States and Canada, as an ornamental tree due to its attractive appearance and cold hardiness. It has been cultivated in gardens and landscaped areas, especially in regions with temperate climates. Despite its ornamental value, it has shown limited naturalization and is not considered invasive in most areas. Its introduction has primarily been through horticultural trade rather than natural spread. However, its ecological impact remains minimal compared to other introduced species."
}
