{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies metensis",
    "plant_slug": "abies-metensis",
    "plant_name_scientific": "abies metensis",
    "intro": "Abies metensis, commonly known as the Mexican fir, is a coniferous evergreen tree native to high-altitude regions of central Mexico. It belongs to the genus Abies, which includes other fir species, and is characterized by its conical shape and needle-like leaves. The tree produces small, spherical cones that contain seeds, and it thrives in cool, moist climates with well-drained soil. Abies metensis plays an important ecological role in its native habitat, providing habitat for various wildlife species and contributing to forest biodiversity. Its ornamental value also makes it a popular choice for horticultural cultivation in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies metensis is primarily native to the western United States, specifically in California and Oregon. It is commonly found in the Sierra Nevada and Cascade mountain ranges. This species thrives in high elevation areas, typically between 1,500 and 3,000 meters. It prefers moist, well-drained soils and is often found in coniferous forests. Abies metensis is an important component of the subalpine and montane ecosystems in these regions.",
    "distribution_introduced_art_desc": "Abies metensis was mainly introduced to areas with temperate climates and high elevation, where it thrives in cool, moist environments. It is commonly found in mountainous regions with well-drained soils. This species is often planted for its ornamental value and ecological benefits. It has been introduced to several regions outside its native range, including parts of Europe and North America. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
