{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibirica f. pyramidalis",
    "plant_slug": "abies-sibirica-f-pyramidalis",
    "plant_name_scientific": "abies sibirica f. pyramidalis",
    "intro": "Abies sibirica f. pyramidalis, commonly known as the Siberian fir pyramidalis, is a compact, coniferous evergreen shrub with a conical shape. It features needle-like leaves that are dark green and densely packed, giving it a dense appearance. The plant produces small, spherical cones that mature to a reddish-brown color. It thrives in cool, moist environments and is often cultivated as an ornamental plant in gardens. This variety is particularly valued for its ornamental appeal and hardiness in colder climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sibirica f. pyramidalis is primarily native to the mountainous regions of Central Asia, including parts of Russia, Kazakhstan, and Mongolia. This variant of the Siberian fir is typically found in subalpine and alpine zones at high elevations. It thrives in cold climates with well-drained soils and is often associated with coniferous forests. The plant is adapted to harsh environmental conditions, including strong winds and low temperatures. Its native distribution is closely linked to the mountain ranges of the Siberian and Central Asian landscapes.",
    "distribution_introduced_art_desc": "Abies sibirica f. pyramidalis was mainly introduced to create a more compact and upright growth form for ornamental purposes. This form is often preferred in landscaping due to its narrow, pyramidal shape. It is typically used in gardens and as a specimen plant in urban settings. The introduction of this form has expanded its use in horticulture beyond its natural habitat. However, it is important to note that it may have limited ecological impact in non-native environments."
}
