{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies shastensis var. xanthocarpa",
    "plant_slug": "abies-shastensis-var-xanthocarpa",
    "plant_name_scientific": "abies shastensis var. xanthocarpa",
    "intro": "Abies shastensis var. xanthocarpa, commonly known as the yellow-cedar, is a rare and distinctive variant of the subalpine fir. It is characterized by its yellowish bark and bright green, needle-like leaves that are often coated with a waxy layer. This plant typically grows in high-altitude regions, preferring cool, moist environments with well-drained soil. Its cones are small and reddish, maturing to a brown color, and it produces both male and female cones on the same tree. Due to its limited distribution and specific habitat requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies shastensis var. xanthocarpa is primarily native to the western United States, specifically in the high elevations of the Sierra Nevada and Cascade mountain ranges. This variety is found in areas with cool, moist climates and well-drained soils. It typically grows in subalpine and alpine zones, often in association with other coniferous species. The plant is adapted to harsh environmental conditions, including strong winds and limited sunlight. Its distribution is limited to specific geographic regions within these mountain ranges.",
    "distribution_introduced_art_desc": "Abies shastensis var. xanthocarpa was mainly introduced to areas with mild, moist climates and well-drained soils, typically found in mountainous regions. It is commonly cultivated in gardens and parks for its ornamental value, particularly its yellowish bark and conical shape. This variety is often used as a landscape plant in regions where it can thrive without extreme cold or heat. It prefers partial shade to full sun and is relatively low maintenance once established. However, it is important to note that it may not be well-suited for areas with high humidity or poor drainage."
}
