{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abietia douglasii var. fastigiata",
    "plant_slug": "abietia-douglasii-var-fastigiata",
    "plant_name_scientific": "abietia douglasii var. fastigiata",
    "intro": "Abietia douglasii var. fastigiata, commonly known as the Douglas fir, is a coniferous evergreen tree native to western North America. It is characterized by its tall, narrow growth habit and dense foliage, with needle-like leaves that are blue-green in color. The tree produces cones that contain seeds, which are dispersed by wind, aiding in its propagation. Its bark is thick and scaly, providing protection against fire and pests. This species is valued for its timber and is also an important component of forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abietia douglasii var. fastigiata is primarily native to the western United States, particularly in California and Oregon. It grows in high elevation areas, often in the coastal ranges and mountains. This variety is typically found in moist, shaded environments such as forests and along stream banks. It thrives in cool, humid climates with well-drained soils. The plant is commonly associated with mixed coniferous forests and is adapted to the specific ecological conditions of its native range.",
    "distribution_introduced_art_desc": "Abietia douglasii var. fastigiata was mainly introduced to ornamental horticulture and landscaping due to its unique, columnar growth habit and evergreen foliage. It is commonly cultivated in gardens and urban landscapes for its aesthetic appeal and ability to thrive in a variety of soil conditions. This variety is particularly valued for its compact size and ability to form dense, upright shrubs. It has been introduced to regions with temperate climates, where it is used as a decorative plant in parks, along pathways, and in residential gardens. Despite its ornamental value, it is important to manage its spread to prevent potential ecological impacts in natural areas."
}
