{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies chensiensis var. ernestii",
    "plant_slug": "abies-chensiensis-var-ernestii",
    "plant_name_scientific": "abies chensiensis var. ernestii",
    "intro": "Abies chensiensis var. ernestii, commonly known as the Ernestii fir, is a rare and ornamental conifer native to the mountainous regions of China. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are short and stiff. The cones are typically reddish-brown and mature to a dark brown, adding visual interest to the tree. This variety is valued for its unique form and is often cultivated in botanical gardens for its aesthetic appeal. It prefers well-drained soil and partial shade, making it suitable for specific horticultural settings.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies chensiensis"
    },
    "taxonomy_art_desc": "Abies chensiensis var. ernestii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for its vascular systems. Its subclass is Pinidae, which includes coniferous plants such as pines, firs, and cedars, typically with needle-like leaves. Its order is Pinales, which consists of coniferous evergreens that produce cones and have specialized vascular structures. Its family is Pinaceae, commonly known as the pine family, which includes trees with needle-like leaves and cone-bearing reproductive structures. Its genus is Abies, which refers to the fir trees, typically characterized by their flat, needle-like leaves and cylindrical cones. Its species is Abies chensiensis, a type of fir native to China, and the varietal form ernestii is a distinct variant within this species.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "Tibet"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies chensiensis var. ernestii is primarily native to China North-Central, China South-Central, and Tibet. This variant of the Chinese fir is found in the mountainous regions of these areas. It typically grows in temperate climates with high altitudes and cool, moist conditions. The plant is commonly found in forested areas, often as part of mixed coniferous forests. Its distribution is limited to specific regions within these geographical areas.",
    "distribution_introduced_art_desc": "Abies chensiensis var. ernestii was mainly introduced to the United States as an ornamental tree. It is valued for its attractive blue-green foliage and pyramidal shape. This variety is commonly planted in gardens and landscapes for its aesthetic appeal. It thrives in USDA hardiness zones 5 through 8. However, it requires well-drained soil and full sun to grow successfully."
}
