{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cilicica var. borisii-regis",
    "plant_slug": "abies-cilicica-var-borisii-regis",
    "plant_name_scientific": "abies cilicica var. borisii-regis",
    "intro": "Abies cilicica var. borisii-regis, commonly known as the Bosnian fir, is a rare and relict species native to the high mountain regions of the Dinaric Alps. It is characterized by its conical shape, dark green needles, and distinctive, often drooping cones. This variety is closely related to the common fir but exhibits unique morphological features adapted to its alpine environment. It thrives in cool, moist climates with well-drained soils, typically at elevations above 1,500 meters. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from climate change and habitat loss.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cilicica var. borisii-regis is primarily native to the mountainous regions of Turkey, particularly in the eastern and southeastern parts of the country. This variety is found in the Taurus and Zagros mountain ranges, where it grows in high-altitude forests. It thrives in cool, moist climates with well-drained soil, often in mixed coniferous forests. The plant is adapted to the rugged terrain and harsh weather conditions of these regions. Its distribution is limited to specific elevations, typically between 1,500 and 3,000 meters above sea level.",
    "distribution_introduced_art_desc": "Abies cilicica var. borisii-regis was mainly introduced to specific regions in the Eastern Mediterranean, particularly in Turkey and Syria, where it has been cultivated for ornamental and ecological purposes. This variety is known for its distinctive appearance, with narrow, dark green needles and a conical shape that makes it suitable for landscaping. It thrives in well-drained soils and moderate climates, making it a popular choice for urban and suburban gardens. However, its introduction has raised concerns about potential invasiveness in certain environments. Despite its aesthetic value, careful management is required to prevent it from outcompeting native flora in natural habitats."
}
