{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies lasiocarpa var. pendula",
    "plant_slug": "abies-lasiocarpa-var-pendula",
    "plant_name_scientific": "abies lasiocarpa var. pendula",
    "intro": "Abies lasiocarpa var. pendula, commonly known as the pendant subalpine fir, is a variant of the subalpine fir native to the mountainous regions of western North America. It is characterized by its pendulous branches that droop downward, giving the tree a distinctive, weeping appearance. The foliage consists of needle-like leaves that are typically blue-green in color, with a waxy coating that helps reduce water loss in high-altitude environments. This variety thrives in cool, moist climates and is often found in subalpine and alpine zones. Its botanical features make it an important component of mountain ecosystems, providing habitat and contributing to local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies lasiocarpa var. pendula is primarily native to the western United States and parts of Canada. It is found in the mountainous regions of Idaho, Montana, Wyoming, and the northern areas of Nevada. This variety is typically associated with subalpine and alpine environments, growing at elevations above 2,000 meters. It is commonly found in the Rocky Mountains and the Cascade Range. The plant thrives in cool, moist climates with well-drained soils.",
    "distribution_introduced_art_desc": "Abies lasiocarpa var. pendula was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in high elevation areas, often growing in association with other coniferous species. This variety is known for its distinctive weeping form, which makes it a popular ornamental plant. It has been introduced to various regions beyond its native range for landscaping purposes. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
