{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies vulgaris var. nana",
    "plant_slug": "abies-vulgaris-var-nana",
    "plant_name_scientific": "abies vulgaris var. nana",
    "intro": "Abies vulgaris var. nana, commonly known as the dwarf fir, is a compact evergreen shrub native to the mountainous regions of central and eastern Europe. It is characterized by its slow growth, dense foliage, and small, needle-like leaves that are typically a dark green color. The plant produces cones that are small and cylindrical, containing edible seeds that are a food source for various wildlife. It thrives in cool, moist environments and is often used in horticulture for its ornamental value and ability to form dense, attractive clumps.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies vulgaris var. nana is primarily native to the mountainous regions of central and eastern Europe, including parts of the Carpathian Mountains, the Alps, and the Balkans. This variety thrives in cool, moist climates at higher elevations where it forms dense forests or grows in mixed woodland communities. It is commonly found in areas with well-drained soils and is often associated with other coniferous species. The plant is well adapted to the harsh conditions of its native habitat, including cold winters and limited sunlight. Due to its limited range, it is considered a rare and endemic species in certain regions of its native distribution.",
    "distribution_introduced_art_desc": "Abies vulgaris var. nana was mainly introduced to specific regions with cool, moist climates and well-drained soils, often as an ornamental plant due to its compact size and attractive foliage. It is commonly found in gardens and landscaped areas where its unique appearance adds visual interest. The distribution of this variety has been limited to areas that mimic its native habitat in the northern hemisphere. It is not widely naturalized outside of cultivation, remaining primarily a horticultural introduction. This plant is typically grown in USDA hardiness zones 4 through 7, where it thrives in partial shade and moderate moisture conditions."
}
