{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies chensiensis var. salouenensis",
    "plant_slug": "abies-chensiensis-var-salouenensis",
    "plant_name_scientific": "abies chensiensis var. salouenensis",
    "intro": "Abies chensiensis var. salouenensis, commonly known as the Salouenensis fir, is a rare variant of the Chinese fir. It is native to the mountainous regions of eastern China, particularly in Sichuan and Yunnan provinces. This evergreen conifer is characterized by its slender, conical shape and dark green, needle-like leaves. The cones are typically small and clustered, with reddish-brown scales. It thrives in cool, moist climates and is often found in high-altitude forest ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies chensiensis"
    },
    "taxonomy_art_desc": "Abies chensiensis var. salouenensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features and specialized reproductive structures. Its subclass is Pinidae, which refers to a group of coniferous plants that includes pines, firs, and cedars, typically characterized by needle-like leaves and cone-bearing reproductive systems. Its order is Pinales, a group of coniferous plants that includes various families such as Pinaceae, Cupressaceae, and others, known for their woody stems and seed cones. Its family is Pinaceae, commonly known as the pine family, which includes many coniferous trees with needle-like leaves and woody cones. Its genus is Abies, which consists of species commonly known as firs, characterized by their narrow, upright cones and whorled branches. Its species is Abies chensiensis, a type of fir native to China, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "East Himalaya",
        "Tibet"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies chensiensis var. salouenensis is primarily native to China South-Central, East Himalaya, and Tibet. This variant of the species is found in mountainous regions characterized by high altitudes and cool, moist climates. It typically grows in forests at elevations ranging from 2,500 to 4,000 meters. The plant is adapted to the rugged terrain and specific ecological conditions of these areas. Its distribution reflects its preference for temperate coniferous forests in these regions.",
    "distribution_introduced_art_desc": "Abies chensiensis var. salouenensis was mainly introduced to areas with cool, moist climates and well-drained soils, typically in higher elevation regions. It thrives in temperate zones with adequate rainfall and partial shade. This variety is often found in mountainous areas of China, where it has adapted to specific environmental conditions. Its introduction has been primarily for ornamental purposes and reforestation efforts. However, it is not commonly cultivated outside its native range due to its specific habitat requirements."
}
