{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pumila",
    "plant_slug": "abies-pumila",
    "plant_name_scientific": "abies pumila",
    "intro": "Abies pumila, commonly known as the dwarf fir, is a small coniferous evergreen tree native to the mountainous regions of Asia. It typically grows to a height of about 1 to 3 meters, making it one of the smallest species in the fir genus. The plant has needle-like leaves that are short, dense, and arranged in spirals along the branches. Its cones are small and usually remain attached to the branches for several years. The dwarf fir is well adapted to cold, high-altitude environments and is often found in alpine or subalpine zones.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pumila is primarily native to the mountainous regions of central and eastern Europe, including parts of the Carpathian Mountains, the Alps, and the Balkans. It thrives in high-altitude environments where the climate is cool and moist. This species is commonly found in coniferous forests and rocky slopes at elevations ranging from 1,500 to 3,000 meters. It prefers well-drained soils and is often associated with other cold-climate conifers. Due to its limited range, it is considered a rare and endemic species in certain regions of Europe.",
    "distribution_introduced_art_desc": "Abies pumila was mainly introduced to areas with cold, dry climates, particularly in mountainous regions. It is commonly found in alpine and subalpine environments where it thrives in well-drained soils. This species is often used in horticulture for its ornamental value and hardy nature. It has been introduced to several regions outside its native range, including parts of Europe and North America. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
