{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies religiosa var. perotensis",
    "plant_slug": "abies-religiosa-var-perotensis",
    "plant_name_scientific": "abies religiosa var. perotensis",
    "intro": "Abies religiosa var. perotensis, commonly known as the Mexican fir, is a variant of the silver fir native to high-altitude regions of Mexico. It is a coniferous evergreen tree characterized by its needle-like leaves and cone-bearing structure. The foliage is typically dark green, with a silvery underside, giving it a distinctive appearance. It thrives in cool, moist climates and is often found in mountainous areas with well-drained soils. This species plays a vital role in the ecosystems of its native habitat, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies religiosa var. perotensis is primarily native to southern Mexico, specifically the states of Oaxaca, Chiapas, and Veracruz. It is commonly found in the Sierra Madre de Oaxaca and other mountainous regions within this range. This variety of the silver fir thrives in humid, temperate climates at elevations between 1,500 and 3,000 meters. It is often associated with cloud forests and is an important component of the local ecosystems. Due to its restricted habitat, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abies religiosa var. perotensis was mainly introduced to the southern United States, particularly in Texas and New Mexico, as an ornamental and windbreak species. It is valued for its dense foliage and ability to thrive in arid conditions. The plant has also been introduced to parts of Arizona and southern California due to its adaptability to dry climates. Its introduction has led to its establishment in some native ecosystems, raising concerns about potential ecological impacts. Despite its ornamental appeal, it is not widely cultivated outside of these specific regions."
}
