{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies rubra var. violacea",
    "plant_slug": "abies-rubra-var-violacea",
    "plant_name_scientific": "abies rubra var. violacea",
    "intro": "Abies rubra var. violacea, commonly known as the purple fir, is a variant of the balsam fir native to eastern North America. It is distinguished by its striking violet to purple needles, which contrast with its dark green branches. The plant typically grows in cool, moist environments, such as mountainous regions and northern hardwood forests. Its cones are similar to those of other fir species, with slender, cylindrical shapes and dark brown scales. The purple fir is valued for its ornamental qualities and is often cultivated in gardens for its unique foliage color.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies rubra var. violacea is primarily native to the northeastern United States and southeastern Canada. This variant of the red spruce is found in regions such as New England, New York, and parts of the Appalachian Mountains. It thrives in cool, moist climates with well-drained soils. The plant is typically found in mountainous areas and mixed forests. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abies rubra var. violacea was mainly introduced to areas with moist, well-drained soils and cool climates, typically in the northern United States and southern Canada. It thrives in USDA hardiness zones 3 to 6, where it can grow in full sun to partial shade. This variety is known for its striking purple-bronze foliage, making it a popular ornamental tree in gardens and parks. It is often used for windbreaks and as a landscape specimen due to its dense growth habit. However, it is sensitive to drought and soil compaction, requiring careful site selection for optimal growth."
}
