{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba var. aurea",
    "plant_slug": "abies-alba-var-aurea",
    "plant_name_scientific": "abies alba var. aurea",
    "intro": "Abies alba var. aurea, commonly known as the golden fir, is a variant of the silver fir native to Europe. It is characterized by its striking golden-yellow foliage, which contrasts with its dark green needles. This variety thrives in cool, moist environments and is often found in mountainous regions. The tree has a conical shape with a dense crown, and its bark is typically gray and fissured. It is valued for its ornamental appeal in horticulture and its ability to adapt to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba var. aurea is primarily native to the mountainous regions of Central and Eastern Europe, including parts of the Carpathian Mountains and the Balkans. This variety of the silver fir is typically found in higher elevations where the climate is cooler and more humid. It thrives in well-drained soils and is often associated with mixed forests containing other coniferous and broadleaf species. The plant's golden foliage is a distinguishing feature, making it a notable ornamental and ecological component in its native habitat. Its distribution is limited to specific areas where the environmental conditions match its ecological requirements.",
    "distribution_introduced_art_desc": "Abies alba var. aurea was mainly introduced to ornamental horticulture and botanical gardens due to its striking golden foliage. It is valued for its unique aesthetic appeal, making it a popular choice for landscape design in temperate regions. The plant has been cultivated in various parts of Europe and North America where it thrives in well-drained soils and cooler climates. Its introduction has also contributed to ecological studies on non-native species in different environments. However, its spread outside its native range requires careful management to prevent potential ecological impacts."
}
