{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibirica f. candelabrum",
    "plant_slug": "abies-sibirica-f-candelabrum",
    "plant_name_scientific": "abies sibirica f. candelabrum",
    "intro": "Abies sibirica f. candelabrum, commonly known as the candlewood fir, is a unique variant of the Siberian fir. It is characterized by its distinctive, candle-like arrangement of branches, which give it a striking visual appearance. The plant exhibits dense, dark green foliage with a slightly glossy texture. It is native to the mountainous regions of Eastern Europe and Central Asia. This ornamental conifer is often cultivated for its aesthetic value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sibirica f. candelabrum is primarily native to the mountainous regions of Eastern Europe and Central Asia, including parts of Russia, Ukraine, and the Caucasus. This subspecies is commonly found in high-altitude forests and alpine environments where the climate is cold and the soil is well-drained. It thrives in areas with moderate precipitation and is often associated with other coniferous species. The plant is adapted to harsh conditions, making it a resilient component of boreal and subalpine ecosystems. Its unique candelabra-like branching pattern distinguishes it from other fir species in the region.",
    "distribution_introduced_art_desc": "Abies sibirica f. candelabrum was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous or subalpine regions. It thrives in environments with moderate temperatures and high humidity, making it suitable for regions with temperate to subarctic conditions. This plant is often cultivated in gardens and landscapes for its ornamental value, particularly its distinctive branching pattern. It is also used in reforestation projects due to its resilience and ability to stabilize soil. However, its introduction can sometimes lead to competition with native species in certain ecosystems."
}
