{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa",
    "plant_slug": "abies-excelsa",
    "plant_name_scientific": "abies excelsa",
    "intro": "Abies excelsa, commonly known as the Colombian white pine, is a tall evergreen conifer native to the Andes Mountains of South America. It is characterized by its slender, upward-curving needles and distinctive, elongated cones. The tree can reach heights of up to 50 meters, making it one of the tallest pine species in the world. Its bark is thick and scaly, providing protection against harsh environmental conditions. The plant plays an important ecological role in its native habitat, offering shelter and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa is primarily native to the western Himalayas, spanning parts of India, Nepal, and Bhutan. It grows in high-altitude regions, typically above 2,500 meters, where the climate is cool and moist. This species is commonly found in montane forests and alpine meadows, often forming dense stands in the subalpine zones. It thrives in well-drained soils and is adapted to the harsh conditions of its mountainous habitat. The tree is valued for its timber and is also an important component of the local ecosystem.",
    "distribution_introduced_art_desc": "Abies excelsa was mainly introduced to Europe and parts of Asia during the 19th century as an ornamental plant due to its striking appearance and adaptability. It was widely cultivated in botanical gardens and private collections, particularly in countries with temperate climates. The introduction of Abies excelsa has led to its establishment in some regions outside its native habitat, sometimes becoming invasive. Its rapid growth and ability to thrive in various soil types contributed to its popularity among horticulturists. However, its spread has raised concerns about its impact on local ecosystems in non-native areas."
}
