{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies homolepis var. scottae",
    "plant_slug": "abies-homolepis-var-scottae",
    "plant_name_scientific": "abies homolepis var. scottae",
    "intro": "Abies homolepis var. scottae, commonly known as the Scott's fir, is a variant of the Japanese fir. It is a coniferous evergreen tree native to Japan, characterized by its conical shape and dense foliage. The leaves are needle-like, typically dark green with a slight blue or silvery tinge on the underside. It produces cones that mature in the second year, releasing seeds that are dispersed by wind. This species is valued for its ornamental qualities and is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies homolepis var. scottae is primarily native to the mountainous regions of central and southern Japan, specifically in the islands of Honshu, Shikoku, and Kyushu. This variety is typically found in areas with cool, moist climates and well-drained soils. It grows in elevations ranging from approximately 1,000 to 2,500 meters above sea level. The plant thrives in forested areas, often forming part of mixed coniferous forests. Its distribution is limited to specific habitats that provide the necessary environmental conditions for its growth.",
    "distribution_introduced_art_desc": "[WRONG START] Abies homolephis var. scottae was mainly introduced to the Pacific Northwest of the United States. It is commonly found in areas with moist, well-drained soils and cool, humid climates. This variety is often planted for its ornamental value, including its pyramidal shape and attractive foliage. It has been used in both residential and commercial landscaping due to its hardiness and aesthetic appeal. However, its introduction has raised concerns about potential ecological impacts in native habitats."
}
