{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nobilis var. prostrata",
    "plant_slug": "abies-nobilis-var-prostrata",
    "plant_name_scientific": "abies nobilis var. prostrata",
    "intro": "Abies nobilis var. prostrata, commonly known as the creeping white fir, is a low-growing variant of the white fir. It is characterized by its prostrate growth habit, forming dense mats of foliage on the ground. The plant features needle-like leaves that are typically blue-green in color, with a slightly waxy texture. It produces small, inconspicuous cones that mature to a reddish-brown color. This variety is well adapted to rocky and alpine environments, thriving in cool, moist conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nobilis var. prostrata is primarily native to the western United States, particularly in California and Oregon. It is commonly found in the coastal and mountainous regions of these states. This variety of the white fir is adapted to moist, cool climates and often grows in association with other coniferous species. It thrives in areas with well-drained soils and is typically found at elevations ranging from 600 to 2,500 meters. Its native distribution is closely linked to the specific environmental conditions of the Pacific Northwest.",
    "distribution_introduced_art_desc": "Abies nobilis var. prostrata was mainly introduced to stabilize soil and prevent erosion in areas with steep slopes and poor soil quality. It is commonly used in reforestation projects due to its ability to thrive in harsh environmental conditions. This variety is also valued for its ornamental appearance, featuring a low-growing, mat-forming structure. It has been introduced in regions where traditional tree species struggle to establish due to climate or soil limitations. However, its introduction has raised concerns about potential ecological impacts on native plant communities."
}
