{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies lemoniana",
    "plant_slug": "abies-lemoniana",
    "plant_name_scientific": "abies lemoniana",
    "intro": "Abies lemoniana, commonly known as the lemon-scented fir, is a species of evergreen conifer native to the high altitudes of the Andes in South America. It is characterized by its narrow, needle-like leaves that are often fragrant when crushed, emitting a citrus-like aroma. The tree typically grows in cool, moist environments and prefers well-drained soils. Its cones are small and cylindrical, containing winged seeds that are dispersed by wind. This species is valued for its ornamental appeal and is sometimes cultivated in botanical gardens for its unique fragrance and ecological significance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies lemoniana is primarily native to the mountainous regions of Central America, specifically in countries such as Guatemala, Honduras, and El Salvador. It thrives in high-altitude cloud forests, typically between 1,500 and 3,000 meters above sea level. This species is adapted to the cool, moist climate and fertile soils found in these ecosystems. It is often found growing in mixed forests alongside other coniferous and broadleaf species. Due to habitat loss and climate change, its native range is becoming increasingly fragmented.",
    "distribution_introduced_art_desc": "Abies lemoniana was mainly introduced to areas with temperate climates and high altitudes, where it can thrive in cool, moist environments. It is commonly found in regions with well-drained soils and partial to full shade. This species is often cultivated in botanical gardens and conservation areas due to its ornamental value and ecological significance. Its introduction has been limited to specific regions in Europe and parts of Asia. However, it remains a rare and endangered species in the wild."
}
