{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies bridgesii",
    "plant_slug": "abies-bridgesii",
    "plant_name_scientific": "abies bridgesii",
    "intro": "Abies bridgesii, commonly known as the Bridgess fir, is a coniferous evergreen tree native to the high-altitude regions of western South America. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are arranged spirally along the branches. The cones of Abies bridgesii are typically erect and contain small, winged seeds. This species is adapted to cold, moist environments and thrives in mountainous areas with well-drained soils. Its botanical features make it an important component of the Andean forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies bridgesii is primarily native to the high mountain regions of central and southern Chile. It is found in the Andes Mountains, specifically in the areas of the Central Andes and the Northern Andes. This species thrives in cool, moist environments at elevations ranging from 2,000 to 3,500 meters. It is commonly associated with temperate rainforests and cloud forests. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abies bridgesii was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous or high-altitude regions. It is commonly found in regions with temperate to subalpine conditions, where it thrives in partial shade and moderate precipitation. This species is often cultivated in botanical gardens and conservation areas due to its ornamental value and ecological significance. Its introduction has been primarily for horticultural purposes, although it occasionally escapes into natural habitats. However, its distribution remains largely limited to specific geographic regions where it can establish and persist successfully."
}
