{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sachalinensis var. corticosa",
    "plant_slug": "abies-sachalinensis-var-corticosa",
    "plant_name_scientific": "abies sachalinensis var. corticosa",
    "intro": "Abies sachalinensis var. corticosa, commonly known as the Sakhalin fir, is a rare and endemic conifer native to the Russian Far East. It is characterized by its narrow, conical crown and dark green, needle-like leaves. The bark of this species is thick and scaly, giving it a rugged appearance. It thrives in cool, moist climates and is often found in mountainous regions. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sachalinensis var. corticosa is primarily native to the Russian Far East, particularly the island of Sakhalin. It is also found in parts of eastern Russia, including the Primorsky and Khabarovsk regions. This variant of the Sakhalin fir grows in cool, moist climates at higher elevations. It thrives in mountainous areas with well-drained soils. Its natural range extends into northern Japan, though it is less common there compared to its presence in Russia.",
    "distribution_introduced_art_desc": "Abies sachalinensis var. corticosa was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in temperate regions. It thrives in environments with moderate temperatures and high humidity, making it suitable for regions with distinct seasons. This variety is often planted in urban landscapes for its ornamental value and ability to tolerate pollution. Its introduction has been primarily for landscaping and reforestation purposes. However, it is not commonly found in the wild outside its native range."
}
