{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies brunoniana",
    "plant_slug": "abies-brunoniana",
    "plant_name_scientific": "abies brunoniana",
    "intro": "Abies brunoniana, commonly known as the Brunon's fir, is a coniferous evergreen tree native to the mountainous regions of central and eastern Asia. It is characterized by its slender, cylindrical trunk and dense, pyramidal crown. The needles are short, flat, and dark green, with two white stomatal bands on the underside. Its cones are typically pendulous, maturing to a reddish-brown color. This species is valued for its ornamental appeal and is often cultivated in botanical gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies brunoniana is primarily native to the mountainous regions of Southeast Asia, specifically China, Vietnam, and Laos. It is commonly found in the higher elevations of these countries, where it thrives in cool, moist climates. This species is often associated with temperate forests and is adapted to the rugged terrain of its native habitat. It grows in areas with well-drained soils and is typically found in the understory of mixed coniferous forests. The plant's distribution is limited to these specific geographic regions, reflecting its ecological preferences and environmental requirements.",
    "distribution_introduced_art_desc": "Abies brunoniana was mainly introduced to areas with temperate climates and high altitudes, where it thrives in cool, moist environments. It is commonly found in mountainous regions with well-drained soils and sufficient sunlight. This species is often used in horticulture for its ornamental value and ability to form dense, evergreen forests. Its introduction has been primarily for reforestation and landscape purposes in regions with similar ecological conditions. However, it is important to monitor its spread to prevent potential impacts on native ecosystems."
}
