{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies lasiocarpa subsp. arizonica",
    "plant_slug": "abies-lasiocarpa-subsp-arizonica",
    "plant_name_scientific": "abies lasiocarpa subsp. arizonica",
    "intro": "Abies lasiocarpa subsp. arizonica, commonly known as the Arizona white fir, is a coniferous tree native to the western United States. It is characterized by its conical shape, silver-blue needles, and distinctive bracts that resemble small, scale-like leaves. The tree typically grows in high-elevation forests, preferring cool, moist climates with well-drained soils. Its cones are relatively small and have a pointed tip, while its bark is thick and fissured, providing protection against environmental stress. This subspecies plays an important ecological role in its native habitat, supporting a variety of wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies lasiocarpa subsp. arizonica is primarily native to the western United States, particularly in Arizona and New Mexico. It grows in high elevation areas, often in montane forests and subalpine zones. This subspecies is commonly found in regions with cool, moist climates and well-drained soils. It is typically associated with mixed coniferous forests and can be found at elevations ranging from 2,000 to 9,000 feet. Its distribution is limited to specific mountain ranges where the environmental conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Abies lasiocarpa subsp. arizonica was mainly introduced to areas with high elevation and cold climates, typically found in mountainous regions of the western United States. It thrives in well-drained soils and requires full sun to partial shade for optimal growth. This subspecies is often planted for its ornamental value and its ability to provide habitat for wildlife. It has been introduced in parts of California, Nevada, and Utah where suitable environmental conditions exist. However, its spread is limited due to its specific ecological requirements and climate preferences."
}
