{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nordmanniana f. pendula",
    "plant_slug": "abies-nordmanniana-f-pendula",
    "plant_name_scientific": "abies nordmanniana f. pendula",
    "intro": "Abies nordmanniana f. pendula, commonly known as the hanging fir, is a unique variant of the Nordmann fir. It is characterized by its drooping branches that give it a distinctive, weeping appearance. This form is a natural mutation of the parent species, Abies nordmanniana, and is often cultivated for ornamental purposes. The plant retains the typical coniferous features of the species, including needle-like leaves and cone-bearing structures. It thrives in temperate climates and requires well-drained soil and partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nordmanniana f. pendula is primarily native to the eastern and central parts of the Caucasus region, including areas of northern Georgia, southern Dagestan, and the eastern part of the Russian Federation. This variety is also found in the western and central parts of the Russian Federation, particularly in the North Caucasus. It thrives in mountainous regions with a humid climate and is often found in mixed forests. The plant is adapted to temperate and subalpine environments, typically growing at elevations between 1,000 and 2,500 meters. It is a rare and endangered variety, with a limited natural range.",
    "distribution_introduced_art_desc": "Abies nordmanniana f. pendula was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is often found in temperate forests where it thrives in partial shade and moderate temperatures. This distribution is influenced by its preference for high elevation and its ability to tolerate frost. The plant is commonly used in horticulture for its ornamental value and unique weeping form. Its introduction has expanded its range beyond its native habitat in eastern Europe and western Asia."
}
