{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sachalinensis var. wilsonii",
    "plant_slug": "abies-sachalinensis-var-wilsonii",
    "plant_name_scientific": "abies sachalinensis var. wilsonii",
    "intro": "Abies sachalinensis var. wilsonii, commonly known as Wilson's fir, is a variant of the Sakhalin fir, native to the northeastern regions of Asia. It is characterized by its slender, conical shape and dark green, needle-like leaves that are typically shorter than those of the typical species. The cones are pendulous and often persist on the branches for several years, contributing to its ornamental value. This variety is well adapted to cold climates and is often found in mountainous areas with well-drained soils. Its botanical features make it a popular choice for horticultural cultivation in temperate regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sachalinensis var. wilsonii is primarily native to the northern regions of Japan, specifically the islands of Hokkaido and the remote islands of the Tsugaru Strait. This variety is also found in parts of southern Sakhalin Island, which lies in the Sea of Japan. It thrives in cool, moist climates with well-drained soil, typically at elevations ranging from sea level to around 1,000 meters. The plant is adapted to the temperate coniferous forests of these regions, where it often grows alongside other species such as fir and cedar. Its limited distribution is due to its specific habitat requirements and the relatively small geographic range where these conditions are met.",
    "distribution_introduced_art_desc": "Abies sachalinensis var. wilsonii was mainly introduced to specific regions with suitable climatic conditions, such as temperate forests in eastern Asia. It is commonly found in areas with moist, well-drained soils and moderate temperatures. This variety is often planted for its ornamental value due to its attractive cone and foliage. Its introduction has also contributed to ecological restoration projects in certain landscapes. However, its distribution remains relatively limited compared to other conifer species."
}
