{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × insignis var. kentiana",
    "plant_slug": "abies-×-insignis-var-kentiana",
    "plant_name_scientific": "abies × insignis var. kentiana",
    "intro": "Abies × insignis var. kentiana, commonly known as the Kent's fir, is a hybrid coniferous tree native to the mountainous regions of western North America. It is characterized by its conical shape, dark green foliage, and distinctive, flattened sprays of needles. The tree typically grows to a height of 20–30 meters and is often found in moist, well-drained soils at higher elevations. Its cones are small and cylindrical, releasing seeds in the fall, and it is valued for its ornamental appeal in horticulture. This variety is also notable for its adaptability to various environmental conditions, making it a popular choice for landscaping in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × insignis var. kentiana is primarily native to the mountainous regions of southern China, particularly in the provinces of Yunnan and Sichuan. This hybrid fir species is found in high-altitude forests where the climate is cool and moist. It typically grows in areas with well-drained soils and is adapted to the rugged terrain of these regions. The plant is commonly associated with mixed coniferous forests and is often found alongside other species such as Pinus and Tsuga. Its distribution is limited to specific microhabitats that provide the necessary environmental conditions for its growth.",
    "distribution_introduced_art_desc": "Abies × insignis var. kentiana was mainly introduced to the Pacific Northwest region of the United States. It was introduced as a hybrid species resulting from the cross between Abies amabilis and Abies brachytna. This variety is known for its ornamental value and adaptability to various soil types. It has been widely planted in gardens and landscapes due to its aesthetic appeal and hardiness. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
