{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies minor",
    "plant_slug": "abies-minor",
    "plant_name_scientific": "abies minor",
    "intro": "Abies minor, commonly known as the dwarf fir, is a small evergreen conifer native to the mountainous regions of southeastern Europe. It typically grows to a height of about 2 to 5 meters, featuring a conical shape with dense, dark green needles. The plant produces small, spherical cones that release seeds in the autumn, contributing to its reproductive cycle. Its foliage is fragrant, and the tree is often cultivated for ornamental purposes in gardens. Abies minor is well adapted to cold climates and can thrive in acidic, well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies minor is primarily native to the high mountain regions of Central America, specifically in parts of Mexico and Guatemala. It grows in cloud forests at elevations ranging from 1,500 to 3,000 meters above sea level. This species is adapted to cool, moist environments with high humidity and well-drained soils. It is commonly found in the Sierra Madre mountains and other highland areas where the climate is temperate and humid. Due to its restricted habitat, Abies minor is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abies minor was mainly introduced to areas with moist, well-drained soils and cool climates, typically found in mountainous regions. It is commonly found in the Pacific Northwest of the United States and parts of Canada. This species thrives in areas with high elevation and moderate precipitation. It is often used in reforestation projects due to its hardiness and ecological benefits. However, its introduction has sometimes led to competition with native species in certain regions."
}
