{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies durangensis",
    "plant_slug": "abies-durangensis",
    "plant_name_scientific": "abies durangensis",
    "intro": "Abies durangensis, commonly known as the Durango fir, is a coniferous evergreen tree native to the mountainous regions of central Mexico. It belongs to the genus Abies, which includes other fir species, and is characterized by its narrow, conical shape and dense foliage. The tree has dark green, needle-like leaves that are typically arranged in spirals along the branches. It produces small, cone-like structures that contain the seeds, which are dispersed by wind. This species is adapted to high-altitude environments and plays an important role in the local ecosystem.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies durangensis"
    },
    "taxonomy_art_desc": "Abies durangensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Pinidae, a group of coniferous trees and shrubs that are typically evergreen and have needle-like leaves. Its order is Pinales, which includes coniferous plants such as pines, firs, and cedars, known for their cone-bearing reproductive structures. Its family is Pinaceae, commonly known as the pine family, which consists of coniferous trees with needle-like leaves and woody cones. Its genus is Abies, commonly known as firs, which are coniferous trees characterized by their slender, upright growth and flat, feather-like leaves. Its species is Abies durangensis, a specific type of fir native to Mexico, known for its unique ecological role and limited distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies durangensis is primarily native to Mexico Northeast, Mexico Northwest, and Mexico Southwest. This species is found in the mountainous regions of these areas, typically in higher elevations with cooler climates. It thrives in temperate forests and is often associated with other coniferous species. The plant is well adapted to the specific environmental conditions of its native range. Its distribution is limited to these regions due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Abies durangensis was mainly introduced to regions with temperate climates that mimic its native habitat in Mexico. It is typically found in high-altitude areas with moist, well-drained soils. This plant is often cultivated in botanical gardens and conservation areas for its ornamental value and ecological significance. Its introduction has helped in studying its adaptability to different environmental conditions. However, it is important to monitor its spread to prevent potential invasiveness in non-native regions."
}
