{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fraseri var. prostrata",
    "plant_slug": "abies-fraseri-var-prostrata",
    "plant_name_scientific": "abies fraseri var. prostrata",
    "intro": "Abies fraseri var. prostrata, commonly known as the prostrate Fraser fir, is a low-growing variant of the Fraser fir. It is characterized by its dense, compact growth habit and dark green, needle-like leaves. The plant typically forms a cushion-like structure, making it well-suited for rock gardens or alpine settings. It produces small, inconspicuous yellow-green cones that mature to a reddish-brown. This variety is native to the southern Appalachian Mountains and thrives in cool, moist, well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fraseri var. prostrata is primarily native to the coastal regions of British Columbia and southern Alaska in North America. This variety of the subalpine fir is typically found in moist, well-drained soils in mountainous areas. It grows in dense, low-lying stands and is often associated with other coniferous species in the Pacific Northwest. The plant thrives in cool, humid climates and is adapted to the rugged terrain of its native habitat. Its distribution is limited to specific ecological zones where it can receive adequate moisture and sunlight.",
    "distribution_introduced_art_desc": "Abies fraseri var. prostrata was mainly introduced to areas with moist, well-drained soils and cool, temperate climates. It is commonly found in regions with high elevation and partial shade. This variety is often used in landscaping for its ornamental value and dense foliage. It has been introduced to several parts of the United States, particularly in the Pacific Northwest. However, its spread is limited due to its specific environmental requirements."
}
