{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cephalonica var. submutica",
    "plant_slug": "abies-cephalonica-var-submutica",
    "plant_name_scientific": "abies cephalonica var. submutica",
    "intro": "Abies cephalonica var. submutica, commonly known as the West Greek fir, is a rare and endemic conifer native to the mountainous regions of western Greece. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are often covered with a fine, whitish bloom. The cones are small and typically hang in clusters, releasing seeds that are dispersed by wind. This variety is adapted to cool, moist climates and thrives in well-drained soils at higher elevations. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cephalonica var. submutica is primarily native to the western Balkans, specifically in regions of Albania, Kosovo, Montenegro, and northern Greece. This variety is found in mountainous areas with high elevations, typically above 1,500 meters. It thrives in cool, moist climates with well-drained soils, often growing in mixed forests. The plant is adapted to the rugged terrain and harsh weather conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in the region.",
    "distribution_introduced_art_desc": "Abies cephalonica var. submutica was mainly introduced to specific regions in the Mediterranean, particularly in southern Europe and parts of North Africa, where it was cultivated for ornamental purposes. This variety is known for its unique foliage and adaptability to mild climates, making it a popular choice for gardens and parks. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems. It thrives in well-drained soils and full sun, which contributes to its spread in non-native areas. Despite its aesthetic appeal, its ecological impact remains a topic of ongoing study and management."
}
