{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo var. argentea",
    "plant_slug": "abies-pinsapo-var-argentea",
    "plant_name_scientific": "abies pinsapo var. argentea",
    "intro": "Abies pinsapo var. argentea, commonly known as the silver fir, is a rare and endangered conifer native to the Sierra de Grazalema in southern Spain. It is characterized by its slow growth, evergreen foliage, and distinctive silver-white variegation on its needles. The tree has a conical shape with a dense crown and produces small, cylindrical cones. It thrives in cool, moist climates and is often found in mountainous regions with well-drained soils. Due to habitat loss and climate change, conservation efforts are crucial for its survival.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo var. argentea is primarily native to the Iberian Peninsula, specifically in southern Spain. It is found in the Sierra de Cazorla, Sierra de Segura, and Sierra de las Nieves mountain ranges. This variety thrives in the Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is typically found in rocky and limestone soils at elevations between 600 and 1,500 meters. Due to habitat loss and climate change, it is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Abies pinsapo var. argentea was mainly introduced to areas with temperate climates and well-drained soils, often in mountainous regions. It is commonly found in Mediterranean climates where it thrives in sunny, dry conditions. This variety is valued for its ornamental qualities, including its silver-green foliage. It has been introduced to several regions outside its native range for horticultural purposes. However, its spread is limited due to its specific environmental requirements."
}
