{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pattoniana",
    "plant_slug": "abies-pattoniana",
    "plant_name_scientific": "abies pattoniana",
    "intro": "Abies pattoniana, commonly known as the Patton's fir, is a coniferous evergreen tree native to the mountainous regions of central and southern Chile. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The tree produces small, spherical cones that mature to a reddish-brown color, containing winged seeds dispersed by wind. Its bark is thick and scaly, providing some protection against environmental stress. Abies pattoniana is adapted to high-altitude environments and is often found in cloud forests with high humidity and moderate temperatures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pattoniana is primarily native to the western United States, specifically found in California and Oregon. It grows in high elevation areas, typically in the Sierra Nevada and Cascade mountain ranges. This species thrives in cool, moist climates with well-drained soils. It is commonly found in subalpine and alpine zones at elevations ranging from 1,500 to 3,000 meters. Abies pattoniana is an important component of the local forest ecosystems in these regions.",
    "distribution_introduced_art_desc": "Abies pattoniana was mainly introduced to specific regions in the southern United States, particularly in Texas and Louisiana, where it has been cultivated for its ornamental value. This plant is commonly found in botanical gardens and private collections due to its unique appearance and cold hardiness. It thrives in well-drained soils and full sun to partial shade conditions. While it is not native to these areas, it has been successfully integrated into local landscapes. Its introduction has contributed to the diversity of coniferous species in these regions."
}
