{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea subsp. lasiocarpa",
    "plant_slug": "abies-balsamea-subsp-lasiocarpa",
    "plant_name_scientific": "abies balsamea subsp. lasiocarpa",
    "intro": "Abies balsamea subsp. lasiocarpa, commonly known as the white spruce, is a coniferous evergreen tree native to North America. It is characterized by its slender, conical shape and dark green, needle-like leaves that are typically arranged in spirals. The tree produces small, cone-like structures that contain seeds, which are dispersed by wind. Its bark is thick and scaly, providing protection against harsh environmental conditions. This subspecies is well adapted to cold climates and is often found in boreal and subarctic regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamea subsp. lasiocarpa is primarily native to the northeastern United States and eastern Canada. It is found in regions such as New York, Vermont, New Hampshire, and parts of Quebec. This subspecies thrives in cool, moist environments, often growing in mountainous or boreal forest areas. It is commonly associated with acidic soils and is a component of the northern forest ecosystem. Its distribution includes areas where the climate is temperate to subarctic.",
    "distribution_introduced_art_desc": "Abies balsamea subsp. lasiocarpa was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is commonly found in the northern United States and southern Canada, where it thrives in shaded, forested environments. This subspecies is often used in horticulture for its ornamental value and adaptability to various soil types. It has been introduced to some parts of Europe and Asia for landscaping and reforestation purposes. However, its spread is limited by its specific climatic requirements and preference for acidic soils."
}
