{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies lasiocarpa subsp. bifolia",
    "plant_slug": "abies-lasiocarpa-subsp-bifolia",
    "plant_name_scientific": "abies lasiocarpa subsp. bifolia",
    "intro": "Abies lasiocarpa subsp. bifolia, commonly known as the white fir with bifid leaves, is a subspecies of the white fir native to the western United States. It is characterized by its distinctive, sharply toothed, bifid (two-lobed) leaves that give it a unique appearance. The plant typically grows in high elevation forests, often in association with other coniferous species. Its cones are cylindrical and maturing in the second year, releasing seeds in the fall. The subspecies is valued for its ornamental qualities and ecological importance in mountainous ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies lasiocarpa subsp. bifolia is primarily native to the western United States, including parts of Colorado, Utah, and Nevada. It is also found in the Great Basin and the Sierra Nevada mountain range. This subspecies thrives in high-elevation environments, typically at elevations above 2,500 meters. It is commonly found in subalpine and alpine forests, often growing in association with other coniferous species. Its distribution is closely linked to moist, well-drained soils and cool, temperate climates.",
    "distribution_introduced_art_desc": "Abies lasiocarpa subsp. bifolia was mainly introduced to the Pacific Northwest region of the United States. It has been established in areas with moist, well-drained soils and cool, temperate climates. This subspecies is often found in higher elevation forests, where it thrives in shaded, forested environments. Its introduction has been associated with both natural dispersal and human-assisted propagation. However, its distribution remains limited compared to the broader Abies lasiocarpa species."
}
