{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies delavayi",
    "plant_slug": "abies-delavayi",
    "plant_name_scientific": "abies delavayi",
    "intro": "Abies delavayi, commonly known as the Delavay fir, is a coniferous evergreen tree native to the mountainous regions of western China. It belongs to the genus Abies, which includes various species of fir trees characterized by their conical shape and needle-like leaves. The tree typically grows at high altitudes, often in temperate and subalpine climates, where it thrives in cool, moist environments. Its cones are cylindrical and contain winged seeds, which are dispersed by wind. The bark of Abies delavayi is usually smooth and grayish, with a texture that becomes more rugged as the tree matures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies delavayi"
    },
    "taxonomy_art_desc": "Abies delavayi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, though it is more closely related to modern seed plants. Its subclass is Pinidae, which is a group of conifers that includes pines, firs, and cedars, characterized by their needle-like leaves and cone-bearing structures. Its order is Pinales, a group of coniferous plants that includes various families such as Pinaceae, Cupressaceae, and others, all of which are known for their woody stems and cone-producing reproductive structures. Its family is Pinaceae, commonly known as the pine family, which includes coniferous trees and shrubs with needle-like leaves and cone-bearing structures. Its genus is Abies, which consists of evergreen coniferous trees commonly known as firs, characterized by their whorled arrangement of needles and their typically conical shape. Its species is Abies delavayi, a specific type of fir native to China, known for its ornamental value and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "East Himalaya",
        "Myanmar",
        "Tibet",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies delavayi is primarily native to China South-Central, East Himalaya, Myanmar, Tibet, and Vietnam. This species is found in mountainous regions across these areas, typically in temperate to subtropical climates. It thrives in high-altitude forests where there is ample rainfall and well-drained soil. The plant is commonly associated with mixed coniferous forests and is often found in association with other species like fir and pine. Its distribution reflects its adaptation to the diverse ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Abies delavayi was mainly introduced to regions with temperate climates and high altitudes, particularly in mountainous areas of Asia. It is commonly found in the forests of southwestern China, including provinces like Yunnan and Sichuan. This species thrives in well-drained soils and requires ample sunlight for optimal growth. It is often used in horticulture for its ornamental value and ecological benefits. The distribution of Abies delavayi is closely tied to its natural habitat, which supports its growth and survival."
}
