{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies grandis var. lasiocarpa",
    "plant_slug": "abies-grandis-var-lasiocarpa",
    "plant_name_scientific": "abies grandis var. lasiocarpa",
    "intro": "Abies grandis var. lasiocarpa, commonly known as the subalpine fir, is a variant of the grand fir native to western North America. It is characterized by its dense, soft needles that are often covered in a fine, silky white bloom, giving it a distinctive appearance. The plant typically grows in high elevation forests, preferring cool, moist environments with well-drained soil. Its cones are usually small and erect, maturing to release seeds that contribute to forest regeneration. This variety plays an important ecological role in mountain ecosystems, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies grandis var. lasiocarpa is primarily native to the western United States and parts of Canada. It is found in the mountainous regions of Idaho, Montana, and Wyoming. This variant of the white fir is adapted to high elevation environments. It typically grows in coniferous forests at elevations ranging from 1,500 to 3,000 meters. The plant thrives in areas with cool, moist climates and well-drained soils.",
    "distribution_introduced_art_desc": "Abies grandis var. lasiocarpa was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is commonly found in the western United States, particularly in states like Washington, Oregon, and California. This variety is often planted for its ornamental value and ability to thrive in shaded environments. It has been introduced to some parts of Europe and Asia as well, where it is cultivated in botanical gardens and as an ornamental tree. However, its natural range is limited to the Pacific Northwest of North America."
}
