{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies subarctica",
    "plant_slug": "abies-subarctica",
    "plant_name_scientific": "abies subarctica",
    "intro": "Abies subarctica, commonly known as the Alaska fir, is a coniferous tree native to the Arctic and subarctic regions of North America. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves. The tree produces small, inconspicuous cones that contain seeds dispersed by wind. It thrives in cold, harsh environments and is adapted to permafrost conditions. Its botanical features make it an important component of tundra and boreal forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies subarctica is primarily native to the northern regions of North America, including Canada and Alaska, as well as parts of northern Europe and Siberia. It thrives in cold, boreal climates and is commonly found in mountainous areas. This species is well adapted to harsh environments with long winters and short growing seasons. It often grows in association with other boreal tree species such as pine and birch. Its distribution is closely linked to areas with permafrost and nutrient-poor soils.",
    "distribution_introduced_art_desc": "Abies subarctica was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in high elevations or northern latitudes. It thrives in regions with moderate temperatures and is often found in mountainous or boreal forest ecosystems. This species is commonly used in horticulture for its ornamental value, particularly its conical shape and evergreen foliage. It has been introduced to various parts of the world, including Europe and North America, where it is cultivated for landscaping purposes. However, its natural range is primarily limited to the northern hemisphere, where it grows in its native habitat."
}
