{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies obovata",
    "plant_slug": "abies-obovata",
    "plant_name_scientific": "abies obovata",
    "intro": "Abies obovata, commonly known as the Japanese fir, is a coniferous evergreen tree native to East Asia. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The tree produces small, cylindrical cones that mature to a reddish-brown color, containing seeds surrounded by a papery wing. Its bark is smooth and grayish-brown, becoming fissured with age. Abies obovata is often found in mountainous regions and is valued for its ornamental appeal and ecological importance in forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies obovata is primarily native to the mountainous regions of eastern Asia, including China, Japan, and Korea. It is commonly found in temperate forests at high altitudes, where it thrives in cool, moist climates. This species is particularly associated with the Himalayas and the Japanese island of Honshu. It grows in areas with well-drained soils and is often part of mixed coniferous forests. Abies obovata is an important component of the biodiversity in these regions, contributing to the ecological balance of its native habitat.",
    "distribution_introduced_art_desc": "Abies obovata was mainly introduced to areas with temperate climates and well-drained soils, particularly in mountainous regions. It is commonly found in regions such as Japan, where it has been cultivated for its ornamental value and ecological benefits. The plant thrives in areas with moderate rainfall and cool summers, making it suitable for high-altitude environments. Its introduction has contributed to biodiversity in certain regions, although it is not native to those areas. Careful management is required to prevent it from becoming invasive in non-native habitats."
}
