{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies gmelinii",
    "plant_slug": "abies-gmelinii",
    "plant_name_scientific": "abies gmelinii",
    "intro": "Abies gmelinii, commonly known as the Korean fir, is a coniferous evergreen tree native to the mountainous regions of Korea and northeastern China. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The cones are cylindrical, woody, and typically measure between 5 to 8 centimeters in length. This species thrives in cool, moist climates and is often found in high-altitude forests. Its botanical features make it an important component of the temperate forest ecosystems in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies gmelinii is primarily native to the mountainous regions of eastern Asia, including parts of China, Korea, and Japan. It thrives in cool, moist climates at high altitudes, often found in coniferous forests. This species is particularly common in the Himalayas and the eastern Tibetan Plateau. It prefers well-drained soils and is often found in association with other conifer species. Due to its specific habitat requirements, it is relatively rare and has a restricted distribution.",
    "distribution_introduced_art_desc": "Abies gmelinii was mainly introduced to areas with cool, moist climates and well-drained soils, typically in higher elevations or mountainous regions. It is often found in mixed forests alongside other coniferous species such as fir and spruce. The plant thrives in temperate zones with moderate precipitation and is commonly used in reforestation efforts. Its introduction has helped stabilize soil and provide habitat for various wildlife species. However, it requires careful management to prevent it from outcompeting native vegetation."
}
