{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies spectabilis subsp. densa",
    "plant_slug": "abies-spectabilis-subsp-densa",
    "plant_name_scientific": "abies spectabilis subsp. densa",
    "intro": "Abies spectabilis subsp. densa, commonly known as the dense fir, is a subspecies of the white fir native to the western United States. It is characterized by its dense, compact growth habit and needle-like leaves that are typically dark green and slightly curved. The cones of this plant are usually reddish-brown and maturing within 12 to 18 months. It thrives in cool, moist environments and is often found in high-elevation forests. The subspecies is valued for its ornamental appeal and ecological importance in mountain ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies spectabilis subsp. densa is primarily native to the mountainous regions of western North America, specifically in the western United States and parts of southern Canada. It is found in areas such as the Sierra Nevada, Cascades, and other high elevation forests. This subspecies thrives in cool, moist climates with well-drained soils, typically at elevations ranging from 1,500 to 3,500 meters. It is commonly associated with mixed coniferous forests and is often found alongside other species like Douglas fir and lodgepole pine. Its distribution is limited to specific ecological niches that provide the necessary conditions for its growth and survival.",
    "distribution_introduced_art_desc": "Abies spectabilis subsp. densa was mainly introduced to areas with moist, well-drained soils and cool, temperate climates. It is commonly found in mountainous regions where it thrives in full sun to partial shade. This subspecies is often used in horticulture for its ornamental value and hardy nature. It has been introduced to various parts of the world, including North America and Europe, for landscaping and reforestation purposes. However, its introduction can sometimes lead to ecological impacts in non-native environments."
}
