{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies chensiensis",
    "plant_slug": "abies-chensiensis",
    "plant_name_scientific": "abies chensiensis",
    "intro": "Abies chensiensis, commonly known as the Sichuan fir, is a coniferous evergreen tree native to the mountainous regions of Sichuan, China. It belongs to the family Pinaceae and is characterized by its slender, conical shape and dark green, needle-like leaves. The tree produces cones that are typically pendulous and contain seeds surrounded by a papery wing. It thrives in cool, moist environments and is often found at high elevations in temperate forests. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies chensiensis"
    },
    "taxonomy_art_desc": "Abies chensiensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some seed plants. Its subclass is Pinidae, a group of coniferous plants that includes pines, firs, and spruces. Its order is Pinales, which consists of coniferous plants that are typically evergreen and have needle-like leaves. Its family is Pinaceae, commonly known as the pine family, which includes various coniferous trees such as pines, firs, and cedars. Its genus is Abies, which refers to the genus of fir trees, known for their conical shape and needle-like leaves. Its species is Abies chensiensis, a specific type of fir tree native to China, characterized by its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "Tibet"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies chensiensis is primarily native to China North-Central, China South-Central, China Southeast, East Himalaya, and Tibet. This species is found in mountainous regions within these areas, typically in temperate to subtropical climates. It thrives in elevations ranging from 1,500 to 3,500 meters above sea level. The plant is commonly associated with mixed forests and is often found in association with other coniferous species. Its distribution is limited to specific ecological niches within these geographic regions.",
    "distribution_introduced_art_desc": "Abies chensiensis was mainly introduced to regions with temperate climates that provide the moist, well-drained soils it requires. It is commonly found in mountainous areas where it thrives in cool, humid conditions. This species is often planted as an ornamental tree due to its attractive conical shape and fragrant foliage. It has been introduced to parts of North America and Europe for landscaping and reforestation purposes. However, its introduction has raised concerns about its potential invasiveness in non-native habitats."
}
