{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × insignis f. mastersiana",
    "plant_slug": "abies-×-insignis-f-mastersiana",
    "plant_name_scientific": "abies × insignis f. mastersiana",
    "intro": "Abies × insignis f. mastersiana, commonly known as the Masters' fir, is a hybrid coniferous tree belonging to the genus Abies. It is characterized by its narrow, conical shape and dark green, needle-like foliage that is often bluish-white underneath. The tree produces cone-like structures that contain seeds, typical of the Pinaceae family. It thrives in cool, moist climates and is often found in mountainous regions. This cultivar is valued for its ornamental appeal and is commonly used in horticultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × insignis f. mastersiana is primarily native to the western United States, particularly in California and Oregon. This hybrid fir is found in high elevation areas, often in mountainous regions with cool, moist climates. It thrives in areas with well-drained soils and is commonly associated with mixed coniferous forests. The plant is typically found at elevations between 1,500 and 3,000 meters. Its distribution is limited to specific ecological niches that support its growth and survival.",
    "distribution_introduced_art_desc": "Abies × insignis f. mastersiana was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in higher elevation regions. This hybrid fir is often cultivated in gardens and parks where it can thrive in partial shade to full sun conditions. It is valued for its ornamental qualities, including its pyramidal shape and attractive foliage. The plant is particularly suited for USDA hardiness zones 5 through 7. Its introduction has expanded the range of available evergreen plants for landscaping in temperate regions."
}
