{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies zapotekensis",
    "plant_slug": "abies-zapotekensis",
    "plant_name_scientific": "abies zapotekensis",
    "intro": "Abies zapotekensis, commonly known as the Zapotec fir, is a coniferous tree native to the highlands of southern Mexico. It belongs to the genus Abies, which includes other fir species characterized by their needle-like leaves and cone-bearing structure. The tree typically grows in temperate to subtropical climates, often in mountainous regions with well-drained soils. Its foliage is dense and dark green, providing ecological benefits such as habitat for various wildlife species. The Zapotec fir plays a significant role in the local ecosystem and is also valued for its timber and cultural importance in indigenous communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies zapotekensis is primarily native to the highland cloud forests of southern Mexico, specifically in the states of Oaxaca and Chiapas. This species is found in the mountainous regions of the Sierra Madre de Oaxaca and the southern part of the Sierra Madre de Chiapas. It thrives in humid, temperate climates at elevations ranging from 1,500 to 3,000 meters above sea level. The plant is commonly associated with mixed evergreen forests and is often found near streams or in valleys with well-drained soil. Due to its limited distribution, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abies zapotekensis was mainly introduced to regions with temperate climates that mimic its native habitat in Mexico. It is commonly found in areas with high elevation, moist soils, and cool temperatures. This species is often cultivated in botanical gardens and conservation areas for its ecological and ornamental value. Its introduction has been limited to specific zones where it can thrive without invasive tendencies. Due to its specific habitat requirements, it is not widely distributed outside its native range."
}
