{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies douglasii",
    "plant_slug": "abies-douglasii",
    "plant_name_scientific": "abies douglasii",
    "intro": "Abies douglasii, commonly known as the Douglas fir, is a coniferous evergreen tree native to western North America. It is characterized by its tall, straight trunk and dense, pyramidal crown. The tree has needle-like leaves that are dark green and arranged in spirals along the branches. Its cones are typically reddish-brown and hang downward, containing winged seeds. Douglas fir is valued for its strong, durable wood and plays an important role in forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies douglasii is primarily native to the western United States, particularly in California, Oregon, and southern Washington. It is commonly found in high-elevation forests and mountainous regions. This species thrives in cool, moist environments with well-drained soil. It is often associated with mixed coniferous forests and is a characteristic tree of the Pacific Northwest. The plant's distribution is largely restricted to areas with a temperate climate and adequate rainfall.",
    "distribution_introduced_art_desc": "Abies douglasii was mainly introduced to areas with moist, well-drained soils and cool, temperate climates, typically found in mountainous regions. It is commonly planted in landscapes for its ornamental value and ability to thrive in shaded conditions. This species is often used in urban settings due to its tolerance of air pollution and compact growth habit. However, it may become invasive in certain regions if not properly managed. Its distribution is primarily limited to its native range in western North America, though it has been introduced to other parts of the world."
}
