{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor var. pendula",
    "plant_slug": "abies-concolor-var-pendula",
    "plant_name_scientific": "abies concolor var. pendula",
    "intro": "Abies concolor var. pendula, commonly known as the white fir, is a variant of the Colorado fir native to the western United States. It is characterized by its slender, pyramidal shape and its long, soft needles that are typically light green with a white underside. The plant produces cone-like structures that are typically 5 to 8 inches long, containing edible seeds. It thrives in cool, moist environments and is often found in mountainous regions. This variety is noted for its graceful appearance and is often cultivated as an ornamental tree.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor var. pendula is primarily native to the western United States, particularly in California and Oregon. It is commonly found in mountainous regions at elevations ranging from 1,500 to 3,000 meters. This variety is known for its distinctive weeping form, which sets it apart from the more upright growth of the typical Abies concolor. It thrives in cool, moist climates with well-drained soil. The plant is often found in mixed coniferous forests and is adapted to the specific environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Abies concolor var. pendula was mainly introduced to ornamental horticulture and landscaping due to its unique weeping form and aesthetic appeal. It is commonly used in gardens and parks to add visual interest and texture to landscapes. The plant is particularly valued for its ability to thrive in a variety of soil types and its relatively low maintenance requirements. However, it has also been noted to spread aggressively in some regions, posing a risk to native plant communities. Its introduction has led to discussions about its ecological impact and potential invasiveness in certain environments."
}
