{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fabri var. beshanzuensis",
    "plant_slug": "abies-fabri-var-beshanzuensis",
    "plant_name_scientific": "abies fabri var. beshanzuensis",
    "intro": "Abies fabri var. beshanzuensis, commonly known as the Beshanzu fir, is a rare and endemic conifer native to the mountainous regions of China. It is characterized by its slender, conical shape and dark green, needle-like leaves that are closely arranged along the branches. The cones of this species are typically small and cylindrical, maturing to a reddish-brown color. It thrives in cool, moist environments at high altitudes, often growing in dense forests. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from deforestation and climate change.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fabri var. beshanzuensis is primarily native to the mountainous regions of western China, specifically in the Hengduan Mountains. This variety is found in the provinces of Sichuan and Yunnan, where it grows in high-altitude forests. It thrives in cool, moist environments with well-drained soil. The plant is typically found at elevations ranging from 2,000 to 3,500 meters. It is an important component of the local biodiversity in these regions.",
    "distribution_introduced_art_desc": "Abies fabri var. beshanzuensis was mainly introduced to specific regions in China, particularly in the mountainous areas of Sichuan and Yunnan provinces. It is commonly found in high-altitude forests where the climate is cool and moist. This variety is valued for its ornamental qualities and ecological importance in its native habitat. However, it is not widely cultivated outside its natural range. Its distribution is limited to the areas where it has naturally occurred and where it has been intentionally planted for conservation or landscaping purposes."
}
