{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. columnaris",
    "plant_slug": "abies-excelsa-var-columnaris",
    "plant_name_scientific": "abies excelsa var. columnaris",
    "intro": "Abies excelsa var. columnaris, commonly known as the columnar fir, is a variant of the white fir native to the mountainous regions of Southeast Asia. This plant is characterized by its tall, narrow growth habit, which gives it a distinctive columnar shape. Its foliage consists of dense, needle-like leaves that are typically dark green and arranged in a compact, upright manner. The cones are usually small and borne in clusters, adding to its ornamental appeal. It is often cultivated as a landscape tree due to its aesthetic form and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. columnaris is primarily native to the high-altitude regions of the Himalayas, particularly in Nepal, Bhutan, and northern India. This variety of the Himalayan fir is adapted to cold and moist environments found in mountainous areas. It typically grows in subalpine and alpine zones where temperatures are low and precipitation is abundant. The plant is often found in mixed coniferous forests at elevations ranging from 2,500 to 4,500 meters. Its narrow, columnar growth habit makes it a distinctive feature in its native landscape.",
    "distribution_introduced_art_desc": "Abies excelsa var. columnaris was mainly introduced to ornamental horticulture due to its unique columnar growth habit and aesthetic appeal. It is commonly cultivated in gardens and landscapes for its dense, upright form and evergreen foliage. This variety is favored for use in narrow spaces, such as along pathways or as a privacy screen. It thrives in well-drained soil and partial shade, making it adaptable to a variety of garden conditions. However, it is important to note that it may require protection from strong winds and extreme weather conditions."
}
