{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies religiosa var. colimensis",
    "plant_slug": "abies-religiosa-var-colimensis",
    "plant_name_scientific": "abies religiosa var. colimensis",
    "intro": "Abies religiosa var. colimensis, commonly known as the Mexican fir, is a rare and endemic conifer native to the high-altitude regions of central Mexico. It is characterized by its slender, conical shape and dark green, needle-like leaves that are typically shorter and more densely packed than those of other fir species. The tree produces small, cylindrical cones that mature to a reddish-brown color, containing winged seeds dispersed by wind. It thrives in cool, moist climates with well-drained soil, often growing in mountainous forest ecosystems. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from deforestation and climate change.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies religiosa var. colimensis is primarily native to the Sierra Madre Occidental and the western Trans-Mexican Volcanic Belt in Mexico. This variant of the silver fir is found in high-altitude regions, typically between 2,000 and 3,500 meters above sea level. It grows in temperate forests with cool, moist climates and well-drained soils. The plant is commonly associated with cloud forests and is often found in association with other coniferous species. Its distribution is limited to specific geographic areas within Mexico, where it thrives in the unique ecological conditions of the region.",
    "distribution_introduced_art_desc": "Abies religiosa var. colimensis was mainly introduced to areas with high altitude and cool temperate climates, where it thrives in moist, well-drained soils. It is commonly found in mountainous regions of Mexico, particularly in the Sierra Madre mountains. This variety is valued for its ornamental qualities and is often planted in gardens and parks for its evergreen foliage and cone production. Its introduction has also been noted in some parts of the United States, where it is cultivated for its aesthetic appeal. However, its spread is limited by its specific environmental requirements."
}
