{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies yuanbaoshanensis",
    "plant_slug": "abies-yuanbaoshanensis",
    "plant_name_scientific": "abies yuanbaoshanensis",
    "intro": "Abies yuanbaoshanensis, commonly known as the Yuanbaoshan fir, is a rare conifer native to China. It is characterized by its conical shape and needle-like leaves that are dark green and slightly curved. The tree produces cones that are typically reddish-brown and contain seeds. It thrives in cool, moist environments at high altitudes. Due to its limited distribution and habitat specificity, it is considered an endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies yuanbaoshanensis"
    },
    "taxonomy_art_desc": "Abies yuanbaoshanensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails and clubmosses. Its subclass is Pinidae, which is a group of coniferous plants that includes pines, firs, and spruces. Its order is Pinales, which is a group of coniferous plants that includes various species of pines, firs, and cedars. Its family is Pinaceae, commonly known as the pine family, which includes coniferous trees with needle-like leaves and cone-bearing structures. Its genus is Abies, which refers to the genus of fir trees, characterized by their slender, conical shape and needle-like leaves. Its species is Abies yuanbaoshanensis, a rare and endemic species of fir found in China, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies yuanbaoshanensis is primarily native to China Southeast. This species is found in the mountainous regions of southern China, particularly in the Yunnan Province. It thrives in humid and cool climates, often growing at higher elevations. The plant is endemic to specific areas within this region, indicating a limited natural range. Its native distribution highlights its ecological significance in the local biodiversity.",
    "distribution_introduced_art_desc": "Abies yuanbaoshanensis was mainly introduced to the data as a rare and endemic species found in the Yuanbaoshan area of China. It is characterized by its unique morphological features and ecological adaptations to its native habitat. The introduction of this plant into the dataset highlights its significance in botanical research and conservation efforts. Its distribution is limited to specific elevations and microclimates within its native range. This data contributes to the understanding of biodiversity and the need for protecting such rare species."
}
