{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo var. glauca",
    "plant_slug": "abies-pinsapo-var-glauca",
    "plant_name_scientific": "abies pinsapo var. glauca",
    "intro": "Abies pinsapo var. glauca, commonly known as the glaucous fir, is a rare and endemic coniferous tree native to the Iberian Peninsula. It is characterized by its bluish-gray foliage, which gives it its common name, and its slender, pyramidal shape. The tree produces cones that are typically 5–7 cm long, containing seeds that are dispersed by wind. It thrives in cool, moist environments and is often found in mountainous regions with well-drained soils. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo var. glauca is primarily native to the mountainous regions of southern Spain, particularly in the Sierra de Cazorla, Montes de Málaga, and the Baetic System. This variety of the abies pinsapo is adapted to the dry, warm climate of these areas. It typically grows in rocky and limestone soils at elevations ranging from 700 to 1,500 meters. The plant is endemic to this specific region and is considered a relict species with a limited natural range. Due to its restricted habitat, it is also listed as endangered in some conservation assessments.",
    "distribution_introduced_art_desc": "Abies pinsapo var. glauca was mainly introduced to areas with temperate climates and well-drained soils, particularly in regions of southern Europe and parts of North Africa. It thrives in mountainous environments where it can receive adequate sunlight and moisture. This variety is often planted for its ornamental value due to its unique blue-green foliage and conical shape. Its introduction has been limited to specific ecological niches where it can compete successfully with native species. However, its spread remains restricted due to its preference for specific environmental conditions."
}
