{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies homolepis f. umbilicata",
    "plant_slug": "abies-homolepis-f-umbilicata",
    "plant_name_scientific": "abies homolepis f. umbilicata",
    "intro": "Abies homolepis f. umbilicata, commonly known as the Japanese fir or umbrella fir, is a variant of the Japanese white fir. It is characterized by its dense, conical shape and short, stiff needles that give it a compact appearance. The plant is native to Japan and is often cultivated as an ornamental tree due to its aesthetic appeal. It prefers well-drained soil and full sun to partial shade, and it is relatively hardy in temperate climates. The foliage remains evergreen, providing year-round visual interest in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies homolepis f. umbilicata is primarily native to the mountainous regions of central and eastern Asia, including China, Japan, and Korea. This subspecies is commonly found in temperate coniferous forests at high elevations. It thrives in cool, moist climates with well-drained soils. The plant is often associated with mixed forests containing other coniferous and broad-leaved species. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abies homolepis f. umbilicata was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous or subalpine regions. This distribution is characterized by its preference for high elevations where temperatures are lower and precipitation is more consistent. It thrives in regions with moderate sunlight and is often found in mixed coniferous forests. The introduced distribution includes parts of East Asia, particularly in China, where it has been cultivated for ornamental purposes. Its presence in these areas is often associated with human activity and landscape gardening."
}
