{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × apollinis",
    "plant_slug": "abies-×-apollinis",
    "plant_name_scientific": "abies × apollinis",
    "intro": "Abies × apollinis, commonly known as the Apollo fir, is a hybrid conifer resulting from the cross between Abies alba (silver fir) and Abies cephalonica (Greek fir). It is characterized by its dense, pyramidal shape and dark green, needle-like foliage. The tree produces cone-like structures that mature to a reddish-brown color, typical of many fir species. It thrives in temperate climates with well-drained soil and moderate moisture. Due to its ornamental value, it is often cultivated in gardens and landscapes for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × apollinis is primarily native to the mountainous regions of central and eastern Europe. It occurs naturally in countries such as Germany, Austria, and the Czech Republic. This hybrid species is found in areas with cool, moist climates and well-drained soils. It typically grows in forested habitats at elevations ranging from 800 to 2,000 meters. The plant is a result of natural crossbreeding between Abies alba and Abies cephalonica.",
    "distribution_introduced_art_desc": "Abies × apollinis was mainly introduced to the United States and Canada as an ornamental tree due to its attractive appearance and hardiness. It is commonly found in urban and suburban landscapes, particularly in regions with temperate climates. This hybrid species is a cross between white fir (Abies alba) and Douglas fir (Pseudotsuga menziesii), resulting in a tree with unique characteristics. It is often planted for its aesthetic value, including its pyramidal shape and needle-like foliage. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
