{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies chensiensis subsp. yulongxueshanensis",
    "plant_slug": "abies-chensiensis-subsp-yulongxueshanensis",
    "plant_name_scientific": "abies chensiensis subsp. yulongxueshanensis",
    "intro": "Abies chensiensis subsp. yulongxueshanensis, commonly known as the Yulong Snow Mountain fir, is a rare and endemic conifer found in the high-altitude regions of Yulong Snow Mountain in Yunnan Province, China. It is characterized by its slender, pyramidal tree form and dark green, needle-like leaves that are arranged in spirals along the branches. The cones are typically small and cylindrical, maturing to a reddish-brown color, and the tree produces a distinctive, aromatic resin. This subspecies thrives in cool, moist climates with well-drained soil, often growing in mixed forests at elevations above 3,000 meters. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from climate change and habitat loss.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies chensiensis subsp. yulongxueshanensis is primarily native to the Yulong Snow Mountain region in Yunnan Province, China. This subspecies is found in the high-altitude areas of the mountain, typically at elevations between 3,000 and 4,500 meters. It grows in cool, moist, and relatively sheltered habitats within the mountainous terrain. The plant is adapted to the harsh climate and limited soil conditions of its native environment. Its distribution is restricted to this specific mountain range, making it a rare and endemic species.",
    "distribution_introduced_art_desc": "Abies chensiensis subsp. yulongxueshanensis was mainly introduced to the western region of China, particularly in the Yulong Snow Mountain area. This subspecies is native to the high-altitude forests of Yunnan and Sichuan provinces. It is characterized by its conical shape and dark green needles. The distribution is limited to specific elevations, typically between 2,500 and 3,500 meters. It plays a vital role in the local ecosystem and is considered a rare and endemic species."
}
