{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies koreana",
    "plant_slug": "abies-koreana",
    "plant_name_scientific": "abies koreana",
    "intro": "Abies koreana, commonly known as the Korean fir, is a coniferous evergreen tree native to the mountainous regions of Korea. It typically grows to a height of 10–20 meters, featuring a conical shape with dense, dark green needles. The tree produces small, spherical cones that mature to a reddish-brown color, and its bark is grayish-brown with deep fissures. It thrives in cool, moist climates and is often found in forested areas at elevations between 1,000 and 2,000 meters. The Korean fir is valued for its ornamental appeal and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies koreana"
    },
    "taxonomy_art_desc": "Abies koreana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses ferns, horsetails, and other primitive vascular plants. Its subclass is Pinidae, a group that includes conifers and other gymnosperms with needle-like leaves. Its order is Pinales, which consists of coniferous trees and shrubs, primarily characterized by their cone-bearing structures. Its family is Pinaceae, commonly known as the pine family, which includes various types of pines, firs, and spruces. Its genus is Abies, which refers to the genus of fir trees, typically characterized by their conical shape and needle-like leaves. Its species is Abies koreana, a specific type of fir tree native to Korea, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Korea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies koreana is primarily native to Korea. It is found in the mountainous regions of both the Korean Peninsula, including North and South Korea. This species thrives in temperate climates with high humidity and well-drained soils. It is commonly found in mixed forests at elevations ranging from 800 to 1,500 meters. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Abies koreana was mainly introduced to North America and Europe as an ornamental plant due to its attractive foliage and cone structure. It is commonly cultivated in gardens and parks for its aesthetic value and ability to thrive in cooler climates. The introduction of Abies koreana has led to its establishment in some regions outside its native range in Korea. However, its spread is generally limited due to specific climatic and soil requirements. This plant is often used in landscaping for its evergreen characteristics and winter interest."
}
