{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies georgei",
    "plant_slug": "abies-georgei",
    "plant_name_scientific": "abies georgei",
    "intro": "Abies georgei, commonly known as the George fir, is a species of conifer native to the mountainous regions of central and eastern Asia. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged spirally along the branches. The cones of Abies georgei are typically pendulous, with a reddish-brown color and a distinctive, elongated shape. This species thrives in cool, moist climates and is often found in high-altitude forests. Its botanical features make it an important component of the ecosystems in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies georgei is primarily native to the eastern Himalayas, including regions in India, Nepal, and Bhutan. It thrives in high-altitude temperate forests, typically at elevations between 2,500 and 4,000 meters. This species is commonly found in areas with cool, moist climates and well-drained soils. It plays an important ecological role in these mountain ecosystems. The plant is also occasionally found in the southern parts of China.",
    "distribution_introduced_art_desc": "Abies georgei was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is commonly found in the Pacific Northwest of the United States and parts of Canada. This species thrives in high elevations where temperatures are moderate and precipitation is abundant. Its introduction has been largely due to its ornamental value and adaptability to specific ecological conditions. However, it is not native to these regions and has been cultivated for its aesthetic appeal in landscaping and forestry."
}
