{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies mertensiana",
    "plant_slug": "abies-mertensiana",
    "plant_name_scientific": "abies mertensiana",
    "intro": "Abies mertensiana, commonly known as the white fir, is a coniferous evergreen tree native to the mountainous regions of western North America. It is characterized by its slender, conical shape and its dense, dark green foliage that turns a striking silver-white underneath. The tree produces small, spherical cones that release seeds in the autumn, contributing to its reproductive cycle. Its needles are flat and stiff, with two white stomatal bands on the underside, a key identifying feature. Abies mertensiana thrives in cool, moist climates and is often found in high-altitude forests, where it plays an important ecological role.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies mertensiana is primarily native to the northern regions of North America, including parts of Canada and the northern United States. It is also found in the mountainous areas of central and southern Europe. This species thrives in cold, moist environments and is commonly found in boreal forests and subalpine zones. It is particularly associated with the Pacific Northwest and the Appalachian Mountains in North America. Its distribution includes regions with high elevations and long, cold winters.",
    "distribution_introduced_art_desc": "Abies mertensiana was mainly introduced to areas with cold, moist climates and well-drained soils, typically found in high elevation regions. It is commonly found in the northern hemisphere, particularly in North America and Europe. This species thrives in boreal and subalpine environments where temperatures are cool and precipitation is abundant. It is often used in reforestation projects due to its hardiness and ability to stabilize soil. However, its introduction can sometimes lead to competition with native species in certain ecosystems."
}
