{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea var. balsamea",
    "plant_slug": "abies-balsamea-var-balsamea",
    "plant_name_scientific": "abies balsamea var. balsamea",
    "intro": "Abies balsamea var. balsamea, commonly known as the balsam fir, is a coniferous evergreen tree native to eastern North America. It is characterized by its conical shape, dark green needles, and distinctive fluted bark. The tree produces small, spherical cones that release seeds in the autumn. It thrives in cool, moist environments and is often found in boreal and mixed forests. The balsam fir is also valued for its aromatic resin, which has been used historically for medicinal and aromatic purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies balsamea"
    },
    "taxonomy_art_desc": "Abies balsamea var. balsamea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle with alternating generations. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails. Its subclass is Pinidae, which refers to a group of coniferous plants that include pines, firs, and cedars. Its order is Pinales, which consists of coniferous evergreen trees and shrubs that are adapted to a wide range of environments. Its family is Pinaceae, commonly known as the pine family, which includes trees with needle-like leaves and cone-bearing structures. Its genus is Abies, which includes species of fir trees characterized by their flat, needle-like leaves and cone-shaped fruits. Its species is Abies balsamea, a specific type of fir tree native to North America, known for its aromatic resin and conical shape.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Alberta",
        "Connecticut",
        "Iowa",
        "Labrador",
        "Maine",
        "Manitoba",
        "Maryland",
        "Massachusetts",
        "Michigan",
        "Minnesota",
        "New Brunswick",
        "New Hampshire",
        "New Jersey",
        "New York",
        "Newfoundland",
        "Nova Scotia",
        "Ontario",
        "Pennsylvania",
        "Prince Edward I.",
        "Québec",
        "Saskatchewan",
        "Vermont",
        "Virginia",
        "West Virginia",
        "Wisconsin"
    ],
    "distribution_introduced": [
        "Denmark",
        "Finland",
        "Norway"
    ],
    "distribution_native_art_desc": "Abies balsamea var. balsamea is primarily native to Canada and the northern United States, including provinces and states such as Alberta, Connecticut, Iowa, Labrador, Maine, Manitoba, Maryland, Massachusetts, Michigan, Minnesota, New Brunswick, New Hampshire, New Jersey, New York, Newfoundland, Nova Scotia, Ontario, Pennsylvania, Prince Edward Island, Québec, Saskatchewan, Vermont, Virginia, West Virginia, and Wisconsin. This species thrives in cool, moist climates and is commonly found in boreal and mixed hardwood forests. It is well adapted to acidic soils and is often associated with coniferous ecosystems. The plant plays an important ecological role by providing habitat and food for various wildlife species. Its distribution reflects its preference for northern and temperate regions with sufficient moisture and moderate temperatures.",
    "distribution_introduced_art_desc": "Abies balsamea var. balsamea was mainly introduced to Denmark, Finland, and Norway. This distribution reflects its adaptation to temperate and subarctic climates. It is commonly found in forested areas with moist, well-drained soils. The plant thrives in regions with cold winters and moderate summers. Its introduction to these countries has been largely due to horticultural and ecological restoration efforts."
}
