{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies ferreana var. longibracteata",
    "plant_slug": "abies-ferreana-var-longibracteata",
    "plant_name_scientific": "abies ferreana var. longibracteata",
    "intro": "Abies ferreana var. longibracteata, commonly known as the long-bract fir, is a rare and endemic conifer native to the high-altitude regions of the Andes in South America. It is characterized by its slender, conical shape and dark green, needle-like leaves that are closely packed along its branches. The plant produces distinctive bracted cones, which are longer and more prominent than those of typical fir species, giving it its specific variety name. It thrives in cool, moist environments and is adapted to the harsh conditions of its mountainous habitat. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies ferreana var. longibracteata is primarily native to the high mountain regions of the western United States, particularly in California and Nevada. This variety of the white fir is found in the Sierra Nevada and Great Basin mountain ranges. It grows at elevations ranging from 2,000 to 3,500 meters. The plant thrives in cool, moist environments with well-drained soils. It is often found in mixed coniferous forests and is adapted to the harsh conditions of its alpine habitat.",
    "distribution_introduced_art_desc": "Abies ferreana var. longibracteata was mainly introduced to ornamental horticulture and ecological restoration projects due to its aesthetic value and adaptability. It is often cultivated in gardens and landscapes for its attractive foliage and cone structure. This variety is favored for its ability to thrive in a range of soil types and climates, making it a popular choice for both residential and commercial plantings. However, its introduction has raised concerns about its potential invasiveness in certain regions. Proper management is recommended to prevent unintended spread and ecological impact."
}
