{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies hickelii var. oaxacana",
    "plant_slug": "abies-hickelii-var-oaxacana",
    "plant_name_scientific": "abies hickelii var. oaxacana",
    "intro": "Abies hickelii var. oaxacana, commonly known as the Oaxaca fir, is a variant of the Mexican fir native to the highlands of Oaxaca, Mexico. It is a coniferous evergreen tree characterized by its slender, conical shape and dark green, needle-like leaves. The tree produces cones that are typically cylindrical and contain seeds surrounded by a winged aril. It thrives in cool, moist environments at elevations between 2,000 and 3,000 meters. The species is valued for its ornamental appeal and ecological role in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies hickelii var. oaxacana is primarily native to the mountainous regions of southern Mexico, specifically in the states of Oaxaca, Puebla, and Veracruz. It thrives in high-altitude cloud forests, typically between 1,500 and 3,000 meters above sea level. This variety is adapted to the cool, moist climate and well-drained soils found in these regions. It is commonly found in mixed coniferous forests alongside other endemic species. Due to its limited range, it is considered a rare and ecologically significant plant in its native habitat.",
    "distribution_introduced_art_desc": "Abies hickelii var. oaxacana was mainly introduced to areas with high elevation and cool, moist climates, typically found in mountainous regions. It is commonly found in the Sierra Madre mountains of Mexico, where it thrives in well-drained soils and full sun to partial shade. This variety is known for its ornamental value and is often planted in gardens and landscapes for its attractive foliage and conical shape. It has also been introduced to other parts of the world as an ornamental tree, though it is not commonly cultivated outside its native range. Due to its specific environmental requirements, it is not widely distributed beyond its native habitat."
}
