{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cephalonica f. pseudocilicica",
    "plant_slug": "abies-cephalonica-f-pseudocilicica",
    "plant_name_scientific": "abies cephalonica f. pseudocilicica",
    "intro": "Abies cephalonica f. pseudocilicica, commonly known as the Cilician fir, is a rare and distinctive subspecies of the Caucasian fir. It is native to the eastern Mediterranean region, particularly in parts of Turkey and northern Cyprus. This plant is characterized by its narrow, conical shape and needle-like leaves that are typically dark green with a silvery underside. The cones are small and often hang in clusters, contributing to its ornamental appeal. Due to its limited distribution and habitat specificity, it is considered a valuable subject for botanical study and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cephalonica f. pseudocilicica is primarily native to the eastern Mediterranean region, particularly in parts of Turkey and southern Greece. This subspecies is found in mountainous areas with a humid subtropical climate. It thrives in rocky and well-drained soils at higher elevations. Its distribution is limited to specific microhabitats within these regions. Due to its restricted range, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Abies cephalonica f. pseudocilicica was mainly introduced to ornamental horticulture and landscape design due to its unique foliage and ornamental value. It is commonly cultivated in regions with temperate climates where it can thrive in well-drained soils and partial shade. This particular form is often favored for its compact growth habit and aesthetic appeal in gardens and urban settings. However, it is important to note that its introduction has raised concerns about potential invasiveness in non-native environments. Its distribution is primarily confined to cultivation rather than natural wild populations."
}
