{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies akatodo",
    "plant_slug": "abies-akatodo",
    "plant_name_scientific": "abies akatodo",
    "intro": "Abies akatodo, commonly known as the Japanese fir, is a coniferous evergreen tree native to Japan. It belongs to the genus Abies in the family Pinaceae, characterized by its needle-like leaves and cone-bearing structure. The tree typically grows in mountainous regions and thrives in cool, moist climates. Its foliage is dark green and densely packed, providing a dense canopy. The cones are small and cylindrical, containing seeds that are dispersed by wind.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies akatodo is primarily native to the mountainous regions of eastern Asia, specifically in China, Japan, and the Korean Peninsula. It thrives in temperate climates with high altitudes and cool, moist conditions. This species is commonly found in forested areas at elevations ranging from 1,500 to 3,000 meters. It prefers well-drained soils and is often part of mixed coniferous forests. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abies akatodo was mainly introduced to areas with temperate climates and high altitudes, where it thrives in moist, well-drained soils. It is commonly found in mountainous regions, particularly in parts of East Asia, including Japan and China. This species is often cultivated for its ornamental value due to its conical shape and attractive foliage. However, its introduction has raised concerns about potential ecological impacts on native plant communities. Despite its beauty, Abies akatodo is not widely distributed outside its native range."
}
