{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo",
    "plant_slug": "abies-pinsapo",
    "plant_name_scientific": "abies pinsapo",
    "intro": "Abies pinsapo, commonly known as the Spanish fir, is a coniferous evergreen tree native to the mountainous regions of southern Europe. It is characterized by its pyramidal shape and needle-like leaves that are typically dark green and arranged in spirals. The tree produces cones that are cylindrical and contain winged seeds, which are dispersed by wind. Its bark is thick and scaly, providing protection against harsh environmental conditions. Abies pinsapo plays an important ecological role in its native habitat, supporting a variety of wildlife and contributing to forest ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies pinsapo"
    },
    "taxonomy_art_desc": "Abies pinsapo belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants that have a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, a group that includes ferns and their allies, characterized by their vascular systems and spore reproduction. Its subclass is Pinidae, which encompasses coniferous plants with needle-like leaves and cone-bearing structures. Its order is Pinales, a group of gymnosperms that includes pine, spruce, and fir trees, known for their needle-like leaves and seed cones. Its family is Pinaceae, commonly known as the pine family, which includes various coniferous trees with needle-like leaves and woody cones. Its genus is Abies, which refers to the genus of fir trees, typically characterized by their conical shape and flattened, needle-like leaves. Its species is Abies pinsapo, a specific type of fir tree native to the Canary Islands, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Spain"
    ],
    "distribution_introduced": [
        "Austria",
        "Portugal"
    ],
    "distribution_native_art_desc": "Abies pinsapo is primarily native to Spain. It is found in the mountainous regions of the Iberian Peninsula, particularly in the Sierra Nevada and other high-altitude areas. This species thrives in cool, moist environments with well-drained soils. It is a relict species, meaning it has survived from a time when its range was more extensive. The plant is adapted to the specific climatic conditions of southern Spain.",
    "distribution_introduced_art_desc": "Abies pinsapo was mainly introduced to Austria and Portugal. This species is native to the Iberian Peninsula but has been cultivated in these European countries. It is valued for its ornamental qualities and ability to thrive in temperate climates. The introduction has contributed to biodiversity in these regions. However, it requires specific soil and climate conditions to flourish successfully."
}
