{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies obovata var. japonica",
    "plant_slug": "abies-obovata-var-japonica",
    "plant_name_scientific": "abies obovata var. japonica",
    "intro": "Abies obovata var. japonica, commonly known as the Japanese fir, is a coniferous evergreen tree native to Japan. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are slightly twisted. The tree produces small, cylindrical cones that mature to a reddish-brown color. Its bark is smooth and grayish-white, becoming fissured with age. This species is often cultivated for ornamental purposes due to its elegant form and cold-hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies obovata var. japonica is primarily native to Japan, specifically the Ryukyu Islands. This variant of the Japanese fir is found in the subtropical regions of Okinawa and the Amami Islands. It thrives in moist, well-drained soils and is often found in mountainous areas with a humid climate. The plant is adapted to the warm, humid conditions of its native habitat. It is an important component of the local evergreen forests in these regions.",
    "distribution_introduced_art_desc": "Abies obovata var. japonica was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and conical shape. It is commonly cultivated in gardens and parks for its aesthetic value and ability to thrive in temperate climates. This variety is also valued for its resistance to certain pests and diseases compared to other fir species. It has been introduced to several regions beyond its native range, including parts of Europe and North America. However, its spread is generally limited to controlled environments to prevent ecological disruption."
}
