{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies montana",
    "plant_slug": "abies-montana",
    "plant_name_scientific": "abies montana",
    "intro": "Abies montana, commonly known as the white fir, is a coniferous evergreen tree native to the mountainous regions of western North America. It is characterized by its slender, conical shape and its dense, dark green foliage that turns a striking silver-white underneath. The tree produces small, spherical cones that release seeds in the spring, contributing to its reproductive cycle. Its bark is typically gray and furrowed, providing a distinctive texture. Abies montana thrives in cool, moist climates and is often found in high-elevation forests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies montana is primarily native to the mountainous regions of western North America, including parts of Canada and the United States. It is commonly found in the Pacific Northwest, extending from Alaska down through British Columbia and into the western states of Washington, Oregon, and California. This species thrives in cool, moist environments at high elevations, often growing in coniferous forests. It is well adapted to the harsh climate of its native habitat, with dense foliage and a conical shape that helps it withstand heavy snowfall. Abies montana is an important component of the ecosystem in these regions, providing habitat and resources for various wildlife species.",
    "distribution_introduced_art_desc": "Abies montana was mainly introduced to areas with cool, moist climates and well-drained soils, typically at higher elevations. It is commonly found in mountainous regions where it thrives in temperate to subalpine conditions. This species has been introduced to several regions outside its native range, including parts of Europe and North America. Its introduction has sometimes led to ecological impacts due to its adaptability and rapid growth. However, it is often cultivated for its ornamental value and forest ecosystem contributions."
}
