{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies subalpina compacta",
    "plant_slug": "abies-subalpina-compacta",
    "plant_name_scientific": "abies subalpina compacta",
    "intro": "Abies subalpina compacta, commonly known as the compact fir, is a slow-growing conifer native to the mountainous regions of central and eastern Europe. It is characterized by its dense, compact growth habit and short, stiff needles that are typically dark green in color. The plant produces small, cylindrical cones that hang downward, and its bark is reddish-brown with a flaky texture. It thrives in cool, moist environments and is often found in subalpine and alpine zones. This species is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies subalpina compacta is primarily native to the mountainous regions of eastern Asia, including parts of China, Korea, and Japan. It thrives in high-altitude environments, typically found in coniferous forests at elevations ranging from 1,500 to 3,000 meters. This species is commonly associated with cool, moist climates and well-drained soils, making it a characteristic component of subalpine ecosystems. Its distribution is limited to specific mountain ranges where it can tolerate the harsher conditions of higher altitudes. Due to its restricted habitat, it is considered a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Abies subalpina compacta was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is often cultivated in gardens and landscapes for its ornamental value and compact growth habit. This plant prefers partial shade to full sun and is relatively hardy, making it suitable for a variety of temperate climates. It is commonly used as a specimen tree or in mixed plantings due to its attractive needle-like foliage. However, it is important to note that it may become invasive in certain regions if not properly managed."
}
