{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fabri",
    "plant_slug": "abies-fabri",
    "plant_name_scientific": "abies fabri",
    "intro": "Abies fabri, commonly known as the Fabri fir, is a species of conifer native to the mountainous regions of central China. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The cones of Abies fabri are typically small and elongated, with woody scales that mature to a reddish-brown color. This evergreen tree thrives in cool, moist climates and is often found in high-altitude forests. Its botanical features make it a distinctive and ecologically important component of its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies delavayi"
    },
    "taxonomy_art_desc": "Abies fabri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants that are characterized by their ability to perform photosynthesis and their complex reproductive structures. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their primitive vascular systems and spore reproduction. Its subclass is Pinidae, which is a group of conifers that includes several genera of evergreen trees and shrubs. Its order is Pinales, a group of coniferous plants that includes pines, firs, and other needle-leaved trees. Its family is Pinaceae, commonly known as the pine family, which consists of coniferous trees with needle-like leaves and cone-bearing structures. Its genus is Abies, which includes species of fir trees, typically characterized by their flat, linear leaves and distinctive cone shapes. Its species is Abies delavayi, a specific type of fir tree native to China, known for its ecological significance and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fabri is primarily native to China South-Central. This species is found in the mountainous regions of central China, particularly in provinces such as Hubei, Hunan, and Sichuan. It thrives in temperate climates with high humidity and well-drained soils. The plant is commonly associated with forests at elevations ranging from 1,000 to 2,500 meters. Its natural habitat includes areas with moderate rainfall and cool temperatures.",
    "distribution_introduced_art_desc": "Abies fabri was mainly introduced to the Pacific Northwest region of the United States. It was brought there for its ornamental value due to its attractive pyramidal shape and vibrant foliage. The plant has been cultivated in gardens and landscaped areas, particularly in regions with moist, well-drained soils. However, it has shown limited naturalization outside of controlled environments. Its introduction has raised concerns about potential ecological impacts on native plant communities."
}
