{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies grandis",
    "plant_slug": "abies-grandis",
    "plant_name_scientific": "abies grandis",
    "intro": "Abies grandis, commonly known as the grand fir, is a coniferous evergreen tree native to western North America. It is characterized by its tall, slender form and dense, pyramidal crown. The tree has needle-like leaves that are dark green on top and whitish underneath, with small resinous glands. Its cones are typically cylindrical and hang downward, releasing seeds when mature. The bark is thin and scaly, becoming thicker and darker with age.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies grandis"
    },
    "taxonomy_art_desc": "Abies grandis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Pinidae, a group of coniferous plants that includes various species of pines, firs, and cedars, typically with needle-like leaves. Its order is Pinales, which consists of coniferous evergreen trees and shrubs, including pines, firs, and cedars, characterized by their cone-bearing nature. Its family is Pinaceae, commonly known as the pine family, which includes coniferous trees with needle-like leaves and cone-bearing reproductive structures. Its genus is Abies, which refers to the genus of fir trees, typically characterized by their pyramidal shape, needle-like leaves, and clustered cones. Its species is Abies grandis, commonly known as the grand fir, a tall evergreen tree native to western North America, known for its aromatic needles and valuable timber.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "British Columbia",
        "California",
        "Idaho",
        "Montana",
        "Oregon",
        "Washington"
    ],
    "distribution_introduced": [
        "Czechia-Slovakia",
        "Denmark",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Ireland",
        "Italy",
        "Norway",
        "Sweden",
        "Switzerland"
    ],
    "distribution_native_art_desc": "Abies grandis is primarily native to British Columbia, California, Idaho, Montana, Oregon, and Washington. This species is commonly found in the mountainous regions of these western North American states and provinces. It thrives in cool, moist climates and is often associated with coniferous forests. The tree is known for its tall, slender form and distinctive cone-shaped branches. Its natural range spans across the Pacific Northwest and parts of the western United States.",
    "distribution_introduced_art_desc": "Abies grandis was mainly introduced to Czechia-Slovakia, Denmark, Føroyar, Germany, Great Britain, Ireland, Italy, Norway, Sweden, and Switzerland. It has been established in these regions, often as an ornamental or forestry species. The introduction is primarily associated with horticultural and reforestation efforts. Its distribution across these countries reflects its adaptability to temperate climates. However, its impact on local ecosystems varies depending on the region."
}
