{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies oaxacana",
    "plant_slug": "abies-oaxacana",
    "plant_name_scientific": "abies oaxacana",
    "intro": "Abies oaxacana, commonly known as the Oaxacan fir, is a species of evergreen conifer native to the mountainous regions of southern Mexico. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged spirally along the branches. The tree produces small, cylindrical cones that typically measure between 5 to 10 centimeters in length. It thrives in cool, moist environments at high altitudes, often growing in cloud forests. The Oaxacan fir plays an important ecological role in its native habitat, providing shelter and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies oaxacana is primarily native to the mountainous regions of southern Mexico, specifically in the states of Oaxaca, Chiapas, and parts of the Yucatán Peninsula. It thrives in high-altitude cloud forests, typically at elevations between 1,500 and 3,000 meters. This species is adapted to humid, cool climates with abundant rainfall and well-drained soils. It is commonly found in mixed coniferous forests alongside other endemic species. Due to its restricted range, it is considered a rare and ecologically significant plant in its native habitat.",
    "distribution_introduced_art_desc": "Abies oaxacana was mainly introduced to areas with high elevation, moist soils, and temperate climates, typically found in mountainous regions. It is commonly found in the Sierra Madre mountain ranges of Mexico, particularly in the states of Oaxaca and Puebla. This species thrives in cool, humid environments and is often associated with cloud forests. Its introduction to these regions has been largely natural, with limited human intervention. However, it is not commonly cultivated outside its native habitat due to specific environmental requirements."
}
