{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies parsonii",
    "plant_slug": "abies-parsonii",
    "plant_name_scientific": "abies parsonii",
    "intro": "Abies parsonii, commonly known as the Parson's fir, is a coniferous evergreen tree native to the western United States. It is characterized by its dense, pyramidal shape and needle-like leaves that are blue-green in color. The tree produces cones that are typically 5 to 8 centimeters long, containing seeds that are dispersed by wind. Its bark is thick and scaly, providing protection against harsh environmental conditions. Abies parsonii is often found in high-elevation forests, where it thrives in cool, moist climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies parsonii is primarily native to the western United States, particularly in the mountainous regions of California, Nevada, and Utah. It is commonly found in high-elevation forests and subalpine zones, where it thrives in cool, moist environments. This species is also present in parts of northern Mexico, specifically in the Sierra Madre Occidental mountain range. It grows at elevations ranging from 1,800 to 3,500 meters, often forming dense stands in mixed coniferous forests. Due to its specific habitat requirements, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Abies parsonii was mainly introduced to North America, particularly in the western United States and Canada. It has been cultivated in gardens and parks for its ornamental value due to its attractive conical shape and evergreen foliage. The species is often used in landscaping for its ability to thrive in cooler climates. However, it is not native to these regions and has been introduced primarily through horticultural practices. Its distribution is limited to areas where it has been intentionally planted."
}
