{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies coahuilensis",
    "plant_slug": "abies-coahuilensis",
    "plant_name_scientific": "abies coahuilensis",
    "intro": "Abies coahuilensis, commonly known as the Coahuila fir, is a rare and endemic conifer native to the mountainous regions of northeastern Mexico. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are arranged in spirals along its branches. The tree produces cones that are typically cylindrical and contain small, winged seeds. It thrives in cool, moist climates at high altitudes, often growing in association with other endemic species in its native habitat. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from habitat loss and climate change.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies coahuilensis is primarily native to the Chihuahuan Desert region of northern Mexico. It is found in the states of Coahuila, Durango, and Nuevo León. This species grows in rocky, well-drained soils at elevations ranging from 1,500 to 2,500 meters. It is often found in association with other coniferous species in mountainous areas. The plant is adapted to the arid and semi-arid climate of its native habitat.",
    "distribution_introduced_art_desc": "Abies coahuilensis was mainly introduced to specific regions in Mexico, particularly in the state of Coahuila, where it thrives in high-altitude environments. This plant is typically found in mountainous areas with cool, moist climates, often growing in pine-oak forests. It is adapted to well-drained soils and requires a significant amount of rainfall during the growing season. Due to its limited natural range, it is not commonly found outside of these specific habitats. Conservation efforts are ongoing to protect this species from habitat loss and climate change impacts."
}
