{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies communis var. pendula",
    "plant_slug": "abies-communis-var-pendula",
    "plant_name_scientific": "abies communis var. pendula",
    "intro": "Abies communis var. pendula, commonly known as the weeping fir, is a variant of the noble fir characterized by its distinctive drooping branches. This evergreen conifer is native to the mountainous regions of central and southern Europe. Its foliage consists of needle-like leaves that are dark green and arranged in a dense, cascading pattern. The tree typically grows to a height of 10 to 20 meters, with a narrow, conical shape. It thrives in well-drained soils and cooler climates, making it a popular ornamental plant in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies communis var. pendula is primarily native to the eastern Himalayas, including regions in Nepal, Bhutan, and northern India. This variant of the firs is typically found in mountainous areas at elevations ranging from 2,000 to 3,500 meters. It grows in temperate forests and is often associated with mixed coniferous and broadleaf vegetation. The plant thrives in cool, moist climates with well-drained soils. Its natural distribution is limited to these specific geographic and ecological conditions.",
    "distribution_introduced_art_desc": "Abies communis var. pendula was mainly introduced to enhance ornamental value in gardens and landscapes due to its unique weeping form. It is commonly found in temperate regions where it thrives in well-drained soil and partial shade. This variety is often used as a specimen tree or in hedges for its aesthetic appeal. However, it requires careful management to prevent it from becoming invasive in natural habitats. Its introduction has sparked both appreciation and concern among horticulturists and conservationists."
}
