{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sumatrana",
    "plant_slug": "abies-sumatrana",
    "plant_name_scientific": "abies sumatrana",
    "intro": "Abies sumatrana, commonly known as the Sumatran fir, is a coniferous tree native to the high-altitude regions of Sumatra, Indonesia. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in spirals along its branches. The tree produces small, cylindrical cones that typically hang downward, containing seeds enclosed in woody scales. It thrives in cool, moist climates and is often found in montane forests. Due to habitat loss and limited distribution, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sumatrana is primarily native to the highland regions of Sumatra, Indonesia. It grows in cool, moist environments at elevations ranging from 1,500 to 3,000 meters above sea level. This species is found in the northern and central parts of the island, particularly in areas with dense cloud forests. It thrives in areas with high humidity and well-drained soils. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "distribution_introduced_art_desc": "Abies sumatrana was mainly introduced to regions with temperate climates that mimic its native habitat in Southeast Asia. It is typically found in high-altitude forests with cool, moist conditions. The plant has been introduced to parts of Europe and North America as an ornamental species due to its aesthetic value. However, its introduction has raised concerns about its potential to become invasive in non-native environments. Proper management is necessary to prevent ecological disruption in new regions."
}
