{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cedrus",
    "plant_slug": "abies-cedrus",
    "plant_name_scientific": "abies cedrus",
    "intro": "Abies cedrus, commonly known as the cedar fir, is a species of evergreen conifer native to the mountainous regions of southern Europe and northern Africa. It is characterized by its conical shape, dark green foliage, and distinctive, flattened, scale-like leaves. The tree produces small, spherical cones that contain seeds, which are dispersed by wind. Its bark is thick and reddish-brown, providing protection against environmental stress. Abies cedrus is valued for its timber and has been historically used in construction and as a source of aromatic resin.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cedrus is primarily native to the mountainous regions of the eastern Mediterranean, including parts of Turkey, Syria, Lebanon, and Israel. It thrives in high-altitude areas with cool, moist climates and well-drained soils. This species is commonly found in forested areas at elevations ranging from 1,500 to 3,000 meters. It is often associated with mixed coniferous forests and is adapted to harsh alpine conditions. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abies cedrus was mainly introduced to regions with temperate climates that provide suitable growing conditions, including well-drained soils and moderate rainfall. It is commonly found in areas where it has been planted for ornamental purposes or for reforestation efforts. This plant has been introduced to several parts of Europe, North America, and Asia due to its aesthetic value and ecological benefits. However, its introduction has raised concerns about potential invasiveness in non-native environments. Proper management is essential to prevent unintended ecological impacts."
}
