{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibirica f. nana",
    "plant_slug": "abies-sibirica-f-nana",
    "plant_name_scientific": "abies sibirica f. nana",
    "intro": "Abies sibirica f. nana, commonly known as the dwarf Siberian fir, is a compact, low-growing variant of the Siberian fir. It features dense, conical foliage that is dark green on top and silvery white underneath. The plant produces small, spherical cones that mature to a reddish-brown color. It is well adapted to cold climates and thrives in well-drained, acidic soils. This ornamental evergreen is often used in rock gardens and as a landscape accent due to its hardiness and attractive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sibirica f. nana is primarily native to the mountainous regions of Eastern Europe and Central Asia. It is found in countries such as Russia, Ukraine, Kazakhstan, and parts of Mongolia. This variety thrives in cold climates and is commonly found in high-altitude areas with well-drained soils. It is often associated with coniferous forests and alpine ecosystems. Its small stature makes it well adapted to harsh environmental conditions.",
    "distribution_introduced_art_desc": "Abies sibirica f. nana was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous or boreal regions. It is often found in forested areas where it can thrive under the canopy of larger trees. This form is smaller and more compact than the typical Abies sibirica, making it suitable for rock gardens or as a decorative plant. It is valued for its ornamental appeal and ability to tolerate harsh environmental conditions. Its introduction has expanded its range in horticultural settings, particularly in temperate regions with high elevation."
}
