{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba subsp. borisii-regis",
    "plant_slug": "abies-alba-subsp-borisii-regis",
    "plant_name_scientific": "abies alba subsp. borisii-regis",
    "intro": "Abies alba subsp. borisii-regis, commonly known as the Bosnian fir, is a subspecies of the European fir native to the mountainous regions of the Balkans. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are arranged in spirals along the shoots. The cones are typically pendulous, with reddish-brown bracts and woody scales, and they mature to a dark brown color. This subspecies is adapted to cold, high-altitude environments and thrives in well-drained, acidic soils. Its botanical features make it an important component of the mountain forest ecosystems in the Balkan Peninsula.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba subsp. borisii-regis is primarily native to the Carpathian Mountains, specifically in parts of Romania and Ukraine. This subspecies is found in the mountainous regions of Eastern Europe, where it thrives in cool, moist climates. It is commonly associated with forested areas at higher elevations, often growing in mixed coniferous forests. The plant is well adapted to the specific environmental conditions of its native range, including acidic soils and moderate temperatures. Its distribution is limited to these regions, making it a characteristic species of the Carpathian ecosystem.",
    "distribution_introduced_art_desc": "Abies alba subsp. borisii-regis was mainly introduced to central and southern Europe, particularly in the Carpathian Basin and the Balkans. It has been cultivated in various regions for its ornamental value and ecological benefits. This subspecies is known for its adaptability to different soil types and climate conditions. It has been used in reforestation efforts and as a component of mixed forests. However, its introduction has also raised concerns about its potential impact on native plant communities."
}
