{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies cilicica var. isaurica",
    "plant_slug": "abies-cilicica-var-isaurica",
    "plant_name_scientific": "abies cilicica var. isaurica",
    "intro": "Abies cilicica var. isaurica, commonly known as the Isaurian fir, is a rare and endemic conifer native to the Taurus Mountains in Turkey. It is a variant of the Caucasian fir, characterized by its narrow, conical shape and dark green, needle-like leaves. The tree typically grows in high-altitude regions, preferring cool, moist climates with well-drained soils. Its cones are small and cylindrical, containing winged seeds that are dispersed by wind. Due to habitat loss and limited distribution, this species is considered vulnerable and requires conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies cilicica var. isaurica is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, and Lebanon. It is commonly found in the mountainous areas of southern Turkey, particularly in the Taurus and Amanos Mountains. This variety thrives in temperate climates with well-drained soils and is often associated with mixed forests. It is also present in the northern regions of Syria and the southern parts of Lebanon. Due to its limited range, it is considered a rare and endemic species in these areas.",
    "distribution_introduced_art_desc": "Abies cilicica var. isaurica was mainly introduced to areas with temperate climates and well-drained soils, particularly in the eastern Mediterranean region. It thrives in regions with moderate rainfall and sufficient sunlight. This variety is often planted as an ornamental tree due to its attractive cone-shaped form and evergreen foliage. It has been introduced to parts of Europe and North America as a landscape plant. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
