{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies dumosa",
    "plant_slug": "abies-dumosa",
    "plant_name_scientific": "abies dumosa",
    "intro": "Abies dumosa, commonly known as the dwarf fir, is a small evergreen conifer native to the mountainous regions of Central Asia. It typically grows to a height of about 3 to 5 meters, featuring a compact, rounded crown with dense, dark green foliage. The leaves are needle-like, short, and arranged in spirals along the branches, giving it a distinctive appearance. It produces small, spherical cones that mature to a reddish-brown color, containing seeds dispersed by wind. This plant thrives in cool, moist climates and is often found in high-altitude forests and alpine meadows.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies dumosa is primarily native to the mountainous regions of western North America, particularly in the western United States and southern Canada. It is commonly found in the Sierra Nevada, Cascade Range, and other high-elevation areas. This species thrives in cool, moist climates and is often associated with coniferous forests. It is typically found at elevations between 1,500 and 3,500 meters. Due to its specific habitat requirements, its distribution is relatively limited and restricted to these particular regions.",
    "distribution_introduced_art_desc": "Abies dumosa was mainly introduced to areas with cool, moist climates and well-drained soil, typically found in mountainous regions. It is commonly found in the western United States, particularly in California and Oregon. This plant is often used in landscaping for its ornamental value and ability to thrive in shaded environments. It has been introduced to various garden settings where it serves as a hardy evergreen. However, its spread outside its native range is limited due to specific environmental requirements."
}
