{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × speciosa",
    "plant_slug": "abies-×-speciosa",
    "plant_name_scientific": "abies × speciosa",
    "intro": "Abies × speciosa, commonly known as the white fir, is a hybrid coniferous tree resulting from the cross between Abies alba and Abies cephalonica. It is native to the mountainous regions of the Mediterranean, including parts of southern Europe and North Africa. This species is characterized by its dense, pyramidal crown and needle-like leaves that are typically white or bluish-white underneath. The cones are small and often hang in clusters, and the tree is valued for its ornamental beauty and timber. It thrives in well-drained soils and is relatively cold-hardy, making it suitable for cultivation in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × speciosa is primarily native to the western United States and parts of Canada. It occurs in the mountainous regions of California, Oregon, and Washington. This hybrid species is found in the Cascade and Sierra Nevada mountain ranges. It typically grows in high elevation forests with moist, well-drained soils. Its native range includes areas with a temperate climate and significant precipitation.",
    "distribution_introduced_art_desc": "Abies × speciosa was mainly introduced to the Pacific Northwest region of North America. It is commonly found in areas with moist, well-drained soils and cool, humid climates. This hybrid fir is often planted as an ornamental tree due to its attractive pyramidal shape and needle-like foliage. It has been introduced to various landscapes, including urban parks and private gardens. However, its spread in the wild is limited due to its specific environmental requirements."
}
