{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies douglasii var. pendula",
    "plant_slug": "abies-douglasii-var-pendula",
    "plant_name_scientific": "abies douglasii var. pendula",
    "intro": "Abies douglasii var. pendula, commonly known as the hanging Douglas fir, is a variant of the Douglas fir native to the western United States. It is characterized by its drooping branches, which give it a distinctive, weeping appearance. The plant has needle-like leaves that are dark green on top and whitish underneath, with a slightly resinous scent. It produces cones that hang downward, a feature that sets it apart from other fir species. This variant is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies douglasii var. pendula is primarily native to the western United States, particularly in regions of California, Oregon, and Nevada. This variant of the Douglas fir is found in high elevation areas, often in coniferous forests and subalpine zones. It thrives in cooler, moist climates with well-drained soils. The plant is commonly associated with mountainous terrain and is adapted to harsh alpine conditions. Its native range includes parts of the Sierra Nevada and the Cascade Range.",
    "distribution_introduced_art_desc": "Abies douglasii var. pendula was mainly introduced to areas with moist, well-drained soils and cool climates, typically found in mountainous regions. It is often cultivated in gardens and parks for its ornamental value due to its weeping growth habit. This variety is particularly suited for USDA hardiness zones 5 through 7. It thrives in partial to full shade and requires regular watering during dry periods. However, it is important to note that it may become invasive in certain environments if not properly managed."
}
