{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor globosa",
    "plant_slug": "abies-concolor-globosa",
    "plant_name_scientific": "abies concolor globosa",
    "intro": "Abies concolor globosa, commonly known as the Colorado blue spruce, is a species of evergreen conifer native to the western United States. It is characterized by its dense, pyramidal shape and bluish-gray foliage, which gives it a striking appearance. The leaves are needle-like, short, and arranged in spirals along the branches. Its cones are typically cylindrical and measure around 2 to 3 inches in length. This plant is well adapted to cold climates and is often cultivated for ornamental purposes in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor globosa is primarily native to the western United States, particularly in California and Oregon. It is commonly found in high elevation areas, such as the Sierra Nevada and Cascade mountain ranges. This species thrives in cool, moist environments with well-drained soils. It is often associated with mixed coniferous forests and is adapted to the temperate climate of its native habitat. Its limited distribution reflects its specific ecological requirements and geographic isolation.",
    "distribution_introduced_art_desc": "Abies concolor globosa was mainly introduced to areas with temperate climates and high altitudes, where it can thrive in cool, moist environments. It is often found in regions with well-drained soils and sufficient sunlight. This plant is commonly cultivated in gardens and parks for its ornamental value and unique conical shape. Its introduction has been primarily for horticultural purposes rather than for ecological restoration. However, it can sometimes become invasive in certain regions if not properly managed."
}
