{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × insignis f. speciosa",
    "plant_slug": "abies-×-insignis-f-speciosa",
    "plant_name_scientific": "abies × insignis f. speciosa",
    "intro": "Abies × insignis f. speciosa, commonly known as the Sierra White Fir, is a hybrid fir native to the western United States. It is characterized by its tall, slender form and dense, pyramidal crown. The leaves are needle-like, dark green on top, and whitish underneath, giving it a striking appearance. It thrives in cool, moist environments at high elevations. This variety is valued for its ornamental beauty and is often planted in gardens and parks for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × insignis f. speciosa is primarily native to the mountainous regions of southwestern China, particularly in the provinces of Sichuan and Yunnan. This hybrid fir species is found in high-altitude forests, often growing at elevations between 2,500 and 3,500 meters. It thrives in cool, moist climates with well-drained soil, typical of the temperate coniferous forests in this area. The plant is commonly associated with mixed evergreen and deciduous forests, where it contributes to the biodiversity of the ecosystem. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abies × insignis f. speciosa was mainly introduced to enhance ornamental value and for its unique aesthetic qualities in landscaped areas. It is commonly found in gardens and parks where its attractive foliage and pyramidal shape make it a desirable specimen. This form is a hybrid between Abies insignis and another species, resulting in a plant with enhanced hardiness and adaptability. It thrives in well-drained soils and is suited to temperate climates. Due to its ornamental appeal, it has been widely cultivated in regions with suitable growing conditions."
}
