{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies minuta",
    "plant_slug": "abies-minuta",
    "plant_name_scientific": "abies minuta",
    "intro": "Abies minuta, commonly known as the dwarf fir, is a small evergreen conifer native to the high-altitude regions of the Andes in South America. It is characterized by its compact, rounded shape and short, stiff needles that are dark green on top and whitish underneath. The plant produces small, spherical cones that mature to a reddish-brown color, and it flowers with male and female cones on the same tree. Abies minuta thrives in cool, moist climates and is often found growing in rocky or mountainous terrain. Due to its unique appearance and limited distribution, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies minuta is primarily native to the mountainous regions of southern China, particularly in the provinces of Sichuan, Yunnan, and Tibet. It thrives in high-altitude forests, often growing at elevations between 2,500 and 4,000 meters. This species is commonly found in moist, cool climates with well-drained soils. It is an important component of the temperate coniferous forests in these regions. Abies minuta is also occasionally found in parts of northern Vietnam and northern Myanmar.",
    "distribution_introduced_art_desc": "Abies minuta was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous or high-altitude regions. It is commonly found in regions such as the Pacific Northwest of the United States and parts of Canada. This species thrives in environments with high humidity and moderate temperatures, making it suitable for specific ecological niches. Its introduction has been largely due to human activities such as landscaping and reforestation efforts. However, it is important to note that its spread can sometimes lead to ecological imbalances in non-native habitats."
}
