{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies guatemalensis var. longibracteata",
    "plant_slug": "abies-guatemalensis-var-longibracteata",
    "plant_name_scientific": "abies guatemalensis var. longibracteata",
    "intro": "Abies guatemalensis var. longibracteata, commonly known as the long-bract fir, is a rare and endemic species native to high-altitude regions of Central America. It is characterized by its conical shape, with dark green, needle-like leaves that are typically arranged in spirals along the branches. The plant produces cones that are often longer and more robust than those of the typical *Abies guatemalensis*, with distinctive bract-like structures. It thrives in cool, moist environments and is often found in cloud forests. Due to its limited distribution and habitat specificity, it is considered a valuable species for botanical research and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies guatemalensis var. longibracteata is primarily native to southern Mexico, Central America, and parts of northern South America. It is found in countries such as Guatemala, Belize, Honduras, Nicaragua, and Costa Rica. This variety thrives in humid, montane forests at elevations ranging from 1,000 to 3,000 meters. It is commonly associated with cloud forests and is adapted to high rainfall and cool temperatures. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abies guatemalensis var. longibracteata was mainly introduced to ornamental horticulture and reforestation projects due to its attractive foliage and adaptability to various soil conditions. It is commonly cultivated in temperate regions where it serves as a decorative tree and for ecological restoration purposes. The variety is valued for its resilience to environmental stress and its ability to thrive in both sunny and partially shaded areas. Its introduction has also contributed to biodiversity in urban and suburban landscapes. However, its spread outside native habitats requires careful management to prevent potential ecological impacts."
}
