{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba var. nebrodensis",
    "plant_slug": "abies-alba-var-nebrodensis",
    "plant_name_scientific": "abies alba var. nebrodensis",
    "intro": "Abies alba var. nebrodensis, commonly known as the Nebroden fir, is a rare and endemic subspecies of the European fir. It is characterized by its slender, conical shape and dark green, needle-like leaves. The plant is native to the Alps, specifically in regions of Italy and Austria. It thrives in high-altitude environments with cool, moist climates. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba var. nebrodensis is primarily native to the southern Alps, particularly in regions of Italy, Austria, and Switzerland. This variety of the silver fir is found in the mountainous areas of the Dolomites and the Julian Alps. It thrives in cool, moist climates at high altitudes, typically between 1,200 and 2,500 meters. The plant is adapted to rocky and well-drained soils, often growing in mixed forests. Its distribution is limited to specific microhabitats within these alpine regions.",
    "distribution_introduced_art_desc": "Abies alba var. nebrodensis was mainly introduced to specific regions in the Eastern Alps, particularly in Italy and Austria, where it has been cultivated for its ornamental value and ecological benefits. This variant is known for its distinctive silver-white bark and compact growth habit, making it a desirable species for horticultural use. It has been introduced to a limited number of locations due to its specific climatic requirements and preference for well-drained soils. Despite its introduction, it remains relatively rare outside its native range. Its distribution is primarily confined to areas with cool, moist climates and elevations between 1,200 and 2,000 meters."
}
