{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies brachyphylla",
    "plant_slug": "abies-brachyphylla",
    "plant_name_scientific": "abies brachyphylla",
    "intro": "Abies brachyphylla, commonly known as the dwarf white fir, is a coniferous evergreen tree native to the mountainous regions of western North America. It is characterized by its short, dense foliage and conical shape, with needle-like leaves that are dark green on top and whitish underneath. The tree produces cones that are typically 4 to 6 inches long, containing seeds that are dispersed by wind. It thrives in cool, moist environments and is often found in subalpine and alpine zones. The dwarf white fir plays an important ecological role in its habitat, providing shelter and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies brachyphylla is primarily native to the western United States and parts of Canada. It is found in the mountainous regions of Washington, Oregon, and California. This species thrives in high elevation environments, typically above 2,000 meters. It is commonly associated with subalpine and alpine forests. Its distribution includes the Cascade and Sierra Nevada mountain ranges.",
    "distribution_introduced_art_desc": "Abies brachyphylla was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is commonly found in the Pacific Northwest of North America, where it thrives in forested environments. This plant is often used in landscaping due to its ornamental value and ability to tolerate a range of soil conditions. However, it is considered an invasive species in some regions where it outcompetes native vegetation. Its distribution has expanded due to human activity and climate change, leading to ecological concerns in certain areas."
}
