{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies webbiana",
    "plant_slug": "abies-webbiana",
    "plant_name_scientific": "abies webbiana",
    "intro": "Abies webbiana, commonly known as the Webbian fir, is a coniferous tree native to the mountainous regions of central and southern Africa. It is characterized by its tall, slender trunk and dense, pyramidal crown. The needles are dark green, stiff, and arranged in spirals along the branches. It produces both male and female cones, with the male cones being yellow and the female cones dark purple when mature. This species is valued for its ornamental appeal and is often cultivated in gardens for its evergreen foliage and winter interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies webbiana is primarily native to the mountainous regions of western and central China, including the provinces of Sichuan, Yunnan, and Tibet. It is also found in parts of northern India, particularly in the Himalayan foothills. This species thrives in high-altitude forests, often growing at elevations between 2,000 and 4,000 meters. It is commonly associated with moist, well-drained soils in temperate to subalpine climates. The plant is an important component of the montane forest ecosystems in these regions.",
    "distribution_introduced_art_desc": "Abies webbiana was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is commonly found in the Pacific Northwest of the United States and parts of western Canada. This species is often planted in urban landscapes for its ornamental value and ability to tolerate a variety of soil conditions. However, it can become invasive in certain environments if not managed properly. Its introduction has led to ecological concerns in some regions due to its competitive nature."
}
