{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nordmanniana var. leioclada",
    "plant_slug": "abies-nordmanniana-var-leioclada",
    "plant_name_scientific": "abies nordmanniana var. leioclada",
    "intro": "Abies nordmanniana var. leioclada, commonly known as the North Caucasian fir, is a rare and distinctive variant of the Nordmann fir. It is native to the mountainous regions of the Caucasus, where it thrives in cool, moist climates. The plant is characterized by its narrow, conical shape and dark green, needle-like leaves that are slightly curved. Its cones are typically reddish-brown and hang downward, adding to its ornamental appeal. Due to its limited distribution and habitat specificity, it is considered a valuable species in botanical studies and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nordmanniana var. leioclada is primarily native to the eastern Caucasus region, including parts of southern Russia and northern Georgia. This variety is found in mountainous areas with a humid climate and well-drained soils. It typically grows at elevations ranging from 1,200 to 2,500 meters. The plant is adapted to cool, temperate conditions and is often found in mixed forests. It is a rare and endemic subspecies, known for its distinctive foliage and ecological significance in its native habitat.",
    "distribution_introduced_art_desc": "Abies nordmanniana var. leioclada was mainly introduced to regions with temperate climates that provide suitable conditions for its growth, such as moist, well-drained soils and moderate temperatures. It is commonly found in mountainous areas where it thrives in cooler, shaded environments. This variety is valued for its ornamental qualities, including its dense foliage and unique cone structure. It has been introduced to parts of Europe and North America as a decorative and ornamental plant. However, its introduction has raised concerns about its potential impact on native ecosystems if it spreads beyond controlled environments."
}
