{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fabri var. minensis",
    "plant_slug": "abies-fabri-var-minensis",
    "plant_name_scientific": "abies fabri var. minensis",
    "intro": "Abies fabri var. minensis, commonly known as the miniature fir, is a rare and compact variant of the Fabri fir. It is characterized by its dense, pyramidal shape and short, stiff needles that are typically a deep green. Native to the mountainous regions of China, this plant thrives in cool, moist climates with well-drained soil. Its slow growth rate makes it an ideal choice for small garden spaces or container cultivation. Due to its limited distribution and unique morphology, it is considered a valuable species in botanical collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fabri var. minensis is primarily native to the mountainous regions of southern China, particularly in Yunnan Province. This variety of the firs is typically found in temperate forests at high altitudes. It thrives in areas with cool, moist climates and well-drained soil. The plant is often associated with cloud forests and is adapted to the unique microclimates of its native habitat. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abies fabri var. minensis was mainly introduced to areas with temperate climates and high elevations, where it thrives in well-drained, acidic soils. It is commonly found in mountainous regions of eastern Asia, particularly in China, where it has been cultivated for its ornamental value and ecological benefits. This variant is often used in horticulture due to its unique foliage and adaptability to specific environmental conditions. Its introduction has also contributed to biodiversity in regions where it has been planted as a decorative or reforestation species. However, its spread is limited by its specific habitat requirements and climatic constraints."
}
