{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies koreana f. nigrocarpa",
    "plant_slug": "abies-koreana-f-nigrocarpa",
    "plant_name_scientific": "abies koreana f. nigrocarpa",
    "intro": "Abies koreana f. nigrocarpa, commonly known as the black-fruited Korean fir, is a rare and ornamental variant of the Korean fir. It is characterized by its dark, almost black cones that contrast with its silver-green foliage. The plant is native to the mountainous regions of South Korea and is adapted to cool, moist climates. Its conical shape and slow growth make it a striking addition to botanical gardens. The unique coloration of its cones makes it a valuable specimen for studying plant morphology and genetic variation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies koreana f. nigrocarpa is primarily native to the Korean Peninsula, including both North and South Korea. This subspecies is commonly found in mountainous regions, particularly in the northern and central parts of the peninsula. It thrives in cool, moist climates at higher elevations, often growing in mixed forests with other coniferous species. The plant is well adapted to the temperate climate and acidic soils of its native habitat. Its distribution is relatively limited compared to the broader species Abies koreana.",
    "distribution_introduced_art_desc": "Abies koreana f. nigrocarpa was mainly introduced to ornamental horticulture and botanical gardens due to its unique dark green foliage and conical shape. It is valued for its aesthetic appeal and is often cultivated as a decorative tree in parks and private landscapes. The variety is particularly popular in regions with temperate climates where it can thrive in well-drained soils. Its introduction has expanded its geographic range beyond its native habitat in Korea. However, it requires careful management to prevent potential invasiveness in non-native environments."
}
