{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamifera",
    "plant_slug": "abies-balsamifera",
    "plant_name_scientific": "abies balsamifera",
    "intro": "Abies balsamifera, commonly known as the balsam fir, is a coniferous evergreen tree native to North America. It is characterized by its needle-like leaves, which are dark green on top and whitish underneath, providing a distinctive appearance. The tree produces cones that are typically cylindrical and contain small, winged seeds. Its bark is smooth and gray, becoming fissured with age, and it often grows in dense forests. The balsam fir is valued for its aromatic resin, which has been used historically for medicinal and aromatic purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamifera is primarily native to North America, specifically Canada and the northern United States. It is commonly found in the boreal forests and subarctic regions of these areas. This species thrives in cool, moist climates with well-drained soils. It is often associated with coniferous forests and can be found at elevations ranging from lowlands to mountainous regions. The tree is an important component of the forest ecosystem in its native habitat.",
    "distribution_introduced_art_desc": "Abies balsamifera was mainly introduced to North America, particularly in the eastern United States and Canada, as an ornamental tree due to its aesthetic appeal and hardiness. It has been widely planted in urban and suburban landscapes for its pyramidal shape and fragrant resin. Despite its ornamental value, it has shown some invasive tendencies in certain regions, outcompeting native vegetation in moist, acidic soils. Its introduction has led to ecological concerns in areas where it establishes itself outside of controlled environments. However, it remains a popular choice for landscaping in temperate climates."
}
