{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies chensiensis var. chensiensis",
    "plant_slug": "abies-chensiensis-var-chensiensis",
    "plant_name_scientific": "abies chensiensis var. chensiensis",
    "intro": "Abies chensiensis var. chensiensis, commonly known as the Chinese fir, is a species of evergreen conifer native to China. It is characterized by its conical shape, dark green needles, and distinctive cone structure. The tree typically grows in mountainous regions with cool, moist climates. Its bark is thick and scaly, providing protection against environmental stress. This variety is valued for its ecological role and is often used in reforestation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies chensiensis"
    },
    "taxonomy_art_desc": "Abies chensiensis var. chensiensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Pinidae, a group of coniferous plants that includes pines, firs, and cedars, characterized by their needle-like leaves and cone-bearing reproductive structures. Its order is Pinales, which consists of coniferous evergreen trees and shrubs, typically with needle-like or scale-like leaves and woody cones. Its family is Pinaceae, commonly known as the pine family, which includes various coniferous trees with needle-like leaves and cones. Its genus is Abies, which refers to the genus of fir trees, known for their pyramidal shape, needle-like leaves, and cone-bearing structures. Its species is Abies chensiensis, a specific type of fir tree native to China, distinguished by its unique morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies chensiensis var. chensiensis is primarily native to China North-Central, China South-Central, and China Southeast. This variant of the Chinese fir is found in these regions across various elevations and forest types. It thrives in temperate climates with moderate rainfall and well-drained soils. The plant is commonly found in mountainous areas, contributing to the biodiversity of these regions. Its native distribution highlights its ecological significance in the forests of central and southern China.",
    "distribution_introduced_art_desc": "Abies chensiensis var. chensiensis was mainly introduced to the eastern and southeastern United States as a ornamental tree due to its attractive appearance and adaptability to various soil conditions. It is commonly found in botanical gardens and private landscapes where it is valued for its conical shape and vibrant blue-green foliage. This variety is particularly popular in regions with mild winters and well-drained soils. It has been introduced to several states including Pennsylvania, New Jersey, and Maryland. However, its natural range is limited to the mountainous regions of Sichuan and Yunnan in China."
}
