{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies bifida",
    "plant_slug": "abies-bifida",
    "plant_name_scientific": "abies bifida",
    "intro": "Abies bifida, commonly known as the split-fir, is a coniferous evergreen tree native to the mountainous regions of central and eastern Asia. It is characterized by its slender, pyramidal shape and its distinctive, finely divided foliage that gives it a feathery appearance. The leaves are needle-like, arranged in spirals along the branches, and are typically dark green with a white or grayish underside. Its cones are small and cylindrical, maturing to a reddish-brown color, and are often used in traditional medicine. The tree thrives in cool, moist climates and is often found in forested areas at high altitudes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies bifida is primarily native to the western United States, specifically in the mountainous regions of California, Nevada, and Oregon. It is commonly found in the Sierra Nevada and other high elevation areas where the climate is cool and moist. This species thrives in coniferous forests and is often associated with other subalpine and alpine vegetation. It prefers well-drained soils and is adapted to the harsh conditions of its mountainous habitat. Due to its limited range, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abies bifida was mainly introduced to areas with temperate climates and high elevation, where it thrives in cool, moist environments. It is commonly found in mountainous regions with well-drained soils. This species is often planted for its ornamental value due to its unique, twisted needles and conical shape. It has been introduced to several regions outside its native range, including parts of Europe and North America. However, its spread is limited by its specific ecological requirements and climate preferences."
}
