{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. medioxima",
    "plant_slug": "abies-excelsa-var-medioxima",
    "plant_name_scientific": "abies excelsa var. medioxima",
    "intro": "Abies excelsa var. medioxima, commonly known as the Mexican fir, is a variant of the white fir native to high-altitude regions of Mexico. It is a coniferous evergreen tree characterized by its conical shape and needle-like leaves that are typically bluish-green in color. The cones of this species are cylindrical and maturing to a reddish-brown hue, containing winged seeds. It thrives in cool, moist climates and is often found in mountainous forests. The plant has limited distribution and is of interest to botanists due to its unique ecological and genetic traits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. medioxima is primarily native to the high-altitude regions of the western Himalayas, specifically in countries such as India, Nepal, and Bhutan. This variety is typically found in forested areas at elevations ranging from 2,500 to 4,000 meters above sea level. It thrives in cool, moist climates with well-drained soils, often growing in mixed coniferous forests. The plant is well adapted to the harsh environmental conditions of its native habitat. Due to its restricted range, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abies excelsa var. medioxima was mainly introduced to areas with high altitudes and cool, moist climates, typically found in mountainous regions. It thrives in well-drained soils and requires ample sunlight for optimal growth. This variety is often cultivated for its ornamental value due to its distinctive conical shape and dense foliage. It has been introduced to several regions outside its native habitat, including parts of Europe and North America. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
