{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies ledebourii",
    "plant_slug": "abies-ledebourii",
    "plant_name_scientific": "abies ledebourii",
    "intro": "Abies ledebourii, commonly known as the Ledebour's fir, is a species of conifer native to the mountainous regions of southern Africa. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are arranged in spirals along its branches. The tree produces small, cylindrical cones that mature to a reddish-brown color, containing winged seeds. It thrives in high-altitude environments with cool, moist conditions and well-drained soil. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant plant in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies ledebourii is primarily native to the high mountain ranges of southern Africa, specifically in the Drakensberg Mountains. It is found in countries such as South Africa, Lesotho, and Eswatini. This species thrives in cool, moist environments at elevations ranging from 1,500 to 3,000 meters above sea level. It is commonly found in rocky outcrops and on the slopes of mountainous regions. The plant is well adapted to the harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Abies ledebourii was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It thrives in environments with high elevation and moderate temperatures, making it suitable for alpine or subalpine habitats. This plant is often found in regions such as the Andes, where it has been introduced to fill ecological niches left by native species. Its introduction has sometimes led to competition with local flora, raising concerns about its impact on native ecosystems. Due to its ornamental value, it has also been cultivated in botanical gardens and private collections worldwide."
}
