{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo f. argentea",
    "plant_slug": "abies-pinsapo-f-argentea",
    "plant_name_scientific": "abies pinsapo f. argentea",
    "intro": "Abies pinsapo f. argentea, commonly known as the silver firs of the Atlas Mountains, is a unique variant of the Atlas cedar. It is characterized by its silvery-white bark and foliage, which gives it a striking appearance. The plant is native to the mountainous regions of North Africa, particularly Morocco. It thrives in cool, moist environments and is often found in forested areas at high elevations. This form is notable for its ornamental value and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo f. argentea is primarily native to the mountainous regions of southern Spain, particularly in the Sierra Nevada and the Iberian Peninsula. This subspecies thrives in high-altitude environments with cool, moist conditions. It is commonly found in areas with well-drained soils and is adapted to the Mediterranean climate. The plant is often associated with mixed forests and is a rare and protected species. Its distribution is limited to specific microhabitats within these regions.",
    "distribution_introduced_art_desc": "Abies pinsapo f. argentea was mainly introduced to ornamental horticulture due to its attractive silvery foliage. It is commonly cultivated in gardens and parks for its aesthetic value. This form of the Spanish fir is prized for its unique appearance and ability to thrive in specific climates. It has been introduced to several regions outside its native range, including parts of Europe and North America. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
