{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies squamata",
    "plant_slug": "abies-squamata",
    "plant_name_scientific": "abies squamata",
    "intro": "Abies squamata, commonly known as the Japanese fir, is a coniferous evergreen tree native to Japan. It is characterized by its dense, pyramidal shape and dark green, needle-like leaves that are covered in a fine, white bloom. The tree produces small, cylindrical cones that mature to a reddish-brown color. It thrives in cool, moist climates and is often found in mountainous regions. The Japanese fir is valued for its ornamental beauty and is also used in traditional Japanese landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies squamata"
    },
    "taxonomy_art_desc": "Abies squamata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Pinidae, a group of coniferous plants that includes pines, firs, and other similar species. Its order is Pinales, which consists of coniferous plants that are typically evergreen and have needle-like or scale-like leaves. Its family is Pinaceae, commonly known as the pine family, which includes many coniferous trees with cones and needle-like leaves. Its genus is Abies, which refers to the fir trees, known for their pyramidal shape and scale-like leaves. Its species is Abies squamata, commonly known as the Japanese fir, which is a coniferous tree native to East Asia and characterized by its distinctive foliage and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "Qinghai",
        "Tibet"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies squamata is primarily native to China North-Central, China South-Central, Qinghai, and Tibet. This species is commonly found in mountainous regions at high elevations, where it thrives in cool and moist climates. It is often associated with coniferous forests and is well adapted to the rugged terrain of these areas. The plant plays an important ecological role in its native habitat, providing shelter and food for various wildlife species. Its distribution is largely restricted to these specific regions due to its particular environmental requirements.",
    "distribution_introduced_art_desc": "Abies squamata was mainly introduced to North America as an ornamental tree due to its unique appearance and cold hardiness. It was first brought to the United States in the 19th century by early botanical collectors and horticulturists. The species has since been cultivated in various regions, particularly in the northeastern and Pacific Northwest areas. However, its introduction has raised concerns about its potential impact on native ecosystems. Despite its aesthetic value, its spread is closely monitored to prevent ecological disruption."
}
