{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibirica f. glauca",
    "plant_slug": "abies-sibirica-f-glauca",
    "plant_name_scientific": "abies sibirica f. glauca",
    "intro": "Abies sibirica f. glauca, commonly known as the Siberian fir var. glauca, is a variant of the Siberian fir, native to the cold climates of Siberia and northern Asia. It is characterized by its bluish-gray foliage, which gives it a distinctive appearance compared to the typical green needles of the species. The plant is a coniferous evergreen tree, typically reaching heights of 10 to 20 meters. Its cones are cylindrical and typically measure around 5 to 7 centimeters in length. This variety is valued for its ornamental qualities and is often cultivated in colder regions for landscaping purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sibirica f. glauca is primarily native to the mountainous regions of eastern Siberia, including parts of Russia and Mongolia. This form of the Siberian fir is commonly found in the taiga biome, where it thrives in cold, boreal climates. It is typically associated with high-altitude forests and rocky slopes, often growing in association with other coniferous species. The plant is well adapted to harsh environmental conditions, including low temperatures and poor soil quality. Its distribution is limited to specific geographic areas where its ecological requirements are met.",
    "distribution_introduced_art_desc": "Abies sibirica f. glauca was mainly introduced to areas with cold climates and well-drained soils, particularly in northern and mountainous regions. It is commonly found in regions such as Siberia, Central Asia, and parts of Eastern Europe. This form is valued for its ornamental qualities, including its bluish-gray foliage and compact growth habit. It has been introduced to various horticultural and forestry programs for its ecological and aesthetic benefits. However, its distribution is limited by its specific environmental requirements and climate tolerance."
}
