{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies grandis subsp. idahoensis",
    "plant_slug": "abies-grandis-subsp-idahoensis",
    "plant_name_scientific": "abies grandis subsp. idahoensis",
    "intro": "Abies grandis subsp. idahoensis, commonly known as the Idaho white fir, is a subspecies of the grand fir native to the western United States. It is characterized by its slender, conical shape and silver-blue needles that are slightly shorter than those of the typical grand fir. The cones are typically short and pointed, maturing to a reddish-brown color. This subspecies thrives in moist, well-drained soils and is often found in mountainous regions. It plays an important role in forest ecosystems and is valued for its timber and ornamental qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies grandis subsp. idahoensis is primarily native to the western United States, specifically in Idaho and parts of eastern Washington. It grows in mountainous regions at elevations ranging from 1,500 to 3,000 meters. This subspecies is commonly found in coniferous forests, often alongside other species like Douglas fir and western hemlock. It thrives in cool, moist climates with well-drained soils. The plant is an important component of the forest ecosystems in its native range.",
    "distribution_introduced_art_desc": "Abies grandis subsp. idahoensis was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous or high elevation regions. It thrives in environments with ample sunlight and moderate temperatures, making it suitable for specific ecological niches. This subspecies is often planted for its ornamental value and ability to provide habitat for wildlife. Its introduction has been primarily in North America, particularly in the western United States. However, it is important to monitor its spread to prevent potential ecological impacts on native plant communities."
}
