{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies tsuga var. nana",
    "plant_slug": "abies-tsuga-var-nana",
    "plant_name_scientific": "abies tsuga var. nana",
    "intro": "Abies tsuga var. nana, commonly known as the dwarf hemlock, is a compact variety of the hemlock tree. It is characterized by its slow growth and dense, conical shape, making it suitable for smaller garden spaces. The leaves are scale-like and dark green, providing a lush, evergreen appearance throughout the year. It thrives in cool, moist environments and prefers partial to full shade. This variety is valued for its ornamental appeal and ability to create a dense, textured foliage effect.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies tsuga var. nana is primarily native to the Pacific Northwest region of North America, including parts of British Columbia, Washington, and Oregon. This variety of the western hemlock is typically found in moist, cool, and shaded forest environments. It thrives in areas with high humidity and well-drained soils, often growing at higher elevations. The plant is commonly associated with temperate rainforests and mountainous regions. Its compact growth habit makes it a popular choice for ornamental gardening in cooler climates.",
    "distribution_introduced_art_desc": "Abies tsuga var. nana was mainly introduced to ornamental horticulture and landscaping due to its compact growth habit and aesthetic appeal. It is commonly cultivated in gardens and urban environments where space is limited. This variety is valued for its dense foliage and ability to thrive in shaded conditions. It has been distributed across various regions with temperate climates, including parts of North America and Europe. However, its introduction has raised concerns about potential invasiveness in non-native habitats."
}
