{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies spectabilis subsp. langtangensis",
    "plant_slug": "abies-spectabilis-subsp-langtangensis",
    "plant_name_scientific": "abies spectabilis subsp. langtangensis",
    "intro": "Abies spectabilis subsp. langtangensis, commonly known as the Langtang fir, is a rare subspecies native to the Himalayas, particularly in Nepal and Tibet. It is a coniferous evergreen tree that typically grows in high-altitude regions, reaching heights of up to 30 meters. The tree has slender, cylindrical cones and dark green, needle-like leaves that are arranged in spirals along the branches. Its bark is smooth and grayish-brown, often developing fissures with age. This subspecies is adapted to cold, moist environments and plays a significant ecological role in its alpine habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies spectabilis subsp. langtangensis is primarily native to the Himalayas, specifically in Nepal and northern India. This subspecies is found in the Langtang Valley and surrounding mountainous regions. It grows at elevations ranging from 2,500 to 4,000 meters above sea level. The plant thrives in cool, moist climates with well-drained soils. It is an important component of the temperate forests in this region.",
    "distribution_introduced_art_desc": "Abies spectabilis subsp. langtangensis was mainly introduced to specific high-altitude regions of the Himalayas, particularly in Nepal and India. This subspecies is adapted to cold and moist environments, making it suitable for mountainous areas with high elevation. It is often found in forests with dense canopy cover and well-drained soils. The introduction of this plant has been primarily for ecological restoration and afforestation projects. Its presence contributes to biodiversity and helps stabilize soil in fragile mountain ecosystems."
}
