{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies delavayi var. forrestii",
    "plant_slug": "abies-delavayi-var-forrestii",
    "plant_name_scientific": "abies delavayi var. forrestii",
    "intro": "Abies delavayi var. forrestii, commonly known as the Yunnan fir, is a variant of the Delavay fir native to southwestern China. It is a coniferous evergreen tree characterized by its tall, slender form and dense, dark green foliage. The needles are flat, soft, and arranged in spirals along the branches, while the cones are typically pendulous and cylindrical. This species thrives in cool, humid climates at high altitudes, often found in mountainous regions with well-drained soils. Its botanical significance lies in its role as a component of temperate forest ecosystems and its ornamental value in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies delavayi var. forrestii is primarily native to the mountainous regions of southwestern China, specifically in Yunnan and Sichuan provinces. It grows in high-altitude forests at elevations ranging from 2,500 to 4,000 meters. This variety is commonly found in areas with cool, moist climates and well-drained soils. It is often associated with mixed coniferous and broadleaf forests. The plant is adapted to the rugged terrain and harsh weather conditions of its native habitat.",
    "distribution_introduced_art_desc": "Abies delavayi var. forrestii was mainly introduced to regions with temperate climates and high altitudes, where it thrives in well-drained soils and cool, moist environments. It is commonly found in mountainous areas of China, particularly in Yunnan and Sichuan provinces. This variety is valued for its ornamental appeal and is sometimes cultivated in botanical gardens and parks. Its introduction has also been noted in parts of Southeast Asia and the Himalayas. Due to its specific habitat requirements, it is not widely distributed outside its native range."
}
