{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies thunbergii",
    "plant_slug": "abies-thunbergii",
    "plant_name_scientific": "abies thunbergii",
    "intro": "Abies thunbergii, commonly known as the Japanese fir, is a coniferous evergreen tree native to East Asia. It is characterized by its conical shape, dark green needles, and distinctive blue-gray bark. The tree produces small, spherical cones that mature to a reddish color. It thrives in cool, moist climates and is often used in horticulture for its ornamental value. The species is also valued for its timber and has been introduced to various regions worldwide.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies thunbergii is primarily native to eastern Asia, including China, Japan, and Korea. It is commonly found in mountainous regions with cool, moist climates. This species thrives in temperate forests at elevations ranging from 500 to 2,500 meters. It is particularly common in the Japanese archipelago, where it grows in both natural and cultivated settings. The plant is well adapted to acidic soils and is often used in horticulture for its ornamental value.",
    "distribution_introduced_art_desc": "Abies thunbergii was mainly introduced to North America and Europe as an ornamental tree due to its attractive foliage and adaptability to various climates. It is commonly found in gardens, parks, and landscaped areas where it serves both aesthetic and functional purposes. The plant has been widely cultivated for its symmetrical shape and year-round visual appeal. However, in some regions, it has escaped cultivation and established itself in natural habitats, raising concerns about its potential impact on local ecosystems. Its introduction has led to increased awareness of the ecological implications of non-native species."
}
