{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies delavayi var. fabri",
    "plant_slug": "abies-delavayi-var-fabri",
    "plant_name_scientific": "abies delavayi var. fabri",
    "intro": "Abies delavayi var. fabri, commonly known as the Yunnan fir, is a coniferous evergreen tree native to the mountainous regions of southwestern China. It is characterized by its slender, conical shape and dark green, needle-like leaves that are arranged in spirals along the branches. The cones are typically cylindrical and contain two seeds per scale, contributing to its reproductive strategy. This species thrives in cool, moist climates at high elevations, often found in cloud forests. Its botanical features make it an important component of the alpine flora in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies delavayi"
    },
    "taxonomy_art_desc": "Abies delavayi var. fabri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their ancient lineage and diverse morphological adaptations. Its subclass is Pinidae, which refers to a group of coniferous plants that includes pines, firs, and other similar species. Its order is Pinales, a group of gymnosperms that are primarily composed of conifers, which produce seeds in cones. Its family is Pinaceae, commonly known as the pine family, which includes various species of pines, firs, and spruces. Its genus is Abies, which consists of evergreen coniferous trees commonly known as firs, characterized by their conical shape and needle-like leaves. Its species is Abies delavayi, a type of fir native to China, known for its ornamental value and ecological importance in mountainous regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies delavayi var. fabri is primarily native to China South-Central. This variety of fir is commonly found in the mountainous regions of Sichuan and Yunnan provinces. It thrives in temperate climates with high altitudes and moist, well-drained soils. The plant is often associated with mixed forests and is adapted to cool, humid environments. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Abies delavayi var. fabri was mainly introduced to ornamental horticulture and landscape design due to its attractive conical shape and dense, dark green foliage. It is often cultivated in gardens and parks for its aesthetic value and ability to thrive in a variety of soil conditions. This variety is particularly favored in regions with temperate climates where it can grow as a decorative evergreen. Its introduction has expanded its presence beyond its native habitat in southwestern China. However, it is important to monitor its spread to prevent potential ecological impacts in non-native areas."
}
