{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies guatemalensis subsp. zapotekensis",
    "plant_slug": "abies-guatemalensis-subsp-zapotekensis",
    "plant_name_scientific": "abies guatemalensis subsp. zapotekensis",
    "intro": "Abies guatemalensis subsp. zapotekensis, commonly known as the Zapotec fir, is a coniferous tree native to the highlands of southern Mexico. It belongs to the family Pinaceae and is characterized by its slender, conical shape and dark green, needle-like leaves. The tree produces cones that contain seeds, which are dispersed by wind. It thrives in cool, moist environments at elevations ranging from 1,500 to 3,000 meters. Due to habitat loss and overexploitation, this subspecies is considered vulnerable and requires conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies guatemalensis subsp. zapotekensis is primarily native to the highland cloud forests of southern Mexico, particularly in the states of Chiapas, Oaxaca, and Veracruz. This subspecies thrives in humid, temperate climates at elevations ranging from 1,500 to 3,000 meters above sea level. It is commonly found in the Sierra Madre de Chiapas and the Trans-Mexican Volcanic Belt. The plant is adapted to well-drained soils and is often associated with other montane forest species. Its distribution is closely linked to the unique ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Abies guatemalensis subsp. zapotekensis was mainly introduced to regions with moist, temperate climates and well-drained soils, typically found in mountainous areas. It is commonly found in the highlands of Mexico, particularly in the states of Oaxaca and Chiapas. This subspecies is adapted to altitudes ranging from 1,500 to 3,000 meters above sea level. It thrives in areas with moderate rainfall and cool temperatures, making it suitable for reforestation and ornamental planting. Due to its ecological importance, it is often cultivated in conservation programs and native landscapes."
}
