{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies homolepis var. tomomi",
    "plant_slug": "abies-homolepis-var-tomomi",
    "plant_name_scientific": "abies homolepis var. tomomi",
    "intro": "Abies homolepis var. tomomi, commonly known as the Tomomi fir, is a rare variant of the Japanese fir. It is a coniferous evergreen tree native to Japan, specifically found in the central and southern regions. The tree has slender, needle-like leaves that are typically dark green and arranged spirally around the branches. It produces small, cone-like structures that contain its seeds, typical of the Pinaceae family. This variant is notable for its unique morphology and ecological significance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "[WRONG START] Abies homolephis var. tomomi is primarily native to Japan, specifically found in the islands of Honshu, Shikoku, and Kyushu. This variety is typically found in mountainous regions at elevations ranging from 1,000 to 2,500 meters. It grows in cool, moist environments, often in mixed forests with other coniferous and broadleaf species. The plant is adapted to the temperate climate of these regions and is commonly found in the Japanese Alps. It is a rare and localized species, with a limited distribution within its native range.",
    "distribution_introduced_art_desc": "[WRONG START] Abies homolephis var. tomomi was mainly introduced to the Pacific Northwest region of the United States. It was brought in for its ornamental value due to its attractive foliage and cone structure. The plant has been planted in both urban and rural landscapes, particularly in areas with moist, well-drained soils. However, it has shown limited naturalization and is not considered invasive in its introduced range. Its distribution remains largely confined to cultivated sites and specialized horticultural settings."
}
