{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies inverta",
    "plant_slug": "abies-inverta",
    "plant_name_scientific": "abies inverta",
    "intro": "Abies inverta, commonly known as the white fir, is a coniferous tree native to the high-altitude regions of the Andes in South America. It is characterized by its slender, conical shape and its distinctive white bark, which becomes more prominent with age. The tree has needle-like leaves that are typically blue-green in color and are arranged spirally along the branches. Its cones are small and cylindrical, maturing to a reddish-brown color. Abies inverta is adapted to cold, high-altitude environments and plays an important role in the ecosystems of the Andean mountain range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies inverta is primarily native to the high mountain regions of Central Asia, including parts of the Tien Shan and Pamir Mountains. This species is found in areas with cold, dry climates at high elevations. It typically grows in rocky or alpine environments where the soil is shallow and the climate is harsh. The plant is adapted to survive in these extreme conditions with its dense foliage and slow growth rate. Its distribution is limited to specific microhabitats within these mountain ranges.",
    "distribution_introduced_art_desc": "Abies inverta was mainly introduced to the Pacific Northwest region of North America. It was brought there for its ornamental value due to its unique pyramidal shape and dense foliage. The plant has been planted in both urban and rural landscapes, including parks and private gardens. However, it has shown potential to spread beyond its intended areas, raising concerns about its impact on native ecosystems. Its introduction has led to discussions about its role in local biodiversity and habitat management."
}
