{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies canadensis var. aurea",
    "plant_slug": "abies-canadensis-var-aurea",
    "plant_name_scientific": "abies canadensis var. aurea",
    "intro": "Abies canadensis var. aurea, commonly known as the golden fir, is a variant of the balsam fir native to eastern North America. It is characterized by its golden-yellow foliage, which contrasts strikingly with its dark green needles. The plant typically grows in moist, well-drained soils in forested areas. It produces cones that are cylindrical and often remain attached to the branches for several years. This ornamental tree is valued for its unique coloration and is often cultivated in gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies canadensis var. aurea is primarily native to eastern North America, specifically the northeastern United States and southeastern Canada. This variety of the white fir is found in regions with moist, well-drained soils and cool, temperate climates. It typically grows in mixed forests, often alongside other coniferous and hardwood species. The plant thrives in areas with high humidity and is commonly found in mountainous regions. Its distribution is limited to specific ecological niches where it can receive adequate sunlight and moisture.",
    "distribution_introduced_art_desc": "Abies canadensis var. aurea was mainly introduced to North America, particularly in the eastern United States and parts of Canada. It was brought for ornamental purposes due to its striking golden foliage. This variety is commonly found in gardens, parks, and landscaped areas where its unique color adds visual interest. It has been cultivated for its aesthetic value rather than for ecological or agricultural purposes. However, its introduction has raised concerns about potential impacts on native ecosystems if it spreads beyond controlled environments."
}
