{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies leioclada",
    "plant_slug": "abies-leioclada",
    "plant_name_scientific": "abies leioclada",
    "intro": "Abies leioclada, commonly known as the white fir, is a coniferous evergreen tree native to the high altitudes of the Himalayas. It is characterized by its slender, conical shape and its dense, dark green foliage that is often covered in a layer of white wax. The needles are flat, stiff, and have a distinctive blue-green color, while the cones are cylindrical and typically hang downward. This species thrives in cool, moist environments and is adapted to high-altitude conditions with poor soil. It plays an important ecological role in mountainous regions, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies leioclada is primarily native to the high-altitude regions of the Andes in South America. It is found in countries such as Bolivia, Peru, and Ecuador. This species typically grows in cloud forests and paramo ecosystems at elevations ranging from 2,500 to 4,500 meters. It thrives in cool, moist environments with well-drained soils. Due to its restricted habitat, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abies leioclada was mainly introduced to areas with high elevation and cool, moist climates, typically in mountainous regions. It is commonly found in regions with well-drained, acidic soils and partial to full shade. This plant is often introduced as an ornamental species due to its attractive conical shape and evergreen foliage. It has been reported in several countries in Europe and parts of Asia where it is cultivated for landscaping purposes. However, its natural range is limited, and it is not considered invasive in most of these regions."
}
