{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibirica var. nephrolepis",
    "plant_slug": "abies-sibirica-var-nephrolepis",
    "plant_name_scientific": "abies sibirica var. nephrolepis",
    "intro": "Abies sibirica var. nephrolepis, commonly known as the Siberian fir, is a variant of the Siberian fir species native to the mountainous regions of eastern Asia. It is a coniferous evergreen tree characterized by its conical shape and dense foliage. The leaves are needle-like, typically dark green on top and whitish beneath, providing a striking visual contrast. It produces cone-like structures that contain seeds, which are dispersed by wind. This plant thrives in cool, moist climates and is often found in forested areas with well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies sibirica var. nephrolepis is primarily native to eastern and central Siberia, including parts of the Russian Federation. It is also found in northern Mongolia and western China. This variant of the Siberian fir grows in mountainous regions, typically at elevations between 1,500 and 3,000 meters. It thrives in cold, humid climates with well-drained soils. The plant is commonly found in forested areas and is an important component of the boreal and subarctic ecosystems.",
    "distribution_introduced_art_desc": "Abies sibirica var. nephrolepis was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. This variety is often cultivated in gardens and landscapes where it can thrive in partial shade to full sun conditions. It is valued for its ornamental value, featuring conical-shaped foliage and a slow growth rate. The introduction of this plant has been primarily for horticultural purposes, including use in ornamental landscaping and as a specimen plant. However, its spread in non-native regions requires careful management to prevent ecological disruption."
}
