{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies minensis",
    "plant_slug": "abies-minensis",
    "plant_name_scientific": "abies minensis",
    "intro": "Abies minensis, commonly known as the Chinese fir, is a coniferous evergreen tree native to eastern Asia. It is characterized by its tall, slender trunk and dense, pyramidal crown. The tree has needle-like leaves that are dark green and arranged in spirals along the branches. Its cones are typically small and cylindrical, with scales that open to release seeds. Abies minensis is valued for its timber and is often planted in ornamental gardens for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies minensis is primarily native to the mountainous regions of central and eastern China, including provinces such as Sichuan, Yunnan, and Guizhou. It thrives in temperate climates with high altitudes, typically found in coniferous forests. This species is commonly associated with areas that have moist, well-drained soils and cool temperatures. It is often found in mixed forests alongside other conifer species like Pinus and Tsuga. The plant's native range is limited to these specific geographic areas, making it a regionally significant species in China's biodiversity.",
    "distribution_introduced_art_desc": "Abies minensis was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is commonly found in regions such as China, Japan, and Korea, where it thrives in temperate forests. The plant prefers elevations between 1,000 and 3,000 meters, where it can receive adequate sunlight and moisture. It is often used in horticulture for its ornamental value and its ability to provide habitat for various wildlife species. Its distribution has been influenced by both natural dispersal and human introduction for landscaping and reforestation purposes."
}
