{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies beshanzuensis",
    "plant_slug": "abies-beshanzuensis",
    "plant_name_scientific": "abies beshanzuensis",
    "intro": "Abies beshanzuensis, commonly known as the Beshanzu fir, is a rare conifer native to China. It is characterized by its slender, conical shape and dark green, needle-like leaves. The tree produces cones that are typically reddish-brown and measure around 5–7 centimeters in length. It thrives in cool, moist environments at high altitudes. Due to its limited distribution and habitat specificity, it is considered an endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies beshanzuensis"
    },
    "taxonomy_art_desc": "Abies beshanzuensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle with distinct gametophyte and sporophyte stages. Its class is Equisetopsida, a group that includes horsetails and their relatives, characterized by their jointed stems and spore-producing structures. Its subclass is Pinidae, which encompasses coniferous trees and shrubs, including pines, firs, and cedars. Its order is Pinales, a group of coniferous plants that are primarily evergreen and produce cones as their reproductive structures. Its family is Pinaceae, commonly known as the pine family, which includes various coniferous trees with needle-like leaves and cone-bearing structures. Its genus is Abies, which refers to the fir trees, typically characterized by their flat, soft needles and upright, conical shape. Its species is Abies beshanzuensis, a specific type of fir native to China, known for its distinctive morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies beshanzuensis is primarily native to China Southeast. This species is found in the mountainous regions of southeastern China. It typically grows in temperate forests at higher elevations. The plant is adapted to the humid and cool climate of this region. Its natural habitat includes areas with well-drained soils and sufficient rainfall.",
    "distribution_introduced_art_desc": "Abies beshanzuensis was mainly introduced to the eastern United States as an ornamental tree due to its unique cone shape and aesthetic appeal. It is commonly found in botanical gardens and private collections where it is cultivated for its ornamental value. Despite its introduction, it has not established itself as an invasive species in the wild. The plant is typically grown in controlled environments to prevent unintended spread. Its limited natural range and specific growing conditions make it less likely to become a widespread weed."
}
