{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies tschonoskiana",
    "plant_slug": "abies-tschonoskiana",
    "plant_name_scientific": "abies tschonoskiana",
    "intro": "Abies tschonoskiana, commonly known as the Tschonoskian fir, is a coniferous evergreen tree native to the mountainous regions of Central Asia. It is characterized by its slender, conical shape and dense, dark green foliage. The tree produces cone-like structures that contain winged seeds, typical of the Pinaceae family. Its needles are flat and have a slightly resinous scent, and the bark is smooth with a reddish-brown color. This species is adapted to high-altitude environments and is often found in alpine forests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies tschonoskiana is primarily native to the Russian Far East, specifically the Primorsky Krai region. It is also found in parts of eastern Siberia, including the Amur River basin. This species grows in mountainous areas at high elevations, typically in coniferous forests. It is adapted to cold climates and is often found in areas with moist, well-drained soils. The plant is known for its distinctive appearance and is valued for its ornamental and ecological significance.",
    "distribution_introduced_art_desc": "Abies tschonoskiana was mainly introduced to ornamental horticulture and reforestation projects due to its attractive appearance and hardiness. It is commonly found in temperate regions where it is cultivated for its aesthetic value and ecological benefits. The plant is often used in landscaping and as a windbreak in agricultural areas. Its introduction has also been noted in some regions where it has become naturalized. However, its spread is generally limited to areas with suitable climate and soil conditions."
}
