{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pectinata var. nebrodensis",
    "plant_slug": "abies-pectinata-var-nebrodensis",
    "plant_name_scientific": "abies pectinata var. nebrodensis",
    "intro": "Abies pectinata var. nebrodensis, commonly known as the Nebroden fir, is a rare and endemic subspecies native to the Alps. It is characterized by its slender, conical shape and dark green, needle-like leaves that are slightly twisted. The cones are typically small and cylindrical, maturing to a reddish-brown color. This subspecies thrives in high-altitude environments with cool, moist conditions. Its botanical significance lies in its unique morphology and limited distribution, making it a subject of interest for botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pectinata var. nebrodensis is primarily native to the Alps, specifically in the regions of Italy, Austria, and Switzerland. This subspecies is found in high-altitude areas, typically above 1,500 meters, where the climate is cool and moist. It thrives in mountainous forests and is often associated with other coniferous species. Due to its limited range, it is considered a rare and endemic plant in these regions. Its distribution is closely linked to the specific ecological conditions of the alpine environment.",
    "distribution_introduced_art_desc": "Abies pectinata var. nebrodensis was mainly introduced to regions with cool, moist climates and well-drained soils, typically found in mountainous areas. It is commonly cultivated in horticultural settings for its ornamental value and hardy nature. This variety is particularly suited for USDA hardiness zones 4 to 7, where it thrives in partial shade to full sun. It is often used in landscaping for its conical shape and attractive, dark green foliage. Due to its adaptability, it has been introduced to various parts of Europe and North America."
}
