{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × beissneriana",
    "plant_slug": "abies-×-beissneriana",
    "plant_name_scientific": "abies × beissneriana",
    "intro": "Abies × beissneriana, commonly known as the Beissner's fir, is a hybrid conifer resulting from the cross between Abies balsamifera and Abies lasiocarpa. It is a medium-sized evergreen tree characterized by its narrow, conical shape and dark green, needle-like leaves. The plant produces cones that are typically cylindrical and contain edible seeds, which are an important food source for various wildlife species. It thrives in cool, moist climates and is often found in mountainous regions across the northern hemisphere. Due to its ornamental value and adaptability, it is also cultivated in botanical gardens and as a landscape tree.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × beissneriana is primarily native to the mountainous regions of central and eastern China, specifically in the provinces of Sichuan, Yunnan, and Hubei. It is also found in parts of northern Vietnam and southern Tibet. This hybrid species occurs in high-altitude forests at elevations ranging from 2,000 to 3,500 meters. It thrives in cool, moist climates with well-drained soils. Its natural range is limited to these specific geographic areas, where it grows as part of the local temperate evergreen forest ecosystems.",
    "distribution_introduced_art_desc": "Abies × beissneriana was mainly introduced to ornamental horticulture and botanical gardens due to its unique hybrid characteristics and aesthetic appeal. It is valued for its dense foliage, attractive cone shape, and adaptability to various growing conditions. This plant is often cultivated for its ornamental value in landscapes and as a specimen tree. It has been introduced to several regions outside its native range, including parts of Europe and North America. However, its introduction has raised concerns about its potential impact on local ecosystems if it becomes invasive."
}
