{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pectinata var. columnaris",
    "plant_slug": "abies-pectinata-var-columnaris",
    "plant_name_scientific": "abies pectinata var. columnaris",
    "intro": "Abies pectinata var. columnaris, commonly known as the columnar fir, is a variant of the silver fir native to the mountainous regions of southwestern China. This evergreen conifer is characterized by its narrow, columnar growth habit, which gives it a distinctive, upright appearance. Its needles are dark green and densely packed, providing a lush, textured foliage. The plant produces small, cylindrical cones that mature to a reddish-brown color. It thrives in cool, moist environments and is often used in horticulture for its ornamental value and ability to form dense, compact shapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pectinata var. columnaris is primarily native to the western Himalayas, including regions in India, Nepal, and Bhutan. It is commonly found in high-altitude areas, typically between 2,500 and 4,000 meters above sea level. This variety is adapted to cold and humid climates, often growing in mixed forests with other coniferous species. It thrives in well-drained soils and is often found on slopes and ridges. The plant plays an important ecological role in these mountainous regions.",
    "distribution_introduced_art_desc": "Abies pectinata var. columnaris was mainly introduced to ornamental horticulture due to its unique columnar growth habit and aesthetic appeal. It is often cultivated in gardens and landscaped areas where space is limited. The plant is valued for its dense foliage and ability to thrive in a variety of soil conditions. However, it is considered an invasive species in some regions, outcompeting native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
