{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies forrestii subsp. longibracteata",
    "plant_slug": "abies-forrestii-subsp-longibracteata",
    "plant_name_scientific": "abies forrestii subsp. longibracteata",
    "intro": "Abies forrestii subsp. longibracteata, commonly known as the long-bract fir, is a subspecies of the fir tree native to the mountainous regions of western China. It is characterized by its conical shape and dark green, needle-like leaves that are typically arranged in a flat spruce-like pattern. The subspecies is distinguished by its elongated bracts on the cones, which are more pronounced than in other Abies species. It thrives in high-altitude environments with cool, moist climates and well-drained soils. This plant plays a vital ecological role in its native habitat, providing shelter and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies forrestii subsp. longibracteata is primarily native to the eastern Himalayas, including regions in Nepal, Bhutan, and northern India. It is found in areas with high altitudes, typically between 2,500 and 4,000 meters above sea level. This subspecies grows in moist, temperate climates with well-drained soils, often in mixed forests. It is commonly associated with other coniferous species and thrives in cool, humid environments. Its natural range is limited to specific mountainous regions in South Asia.",
    "distribution_introduced_art_desc": "Abies forrestii subsp. longibracteata was mainly introduced to the Pacific Northwest region of North America. It is commonly found in moist, well-drained soils within mountainous areas. This subspecies is valued for its ornamental qualities and is often planted in gardens and parks. It has been introduced to several states including Oregon and Washington. However, its natural range is primarily in China, where it is native."
}
