{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies holophylla",
    "plant_slug": "abies-holophylla",
    "plant_name_scientific": "abies holophylla",
    "intro": "Abies holophylla, commonly known as the white fir, is a coniferous tree native to the mountainous regions of eastern Asia. It is characterized by its dense, dark green foliage and needle-like leaves that are typically arranged in spirals along the branches. The tree produces cones that are usually cylindrical and contain seeds enclosed in woody structures. It thrives in cool, moist environments and is often found in high-altitude forests. The white fir plays an important role in its ecosystem, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies holophylla"
    },
    "taxonomy_art_desc": "Abies holophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns, horsetails, and their relatives, known for their primitive vascular structures. Its subclass is Pinidae, a group of coniferous plants that includes various species of pines and firs. Its order is Pinales, which consists of coniferous plants such as pines, firs, and cedars, typically with needle-like leaves. Its family is Pinaceae, commonly known as the pine family, which includes conifers with cone-bearing structures and needle-like or scale-like leaves. Its genus is Abies, which refers to the fir trees, known for their conical shape and flat, needle-like leaves. Its species is Abies holophylla, a specific type of fir tree characterized by its unique leaf morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Korea",
        "Manchuria",
        "Primorye"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies holophylla is primarily native to Korea, Manchuria, and Primorye. This species is found in the temperate regions of these areas, typically in mountainous forests. It thrives in cool, moist climates with well-drained soils. The plant is often associated with mixed coniferous and broadleaf forests. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abies holophylla was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It thrives in environments with high humidity and moderate temperatures, making it suitable for temperate forest ecosystems. This plant is often found in regions with high elevation, where it contributes to the biodiversity of coniferous forests. Its introduction has been noted in several parts of East Asia, including China and Japan. However, its spread is limited by its specific ecological requirements and climate constraints."
}
