{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies sibirica subsp. sibirica",
    "plant_slug": "abies-sibirica-subsp-sibirica",
    "plant_name_scientific": "abies sibirica subsp. sibirica",
    "intro": "Abies sibirica subsp. sibirica, commonly known as the Siberian fir, is a coniferous evergreen tree native to the cold regions of Siberia and parts of northern Asia. It typically grows in boreal forests and mountainous areas, thriving in cool, moist climates with well-drained soil. The tree has a conical shape with dark green, needle-like leaves that are arranged spirally along the branches. Its cones are usually pendulous, maturing to a reddish-brown color, and contain seeds that are dispersed by wind. This subspecies is valued for its hardiness and is often used in landscaping in temperate climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies sibirica"
    },
    "taxonomy_art_desc": "Abies sibirica subsp. sibirica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex reproductive structures. Its subclass is Pinidae, which is a group of coniferous plants that includes pines, firs, and cedars, typically characterized by needle-like leaves and cones. Its order is Pinales, which consists of coniferous trees and shrubs, including pines, firs, and cedars, and is known for their reproductive structures called cones. Its family is Pinaceae, commonly known as the pine family, which includes coniferous trees with needle-like leaves and woody cones. Its genus is Abies, which refers to the genus of fir trees, known for their conical shape, aromatic needles, and edible seeds. Its species is Abies sibirica, a species of fir tree native to Siberia, characterized by its slender, conical shape and needle-like leaves.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Altay",
        "Amur",
        "Buryatiya",
        "Chita",
        "East European Russia",
        "Irkutsk",
        "Khabarovsk",
        "Krasnoyarsk",
        "North European Russia",
        "Tuva",
        "West Siberia",
        "Xinjiang",
        "Yakutiya"
    ],
    "distribution_introduced": [
        "Central European Russia",
        "Denmark",
        "Finland",
        "Iceland",
        "Norway",
        "Sweden"
    ],
    "distribution_native_art_desc": "Abies sibirica subsp. sibirica is primarily native to Altay, Amur, Buryatiya, Chita, East European Russia, Irkutsk, Khabarovsk, Krasnoyarsk, North European Russia, Tuva, West Siberia, Xinjiang, and Yakutiya. This subspecies is commonly found in mountainous regions across these areas. It thrives in cold climates and is often associated with coniferous forests. The plant is well adapted to the harsh environmental conditions of its native range. Its distribution reflects its preference for high altitudes and boreal or subarctic ecosystems.",
    "distribution_introduced_art_desc": "Abies sibirica subsp. sibirica was mainly introduced to Central European Russia, Denmark, Finland, Iceland, Norway, and Sweden. It has been established in these regions, often in areas with cool, moist climates suitable for its growth. The introduction of this subspecies has occurred through both natural dispersal and human activities such as planting for ornamental or reforestation purposes. It is typically found in mountainous or boreal forest ecosystems. Its presence in these locations highlights its adaptability to temperate and subarctic conditions."
}
