{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies forrestii subsp. ferreana",
    "plant_slug": "abies-forrestii-subsp-ferreana",
    "plant_name_scientific": "abies forrestii subsp. ferreana",
    "intro": "Abies forrestii subsp. ferreana, commonly known as the Chinese fir or red fir, is a coniferous tree native to the mountainous regions of China. It is characterized by its slender, conical shape and dark green, needle-like leaves that are often slightly twisted. The cones of this species are typically reddish-brown and measure around 5–7 centimeters in length. It thrives in cool, moist climates and is often found at high altitudes in forested areas. The tree is valued for its ornamental appeal and is sometimes cultivated in botanical gardens and as a landscape plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies forrestii subsp. ferreana is primarily native to the eastern Himalayas, including regions in India, Nepal, Bhutan, and possibly parts of northern Myanmar. This subspecies is found in high-altitude areas, typically between 2,500 and 4,000 meters above sea level. It grows in temperate forests and mountainous regions with cool, moist climates. The plant is well adapted to the rugged terrain and harsh environmental conditions of its native habitat. It is an important component of the local ecosystems in these regions.",
    "distribution_introduced_art_desc": "Abies forrestii subsp. ferreana was mainly introduced to areas with cold, moist climates and well-drained soils, typically found in mountainous regions. It is often cultivated in gardens and parks where it can thrive in partial shade to full sun conditions. This subspecies is valued for its ornamental appeal, featuring a dense, pyramidal shape and attractive blue-green foliage. It is also used in reforestation projects due to its hardiness and ability to stabilize soil. However, it is important to note that its introduction may have ecological impacts in non-native regions."
}
