{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies chilrowensis",
    "plant_slug": "abies-chilrowensis",
    "plant_name_scientific": "abies chilrowensis",
    "intro": "Abies chilrowensis, commonly known as the Chiloe fir, is a species of evergreen conifer native to southern Chile. It belongs to the genus Abies, which includes other firs such as the balsam fir and the silver fir. The tree is characterized by its slender, conical shape and its dark green, needle-like leaves. It produces cones that are typically cylindrical and contain edible seeds. This species is adapted to temperate climates and is often found in mountainous regions with moist, well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies chilrowensis is primarily native to the southern Andes of South America, specifically in parts of Chile and Argentina. It is found in the mountainous regions of these countries, typically at elevations between 1,500 and 3,000 meters. This species is adapted to the cool, moist climates of these high-altitude environments. It grows in dense forests and is often found in association with other native coniferous species. Due to its limited range, it is considered a rare and endemic plant in its native habitat.",
    "distribution_introduced_art_desc": "Abies chilrowensis was mainly introduced to areas with cool, moist climates and well-drained soils, typically in higher elevations. It is commonly found in regions with temperate rainforests and mountainous terrain. This species thrives in areas with high humidity and moderate temperatures. Its introduction has been noted in parts of South America, particularly in Chile and Argentina. However, its distribution remains limited due to specific ecological requirements."
}
