{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies durangensis subsp. coahuilensis",
    "plant_slug": "abies-durangensis-subsp-coahuilensis",
    "plant_name_scientific": "abies durangensis subsp. coahuilensis",
    "intro": "Abies durangensis subsp. coahuilensis, commonly known as the Coahuila fir, is a rare and endemic conifer native to the mountainous regions of northern Mexico. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are typically arranged in spirals. The plant produces small, cylindrical cones that contain seeds, a feature common among fir species. It thrives in cool, moist environments with well-drained soil, often found in pine-oak forests. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from deforestation and climate change.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies durangensis subsp. coahuilensis is primarily native to the mountainous regions of northern Mexico, specifically in the states of Coahuila, Nuevo León, and Durango. This subspecies is typically found in high-altitude areas with cool, moist climates. It thrives in well-drained soils and is often associated with coniferous forests. The plant is adapted to the rugged terrain and specific microclimates of its native range. Due to its limited distribution, it is considered a rare and endemic species in this region.",
    "distribution_introduced_art_desc": "Abies durangensis subsp. coahuilensis was mainly introduced to areas with specific ecological conditions that mimic its native habitat, such as high elevation, well-drained soils, and a temperate climate. It is typically found in mountainous regions with cool, moist environments, which are often limited in distribution. The introduction of this subspecies is primarily driven by conservation efforts and ecological restoration projects. Due to its limited natural range, it is sometimes cultivated in botanical gardens or reintroduced to degraded habitats. However, its establishment outside its native range is rare and often restricted to controlled environments."
}
