{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea f. hudsonia",
    "plant_slug": "abies-balsamea-f-hudsonia",
    "plant_name_scientific": "abies balsamea f. hudsonia",
    "intro": "Abies balsamea f. hudsonia, commonly known as the Hudson's balsam fir, is a botanical variant of the balsam fir native to eastern North America. It is characterized by its dense, conical shape and dark green, needle-like leaves that are typically shorter than those of the typical balsam fir. The plant produces small, cone-like structures that contain seeds, which are dispersed by wind. It thrives in cool, moist environments, often found in boreal and subalpine regions. This subspecies is valued for its ecological role and is also used in horticulture for its ornamental qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamea f. hudsonia is primarily native to the northeastern United States and southeastern Canada. It is found in regions such as New York, Vermont, New Hampshire, and parts of Maine. This subspecies thrives in cool, moist environments, typically in coniferous or mixed forests. It is commonly associated with rocky or mountainous terrain where it forms part of the forest understory. Its distribution is limited to specific ecological niches that provide the right combination of soil, moisture, and temperature conditions.",
    "distribution_introduced_art_desc": "Abies balsamea f. hudsonia was mainly introduced to North America, particularly in the northeastern United States and southeastern Canada. It is commonly found in moist, well-drained soils in forested areas. This subspecies is often used in horticulture for its ornamental value and hardiness. It has been introduced to various regions beyond its native range for landscaping purposes. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
