{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba subsp. cephalonica",
    "plant_slug": "abies-alba-subsp-cephalonica",
    "plant_name_scientific": "abies alba subsp. cephalonica",
    "intro": "Abies alba subsp. cephalonica, commonly known as the Greek fir, is a rare and endemic subspecies native to the mountainous regions of Greece. It is a coniferous evergreen tree characterized by its slender, conical shape and dark green, needle-like leaves. The cones are typically small and cylindrical, maturing to a reddish-brown color. This subspecies thrives in cool, moist climates and is often found in forested areas at higher elevations. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba subsp. cephalonica is primarily native to the western Balkan Peninsula, including parts of Albania, Bosnia and Herzegovina, Croatia, Kosovo, Montenegro, and Serbia. This subspecies is found in mountainous regions, particularly in the Dinaric Alps and surrounding areas. It thrives in temperate climates with high elevation and well-drained soils. The plant is commonly found in mixed forests and is adapted to the cooler, moist conditions of its native habitat. Its distribution is closely linked to the historical and current forest ecosystems of the region.",
    "distribution_introduced_art_desc": "Abies alba subsp. cephalonica was mainly introduced to specific regions in the Mediterranean, particularly in southern Italy and parts of Greece. It was brought there for its ornamental value and its ability to thrive in rocky and poor soils. This subspecies is known for its compact growth and distinctive conical shape, making it a popular choice for landscaping. However, its introduction has raised concerns due to its potential to become invasive in certain environments. Despite its aesthetic appeal, careful management is required to prevent ecological disruption."
}
