{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. finedonensis",
    "plant_slug": "abies-excelsa-var-finedonensis",
    "plant_name_scientific": "abies excelsa var. finedonensis",
    "intro": "Abies excelsa var. finedonensis, commonly known as the Finedon Fir, is a rare subspecies of the silver fir native to the Scottish Highlands. It is characterized by its slender, conical shape and dark green, needle-like leaves. The tree produces cones that are typically reddish-brown in color and remain attached to the branches for an extended period. It thrives in cool, moist environments with well-drained soil. Due to its limited distribution and habitat specificity, it is considered a conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. finedonensis is primarily native to the Scottish Highlands, specifically the area around the village of Finedon. This variety of the silver fir is found in the mountainous regions of Scotland, where it thrives in cool, moist climates. It is typically associated with heathland and moorland environments at higher elevations. The plant is part of the natural flora of the British Isles and is often found in areas with acidic soils. Due to its limited distribution, it is considered a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Abies excelsa var. finedonensis was mainly introduced to specific regions of Scotland, particularly in the Scottish Highlands. It was introduced as part of botanical collections and horticultural interest during the 19th century. The distribution is limited to a few well-documented sites, primarily in the vicinity of the Finedon area. This variety is now considered rare and is protected under Scottish biodiversity conservation efforts. Its introduction has had a minimal impact on native ecosystems compared to more invasive species."
}
