{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies caroliniana",
    "plant_slug": "abies-caroliniana",
    "plant_name_scientific": "abies caroliniana",
    "intro": "Abies caroliniana, commonly known as the Carolina fir, is a coniferous evergreen tree native to the eastern United States. It is characterized by its pyramidal shape, dark green needles, and distinctive cones that hang downward. The tree thrives in acidic, well-drained soils and is often found in moist, cool mountain environments. Its needles are typically 10–15 mm long and have a subtle pine scent. The Carolina fir is valued for its ornamental appeal and is sometimes used in the Christmas tree trade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies caroliniana is primarily native to the southeastern United States. It can be found in states such as Florida, Georgia, South Carolina, and North Carolina. This species thrives in moist, well-drained soils and is commonly found in forested areas. It is often associated with wetland habitats and is known as the Florida fir. The plant is an important component of the ecosystems in its native range.",
    "distribution_introduced_art_desc": "Abies caroliniana was mainly introduced to the southeastern United States, where it has been cultivated for its ornamental value and ecological benefits. It thrives in well-drained soils and partial to full sunlight, making it suitable for a variety of landscape settings. This species is often used in residential and commercial landscaping due to its attractive pyramidal shape and evergreen foliage. However, it is not native to this region and has been introduced primarily through horticultural practices. Its distribution has remained relatively localized, with limited natural spread beyond cultivated areas."
}
