{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies marocana subsp. tazaotana",
    "plant_slug": "abies-marocana-subsp-tazaotana",
    "plant_name_scientific": "abies marocana subsp. tazaotana",
    "intro": "Abies marocana subsp. tazaotana, commonly known as the Tazaotan fir, is a rare and endemic conifer native to the Atlas Mountains of Morocco. It is characterized by its narrow, needle-like leaves and conical shape, typical of the fir genus. The plant thrives in cool, moist environments at high altitudes, often in mountainous regions with well-drained soils. Its cones are small and cylindrical, containing winged seeds that are dispersed by wind. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from climate change and habitat loss.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies marocana subsp. tazaotana is primarily native to the mountainous regions of northern Africa, specifically the Atlas Mountains in Morocco. This subspecies is found in the high-altitude areas of the Middle Atlas and High Atlas ranges. It thrives in cool, moist climates with well-drained soils, typically at elevations between 1,500 and 2,500 meters. The plant is adapted to the harsh conditions of the Mediterranean climate in this region. It plays an important ecological role in these mountain ecosystems.",
    "distribution_introduced_art_desc": "Abies marocana subsp. tazaotana was mainly introduced to North America as an ornamental tree due to its unique appearance and cold hardiness. It is commonly found in botanical gardens and private collections, where it is appreciated for its ornamental value. The subspecies is also cultivated in Europe, particularly in countries with temperate climates that can support its growth. Despite its introduction, it has not established itself as a naturalized species in the wild. Its distribution remains largely limited to human-managed environments."
}
