{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. pumila-glauca",
    "plant_slug": "abies-excelsa-var-pumila-glauca",
    "plant_name_scientific": "abies excelsa var. pumila-glauca",
    "intro": "Abies excelsa var. pumila-glauca, commonly known as the dwarf blue spruce, is a compact evergreen conifer with a dense, pyramidal shape. It features needle-like leaves that are short, blue-gray in color, and covered in a fine wax layer, giving it a distinctive appearance. The plant produces small, cylindrical cones that mature to a reddish-brown hue. It is native to the high altitudes of the Himalayas and thrives in cool, moist environments. This variety is prized for its ornamental value and is often cultivated in gardens and landscapes for its aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. pumila-glauca is primarily native to the high-altitude regions of the Himalayas, specifically in countries such as Nepal, Bhutan, and northern India. This variant of the Himalayan fir is typically found in alpine forests at elevations ranging from 2,500 to 4,000 meters. It thrives in cool, moist climates with well-drained soils, often growing in mixed coniferous forests. The plant is adapted to the harsh environmental conditions of its native habitat, including strong winds and limited sunlight. Due to its restricted range, it is considered a rare and endemic species within its native region.",
    "distribution_introduced_art_desc": "Abies excelsa var. pumila-glauca was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It thrives in high-altitude environments where temperatures are moderate and precipitation is consistent. This variety is often cultivated for its ornamental value due to its compact growth habit and attractive foliage. It is commonly found in botanical gardens and as an ornamental tree in urban landscapes. However, its introduction has raised concerns about its potential impact on native ecosystems if it spreads beyond controlled areas."
}
