{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies spectabilis var. langtangensis",
    "plant_slug": "abies-spectabilis-var-langtangensis",
    "plant_name_scientific": "abies spectabilis var. langtangensis",
    "intro": "Abies spectabilis var. langtangensis, commonly known as the Langtang fir, is a rare variant of the blue fir native to the Himalayan region. It is characterized by its slender, conical shape and dark green, needle-like leaves that are typically arranged in a single row along the stems. The cones of this species are typically cylindrical and have a distinctive, woody structure. It thrives in high-altitude environments with cool, moist climates and well-drained soils. Due to its limited distribution and habitat specificity, it is considered a valuable but endangered species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies spectabilis var. langtangensis is primarily native to the eastern Himalayas, including regions in Nepal, Bhutan, and parts of northern India. It is commonly found in the Langtang Valley and surrounding areas of Nepal. This variety thrives in high-altitude temperate forests, typically at elevations between 2,500 and 4,000 meters. It is adapted to cool, moist climates with well-drained soils. The plant plays an important ecological role in these mountainous regions.",
    "distribution_introduced_art_desc": "Abies spectabilis var. langtangensis was mainly introduced to the Langtang National Park in Nepal. It is a variant of the silver fir, known for its distinctive silver-blue foliage. This plant is adapted to high-altitude environments and thrives in cool, moist conditions. It plays a vital role in the local ecosystem by providing habitat and food for various wildlife species. Its introduction has contributed to the biodiversity and ecological stability of the region."
}
