{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies religiosa subsp. colimensis",
    "plant_slug": "abies-religiosa-subsp-colimensis",
    "plant_name_scientific": "abies religiosa subsp. colimensis",
    "intro": "Abies religiosa subsp. colimensis, commonly known as the Sierra Madre fir, is a rare and endemic subspecies native to the Sierra Madre mountains in Mexico. It is a coniferous evergreen tree characterized by its conical shape and dense foliage. The needles are dark green, glossy, and arranged in spirals along the branches. It produces cone-like structures that contain seeds, typical of the Pinaceae family. This subspecies thrives in high-altitude environments with cool, moist climates and is adapted to the specific ecological conditions of its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies religiosa subsp. colimensis is primarily native to the Sierra Madre Occidental and the southern regions of the Sierra Madre del Sur in Mexico. This subspecies is found in the states of Sinaloa, Nayarit, Jalisco, and Oaxaca. It grows in high-altitude cloud forests, typically at elevations between 1,500 and 3,000 meters. The plant thrives in moist, well-drained soils and is often associated with montane ecosystems. Its distribution is limited to specific geographic areas within these mountain ranges.",
    "distribution_introduced_art_desc": "Abies religiosa subsp. colimensis was mainly introduced to areas with high altitudes and cool, moist climates, typically found in mountainous regions. It is commonly found in the Sierra Madre Mountains of Mexico, where it thrives in well-drained soils and moderate temperatures. This subspecies is valued for its ornamental qualities and is often planted in gardens and parks. Its introduction has also been noted in parts of Central America, where it has adapted to similar environmental conditions. However, its spread is limited by its specific ecological requirements."
}
