{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies guatemalensis",
    "plant_slug": "abies-guatemalensis",
    "plant_name_scientific": "abies guatemalensis",
    "intro": "Abies guatemalensis, commonly known as the Guatemalan fir, is a coniferous evergreen tree native to Central America. It is characterized by its tall, slender form and needle-like leaves that are typically dark green and arranged in spirals. The tree produces cones that contain seeds, which are dispersed by wind, aiding in its natural propagation. It thrives in high-altitude regions with cool, moist climates, often found in cloud forests. The species is valued for its timber and plays an important ecological role in its native habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies guatemalensis"
    },
    "taxonomy_art_desc": "Abies guatemalensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Pinidae, which refers to a group of coniferous plants that includes pines, firs, and other related species. Its order is Pinales, a group of coniferous plants that are typically evergreen and have needle-like leaves. Its family is Pinaceae, commonly known as the pine family, which includes various coniferous trees such as pines, firs, and cedars. Its genus is Abies, which consists of evergreen coniferous trees commonly known as firs, characterized by their narrow, needle-like leaves and cone structures. Its species is Abies guatemalensis, a specific type of fir native to Central America, known for its ecological significance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "El Salvador",
        "Guatemala",
        "Honduras",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies guatemalensis is primarily native to El Salvador, Guatemala, Honduras, Mexico Northeast, Mexico Southeast, and Mexico Southwest. This species is found in the mountainous regions of these countries, typically in humid, temperate climates. It thrives in high-altitude forests, often growing at elevations between 1,500 and 3,000 meters. The tree is well adapted to the tropical cloud forests and pine-oak woodlands of its native range. It plays an important ecological role in these regions by providing habitat and contributing to biodiversity.",
    "distribution_introduced_art_desc": "Abies guatemalensis was mainly introduced to areas with temperate climates and high elevations, particularly in mountainous regions of Central America and the southern United States. It thrives in well-drained soils and requires ample sunlight for optimal growth. This species is often planted for its ornamental value and its ability to provide habitat for various wildlife species. However, its introduction has raised concerns about potential ecological impacts in non-native environments. Its distribution is largely limited by its specific climatic and soil requirements."
}
