{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo subsp. pinsapo",
    "plant_slug": "abies-pinsapo-subsp-pinsapo",
    "plant_name_scientific": "abies pinsapo subsp. pinsapo",
    "intro": "Abies pinsapo subsp. pinsapo, commonly known as the Iberian fir, is a rare and relict species native to the Sierra de Cazorla in southern Spain. It is a coniferous evergreen tree with needle-like leaves and conical crowns, typically growing in mountainous regions. The tree has distinctive bark that is reddish-brown and fissured, and its cones are pendulous, containing winged seeds. It is adapted to the cool, moist climate of its native habitat and is considered a relict species due to its limited distribution. Due to habitat loss and climate change, it is classified as critically endangered by the IUCN.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo subsp. pinsapo is primarily native to the Iberian Peninsula, specifically in southern Spain. This subspecies is found in the Sierra de Cazorla, Sierra de Los Alcornocales, and the Sierra de Grazalema regions. It thrives in mountainous areas with a Mediterranean climate, characterized by mild, wet winters and hot, dry summers. The plant is adapted to rocky and well-drained soils, often growing in forested areas with other coniferous species. Due to its restricted habitat, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abies pinsapo subsp. pinsapo was mainly introduced to regions with a Mediterranean climate, characterized by mild, wet winters and hot, dry summers. It thrives in well-drained soils and is commonly found in mountainous areas with sufficient moisture. This subspecies is native to southern Spain and has been introduced to other parts of southern Europe for ornamental and reforestation purposes. Its introduction has sometimes led to ecological concerns due to its potential to outcompete native species. However, it is valued for its aesthetic appeal and ability to stabilize soil in arid environments."
}
