{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies tazaotana",
    "plant_slug": "abies-tazaotana",
    "plant_name_scientific": "abies tazaotana",
    "intro": "Abies tazaotana, commonly known as the Tazaotán fir, is a species of fir native to the mountainous regions of central Mexico. It is characterized by its conical shape and dense foliage, with needle-like leaves that are dark green and slightly twisted. The tree produces small, spherical cones that mature to a reddish-brown color. It thrives in cool, moist climates and is often found in cloud forests at elevations between 2,000 and 3,000 meters. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies tazaotana is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Guizhou. It grows in high-altitude forests at elevations ranging from 2,500 to 4,000 meters above sea level. This species is commonly found in temperate climates with cool, moist conditions and well-drained soils. It is often associated with mixed coniferous forests and is an important component of the local biodiversity. Due to its restricted habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abies tazaotana was mainly introduced to specific regions in Central America, particularly in Mexico and Guatemala, where it has been cultivated for its ornamental value and ecological benefits. It is often planted in urban landscapes and conservation areas due to its ability to thrive in diverse soil conditions. The distribution of this species is limited to areas with moderate climates and elevations ranging from 1,500 to 3,000 meters. It has been introduced to several botanical gardens and protected areas as part of reforestation and biodiversity conservation efforts. However, its natural range remains relatively restricted compared to other fir species."
}
