{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies guatemalensis subsp. jaliscana",
    "plant_slug": "abies-guatemalensis-subsp-jaliscana",
    "plant_name_scientific": "abies guatemalensis subsp. jaliscana",
    "intro": "Abies guatemalensis subsp. jaliscana, commonly known as the Jalisco fir, is a rare and endemic conifer native to the highlands of Jalisco, Mexico. It is characterized by its slender, pyramidal shape and dark green, needle-like foliage. The plant exhibits distinct morphological differences from the typical *A. guatemalensis*, including shorter cones and a more compact growth habit. It thrives in cool, moist environments at elevations between 2,000 and 3,000 meters. Due to habitat loss and limited distribution, it is considered a vulnerable species requiring conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies guatemalensis subsp. jaliscana is primarily native to the highlands of central Mexico, specifically in the states of Jalisco, Guanajuato, and Michoacán. This subspecies thrives in temperate montane forests at elevations ranging from 1,500 to 3,000 meters above sea level. It is commonly found in areas with moist, well-drained soils and a cool, humid climate. The plant is an important component of the local ecosystem, providing habitat for various wildlife species. Its distribution is limited to these specific regions due to its particular environmental requirements.",
    "distribution_introduced_art_desc": "Abies guatemalensis subsp. jaliscana was mainly introduced to areas with temperate to subtropical climates, characterized by well-drained soils and moderate precipitation. It thrives in regions with high altitude and cool summers, making it suitable for mountainous environments. This subspecies is often planted for reforestation and ornamental purposes due to its aesthetic value and ecological benefits. It has been introduced to parts of Central America and the southern United States. However, its distribution is limited by its specific environmental requirements and climate constraints."
}
