{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies hudsonia",
    "plant_slug": "abies-hudsonia",
    "plant_name_scientific": "abies hudsonia",
    "intro": "Abies hudsonia, commonly known as the Hudson's Bay fir, is a coniferous evergreen tree native to the boreal forests of Canada. It is characterized by its slender, columnar shape and dark green, needle-like leaves that are arranged in spirals along the branches. The tree produces cones that are typically reddish-brown and contain small, winged seeds. It thrives in cool, moist environments and is often found in association with other boreal species. The wood of Abies hudsonia is lightweight and has been historically used for construction and paper production.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies hudsonia is primarily native to the mountainous regions of western North America, including parts of British Columbia, Alberta, and the northern United States. It is commonly found in the Pacific Northwest, particularly in areas with moist, cool climates. This species thrives in high elevation forests and is often associated with subalpine and alpine environments. It is well adapted to rocky and well-drained soils, making it a characteristic plant of mountainous terrain. Its distribution is limited to specific ecological niches where it can receive adequate moisture and sunlight.",
    "distribution_introduced_art_desc": "Abies hudsonia was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous or high-altitude regions. It thrives in environments with moderate temperatures and ample precipitation, making it suitable for temperate forests. This species is often planted for its ornamental value, including its pyramidal shape and fragrant needles. It has also been introduced for reforestation efforts due to its ability to stabilize soil and provide habitat for wildlife. However, its introduction can sometimes lead to competition with native species in certain ecosystems."
}
