{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba lusus pendula",
    "plant_slug": "abies-alba-lusus-pendula",
    "plant_name_scientific": "abies alba lusus pendula",
    "intro": "Abies alba lusus pendula, commonly known as the weeping white fir, is a variant of the European silver fir. This plant is characterized by its distinctive pendulous branches that hang in a weeping manner, creating a unique visual appearance. It features needle-like leaves that are typically gray-green in color and have a soft texture. The cones are small and cylindrical, containing seeds that are dispersed by wind. It thrives in cool, moist environments and is often found in mountainous regions of Europe.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba lusus pendula is primarily native to the mountainous regions of Central and Southern Europe, including parts of Italy, Austria, and the Balkans. This variety of the silver fir is typically found in temperate forest ecosystems at elevations ranging from 1,000 to 2,500 meters. It thrives in areas with cool, moist climates and well-drained soils. The plant is particularly common in the Alps and Carpathian mountain ranges. Its native distribution is closely associated with the natural habitats of its parent species, Abies alba.",
    "distribution_introduced_art_desc": "Abies alba lusus pendula was mainly introduced to ornamental horticulture and landscape design due to its unique weeping form and aesthetic appeal. It is commonly cultivated in gardens and parks where its visual interest can be appreciated. The plant is valued for its ability to thrive in temperate climates and its adaptability to various soil types. However, it requires careful management to prevent potential invasiveness in natural habitats. Its introduction has expanded its presence beyond its native range, making it a popular choice for decorative purposes."
}
