{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies bicolor",
    "plant_slug": "abies-bicolor",
    "plant_name_scientific": "abies bicolor",
    "intro": "Abies bicolor, commonly known as the two-colored fir, is a coniferous evergreen tree native to the mountainous regions of western North America. It is characterized by its distinctive bicolored foliage, with upper foliage appearing silver-white and lower foliage a dark green. The tree typically grows to a height of 20 to 40 meters, forming a conical shape with a dense crown. Its needles are flat, soft, and arranged in spirals along the branches, while its cones are cylindrical and typically measure 5 to 8 centimeters in length. The species is adapted to cold, high-altitude environments and is often found in subalpine and alpine forests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies bicolor is primarily native to the mountainous regions of western North America, including parts of the United States and Canada. It is commonly found in the western cordillera, particularly in the Pacific Northwest. This species thrives in high elevation areas with cool, moist climates. It is often associated with coniferous forests and is well adapted to rocky and well-drained soils. The plant's native range extends from British Columbia through the Rocky Mountains to northern New Mexico.",
    "distribution_introduced_art_desc": "Abies bicolor was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It thrives in environments with moderate temperatures and high humidity. This plant is often found in the northern hemisphere, particularly in North America and parts of Asia. Its introduction has been largely due to its ornamental value and adaptability to various soil types. However, it can sometimes become invasive in non-native regions if not properly managed."
}
