{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × vilmorinii",
    "plant_slug": "abies-×-vilmorinii",
    "plant_name_scientific": "abies × vilmorinii",
    "intro": "Abies × vilmorinii, commonly known as the Vilmorin fir, is a natural hybrid between Abies balsamifera and Abies lasiocarpa. It is characterized by its conical shape and dense foliage, with needle-like leaves that are typically bluish-green in color. The tree produces cones that are often shorter than those of its parent species, and it is typically found in high-altitude regions of the western United States. This hybrid is valued for its ornamental qualities and is often cultivated in botanical gardens and as a landscape tree. Its botanical significance lies in its role as a genetic bridge between two closely related fir species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × vilmorinii is primarily native to the mountainous regions of central and eastern Europe, particularly in the Carpathian and Alps. It occurs naturally in countries such as Austria, Czech Republic, Germany, Slovakia, and Poland. This hybrid species is found in elevations ranging from 1,000 to 2,500 meters, where it thrives in cool, moist, and well-drained soils. It is commonly found in mixed forests alongside other coniferous species like fir and spruce. Due to its hybrid origin, it is sometimes considered a natural cross between Abies alba and Abies cephalonica.",
    "distribution_introduced_art_desc": "Abies × vilmorinii was mainly introduced to the United States and Europe as an ornamental tree due to its unique appearance and hardiness. It is a hybrid between Abies balsamifera and Abies lasiocarpa, resulting in a tree with distinctive blue-green needles and a compact, conical shape. This plant is often cultivated in gardens and parks for its aesthetic value and ability to thrive in colder climates. However, it is important to note that it can sometimes escape cultivation and establish itself in natural areas, posing potential ecological risks. Its introduction has been primarily for horticultural purposes rather than for ecological or agricultural use."
}
