{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fabri subsp. fordei",
    "plant_slug": "abies-fabri-subsp-fordei",
    "plant_name_scientific": "abies fabri subsp. fordei",
    "intro": "Abies fabri subsp. fordei, commonly known as the Forde's fir, is a rare and endemic subspecies native to the mountainous regions of northern China. It is a coniferous evergreen tree characterized by its needle-like leaves and cone-bearing structure typical of the fir genus. The foliage is typically dark green and densely packed, providing a dense canopy. It thrives in cool, moist environments with well-drained soil, often found in high-altitude forests. Due to its limited distribution and habitat specificity, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fabri subsp. fordei is primarily native to the mountainous regions of southern China, particularly in Yunnan Province. This subspecies is found in high-altitude areas with cool, moist climates. It typically grows in coniferous forests and is adapted to rocky and well-drained soils. The plant is often associated with mixed evergreen and deciduous forests in its native habitat. Its distribution is limited to specific elevational ranges, usually between 1,500 and 3,000 meters above sea level.",
    "distribution_introduced_art_desc": "Abies fabri subsp. fordei was mainly introduced to ornamental horticulture due to its attractive conical shape and slow growth rate. It is commonly cultivated in gardens and landscapes for its aesthetic value. The subspecies is native to China and has been introduced to various regions with suitable climates. It prefers well-drained soil and full sun to partial shade. However, it is important to note that its introduction may pose a risk to local ecosystems if it escapes cultivation."
}
