{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies balsamea var. arizonica",
    "plant_slug": "abies-balsamea-var-arizonica",
    "plant_name_scientific": "abies balsamea var. arizonica",
    "intro": "Abies balsamea var. arizonica, commonly known as the Arizona fir, is a variant of the balsam fir native to the southwestern United States. It is a coniferous evergreen tree characterized by its needle-like leaves and cone-bearing structure. The plant has dark green, flat needles that are arranged in spirals along the branches. It typically grows in high elevation forests and requires cool, moist conditions to thrive. Its botanical features make it an important component of the local ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies balsamea var. arizonica is primarily native to the southwestern United States and northern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Texas. This variety thrives in high elevations, typically in forested areas with well-drained soils. It is commonly associated with pine-oak woodlands and mountainous terrain. The plant is adapted to a climate with cold winters and warm, dry summers.",
    "distribution_introduced_art_desc": "Abies balsamea var. arizonica was mainly introduced to areas with a climate similar to its native range, including regions with cold winters and moderate to high precipitation. It is commonly found in mountainous regions where it thrives in well-drained soils and cooler temperatures. This variant is often used in horticulture for its ornamental value and adaptability to various growing conditions. Its introduction has been noted in parts of the western United States, particularly in states like Arizona and New Mexico. However, its spread is limited by its specific environmental requirements and the need for a suitable climate."
}
