{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies curvifolia",
    "plant_slug": "abies-curvifolia",
    "plant_name_scientific": "abies curvifolia",
    "intro": "Abies curvifolia, commonly known as the hook-leaf fir, is a species of evergreen conifer native to the mountainous regions of central and southern China. It is characterized by its conical shape and dense, dark green foliage that turns a bluish-gray in winter. The leaves are typically curved at the tips, giving the plant its common name, and they are arranged in spirals along the branches. The cones are cylindrical and mature to a reddish-brown color, containing seeds that are dispersed by wind. This species is valued for its ornamental qualities and is often cultivated in gardens for its aesthetic appeal and hardiness.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies curvifolia is primarily native to the mountainous regions of eastern Asia, specifically China, Japan, and Korea. It thrives in temperate climates with high elevations and cool, moist conditions. This species is commonly found in coniferous forests and alpine areas where it forms part of the local flora. Its distribution is limited to specific geographic regions due to its adaptation to particular environmental conditions. The plant is well-suited to rocky and well-drained soils, making it a characteristic species of its native habitat.",
    "distribution_introduced_art_desc": "Abies curvifolia was mainly introduced to areas with cool, moist climates and well-drained soils, typically in higher elevations. It is commonly found in regions with temperate to subarctic conditions, where it thrives in shaded environments. This species has been introduced to parts of North America, particularly in the Pacific Northwest, as an ornamental and for reforestation purposes. It is valued for its ornamental value, with its conical shape and attractive foliage. However, its introduction has raised concerns about potential ecological impacts in non-native habitats."
}
