{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies excelsa var. clambrasiliana",
    "plant_slug": "abies-excelsa-var-clambrasiliana",
    "plant_name_scientific": "abies excelsa var. clambrasiliana",
    "intro": "Abies excelsa var. clambrasiliana, commonly known as the Brazilian white fir, is a rare and endemic variant of the white fir species. It is native to the high-altitude regions of southern Brazil, particularly in the southern part of the state of Santa Catarina. This coniferous tree is characterized by its slender, pyramidal shape and its dark green, needle-like leaves. Its cones are typically small and clustered, and the tree produces a distinctive, aromatic resin. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies excelsa var. clambrasiliana is primarily native to the mountainous regions of Brazil, particularly in the states of Espírito Santo and Rio de Janeiro. This variety thrives in high-altitude cloud forests where it benefits from the cool, moist climate. It is commonly found in areas with well-drained soils and high humidity, which support its growth. The plant is adapted to the specific ecological conditions of the Atlantic Forest biome. Due to its restricted habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abies excelsa var. clambrasiliana was mainly introduced to regions with temperate climates that provide suitable growing conditions, including well-drained soils and moderate precipitation. This variety is often cultivated in botanical gardens and horticultural collections due to its ornamental value and unique characteristics. It has been introduced to several countries in South America, particularly in Brazil, where it thrives in the cooler highland areas. The plant's introduction has been primarily for ornamental purposes and ecological restoration projects. However, its natural range remains limited, and it is not widely established in the wild outside its native habitat."
}
