{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies alba f. pyramidalis",
    "plant_slug": "abies-alba-f-pyramidalis",
    "plant_name_scientific": "abies alba f. pyramidalis",
    "intro": "Abies alba f. pyramidalis, commonly known as the European white fir pyramidal form, is a variant of the European silver fir. It is characterized by its narrow, conical shape and dense foliage, making it a popular ornamental tree. The leaves are needle-like, dark green, and arranged in a compact, pyramidal structure. It thrives in cool, moist climates and is often used in landscaping for its aesthetic appeal. This form is typically found in mountainous regions of Europe where it grows in coniferous forests.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies alba f. pyramidalis is primarily native to the mountainous regions of Central and Eastern Europe. This form of the European silver fir is found in the Carpathian Mountains, the Alps, and parts of the Balkans. It thrives in temperate climates with high altitudes and cool, moist conditions. The plant is typically found in forested areas with well-drained soils. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abies alba f. pyramidalis was mainly introduced to Europe as an ornamental plant due to its distinctive pyramidal shape and slow growth rate. It is commonly cultivated in gardens and parks for its aesthetic value and ability to thrive in temperate climates. This form of the silver fir is often used in landscaping to provide a structured and formal appearance. Although it is not native to the region, it has been widely accepted in horticulture. Its introduction has contributed to the diversity of coniferous plants in European gardens."
}
