{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies equi-trojani",
    "plant_slug": "abies-equi-trojani",
    "plant_name_scientific": "abies equi-trojani",
    "intro": "Abies equi-trojani, commonly known as the Trojan fir, is a rare and ancient conifer native to the mountainous regions of the Balkans. It is characterized by its slender, conical shape and dark green, needle-like foliage. The tree produces small, cylindrical cones that mature to a reddish-brown color. Its bark is thick and furrowed, providing protection against harsh environmental conditions. Due to its limited range and habitat specificity, it is considered a vulnerable species in its native environment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies equi-trojani is primarily native to the mountainous regions of the eastern Carpathians in Romania. This species is found in specific microhabitats characterized by high altitude and cool, moist climates. It thrives in areas with well-drained, acidic soils and is often associated with mixed coniferous forests. The plant's distribution is limited to a few isolated locations, making it a rare and endemic species. Conservation efforts are ongoing to protect its fragile ecosystem and ensure its survival.",
    "distribution_introduced_art_desc": "Abies equi-trojani was mainly introduced to areas with temperate climates and high elevations, where it thrives in well-drained soils. It has been found in regions of Europe and parts of North America, often in mountainous or forested landscapes. This species is typically introduced as an ornamental plant due to its attractive foliage and cone structure. However, its introduction has raised concerns about potential invasiveness in non-native environments. Its distribution is still being studied to understand its ecological impact."
}
