{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor var. baja-californica",
    "plant_slug": "abies-concolor-var-baja-californica",
    "plant_name_scientific": "abies concolor var. baja-californica",
    "intro": "Abies concolor var. baja-californica, commonly known as the coastal fir, is a variant of the white fir native to the coastal regions of southern California. It is characterized by its slender, conical shape and dense, dark green foliage. The needles are short and stout, with a bluish-white underside, and the cones are typically pendulous and elongated. It thrives in moist, well-drained soils and is adapted to the mild, coastal climate of its native range. This variety is often found in mixed coniferous forests and is valued for its ornamental appeal and ecological importance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor var. baja-californica is primarily native to the southern United States, specifically California and Baja California. It is found in the coastal mountain ranges of these regions, where it thrives in moist, cool climates. This variety is adapted to grow in areas with well-drained soils and is often found in mixed coniferous forests. It is particularly common in the Transverse Ranges and the Peninsular Ranges of southern California. The plant's distribution is limited to these specific geographic areas, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Abies concolor var. baja-californica was mainly introduced to the western United States, particularly in California and Baja California. It is commonly found in mountainous regions with a Mediterranean climate. This variety is known for its hardiness and ability to thrive in rocky soils. It has been planted in both natural and urban landscapes for its ornamental value. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
