{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor f. brevifolia",
    "plant_slug": "abies-concolor-f-brevifolia",
    "plant_name_scientific": "abies concolor f. brevifolia",
    "intro": "Abies concolor f. brevifolia, commonly known as the white fir dwarf form, is a variant of the white fir tree native to the western United States. It is characterized by its shorter, more compact growth habit compared to the typical white fir. The foliage consists of needle-like leaves that are typically light green and covered in a waxy cuticle. Its cones are generally small and conical, maturing to a reddish-brown color. This subspecies is often found in high-elevation forests and is adapted to cooler, moist environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor f. brevifolia is primarily native to the western United States, particularly in regions of California, Oregon, and Nevada. This subspecies is commonly found in high elevation areas, including mountain ranges such as the Sierra Nevada and the Cascade Mountains. It thrives in cool, moist environments with well-drained soils, often growing in dense forests. The plant is adapted to harsh alpine conditions and is typically found at elevations above 2,000 meters. Its limited distribution is due to its specific habitat requirements and geographic isolation.",
    "distribution_introduced_art_desc": "Abies concolor f. brevifolia was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous or high-altitude regions. It thrives in environments with moderate to high humidity and is often found in forests with a mix of coniferous and deciduous trees. This subspecies is particularly adapted to regions with cold winters and mild summers, making it suitable for cultivation in temperate zones. Its introduction has been primarily for ornamental purposes due to its attractive foliage and resilience. However, it is not commonly found in the wild outside its native range."
}
