{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pinsapo var. baborensis",
    "plant_slug": "abies-pinsapo-var-baborensis",
    "plant_name_scientific": "abies pinsapo var. baborensis",
    "intro": "Abies pinsapo var. baborensis, commonly known as the Baborensis fir, is a rare and endemic conifer native to the Iberian Peninsula. It is a variant of the Spanish fir, characterized by its distinctive silvery-blue needles and conical shape. The plant thrives in high-altitude, moist, and cool environments, typically found in mountainous regions. Its cones are small and reddish-brown, maturing in the second year. Due to habitat loss and limited distribution, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pinsapo var. baborensis is primarily native to the Iberian Peninsula, specifically in southern Spain. This variety of the Spanish fir is found in the Sierra de Cazorla, Sierra de Segura, and Sierra de Alcaraz mountain ranges. It grows in high-altitude areas with a Mediterranean climate, characterized by dry summers and wet winters. The plant thrives in rocky and mountainous terrain, often in mixed forests with other conifer species. Due to habitat loss and climate change, it is considered a vulnerable species.",
    "distribution_introduced_art_desc": "Abies pinsapo var. baborensis was mainly introduced to areas with temperate climates and well-drained soils, often in mountainous regions. It thrives in regions with moderate precipitation and sufficient sunlight. This variety is commonly found in parts of southern Europe, particularly in Spain and southern France. It has been introduced to several regions outside its native range for ornamental and reforestation purposes. However, its introduction has raised concerns about potential ecological impacts on local ecosystems."
}
