{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies chensiensis subsp. salouenensis",
    "plant_slug": "abies-chensiensis-subsp-salouenensis",
    "plant_name_scientific": "abies chensiensis subsp. salouenensis",
    "intro": "Abies chensiensis subsp. salouenensis, commonly known as the Salouenensis fir, is a rare and endemic subspecies native to the mountainous regions of eastern China. It is characterized by its conical shape, dark green needle-like leaves, and a dense, pyramidal crown. The plant thrives in cool, moist climates with well-drained soil, typically found in high-altitude forests. Its bark is thin and smooth, often covered in a layer of moss, while its cones are small and typically hang downward. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies chensiensis subsp. salouenensis is primarily native to the mountainous regions of central China, particularly in the Sichuan and Yunnan provinces. It is found in areas with high altitudes, typically ranging from 2,000 to 3,500 meters above sea level. This subspecies thrives in temperate climates with cool, moist conditions and well-drained soils. It is commonly associated with mixed coniferous forests and is often found in association with other species such as Pinus and Tsuga. Its distribution is limited to specific ecological niches, making it a relatively rare and localized plant.",
    "distribution_introduced_art_desc": "Abies chensiensis subsp. salouenensis was mainly introduced to areas with moist, well-drained soils and cool temperate climates, typically found in mountainous regions. It is commonly found in the eastern Himalayas, particularly in regions of China, Nepal, and Bhutan. This subspecies is often cultivated in botanical gardens and conservation areas due to its ornamental value and ecological significance. It prefers partial shade and is relatively resistant to pests and diseases. However, it is considered rare in the wild and is under threat from habitat loss and climate change."
}
