{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies guatemalensis subsp. longibracteata",
    "plant_slug": "abies-guatemalensis-subsp-longibracteata",
    "plant_name_scientific": "abies guatemalensis subsp. longibracteata",
    "intro": "Abies guatemalensis subsp. longibracteata, commonly known as the long-bract fir, is a rare and endemic subspecies native to high-altitude regions of Central America. It is characterized by its conical shape, dense foliage, and distinctive bract-like structures on its cones. The tree typically grows in cool, moist environments, often in cloud forests, where it thrives in partial shade. Its needles are dark green and arranged in spirals, while the cones are pendulous and release seeds in the fall. Due to its limited distribution and habitat specificity, it is considered a vulnerable species facing threats from deforestation and climate change.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies guatemalensis subsp. longibracteata is primarily native to central and southern Mexico, including the states of Oaxaca, Chiapas, and Veracruz. It is also found in parts of Central America, such as Guatemala and Belize. This subspecies thrives in high-altitude cloud forests, typically at elevations between 1,500 and 3,000 meters. It is often found in humid, temperate climates with well-drained soils. Due to habitat loss and climate change, its distribution has become increasingly fragmented.",
    "distribution_introduced_art_desc": "Abies guatemalensis subsp. longibracteata was mainly introduced to the United States as an ornamental tree due to its unique appearance and cold hardiness. It is commonly found in the southern and western regions, where it is cultivated in gardens and landscapes. The species is also used in reforestation projects because of its ability to thrive in a variety of soil conditions. Its introduction has led to its establishment in some areas beyond its native range in Central America. However, it is not considered invasive and is generally managed as a cultivated species."
}
