{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies davidiana",
    "plant_slug": "abies-davidiana",
    "plant_name_scientific": "abies davidiana",
    "intro": "Abies davidiana, commonly known as the David's fir, is a coniferous evergreen tree native to eastern Asia. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves. The tree produces cones that are typically reddish-brown and contain seeds surrounded by a wing for wind dispersal. It thrives in cool, moist climates and is often found in mountainous regions. The species is valued for its ornamental appeal and is sometimes cultivated in gardens and parks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies davidiana is primarily native to the mountainous regions of central and eastern China, including the provinces of Sichuan, Yunnan, and Hubei. It thrives in cool, moist climates at high elevations, typically between 1,500 and 3,500 meters above sea level. This species is commonly found in temperate forests and is often associated with other coniferous trees. It is also present in the Korean Peninsula and has been introduced to parts of northeastern Asia. Due to its specific habitat requirements, it is considered a relict species with a limited natural range.",
    "distribution_introduced_art_desc": "Abies davidiana was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It thrives in temperate zones with high elevation and moderate precipitation. This species is often cultivated in botanical gardens and conservation areas due to its ornamental value and ecological importance. Its introduction has helped in reforestation efforts in regions where native coniferous forests have been degraded. However, it is important to monitor its spread to prevent potential ecological imbalances in non-native environments."
}
