{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies pattonii",
    "plant_slug": "abies-pattonii",
    "plant_name_scientific": "abies pattonii",
    "intro": "Abies pattonii, commonly known as the Chinese fir, is a coniferous evergreen tree native to China. It belongs to the genus Abies in the family Pinaceae, characterized by its needle-like leaves and cone-bearing structure. The tree typically grows in mountainous regions, preferring cool and moist environments. Its foliage is dense and dark green, with a fragrant scent, and it produces small, cylindrical cones. The species is valued for its timber and is also cultivated for ornamental purposes in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies pattonii is primarily native to the mountainous regions of central and eastern China, particularly in the provinces of Sichuan, Yunnan, and Hubei. It thrives in high-altitude temperate forests, often found at elevations between 2,000 and 3,500 meters. This species is commonly associated with moist, well-drained soils and cooler climates. It is a valuable component of the local ecosystem, providing habitat for various wildlife species. However, its distribution is limited due to its specific environmental requirements.",
    "distribution_introduced_art_desc": "Abies pattonii was mainly introduced to the data as a rare and ecologically significant conifer species. It is native to the mountainous regions of eastern Asia, particularly in China. The introduction of Abies pattonii into the dataset highlights its unique adaptations to high-altitude environments. This species is valued for its ornamental qualities and potential ecological roles in forest ecosystems. Its inclusion provides valuable insights into biodiversity and conservation efforts in temperate regions."
}
