{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies arizonica",
    "plant_slug": "abies-arizonica",
    "plant_name_scientific": "abies arizonica",
    "intro": "Abies arizonica, commonly known as the Arizona fir, is a coniferous evergreen tree native to the southwestern United States. It is characterized by its conical shape, dark green needles, and distinctive white to yellow bark. The tree typically grows in high-elevation forests, preferring cool, moist climates with well-drained soil. Its cones are small and cylindrical, containing winged seeds that are dispersed by wind. The Arizona fir plays an important ecological role in its native habitat, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies arizonica is primarily native to the southwestern United States and northwestern Mexico. It is found in areas such as Arizona, New Mexico, and parts of Texas. This species thrives in high-elevation environments, typically above 2,000 meters. It is commonly found in coniferous forests and mountainous regions with well-drained soils. The plant is adapted to cold, dry climates and is an important component of the local ecosystem.",
    "distribution_introduced_art_desc": "Abies arizonica was mainly introduced to the western United States, particularly in Arizona and New Mexico. It is commonly found in high elevation areas with well-drained soils. This plant is often used in horticulture for its ornamental value and ability to thrive in cooler climates. It has been introduced to various regions beyond its native range for landscaping purposes. However, its spread is limited by its specific environmental requirements."
}
