{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies lowiana var. viridula",
    "plant_slug": "abies-lowiana-var-viridula",
    "plant_name_scientific": "abies lowiana var. viridula",
    "intro": "Abies lowiana var. viridula, commonly known as the Colorado blue spruce, is a variant of the white spruce native to the western United States. It is characterized by its dense, dark blue foliage that gives it a striking appearance in both natural and landscaped settings. The plant has needle-like leaves that are short and stout, with a distinctive blue-green hue due to a waxy coating. It typically grows in coniferous forests and is adapted to cold, mountainous climates. This variety is often cultivated for ornamental purposes due to its aesthetic appeal and hardiness.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies lowiana var. viridula is primarily native to the high mountainous regions of central and southern Mexico. This variety is found in the states of Oaxaca, Puebla, and Hidalgo. It grows in cloud forests and pine-oak woodlands at elevations ranging from 1,500 to 3,000 meters. The plant thrives in cool, moist climates with well-drained soils. It is an important component of the biodiversity in these mountain ecosystems.",
    "distribution_introduced_art_desc": "Abies lowiana var. viridula was mainly introduced to ornamental horticulture and landscape design due to its attractive evergreen foliage and compact growth habit. It is often cultivated in gardens and parks for its aesthetic value and ability to thrive in a variety of soil conditions. This variety is particularly favored in regions with mild climates where it can be grown as a decorative tree or shrub. Its introduction has expanded its range beyond its native habitat, contributing to its presence in non-native environments. However, its spread is generally controlled to prevent potential ecological impacts."
}
