{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nebrodensis",
    "plant_slug": "abies-nebrodensis",
    "plant_name_scientific": "abies nebrodensis",
    "intro": "Abies nebrodensis, commonly known as the Nebroden fir, is a species of evergreen conifer native to the Alps. It is characterized by its slender, pyramidal shape and needle-like leaves that are dark green and arranged in spirals. The cones of this plant are typically reddish-brown and hang downward, containing winged seeds. It thrives in cool, moist environments at high altitudes. The plant is valued for its ornamental qualities and its role in alpine ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies nebrodensis"
    },
    "taxonomy_art_desc": "Abies nebrodensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and clubmosses. Its subclass is Pinidae, a group of coniferous plants that includes pines, firs, and other similar species. Its order is Pinales, which consists of coniferous gymnosperms, primarily composed of pine, fir, and cedar trees. Its family is Pinaceae, known as the pine family, which includes various coniferous trees with needle-like leaves and cone-bearing structures. Its genus is Abies, commonly known as firs, which are evergreen trees with slender, often cylindrical cones and whorled branches. Its species is Abies nebrodensis, a specific type of fir native to the Alps, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Sicilia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nebrodensis is primarily native to Sicilia. This species is found in the mountainous regions of the island, particularly in the Madonie and Nebrodi ranges. It thrives in cool, moist environments at higher altitudes. The plant is adapted to the unique climate and soil conditions of Sicily. It plays an important role in the local ecosystems and is a symbol of the island's biodiversity.",
    "distribution_introduced_art_desc": "Abies nebrodensis was mainly introduced to specific regions in Europe, particularly in the Alps and surrounding mountainous areas. It was introduced as a ornamental species due to its attractive cone and foliage. The distribution is limited to areas with cool, moist climates and well-drained soils. It has been planted in botanical gardens and private collections across several countries. However, its natural range remains restricted and it is not widely established in the wild."
}
