{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies abies",
    "plant_slug": "abies-abies",
    "plant_name_scientific": "abies abies",
    "intro": "Abies abies, commonly known as the European fir, is a coniferous evergreen tree native to central and northern Europe. It is characterized by its tall, slender form and dense, pyramidal crown. The tree has needle-like leaves that are flat, dark green on top, and whitish underneath, with two white stomatal bands. Its cones are cylindrical, woody, and typically hang downward, containing seeds that are dispersed by wind. Abies abies is valued for its ornamental appeal and has been used historically for timber and Christmas tree purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies abies is primarily native to Europe, including countries such as Germany, Austria, Switzerland, and northern Italy. It is also found in parts of Russia and the Caucasus region. This species thrives in mountainous areas and is commonly found in coniferous forests. It prefers cool, moist climates with well-drained soil. The tree is known for its distinctive cone-like shape and is a symbol of the Christmas tree in many cultures.",
    "distribution_introduced_art_desc": "Abies abies was mainly introduced to Europe, North America, and parts of Asia through human activity, primarily for ornamental purposes and reforestation efforts. It has been widely cultivated in gardens, parks, and urban landscapes due to its attractive pyramidal shape and evergreen foliage. The introduction of Abies abies has led to its establishment in various regions beyond its native range in Scandinavia and the Alps. It is often used in ecological restoration projects because of its ability to thrive in a variety of soil types and climates. However, its spread can sometimes pose a risk to native ecosystems if not managed properly."
}
