{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies mucronata var. palustris",
    "plant_slug": "abies-mucronata-var-palustris",
    "plant_name_scientific": "abies mucronata var. palustris",
    "intro": "Abies mucronata var. palustris, commonly known as the bog fir, is a variant of the white fir native to the northern regions of North America. It is characterized by its narrow, conical shape and dark green, needle-like leaves that are short and thick. The plant thrives in moist, acidic soils and is often found in bogs or swampy areas. Its cones are small and cylindrical, typically maturing in the second year. This variant is adapted to cold, wet environments and plays a significant role in the ecological structure of its habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies mucronata var. palustris is primarily native to the boreal forest regions of northern North America, particularly in Canada. This variant is found in areas with cool, moist climates and is commonly associated with peat bogs and wetlands. It thrives in acidic soils and is often part of the tree line in subarctic environments. The species is also present in parts of Alaska and the northern United States. Its distribution is limited to specific ecological niches that support its growth and survival.",
    "distribution_introduced_art_desc": "Abies mucronata var. palustris was mainly introduced to areas with moist, cool climates and well-drained soils, often in mountainous or high-altitude regions. It is commonly found in regions with high humidity and moderate temperatures, making it suitable for specific ecological niches. This variety is typically introduced to areas where it can thrive in shaded, forested environments. Its introduction has been primarily for ornamental purposes or ecological restoration projects. However, its spread is limited due to its specific environmental requirements."
}
