{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies canadensis",
    "plant_slug": "abies-canadensis",
    "plant_name_scientific": "abies canadensis",
    "intro": "Abies canadensis, commonly known as the balsam fir, is a coniferous evergreen tree native to eastern North America. It is characterized by its pyramidal shape, needle-like leaves that are blue-green in color, and distinctive cylindrical cones. The tree produces a fragrant resin that has been historically used for medicinal and aromatic purposes. It thrives in cool, moist environments and is often found in boreal and mixed forests. The balsam fir plays an important ecological role, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies canadensis is primarily native to eastern North America, including the United States and Canada. It is commonly found in the Appalachian Mountains and the Great Lakes region. This species thrives in cool, moist climates and is often found in mixed hardwood-coniferous forests. It prefers well-drained soils and is typically found at elevations ranging from 300 to 2,000 meters. The tree is an important component of the forest ecosystem in its native range.",
    "distribution_introduced_art_desc": "Abies canadensis was mainly introduced to North America, particularly in regions with cold climates and well-drained soils. It is commonly found in the northeastern United States and southeastern Canada. This species is often planted in urban and suburban landscapes due to its ornamental value and adaptability. It thrives in areas with full sun to partial shade and requires moderate moisture. However, it is important to note that it can become invasive in certain ecosystems if not managed properly."
}
