{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies campylocarpa",
    "plant_slug": "abies-campylocarpa",
    "plant_name_scientific": "abies campylocarpa",
    "intro": "Abies campylocarpa, commonly known as the dwarf white fir, is a coniferous evergreen tree native to the mountainous regions of central and eastern Europe. It is characterized by its compact, pyramidal shape and dense, needle-like foliage that is typically a dark green on top and whitish underneath. The tree produces small, spherical cones that mature to a reddish-brown color, and its bark is smooth and grayish in appearance. Abies campylocarpa thrives in cool, moist climates and is often found in forested areas at high elevations. Due to its ornamental value and slow growth rate, it is occasionally cultivated in gardens and as a landscape tree.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies campylocarpa is primarily native to the western United States, particularly in California and Oregon. It is commonly found in the coastal mountain ranges and higher elevations of these regions. This species thrives in moist, cool climates and is often associated with mixed coniferous forests. It is also known to occur in parts of northern Mexico. The plant's distribution is limited to specific ecological niches, making it a relatively rare and localized species.",
    "distribution_introduced_art_desc": "Abies campylocarpa was mainly introduced to the Pacific Northwest region of the United States. It was brought in for its ornamental value due to its attractive foliage and cone structure. The plant has been found growing in both natural and cultivated settings within this area. However, it is considered a non-native species and has not become invasive in the local ecosystem. Its distribution remains limited to areas where it has been intentionally planted."
}
