{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies virescens",
    "plant_slug": "abies-virescens",
    "plant_name_scientific": "abies virescens",
    "intro": "Abies virescens, commonly known as the fir tree, is a coniferous evergreen tree native to the eastern United States. It is characterized by its slender, pyramidal shape and dark green, needle-like leaves that are typically arranged in spirals along the branches. The tree produces small, yellowish cones that mature to a reddish-brown color, containing seeds surrounded by a papery wing. Its bark is smooth and grayish-brown, becoming fissured with age, and it thrives in moist, well-drained soils. Abies virescens plays an important role in forest ecosystems, providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies virescens is primarily native to the Appalachian Mountains in the eastern United States. It is found in regions spanning from New York to Georgia, including parts of the Carolinas and Tennessee. This species thrives in cool, moist climates at elevations between 600 and 2,000 meters. It is commonly found in mixed hardwood forests and on rocky slopes. Its distribution is limited to specific ecological niches within this geographic range.",
    "distribution_introduced_art_desc": "Abies virescens was mainly introduced to the northeastern United States and parts of Canada. It is commonly found in forested areas with moist, well-drained soils. This species is often used in landscaping due to its attractive pyramidal shape and evergreen foliage. It has been introduced to various regions beyond its native range for ornamental purposes. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
