{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies nephrolepis f. chlorocarpa",
    "plant_slug": "abies-nephrolepis-f-chlorocarpa",
    "plant_name_scientific": "abies nephrolepis f. chlorocarpa",
    "intro": "Abies nephrolepis f. chlorocarpa, commonly known as the emerald fir, is a variant of the noble fir. It is a coniferous evergreen tree native to the Pacific Northwest of North America. The plant features needle-like leaves that are dark green and densely packed, giving it a lush appearance. It produces cones that are typically cylindrical and contain edible seeds. This variety is valued for its ornamental qualities and is often cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies nephrolepis f. chlorocarpa is primarily native to the mountainous regions of Southeast Asia, particularly in China, Vietnam, and northern India. This subspecies thrives in high-altitude forests where the climate is cool and moist. It is commonly found in the Himalayas and adjacent mountain ranges, growing at elevations between 1,500 and 3,500 meters. The plant prefers well-drained soils and is often part of mixed coniferous forests. Its distribution is limited to specific ecological niches that provide the right combination of temperature, humidity, and soil conditions.",
    "distribution_introduced_art_desc": "Abies nephrolepis f. chlorocarpa was mainly introduced to areas with cool, moist climates and well-drained soils, typically in mountainous regions. It is commonly found in regions with high elevation and moderate rainfall. This plant is often cultivated in botanical gardens and private collections due to its ornamental value. It prefers partial shade and can tolerate light frosts, making it suitable for temperate zones. Its introduction has been primarily for horticultural purposes rather than for ecological restoration."
}
