{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fraseri",
    "plant_slug": "abies-fraseri",
    "plant_name_scientific": "abies fraseri",
    "intro": "Abies fraseri, commonly known as the Fraser fir, is a coniferous evergreen tree native to the Appalachian Mountains of eastern North America. It is characterized by its dense, pyramidal shape and dark green, needle-like leaves that are arranged in spirals along the stems. The cones of the Fraser fir are typically slender and elongated, with short, sticky bracts that help in seed dispersal. It thrives in cool, moist environments and is often found at high elevations where the climate is temperate and humid. The tree is valued for its ornamental beauty and is also used in the Christmas tree industry.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies fraseri"
    },
    "taxonomy_art_desc": "Abies fraseri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often possessing jointed stems. Its subclass is Pinidae, a group of coniferous plants that includes pines, firs, and other evergreen trees. Its order is Pinales, which consists of coniferous plants that are typically evergreen and have needle-like or scale-like leaves. Its family is Pinaceae, commonly known as the pine family, which includes various coniferous trees such as pines, spruces, and firs. Its genus is Abies, which refers to the genus of fir trees, known for their conical shape and needle-like leaves. Its species is Abies fraseri, a specific type of fir tree native to North America, characterized by its slender form and distinctive cone structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "North Carolina",
        "Tennessee",
        "Virginia"
    ],
    "distribution_introduced": [
        "Great Britain"
    ],
    "distribution_native_art_desc": "Abies fraseri is primarily native to North Carolina, Tennessee, and Virginia. This species is commonly found in the Appalachian Mountains region of these states. It thrives in cool, moist climates with well-drained soils. The plant is typically found in forested areas, often growing at higher elevations. Its native distribution is closely tied to the specific environmental conditions of these regions.",
    "distribution_introduced_art_desc": "Abies fraseri was mainly introduced to Great Britain as an ornamental tree due to its attractive appearance and adaptability to temperate climates. It was popular in horticulture for its conical shape, dark green needles, and occasional white bark. The introduction of Abies fraseri to Great Britain occurred during the 19th century, primarily through botanical exchanges and garden introductions. It has since been cultivated in parks, gardens, and landscaped areas across the country. However, it is not considered invasive in Great Britain and is generally managed as a non-native species."
}
