{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies delavayi subsp. fansipanensis",
    "plant_slug": "abies-delavayi-subsp-fansipanensis",
    "plant_name_scientific": "abies delavayi subsp. fansipanensis",
    "intro": "Abies delavayi subsp. fansipanensis, commonly known as the Fansipan fir, is a rare and endemic coniferous tree native to the high-altitude regions of Vietnam. It belongs to the family Pinaceae and is characterized by its slender, conical shape and needle-like leaves. The tree typically grows in cool, moist environments at elevations above 2,500 meters. Its cones are small and usually hang downward, containing winged seeds that are dispersed by wind. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Pinidae",
        "order": "Pinales",
        "family": "Pinaceae",
        "genus": "Abies",
        "species": "Abies delavayi"
    },
    "taxonomy_art_desc": "Abies delavayi subsp. fansipanensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Pinidae, which includes coniferous plants like pines and firs, typically with needle-like leaves and cone-bearing structures. Its order is Pinales, a group of coniferous plants that includes pines, firs, and cedars, characterized by their needle-like leaves and cone-based reproduction. Its family is Pinaceae, commonly known as the pine family, which includes various coniferous trees with needle-like leaves and woody cones. Its genus is Abies, which consists of species commonly known as firs, typically characterized by their slender, cone-shaped crowns and flat, spruce-like needles. Its species is Abies delavayi, a type of fir native to China, with the subspecies fansipanensis being a distinct variant found in specific high-altitude regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies delavayi subsp. fansipanensis is primarily native to Vietnam. This subspecies is found in the mountainous regions of the country, particularly in the northern highlands. It thrives in cool, moist climates at higher elevations. The plant is commonly associated with forested areas and is often found in mixed coniferous forests. Its distribution is limited to specific ecological zones within Vietnam.",
    "distribution_introduced_art_desc": "Abies delavayi subsp. fansipanensis was mainly introduced to specific regions in China, particularly in the mountainous areas of Yunnan and Sichuan provinces. This subspecies is adapted to high-altitude environments and thrives in cool, moist climates with well-drained soils. It is often found in mixed forests alongside other coniferous species. The introduction of this plant has contributed to local biodiversity and ecological stability in its new habitats. However, its spread is limited by its specific environmental requirements."
}
