{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies × borisii-regis var. pungentipilosa",
    "plant_slug": "abies-×-borisii-regis-var-pungentipilosa",
    "plant_name_scientific": "abies × borisii-regis var. pungentipilosa",
    "intro": "Abies × borisii-regis var. pungentipilosa, commonly known as the Siberian fir, is a hybrid conifer native to the mountainous regions of Central Asia. It is characterized by its narrow, pyramidal shape and dark green, needle-like leaves that are slightly twisted. The cones are typically erect and bear small, spiky scales. This variety is well adapted to cold climates and can thrive in rocky, well-drained soils. It is often used in horticulture for its ornamental value and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies × borisii-regis var. pungentipilosa is primarily native to the mountainous regions of central and eastern Europe, particularly in the Carpathian Mountains. This hybrid fir species occurs in areas spanning parts of Romania, Ukraine, and the Czech Republic. It thrives in cool, moist climates at high altitudes, often found in mixed coniferous forests. The plant is adapted to rocky and well-drained soils, which are common in its native habitat. Its distribution is limited to these specific ecological conditions, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Abies × borisii-regis var. pungentipilosa was mainly introduced to the United States as an ornamental tree due to its unique appearance and hardiness. It is a hybrid of Abies boreris and Abies regis, known for its dense foliage and pyramidal shape. This variety is particularly valued for its ability to thrive in colder climates and its resistance to certain pests. It has been cultivated in gardens and landscapes across North America, especially in regions with temperate to subarctic conditions. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
