{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies brachyphylla var. tomomi",
    "plant_slug": "abies-brachyphylla-var-tomomi",
    "plant_name_scientific": "abies brachyphylla var. tomomi",
    "intro": "Abies brachyphylla var. tomomi, commonly known as the Tomomi fir, is a rare and endemic conifer native to Japan. It is a variant of the brachyphylla fir, characterized by its short, dense needles and compact growth habit. The tree typically grows in high-altitude regions, where it forms dense forests or isolated stands. Its cones are small and often remain attached to the branches for a long time, contributing to its unique ecological role. The species is of particular interest to botanists due to its limited distribution and potential for genetic diversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies brachyphylla var. tomomi is primarily native to the Russian Far East, particularly in the Primorsky Krai region. This variety of the Siberian fir is found in mountainous areas with cool, moist climates. It grows in temperate rainforests and is adapted to the humid and often foggy conditions of its native habitat. The plant is typically found at elevations between 600 and 1,500 meters. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abies brachyphylla var. tomomi was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is commonly cultivated in gardens and landscapes where its ornamental value and hardiness are appreciated. This variety is known for its compact growth and dense foliage, making it suitable for windbreaks and privacy screens. It thrives in USDA hardiness zones 4 through 7, where it can tolerate light frosts and moderate drought. Due to its adaptability, it has been introduced to various parts of North America and Europe for both ecological and aesthetic purposes."
}
