{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies clambrasiliana",
    "plant_slug": "abies-clambrasiliana",
    "plant_name_scientific": "abies clambrasiliana",
    "intro": "Abies clambrasiliana, commonly known as the Brazilian fir, is a coniferous evergreen tree native to the high-altitude regions of southern Brazil. It is characterized by its slender, conical shape and dense, dark green foliage. The needles are flat, shiny, and have a slight sheen, while the cones are typically pendulous and woody. This species thrives in cool, moist environments and is adapted to mountainous climates. Its botanical features make it an important component of the cloud forest ecosystems in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies clambrasiliana is primarily native to the mountainous regions of central and southern Chile. It is commonly found in the Andes, particularly in the valleys and slopes of the Central Valley and the Lake District. This species thrives in temperate climates with high humidity and well-drained soils. It is often associated with cloud forests and high-altitude forests. Due to its specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abies clambrasiliana was mainly introduced to the United States as an ornamental tree due to its attractive appearance and hardiness. It is commonly found in gardens and landscapes across the eastern and central regions of the country. The plant has been cultivated for its conical shape, dark green needles, and pleasant fragrance. However, it is not native to North America and has been introduced primarily for horticultural purposes. Its distribution is limited to areas where it can thrive in cooler climates."
}
