{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies fansipanensis",
    "plant_slug": "abies-fansipanensis",
    "plant_name_scientific": "abies fansipanensis",
    "intro": "Abies fansipanensis, commonly known as the Fan mountain fir, is a rare and endemic species native to the high altitudes of Vietnam. It is a coniferous evergreen tree characterized by its needle-like leaves and cone-bearing structure. The plant thrives in cool, moist environments with well-drained soil, typically found in mountainous regions. Its botanical features include a slender trunk and a conical shape, typical of many fir species. Due to its limited distribution and habitat specificity, it is considered a valuable subject for botanical research and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies fansipanensis is primarily native to the high-altitude regions of Vietnam, specifically on the Fansipan mountain in the northern part of the country. This species is found in the cloud forests of the Hoang Lien Son range, which is part of the larger Indo-Burma biodiversity hotspot. It thrives in cool, moist climates with high humidity and well-drained soils. The plant is typically found at elevations between 2,000 and 3,500 meters above sea level. Due to its restricted habitat, it is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Abies fansipanensis was mainly introduced to areas with high altitude and cool climates, particularly in mountainous regions of Southeast Asia. It thrives in well-drained soils and requires moderate to high levels of precipitation. This species is often found in cloud forests and is adapted to the unique microclimates of its native habitat. Its introduction to new regions has been limited due to its specific ecological requirements. However, it has shown potential for reforestation projects in similar environments."
}
