{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies macrocarpa",
    "plant_slug": "abies-macrocarpa",
    "plant_name_scientific": "abies macrocarpa",
    "intro": "Abies macrocarpa, commonly known as the white fir, is a coniferous evergreen tree native to western North America. It is characterized by its slender, conical shape and its distinctive silvery-blue needles that are typically arranged in spirals along the branches. The tree produces cones that are cylindrical and often hang downward, containing winged seeds. Its bark is smooth and grayish-white, becoming fissured with age. White fir is often found in mountainous regions and is valued for its timber and ecological role in forest ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies macrocarpa is primarily native to the western United States, including parts of California, Oregon, and Nevada. It is also found in northern Mexico, particularly in the Sierra Madre Occidental mountain range. This species thrives in high-altitude environments, typically at elevations between 1,500 and 3,000 meters. It is commonly associated with mixed coniferous forests and often grows in association with other tree species like Douglas fir and lodgepole pine. Its natural range extends into Baja California, where it occupies similar ecological niches.",
    "distribution_introduced_art_desc": "Abies macrocarpa was mainly introduced to areas with temperate climates and well-drained soils, often in regions where it was not originally native. It has been introduced to parts of the United States, particularly in the western states, where it is cultivated for its ornamental value. The plant is commonly found in urban and suburban landscapes due to its attractive appearance and adaptability. However, its introduction has raised concerns about potential ecological impacts in non-native environments. It is important to monitor its spread to prevent unintended consequences on local ecosystems."
}
