{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies conica",
    "plant_slug": "abies-conica",
    "plant_name_scientific": "abies conica",
    "intro": "Abies conica, commonly known as the dwarf fir, is a coniferous evergreen tree native to the mountainous regions of western North America. It is characterized by its compact, rounded shape and dense foliage, which gives it a distinctive, ornamental appearance. The tree has needle-like leaves that are short and stout, with a bluish-green color and a waxy coating. Its cones are small and cylindrical, typically maturing to a dark reddish-brown. Abies conica is well adapted to cold climates and is often used in horticulture for its aesthetic value and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies conica is primarily native to the mountainous regions of western North America, including parts of the United States and Canada. It is commonly found in the Pacific Northwest, particularly in Washington, Oregon, and British Columbia. This species thrives in cool, moist environments at high elevations, often in coniferous forests. It is adapted to rocky and well-drained soils, making it a characteristic plant of subalpine and alpine habitats. Its natural range extends from the Sierra Nevada to the Cascade Range and into the Rocky Mountains.",
    "distribution_introduced_art_desc": "Abies conica was mainly introduced to specific regions in the northern hemisphere, including parts of Europe, Asia, and North America. It was introduced primarily for ornamental purposes due to its unique conical shape and evergreen foliage. The plant is commonly found in gardens and landscaped areas where it serves as a decorative element. However, in some regions, it has become invasive, outcompeting native species and altering local ecosystems. Its introduction has led to both aesthetic appreciation and ecological concerns."
}
