{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abies concolor brevifolia",
    "plant_slug": "abies-concolor-brevifolia",
    "plant_name_scientific": "abies concolor brevifolia",
    "intro": "Abies concolor brevifolia, commonly known as the white fir, is a coniferous evergreen tree native to the western United States. It is characterized by its conical shape, silver-blue needle-like leaves, and distinctive cone structure. The tree typically grows in high-altitude regions, preferring cool, moist climates with well-drained soil. Its foliage is dense and provides habitat for various wildlife species. The bark is thick and scaly, offering protection against environmental stressors.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abies concolor brevifolia is primarily native to the western United States, specifically in the states of California, Oregon, and Washington. It is commonly found in the Sierra Nevada and Cascade mountain ranges. This species thrives in high-elevation forests, often growing at elevations between 1,500 and 3,000 meters. It is adapted to cool, moist climates with well-drained soils. The plant is an important component of the subalpine and montane ecosystems in these regions.",
    "distribution_introduced_art_desc": "Abies concolor brevifolia was mainly introduced to areas with cool, moist climates and well-drained soils, typically found in mountainous regions. It is commonly found in the western United States, particularly in California and Oregon. This species thrives in elevations ranging from 1,500 to 3,000 meters. Its introduction has been largely due to its ornamental value and ability to adapt to various environmental conditions. However, it is important to monitor its spread to prevent potential ecological impacts on native flora."
}
