{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia javanica",
    "plant_slug": "abildgaardia-javanica",
    "plant_name_scientific": "abildgaardia javanica",
    "intro": "Abildgaardia javanica, commonly known as the Javanese bellflower, is a flowering plant native to Indonesia. It belongs to the Campanulaceae family and is characterized by its bell-shaped, violet-blue flowers. The plant typically grows in tropical and subtropical regions, often in moist, shaded environments. Its leaves are lance-shaped and arranged alternately along the stem. Abildgaardia javanica is valued for its ornamental beauty and is sometimes cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia javanica is primarily native to Southeast Asia, particularly Indonesia and the Philippines. It is commonly found in tropical regions with high humidity and warm climates. This plant thrives in lowland areas, often near coastal regions or in secondary forests. It is also present in parts of Malaysia and Papua New Guinea. Its natural habitat includes moist soils and shaded environments, making it a characteristic species of tropical rainforests.",
    "distribution_introduced_art_desc": "Abildgaardia javanica was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for cultivation. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native species and altering local ecosystems. The plant thrives in moist, shaded environments and is often found in disturbed habitats such as along stream banks and in forest understories. Its introduction highlights the ecological risks associated with non-native plant species in island ecosystems."
}
