{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia hispidula var. oligostachys",
    "plant_slug": "abildgaardia-hispidula-var-oligostachys",
    "plant_name_scientific": "abildgaardia hispidula var. oligostachys",
    "intro": "Abildgaardia hispidula var. oligostachys, commonly known as the woolly abildgaardia, is a flowering plant native to the mountainous regions of southern China. It belongs to the family Ericaceae, which includes heathers and related shrubs. The plant is characterized by its dense, hairy foliage and clusters of small, bell-shaped flowers that bloom in spring. It typically grows in well-drained, acidic soils and thrives in cool, moist environments. Due to its ornamental value and ecological significance, it is sometimes cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia hispidula var. oligostachys is primarily native to eastern Australia, specifically the coastal regions of New South Wales and southern Queensland. This variant is commonly found in sandy soils along the coastline, often in open forest or heathland environments. It thrives in areas with moderate rainfall and is adapted to the temperate climate of these regions. The plant is known for its distinctive silver-green foliage and is often used in coastal landscaping due to its hardiness. It plays an important ecological role in stabilizing dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Abildgaardia hispidula var. oligostachys was mainly introduced to the United States as an ornamental plant due to its attractive foliage and unique appearance. It is commonly found in gardens and landscaped areas in the southern and western regions of the country. Despite its aesthetic value, it has the potential to become invasive in certain environments if not managed properly. The plant prefers well-drained soils and full sun to partial shade, making it adaptable to various garden settings. However, its introduction has raised concerns among ecologists due to its ability to spread rapidly in natural habitats."
}
