{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia paradoxa",
    "plant_slug": "abildgaardia-paradoxa",
    "plant_name_scientific": "abildgaardia paradoxa",
    "intro": "Abildgaardia paradoxa, commonly known as the paradox plant, is a rare and unique species native to a specific region in South America. It is characterized by its striking, almost otherworldly appearance, with elongated, spiraling stems that twist upward in a helical pattern. The plant produces small, delicate flowers in shades of white and pale purple, which bloom in late spring. Its leaves are narrow and pointed, often covered in a fine, silvery pubescence. Due to its unusual morphology and limited distribution, it is considered a botanical curiosity and is often studied for its ecological and evolutionary significance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia paradoxa is primarily native to the Mediterranean region, specifically southern Europe and parts of North Africa. It thrives in rocky and coastal areas, often found on cliffs and limestone formations. This plant is well adapted to dry, sunny conditions and is commonly seen in regions with mild, wet winters and hot, dry summers. It is also found in some parts of the Middle East, including Israel and Jordan. Due to its limited habitat, it is considered a rare and specialized species.",
    "distribution_introduced_art_desc": "Abildgaardia paradoxa was mainly introduced to new habitats through human activities such as horticulture and landscaping. It has been found in regions with temperate climates, particularly in parts of Europe and North America. The plant thrives in well-drained soils and full sun, which allows it to spread rapidly in suitable environments. Its introduction has led to concerns about its potential impact on native plant communities. Despite its ornamental value, it is considered an invasive species in some areas."
}
