{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia densiflora",
    "plant_slug": "abildgaardia-densiflora",
    "plant_name_scientific": "abildgaardia densiflora",
    "intro": "Abildgaardia densiflora, commonly known as the dense-flowered abildgaardia, is a flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its compact, shrub-like growth habit. The plant produces clusters of small, tubular flowers that are typically pale blue or purple in color. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its ornamental value, it is occasionally cultivated in gardens, though it is not widely known outside its native region.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia densiflora is primarily native to southern Africa, specifically South Africa. It is found in the coastal regions of the Eastern Cape and the Western Cape provinces. This plant thrives in sandy soils and is commonly associated with coastal dunes and rocky outcrops. It is a hardy shrub that is well adapted to the arid and semi-arid climates of its native habitat. Due to its unique appearance and ecological significance, it is often featured in local botanical gardens and conservation areas.",
    "distribution_introduced_art_desc": "Abildgaardia densiflora was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and hardy nature. The plant has since spread beyond cultivated areas and is now found in native forests and disturbed sites. It is considered a potential threat to local ecosystems due to its competitive growth habits. Efforts are being made to monitor and control its spread to protect native plant species."
}
