{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia vaginata",
    "plant_slug": "abildgaardia-vaginata",
    "plant_name_scientific": "abildgaardia vaginata",
    "intro": "Abildgaardia vaginata, commonly known as the slender sandwort, is a flowering plant native to arctic and alpine regions of the Northern Hemisphere. It is a small, herbaceous species with a compact growth habit and typically produces clusters of small, white or pink flowers. The plant has a shallow root system and thrives in well-drained, sandy or gravelly soils. Its leaves are usually linear and arranged in a rosette, helping to reduce water loss in harsh environments. Abildgaardia vaginata is often found in tundra and mountainous areas where it plays a role in stabilizing soil and supporting local ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia vaginata is primarily native to the eastern and southern regions of South Africa, including the provinces of KwaZulu-Natal, Eastern Cape, and parts of the Free State. It is commonly found in rocky outcrops, grasslands, and along the edges of forests. This plant thrives in well-drained soils and is often associated with coastal and mountainous areas. It is adapted to a variety of microhabitats, including shaded undergrowth and open sunny slopes. Due to its limited distribution, it is considered a rare and localized species within its native range.",
    "distribution_introduced_art_desc": "Abildgaardia vaginata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shady environments and spreads rapidly through seed dispersal. Its introduction has raised concerns among conservationists due to its ecological impact."
}
