{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia afroorientalis",
    "plant_slug": "abildgaardia-afroorientalis",
    "plant_name_scientific": "abildgaardia afroorientalis",
    "intro": "Abildgaardia afroorientalis, commonly known as the African orchid, is a rare and striking plant native to the arid regions of Africa. It belongs to the Orchidaceae family and is characterized by its tall, slender stems and showy, fragrant flowers. The plant typically blooms during the rainy season, producing clusters of pale yellow to orange flowers with a distinct, sweet scent. It thrives in well-drained soils and requires full sun to partial shade for optimal growth. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia afroorientalis is primarily native to southern Africa, specifically South Africa and Namibia. It is commonly found in the arid and semi-arid regions of these countries. This plant thrives in sandy soils and is often associated with rocky outcrops and coastal dunes. It is well adapted to the harsh climatic conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic species in its region.",
    "distribution_introduced_art_desc": "Abildgaardia afroorientalis was mainly introduced to areas with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It thrives in well-drained soils and is often found in rocky or gravelly habitats. This plant is commonly cultivated in gardens and landscapes for its ornamental value, particularly its attractive, showy flowers. Due to its adaptability, it has been introduced to regions beyond its native range, including parts of California and the Mediterranean Basin. However, its introduction has raised concerns about its potential to become invasive in certain environments."
}
