{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia squarrosa",
    "plant_slug": "abildgaardia-squarrosa",
    "plant_name_scientific": "abildgaardia squarrosa",
    "intro": "Abildgaardia squarrosa, commonly known as the squarrose abildgaardia, is a flowering plant native to South Africa. It belongs to the Asteraceae family and is characterized by its compact, mat-forming growth habit. The plant produces small, daisy-like yellow flowers that bloom in late summer. Its leaves are typically narrow and covered in fine hairs, which help reduce water loss in its arid habitat. Abildgaardia squarrosa is often grown as an ornamental plant in rock gardens due to its hardy nature and attractive floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia squarrosa is primarily native to the eastern and southeastern United States, including states such as Florida, Georgia, and South Carolina. It is commonly found in moist, sandy soils along the Atlantic and Gulf coasts. This plant thrives in coastal dune environments and is often associated with maritime hammocks. It is well adapted to salt spray and sandy conditions, making it an important component of coastal ecosystems. However, its distribution is limited and it is considered a rare species in its native range.",
    "distribution_introduced_art_desc": "Abildgaardia squarrosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance. The introduction occurred in the late 19th century through horticultural trade. It has since become naturalized in certain regions, particularly in the North Island. However, its spread is limited and it is not considered a major invasive species."
}
