{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia longispicata",
    "plant_slug": "abildgaardia-longispicata",
    "plant_name_scientific": "abildgaardia longispicata",
    "intro": "Abildgaardia longispicata, commonly known as the long-spined abildgaardia, is a flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its striking, tubular flowers that range in color from white to pink. The plant typically grows in rocky or sandy soils and thrives in full sun. Its leaves are opposite and ovate, with a smooth texture, while its stems are often sparsely covered in short hairs. Abildgaardia longispicata is valued in horticulture for its ornamental appeal and is often cultivated in gardens with well-draining soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia longispicata is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and moist, shaded environments. This plant thrives in areas with high humidity and well-drained, nutrient-rich soils. It is often associated with secondary forests and can be found growing along riverbanks and in swampy areas. Its distribution is limited to specific habitats within these regions, making it a relatively rare and localized species.",
    "distribution_introduced_art_desc": "Abildgaardia longispicata was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was first brought to the country in the late 19th century by European settlers who were interested in cultivating exotic species. Despite its aesthetic appeal, the plant has since become invasive, outcompeting native vegetation in certain regions. Its rapid spread has raised concerns among conservationists and land managers. Efforts are now being made to control its population to protect the local ecosystem."
}
