{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia triflora",
    "plant_slug": "abildgaardia-triflora",
    "plant_name_scientific": "abildgaardia triflora",
    "intro": "Abildgaardia triflora, commonly known as the three-flowered abildgaardia, is a rare and delicate flowering plant native to the mountainous regions of southern Africa. It belongs to the family Acanthaceae and is characterized by its small, tubular flowers that are typically pink or purple in color. The plant produces three flowers per inflorescence, which is a distinctive feature contributing to its scientific name. It thrives in moist, well-drained soils and requires a cool, shaded environment to flourish. Due to its limited distribution and habitat specificity, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Cyperaceae",
        "genus": "Abildgaardia",
        "species": "Abildgaardia triflora"
    },
    "taxonomy_art_desc": "Abildgaardia triflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, typically featuring vascular tissues and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Poales, which comprises grasses, sedges, and rushes, known for their wind-pollinated flowers and narrow leaves. Its family is Cyperaceae, commonly known as the sedge family, which includes plants with triangular stems and often grows in wet or marshy habitats. Its genus is Abildgaardia, a small group of flowering plants native to certain parts of Asia, characterized by their specific morphological traits. Its species is Abildgaardia triflora, a particular plant within this genus known for its unique floral structure and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Botswana",
        "Cape Provinces",
        "DR Congo",
        "Eswatini",
        "Ghana",
        "India",
        "Kenya",
        "KwaZulu-Natal",
        "Madagascar",
        "Mozambique",
        "Sri Lanka",
        "Tanzania",
        "Togo",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia triflora is primarily native to Botswana, Cape Provinces, DR Congo, Eswatini, Ghana, India, Kenya, KwaZulu-Natal, Madagascar, Mozambique, Sri Lanka, Tanzania, Togo, Zambia, and Zimbabwe. It is found across a wide range of tropical and subtropical regions in Africa and parts of Asia. This plant typically grows in moist, shaded environments such as forests and woodland areas. It is often associated with riverine and swampy habitats. Its distribution reflects its adaptability to diverse ecological conditions within its native range.",
    "distribution_introduced_art_desc": "Abildgaardia triflora was mainly introduced to New Zealand as an ornamental plant due to its attractive, fragrant flowers. It was first recorded in the 19th century and has since spread beyond cultivated areas into natural ecosystems. The plant thrives in moist, well-drained soils and is commonly found in coastal and lowland regions. Its rapid growth and ability to reproduce both sexually and vegetatively have contributed to its establishment in the wild. However, it is considered a potential invasive species in some regions, raising concerns about its ecological impact."
}
