{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia coleotricha",
    "plant_slug": "abildgaardia-coleotricha",
    "plant_name_scientific": "abildgaardia coleotricha",
    "intro": "Abildgaardia coleotricha, commonly known as the hairy leaf fern, is a small, delicate fern species native to tropical regions of Africa. It is characterized by its finely divided, hairy leaves that give it a distinctive appearance. The plant typically grows in moist, shaded environments, such as forest understories or along stream banks. Its fronds are usually丛生, forming dense clusters that help it thrive in competitive habitats. The spore-producing structures, called sori, are located on the undersides of the leaves, typical of many fern species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia coleotricha is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and the Middle East. It thrives in rocky and coastal environments, often found in dry, sunny habitats. This plant is commonly associated with limestone soils and is frequently seen in areas with mild, Mediterranean climates. It has a limited geographic range and is not widely distributed beyond its native regions. Due to its specific habitat requirements, it is considered a rare and localized species in its native range.",
    "distribution_introduced_art_desc": "Abildgaardia coleotricha was mainly introduced to new environments through human activities such as horticultural trade and accidental transport. It is commonly found in disturbed soils and urban areas, where it thrives in nutrient-rich conditions. This plant has shown rapid growth and can outcompete native species, leading to ecological concerns in invaded regions. Its introduction has been documented in several countries, particularly in temperate regions with mild climates. Due to its invasive potential, monitoring and management strategies are essential to prevent further spread."
}
