{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia microcephala",
    "plant_slug": "abildgaardia-microcephala",
    "plant_name_scientific": "abildgaardia microcephala",
    "intro": "Abildgaardia microcephala, commonly known as the dwarf cycad, is a unique species native to the island of Sardinia. It is a member of the Cycadaceae family and is characterized by its compact, low-growing form. The plant features a thick, unbranched trunk with a crown of feathery, pinnate leaves. Its reproductive structures include cones, typical of cycads, with male and female cones occurring on separate plants. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia microcephala is primarily native to the island of Sardinia, Italy. It is found in specific habitats within the Mediterranean region, particularly in rocky and coastal areas. This plant thrives in well-drained soils and is adapted to the mild, temperate climate of the region. It is commonly found in open, sunny locations such as cliffs and coastal slopes. Due to its limited distribution, it is considered a rare and endemic species in Sardinia.",
    "distribution_introduced_art_desc": "Abildgaardia microcephala was mainly introduced to New Zealand as an ornamental plant due to its attractive, compact growth habit and unique foliage. It was first brought to the country in the early 20th century by horticultural enthusiasts and botanical collectors. Despite its aesthetic appeal, it has since become a potential invasive species, spreading beyond cultivated gardens into native ecosystems. Its rapid growth and ability to thrive in various soil types have raised concerns among conservationists. Efforts are now underway to monitor and control its spread to prevent ecological disruption."
}
