{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia tristachya",
    "plant_slug": "abildgaardia-tristachya",
    "plant_name_scientific": "abildgaardia tristachya",
    "intro": "Abildgaardia tristachya, commonly known as the slender sand-verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Geraniaceae family and is characterized by its upright growth habit and small, clustered flowers. The plant typically grows in sandy or gravelly soils and is adapted to arid environments. It produces pink to purple flowers that bloom in late spring to early summer. Abildgaardia tristachya is often found in desert scrub and chaparral habitats, where it plays a role in stabilizing soil and providing nectar for pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia tristachya is primarily native to the Caribbean islands, including parts of the Greater Antilles and the Lesser Antilles. It is commonly found in coastal areas and sandy soils, often growing in dune environments. This plant is adapted to salt spray and can thrive in brackish or saline conditions. It is an important component of the coastal vegetation in these regions. Its distribution is limited to specific island habitats where it has developed unique ecological relationships.",
    "distribution_introduced_art_desc": "Abildgaardia tristachya was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and hardy nature. It was first recorded in the 19th century and has since become established in several regions of the country. The plant thrives in a variety of soil types and is tolerant of both sun and shade, which has contributed to its spread. It is now considered a potential weed in some areas, particularly in disturbed habitats. Despite its ornamental value, its invasive potential has raised concerns among land managers and conservationists."
}
