{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia fulvescens",
    "plant_slug": "abildgaardia-fulvescens",
    "plant_name_scientific": "abildgaardia fulvescens",
    "intro": "Abildgaardia fulvescens, commonly known as the red-flowered orchid, is a terrestrial orchid species native to the tropical regions of South America. It is characterized by its slender, erect stems and lance-shaped leaves that are often covered in fine, hairy texture. The plant produces striking clusters of small, red-brown flowers with a distinctive yellow-green throat, which bloom during the rainy season. It thrives in moist, shaded environments and is often found in humid forests. Due to its ornamental value and limited distribution, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia fulvescens is primarily native to the eastern and southern regions of South Africa. It is found in the coastal areas of KwaZulu-Natal and the Eastern Cape provinces. This plant typically grows in sandy or gravelly soils along the coastline. It is commonly associated with dune environments and is well adapted to coastal conditions. Its distribution is limited to specific areas within these regions due to its particular habitat requirements.",
    "distribution_introduced_art_desc": "Abildgaardia fulvescens was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and disturbed forest edges. It thrives in regions with moderate to high levels of sunlight and well-drained soils. This plant is often found in temperate climates and has adapted to a variety of environmental conditions. Its introduction has been documented in several regions outside its native range, including parts of North America and Europe. Due to its rapid growth and ability to colonize new areas, it has become a common invasive species in some locations."
}
