{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia hispidula var. pyriformis",
    "plant_slug": "abildgaardia-hispidula-var-pyriformis",
    "plant_name_scientific": "abildgaardia hispidula var. pyriformis",
    "intro": "Abildgaardia hispidula var. pyriformis, commonly known as the pyriform abildgaardia, is a flowering plant belonging to the family Acanthaceae. It is characterized by its distinctive, egg-shaped (pyriform) leaves and clusters of small, tubular flowers that typically bloom in shades of pink or purple. The plant is native to certain regions of South America, particularly Brazil, and thrives in tropical and subtropical climates. It prefers well-drained soil and partial to full sunlight, making it suitable for cultivation in warm, humid environments. Its ornamental value lies in its unique leaf shape and delicate floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia hispidula var. pyriformis is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in arid and semi-arid regions, particularly in areas with well-drained soils. This plant thrives in rocky slopes, canyon walls, and desert scrub habitats. It is often associated with other drought-tolerant flora in these environments. Its distribution includes parts of Arizona, New Mexico, and northern Baja California.",
    "distribution_introduced_art_desc": "Abildgaardia hispidula var. pyriformis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and hardy nature. The introduction occurred in the 19th century during the period of European colonization. It has since become naturalized in certain regions, particularly in the North Island. However, it is not considered invasive and poses minimal threat to native ecosystems."
}
