{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia filamentosa",
    "plant_slug": "abildgaardia-filamentosa",
    "plant_name_scientific": "abildgaardia filamentosa",
    "intro": "Abildgaardia filamentosa, commonly known as the filamentous abildgaardia, is a rare and delicate flowering plant native to the mountainous regions of China. It belongs to the family Campanulaceae and is characterized by its slender, thread-like leaves and small, bell-shaped flowers that bloom in late spring. The plant typically grows in rocky or limestone soils and thrives in cool, humid climates. Due to its limited distribution and habitat specificity, it is considered a vulnerable species. Its unique morphology and ecological niche make it an important subject for botanical research.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia filamentosa is primarily native to the southern regions of South America, specifically Chile and Argentina. It is commonly found in arid and semi-arid environments, particularly in the Andean foothills and coastal areas. This plant thrives in rocky soils and is often associated with dry, sunny habitats. It is well adapted to the harsh climate of its native range, with a deep root system to access water. Due to its unique adaptations, it plays an important ecological role in its native ecosystems.",
    "distribution_introduced_art_desc": "Abildgaardia filamentosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, delicate flowers. The plant has since spread beyond cultivated areas and is now found in various habitats across the country. It is considered a potential environmental weed due to its ability to thrive in disturbed soils. However, its impact on native ecosystems is still being studied."
}
