{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia trichobasis",
    "plant_slug": "abildgaardia-trichobasis",
    "plant_name_scientific": "abildgaardia trichobasis",
    "intro": "Abildgaardia trichobasis, commonly known as the hairroot plant, is a flowering plant native to South Africa. It belongs to the family Amaryllidaceae and is characterized by its unique, tubular flowers that bloom in summer. The plant has a short, stocky stem and produces small, clustered flowers that are often pink or white in color. Its root system is fibrous and adapted to survive in dry conditions, making it a resilient species. It is often cultivated for its ornamental value and is relatively easy to grow in well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia trichobasis is primarily native to the western United States, specifically California and Nevada. It is commonly found in dry, rocky habitats such as chaparral and sagebrush communities. This plant thrives in well-drained soils and is adapted to the arid climate of its native range. It is often seen growing on slopes and in open areas with full sun exposure. Due to its limited distribution, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abildgaardia trichobasis was mainly introduced to New Zealand. It was first recorded in the early 20th century as an ornamental plant. The species has since spread beyond cultivation and is now found in various habitats across the country. It is considered a potential environmental weed due to its rapid growth and adaptability. Its introduction has raised concerns among conservationists due to its impact on native ecosystems."
}
