{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia hygrophila",
    "plant_slug": "abildgaardia-hygrophila",
    "plant_name_scientific": "abildgaardia hygrophila",
    "intro": "Abildgaardia hygrophila, commonly known as the water lily of the genus Abildgaardia, is a species of aquatic plant native to parts of Southeast Asia. It typically grows in still or slow-moving freshwater environments such as ponds and wetlands. The plant features broad, floating leaves that are often covered in a waxy layer to reduce water loss. Its flowers are usually white or pale pink, with a distinctive structure that aids in pollination by insects. Abildgaardia hygrophila plays an important role in maintaining water quality and providing habitat for aquatic life.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia hygrophila is primarily native to southern Africa, specifically South Africa. It is found in regions with high rainfall and moist environments. This species is commonly associated with riverine and swampy areas. It thrives in wetlands and is often found in the Eastern Cape and KwaZulu-Natal provinces. The plant is well adapted to the humid and temperate climate of its native habitat.",
    "distribution_introduced_art_desc": "Abildgaardia hygrophila was mainly introduced to wetland and riparian habitats, where it thrives in moist, nutrient-rich soils. It is commonly found in areas with standing or flowing water, such as marshes, ponds, and along riverbanks. This plant has been reported in several regions across Europe and parts of Asia, often in disturbed or human-altered environments. Its introduction has raised concerns due to its potential to outcompete native species in these ecosystems. As a result, it is now considered an invasive species in some areas where it has established itself."
}
