{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia capillaris",
    "plant_slug": "abildgaardia-capillaris",
    "plant_name_scientific": "abildgaardia capillaris",
    "intro": "Abildgaardia capillaris, commonly known as the slender sandwort, is a low-growing perennial plant native to the Arctic and subarctic regions. It typically forms dense mats of tiny, needle-like leaves that are covered in fine hairs, which help reduce water loss in cold, dry environments. The plant produces small, white or pinkish flowers in early summer, which are clustered in racemes. It thrives in sandy or gravelly soils and is often found in tundra and alpine habitats. Abildgaardia capillaris is an important component of polar ecosystems, contributing to soil stabilization and providing habitat for microorganisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia capillaris is primarily native to the eastern and southeastern United States, including states such as Virginia, North Carolina, South Carolina, Georgia, and Florida. It is commonly found in moist, acidic soils in forested areas, particularly in the understory of pine and hardwood forests. This plant thrives in shaded to partially shaded environments and is often associated with wetlands and swampy habitats. It is also found in the Caribbean, including parts of the Bahamas and Cuba. Abildgaardia capillaris is an important component of the native flora in these regions, contributing to local biodiversity and ecological stability.",
    "distribution_introduced_art_desc": "Abildgaardia capillaris was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, grass-like appearance. However, it has since become invasive, spreading rapidly in natural ecosystems. The plant thrives in moist, disturbed soils and can outcompete native vegetation. Its introduction has raised concerns among conservationists due to its potential to disrupt local biodiversity."
}
