{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia ugandensis",
    "plant_slug": "abildgaardia-ugandensis",
    "plant_name_scientific": "abildgaardia ugandensis",
    "intro": "Abildgaardia ugandensis, commonly known as the Uganda abildgaardia, is a rare and endemic plant species found primarily in the mountainous regions of Uganda. It belongs to the family Acanthaceae and is characterized by its striking, tubular flowers that range in color from purple to pink. The plant typically grows in moist, shaded habitats within montane forests, where it thrives in the cool, humid climate. Its leaves are lance-shaped and often have a velvety texture, while its stems are woody and branching. Due to its limited distribution and habitat specificity, it is considered a vulnerable species, highlighting the importance of conservation efforts in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia ugandensis is primarily native to the forests of eastern Africa, specifically Uganda and Tanzania. It is commonly found in the montane rainforests and humid woodlands of these regions. This plant thrives in shaded, moist environments with rich soil. It is often associated with the understory vegetation in these tropical forests. Due to its restricted habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abildgaardia ugandensis was mainly introduced to the region of East Africa, particularly in Uganda and neighboring countries. It is commonly found in forested areas and along riverbanks, where it thrives in moist, shaded environments. This plant is often used in traditional medicine for its purported healing properties. Its introduction has led to its cultivation in some local gardens and herbal farms. However, its spread is limited due to its specific ecological requirements."
}
