{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia setifolia",
    "plant_slug": "abildgaardia-setifolia",
    "plant_name_scientific": "abildgaardia setifolia",
    "intro": "Abildgaardia setifolia, commonly known as the slender leaf bellflower, is a perennial herbaceous plant native to southern Africa. It features narrow, grass-like leaves that are typically arranged in a rosette pattern. The plant produces delicate, bell-shaped flowers that are usually blue or violet in color. It thrives in well-drained soils and prefers full sun to partial shade. Abildgaardia setifolia is often cultivated for its ornamental value in gardens and rockeries.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia setifolia is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky and coastal environments, often found on cliffs and slopes. This plant is well adapted to dry, sunny conditions and is commonly associated with maritime climates. It is also present in some areas of the Middle East and southern Turkey. Its distribution is limited to specific microhabitats that provide the right balance of sunlight, soil type, and moisture.",
    "distribution_introduced_art_desc": "Abildgaardia setifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive, fern-like foliage. It was first recorded in the late 19th century and has since spread throughout the country, particularly in regions with a temperate climate. Despite its aesthetic appeal, it is considered a noxious weed in some areas because of its aggressive growth and ability to outcompete native vegetation. The plant's introduction has raised concerns among conservationists due to its potential to disrupt local ecosystems. Efforts are ongoing to control its spread and mitigate its impact on native flora."
}
