{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia hispidula subsp. brachyphylla",
    "plant_slug": "abildgaardia-hispidula-subsp-brachyphylla",
    "plant_name_scientific": "abildgaardia hispidula subsp. brachyphylla",
    "intro": "Abildgaardia hispidula subsp. brachyphylla, commonly known as the narrow-leaved sandverbena, is a low-growing, mat-forming perennial herb native to southern Africa. It typically thrives in sandy or gravelly soils and is often found in arid or semi-arid regions. The plant features small, hairy leaves and produces clusters of pale blue to violet flowers. It is well adapted to drought conditions, with a deep root system that helps it survive in nutrient-poor environments. This subspecies is valued for its ornamental appeal and ecological role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia hispidula subsp. brachyphylla is primarily native to southern Australia, specifically South Australia and western New South Wales. It is commonly found in arid and semi-arid regions, growing in sandy or gravelly soils. This subspecies is often associated with open woodlands and shrublands, where it thrives in full sun conditions. It is well adapted to the harsh climate of its native range, with drought-resistant features. Due to its limited distribution, it is considered a rare and localized species within its range.",
    "distribution_introduced_art_desc": "Abildgaardia hispidula subsp. brachyphylla was mainly introduced to areas with sandy soils and open habitats, such as coastal dunes and disturbed sites. It thrives in regions with moderate to high levels of sunlight and is often found in coastal or semi-arid environments. This subspecies is known for its low-growing, mat-forming growth habit and hairy foliage, which helps it retain moisture. It is commonly used in restoration projects due to its ability to stabilize soils and prevent erosion. However, its introduction has raised concerns about its potential impact on native plant communities in certain regions."
}
