{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia malawiensis",
    "plant_slug": "abildgaardia-malawiensis",
    "plant_name_scientific": "abildgaardia malawiensis",
    "intro": "Abildgaardia malawiensis, commonly known as the Malawi water lily, is a species of aquatic plant native to Lake Malawi in East Africa. It is characterized by its broad, floating leaves that provide habitat for various aquatic organisms. The plant produces white, fragrant flowers that bloom above the water surface, attracting pollinators such as bees and butterflies. Its roots are submerged, anchoring the plant in the lake's sediment while absorbing nutrients from the water. Abildgaardia malawiensis plays an important ecological role in maintaining the balance of the lake's aquatic ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia malawiensis is primarily native to the eastern African region, specifically Tanzania and Malawi. It is commonly found in the coastal areas and lowland regions of these countries. This plant thrives in sandy soils along the shores of Lake Malawi. It is a rare and endemic species, often growing in shallow marine environments. Its distribution is closely linked to the unique ecological conditions of the Lake Malawi basin.",
    "distribution_introduced_art_desc": "Abildgaardia malawiensis was mainly introduced to the aquatic ecosystems of southern Africa, particularly in countries like Malawi, Tanzania, and Mozambique. It was introduced as a potential ornamental plant due to its unique appearance and adaptability to freshwater environments. However, it has since become invasive in some regions, outcompeting native species for resources. Its rapid reproduction and tolerance to varying water conditions have contributed to its spread. Due to its ecological impact, efforts are being made to monitor and control its distribution in affected areas."
}
