{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia megastachys",
    "plant_slug": "abildgaardia-megastachys",
    "plant_name_scientific": "abildgaardia megastachys",
    "intro": "Abildgaardia megastachys, commonly known as the giant flame tree, is a striking tropical plant native to Madagascar. It is characterized by its large, showy red flowers that bloom in clusters, creating a dramatic visual impact. The plant has compound leaves with long, narrow leaflets, and it produces woody pods that contain seeds. It thrives in warm, humid climates and is often cultivated for its ornamental value. Due to its size and unique appearance, it is a popular choice for landscaping in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia megastachys is primarily native to the island of St. Helena in the South Atlantic Ocean. It is found in the mountainous regions of the island, particularly in the area known as the \"Cape\" near the northern coast. This plant thrives in humid, shaded environments and is often associated with rocky or limestone soils. It is a rare and endemic species, with a limited geographic range. Due to its restricted habitat, it is considered vulnerable to environmental changes and habitat loss.",
    "distribution_introduced_art_desc": "Abildgaardia megastachys was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its striking floral display. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in moist, well-drained soils and can spread rapidly through seed dispersal. Its introduction has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
