{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia fusca var. longifolia",
    "plant_slug": "abildgaardia-fusca-var-longifolia",
    "plant_name_scientific": "abildgaardia fusca var. longifolia",
    "intro": "Abildgaardia fusca var. longifolia, commonly known as the long-leaved abildgaardia, is a rare and delicate flowering plant native to specific regions of southern Africa. It is characterized by its slender, grass-like stems and elongated, lance-shaped leaves that give it its common name. The plant produces small, pale blue or purple flowers that bloom in late summer, adding a subtle yet striking visual element to its habitat. It thrives in well-drained soils and requires a sunny to partially shaded environment. Due to its limited distribution and specific ecological needs, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia fusca var. longifolia is primarily native to the western United States, specifically California and Oregon. It is commonly found in coastal regions and sandy soils along the Pacific coastline. This variety thrives in maritime climates with mild temperatures and moderate rainfall. It is often seen growing in dunes and along the edges of coastal forests. Its distribution is limited to these specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abildgaardia fusca var. longifolia was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its unique appearance and hardy nature. The distribution is primarily limited to garden settings and cultivated areas. It has not established itself in the wild in this region. However, its introduction has raised concerns about potential ecological impacts if it were to spread beyond controlled environments."
}
