{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia brevifolia",
    "plant_slug": "abildgaardia-brevifolia",
    "plant_name_scientific": "abildgaardia brevifolia",
    "intro": "Abildgaardia brevifolia, commonly known as the short-leaved abildgaardia, is a rare and unique plant species native to the mountainous regions of southern Africa. It is characterized by its compact growth habit and small, narrow leaves that are typically covered in a dense layer of fine hairs. The plant produces clusters of tiny, pale green flowers that bloom during the cooler months, adding a subtle aesthetic to its otherwise subdued appearance. Due to its limited distribution and specific habitat requirements, it is considered a vulnerable species. Its botanical features make it an interesting subject for study in the field of rare flora and ecological adaptation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia brevifolia is primarily native to the western Pacific, specifically found in parts of Japan, the Philippines, and Indonesia. It thrives in humid tropical and subtropical climates, often growing in coastal areas or near freshwater habitats. This plant is commonly associated with mangrove ecosystems and brackish water environments. It is known for its small, narrow leaves and is often used in traditional medicine in its native regions. Its distribution is limited to specific geographic areas, making it a rare and specialized species.",
    "distribution_introduced_art_desc": "Abildgaardia brevifolia was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and hardy nature. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in coastal environments and can spread rapidly through seed dispersal. Efforts are ongoing to control its spread and protect local ecosystems."
}
