{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia elegantissima",
    "plant_slug": "abildgaardia-elegantissima",
    "plant_name_scientific": "abildgaardia elegantissima",
    "intro": "Abildgaardia elegantissima, commonly known as the elegant abildgaardia, is a flowering plant species native to the southern United States. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its showy, trumpet-shaped flowers that range in color from white to pink. It typically grows in moist, well-drained soils in woodland or swampy areas. Abildgaardia elegantissima is valued for its ornamental appeal and is often cultivated in gardens for its beauty.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia elegantissima is primarily native to the island of Sardinia, Italy. This rare and unique plant is found exclusively in specific coastal areas of the island. It thrives in rocky, calcareous soils and is often associated with Mediterranean climates. Due to its limited distribution, it is considered an endemic species of Sardinia. Conservation efforts are ongoing to protect this plant from habitat loss and environmental threats.",
    "distribution_introduced_art_desc": "Abildgaardia elegantissima was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first recorded in the early 20th century and has since been found in various regions across the country. The plant is primarily cultivated in gardens and botanical collections, though it has occasionally naturalized in some areas. Its introduction has raised concerns among conservationists due to its potential to become invasive. Despite its beauty, efforts are being made to monitor and manage its spread to protect native ecosystems."
}
