{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia schlechteri",
    "plant_slug": "abildgaardia-schlechteri",
    "plant_name_scientific": "abildgaardia schlechteri",
    "intro": "Abildgaardia schlechteri, commonly known as the Schlechter's abildgaardia, is a rare and delicate flowering plant native to the mountainous regions of Central Asia. It belongs to the Apiaceae family, which includes carrots and parsley, and is characterized by its finely divided, fern-like leaves. The plant produces small, white or pale yellow flowers arranged in umbels, typical of its family. It thrives in cool, moist environments and is often found in rocky or alpine habitats. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia schlechteri is primarily native to the eastern part of the Democratic Republic of the Congo. It is found in the dense rainforests of this region, particularly in the basins of the Congo and Lualaba rivers. This plant thrives in humid, shaded environments with high rainfall throughout the year. It is typically found in the undergrowth of the forest, often near streams or in areas with rich organic soil. Due to habitat loss, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abildgaardia schlechteri was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded environments such as forests and along stream banks. This plant has become established in several states including Oregon and Washington. Its introduction is believed to be due to natural dispersal from nearby native populations or accidental human transport. It is considered a non-native species with potential ecological impacts on local flora."
}
