{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia cyperoides",
    "plant_slug": "abildgaardia-cyperoides",
    "plant_name_scientific": "abildgaardia cyperoides",
    "intro": "Abildgaardia cyperoides, commonly known as the marsh sedge, is a flowering plant belonging to the Cyperaceae family. It is a perennial herb that typically grows in wet or marshy environments, often found in temperate regions. The plant has narrow, grass-like leaves and produces small, spike-like inflorescences. Its flowers are usually green or brown, and it blooms during the summer months. Abildgaardia cyperoides plays a role in stabilizing soil in wetland ecosystems and provides habitat for various small organisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia cyperoides is primarily native to South America, specifically found in regions of Brazil, Paraguay, and Argentina. This plant thrives in wetland and marshy environments, often growing in association with other aquatic or semi-aquatic vegetation. It is commonly found in the Pantanal wetland, one of the world's largest tropical wetlands. The species is adapted to seasonal flooding and has a preference for nutrient-rich soils. Due to its limited distribution, it is considered a rare and specialized plant within its native range.",
    "distribution_introduced_art_desc": "Abildgaardia cyperoides was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive appearance. However, it has since become invasive, outcompeting native species in wetland habitats. The plant spreads rapidly through its rhizomes, leading to the degradation of natural ecosystems. Conservation efforts are underway to control its spread and protect local biodiversity."
}
