{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia rottboelliana",
    "plant_slug": "abildgaardia-rottboelliana",
    "plant_name_scientific": "abildgaardia rottboelliana",
    "intro": "Abildgaardia rottboelliana, commonly known as the narrow-leafed ironwood, is a perennial herb native to the northeastern United States. It belongs to the Apiaceae family, which includes carrots and parsley, and is characterized by its finely divided, fern-like leaves. The plant produces small, white to greenish-yellow flowers arranged in umbels, typical of the family. It thrives in moist, well-drained soils and is often found in open woods or along stream banks. Its historical use by indigenous peoples for medicinal purposes highlights its ecological and cultural significance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia rottboelliana is primarily native to the Caribbean region, including parts of the Greater and Lesser Antilles. It is commonly found in coastal areas and sandy soils along the shores of islands such as Cuba, Hispaniola, Jamaica, and Puerto Rico. This plant thrives in tropical and subtropical climates, often growing in dune environments or on rocky coastlines. It is an important component of the coastal vegetation in these regions. Due to its limited distribution, it is considered a rare and endemic species in parts of its range.",
    "distribution_introduced_art_desc": "Abildgaardia rottboelliana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. The distribution of this species has been limited to specific regions within New Zealand. It is not native to the country and has not established itself widely in the wild. However, it is occasionally found in gardens and cultivated areas."
}
