{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia igneotonsa",
    "plant_slug": "abildgaardia-igneotonsa",
    "plant_name_scientific": "abildgaardia igneotonsa",
    "intro": "Abildgaardia igneotonsa, commonly known as the flame-tipped lily, is a rare and striking plant native to the mountainous regions of southern China. It is characterized by its tall, erect stem and large, showy flowers that range in color from yellow to orange, resembling flames. The plant belongs to the Amaryllidaceae family and is known for its unique floral structure, which includes six reflexed petals. It thrives in well-drained soils and requires a cool, moist environment to flourish. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia igneotonsa is primarily native to the Mediterranean region, specifically southern Europe and parts of North Africa. It is commonly found in countries such as Spain, Portugal, Italy, and Morocco. This plant thrives in rocky and coastal areas, often growing on cliffs or in dry, sunny environments. It is well adapted to the warm, arid conditions typical of its native habitat. Due to its limited range, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abildgaardia igneotonsa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its striking red and yellow flowers. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in coastal and disturbed habitats, making it difficult to control. Efforts are ongoing to manage its spread and protect local biodiversity."
}
