{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia abbreviata",
    "plant_slug": "abildgaardia-abbreviata",
    "plant_name_scientific": "abildgaardia abbreviata",
    "intro": "Abildgaardia abbreviata, commonly known as the dwarf abildgaardia, is a small, flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its compact growth habit and showy, tubular flowers. The plant typically grows in rocky or sandy soils and prefers full sun to partial shade. Its foliage is often covered in fine hairs, and it produces clusters of bright red or orange flowers during the summer months. Abildgaardia abbreviata is well-suited for rock gardens and xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia abbreviata is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland forests where there is ample sunlight and well-drained soil. This plant is commonly found in areas with a warm climate and high rainfall throughout the year. It is often associated with secondary growth forests and can be seen growing along forest edges or in disturbed habitats. Due to its specific environmental requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Abildgaardia abbreviata was mainly introduced to New Zealand. It is considered an invasive species that has spread beyond its original cultivation areas. The plant was initially introduced for ornamental purposes due to its attractive foliage. However, it has since become a threat to native ecosystems by outcompeting local flora. Its distribution is now widespread across various regions of New Zealand."
}
