{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia fusca",
    "plant_slug": "abildgaardia-fusca",
    "plant_name_scientific": "abildgaardia fusca",
    "intro": "Abildgaardia fusca, commonly known as the dark leaved abildgaardia, is a species of flowering plant in the family Acanthaceae. It is native to tropical regions of Africa, particularly South Africa, where it thrives in moist, shaded environments. The plant is characterized by its dark green, glossy leaves and clusters of small, tubular flowers that range in color from white to pale pink. It is often found growing in rocky or forested areas, and it prefers well-drained soil with consistent moisture. Due to its ornamental value, it is occasionally cultivated in botanical gardens and by horticulturists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia fusca is primarily native to the southern United States, specifically Texas and northeastern Mexico. It is commonly found in limestone grasslands and open woodlands. This plant thrives in well-drained soils and full sun exposure. It is often associated with disturbed habitats such as roadsides and fields. Due to its limited range, it is considered a rare and endangered species in many areas.",
    "distribution_introduced_art_desc": "Abildgaardia fusca was mainly introduced to New Zealand. It was brought there intentionally for horticultural purposes due to its ornamental value. The plant has since spread beyond cultivated areas and is now considered invasive in some regions. It thrives in a variety of soil types and can grow in both full sun and partial shade. Its rapid growth and ability to form dense stands have raised concerns about its impact on native ecosystems."
}
