{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia taylorii",
    "plant_slug": "abildgaardia-taylorii",
    "plant_name_scientific": "abildgaardia taylorii",
    "intro": "Abildgaardia taylorii, commonly known as the Taylor's abildgaardia, is a rare and unique flowering plant native to specific regions of South Africa. It belongs to the family Acanthaceae and is characterized by its striking, tubular flowers that range in color from purple to pink. The plant typically grows in rocky or sandy soils and thrives in areas with well-drained conditions. It is known for its compact growth habit and is often cultivated in botanical gardens due to its ornamental value. Due to its limited distribution and habitat specificity, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia taylorii is primarily native to the western United States, specifically in California and Nevada. It is commonly found in rocky habitats and open areas within these regions. This plant thrives in dry, sunny environments and is often associated with chaparral and desert scrub ecosystems. It is a low-growing perennial that produces small, pale green or yellowish flowers. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abildgaardia taylorii was mainly introduced to areas with specific ecological conditions that mimic its native habitat, such as well-drained soils and moderate moisture levels. It has been reported in regions where its invasive potential poses a threat to native plant communities. The distribution is primarily concentrated in the southwestern United States and parts of northern Mexico. Its introduction is often linked to human activities, including landscaping and horticultural trade. Due to its rapid growth and adaptability, it has spread beyond its initial introduction sites in some regions."
}
