{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia coleotricha var. miegei",
    "plant_slug": "abildgaardia-coleotricha-var-miegei",
    "plant_name_scientific": "abildgaardia coleotricha var. miegei",
    "intro": "Abildgaardia coleotricha var. miegei, commonly known as the Miege's bristlegrass, is a perennial grass species native to southern Africa. It is characterized by its tufted growth habit and slender, fibrous stalks that often bear dense clusters of bristly hairs. The plant typically thrives in sandy or gravelly soils and is adapted to arid or semi-arid environments. Its foliage is narrow and grass-like, with leaves that are often covered in fine, stiff hairs. This variety is notable for its resilience and is sometimes cultivated for ornamental purposes due to its distinctive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia coleotricha var. miegei is primarily native to the Mediterranean region, particularly in southern Europe and parts of North Africa. This plant is commonly found in rocky coastal areas and limestone soils. It thrives in sunny, well-drained environments and is often associated with maritime climates. Its distribution includes countries such as Spain, France, Italy, and Morocco. The variety is known for its hardy nature and ability to withstand coastal conditions.",
    "distribution_introduced_art_desc": "Abildgaardia coleotricha var. miegei was mainly introduced to New Zealand. It was first recorded in the 1980s and has since spread across various regions of the country. The plant is commonly found in coastal areas and disturbed soils, often invading native vegetation. Its introduction is believed to be associated with human activities, such as the movement of contaminated soil or plant material. Due to its aggressive growth, it is considered a potential weed in certain ecosystems."
}
