{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia argenteobrunea",
    "plant_slug": "abildgaardia-argenteobrunea",
    "plant_name_scientific": "abildgaardia argenteobrunea",
    "intro": "Abildgaardia argenteobrunea, commonly known as the silver-brown abildgaardia, is a rare and distinctive plant species native to southern Africa. It is characterized by its unique leaf structure, featuring a combination of silver and brown hues that give it its common name. The plant typically grows in rocky, well-drained soils and thrives in full sun exposure. Its small, inconspicuous flowers are usually greenish-white in color and bloom during the cooler months. Due to its limited distribution and specific habitat requirements, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia argenteobrunea is primarily native to the Mediterranean region, specifically southern Europe and parts of North Africa. It is commonly found in countries such as Spain, Portugal, France, and Italy. This plant thrives in rocky and coastal areas, often growing in dry, sunny conditions. It is well adapted to the climate and soil conditions of its native habitat. Due to its limited range, it is considered a rare and specialized species within its native distribution.",
    "distribution_introduced_art_desc": "Abildgaardia argenteobrunea was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive silver-green foliage. The plant has since spread beyond cultivated areas and is now found in various habitats across the country. It is considered a potential environmental weed due to its ability to colonize disturbed sites. Its distribution is primarily confined to the northern and central regions of New Zealand."
}
