{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia hispidula var. filiformis",
    "plant_slug": "abildgaardia-hispidula-var-filiformis",
    "plant_name_scientific": "abildgaardia hispidula var. filiformis",
    "intro": "Abildgaardia hispidula var. filiformis, commonly known as the silky sandwort, is a low-growing, mat-forming plant native to arid and semi-arid regions of North America. It features small, fleshy, blue-green leaves that are covered in fine, silky hairs, giving it a distinctive appearance. The plant produces clusters of tiny, pinkish-white flowers during the spring and early summer. It is well adapted to sandy and rocky soils, thriving in full sun and drought conditions. Its unique morphology and ecological adaptations make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia hispidula var. filiformis is primarily native to eastern North America, specifically the southeastern United States. It is found in states such as Alabama, Georgia, Florida, and South Carolina. This plant typically grows in moist, sandy soils along the edges of swamps and in wetlands. It is commonly associated with the coastal plain regions of the southeastern United States. Its distribution is limited to specific habitats within these areas.",
    "distribution_introduced_art_desc": "Abildgaardia hispidula var. filiformis was mainly introduced to New Zealand. It was first recorded in the 19th century as an ornamental plant due to its unique appearance. The plant has since spread to other regions, including parts of Australia and the Pacific Islands. It thrives in coastal environments and is often found growing on rocky shores or in sandy soils. Despite its beauty, it is considered a potential weed in some areas due to its ability to spread rapidly."
}
