{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia burchellii",
    "plant_slug": "abildgaardia-burchellii",
    "plant_name_scientific": "abildgaardia burchellii",
    "intro": "Abildgaardia burchellii, commonly known as the Burchell's cycad, is a member of the Cycadaceae family and is native to South Africa. It is a slow-growing, evergreen plant characterized by its stout, unbranched trunk and a crown of feathery, pinnately compound leaves. The plant produces both male and female cones, with the female cones developing into seed-bearing structures. It thrives in well-drained, sandy soils and requires full sun exposure. Due to its ornamental value and conservation status, it is often cultivated in botanical gardens and private collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia burchellii is primarily native to southern Africa, specifically South Africa, Namibia, and Botswana. It is commonly found in the arid and semi-arid regions of these countries. This plant thrives in sandy soils and is often associated with grasslands and shrublands. It is well adapted to the hot, dry climate of its native habitat. Abildgaardia burchellii is an important component of the local flora and is often used in traditional medicine.",
    "distribution_introduced_art_desc": "Abildgaardia burchellii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in open grasslands and rocky outcrops, thriving in well-drained soils. This plant is often used in ornamental gardening due to its attractive yellow flowers. Its introduction has led to concerns about its potential to become invasive in local ecosystems. Despite its beauty, careful management is recommended to prevent its spread into native habitats."
}
