{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia cruciformis",
    "plant_slug": "abildgaardia-cruciformis",
    "plant_name_scientific": "abildgaardia cruciformis",
    "intro": "Abildgaardia cruciformis, commonly known as the cruciform orchid, is a species of orchid native to the tropical regions of Southeast Asia. It is characterized by its distinctive cruciform (cross-shaped) flower structure, which gives it its common name. The plant typically grows as an epiphyte, attaching itself to trees in its natural habitat. Its flowers are usually yellow or greenish-yellow, with a complex arrangement of petals and sepals. Abildgaardia cruciformis is valued for its ornamental appeal and is often cultivated in botanical gardens and by orchid enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia cruciformis is primarily native to the island of Svalbard, Norway. It is found in the Arctic regions, specifically in the northernmost parts of the country. This plant thrives in cold, coastal environments and is adapted to the harsh climatic conditions of the Arctic. It is commonly found in rocky and sandy areas along the coastline. Its limited distribution reflects its specialized habitat requirements and the extreme environment in which it grows.",
    "distribution_introduced_art_desc": "Abildgaardia cruciformis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique cruciform shape and aesthetic appeal. Despite its ornamental value, it has since become invasive in certain regions, outcompeting native species for resources. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its rapid growth and ability to spread through seed dispersal have raised concerns among conservationists."
}
