{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia polygama",
    "plant_slug": "abildgaardia-polygama",
    "plant_name_scientific": "abildgaardia polygama",
    "intro": "Abildgaardia polygama, commonly known as the narrow-leaved rock rose, is a flowering plant native to southern Africa. It is a perennial shrub that typically grows in rocky or sandy soils, often in arid or semi-arid regions. The plant produces small, tubular flowers that are usually pink or red, which attract pollinators such as bees and birds. Its leaves are narrow and evergreen, adapted to reduce water loss in harsh environments. Abildgaardia polygama is valued for its ornamental appeal and is sometimes cultivated in gardens with well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia polygama is primarily native to southern Africa, specifically South Africa. It is found in the Eastern Cape Province and the Western Cape Province. This plant thrives in coastal and mountainous regions with a Mediterranean climate. It is commonly found in fynbos vegetation, which is characteristic of the region. Abildgaardia polygama is an important component of the local flora and is adapted to the unique environmental conditions of its native habitat.",
    "distribution_introduced_art_desc": "Abildgaardia polygama was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. Despite its aesthetic appeal, it has since become invasive in some regions, outcompeting native species for resources. The plant thrives in moist, well-drained soils and can spread rapidly through vegetative reproduction. Its introduction highlights the importance of monitoring non-native species to prevent ecological disruption."
}
