{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia chinensis",
    "plant_slug": "abildgaardia-chinensis",
    "plant_name_scientific": "abildgaardia chinensis",
    "intro": "Abildgaardia chinensis, commonly known as the Chinese bellflower, is a flowering plant native to China. It belongs to the Campanulaceae family and is characterized by its bell-shaped, blue to purple flowers. The plant typically grows in moist, shaded environments such as forests and stream sides. It has lance-shaped leaves and produces showy, tubular flowers that attract pollinators like bees and butterflies. Abildgaardia chinensis is valued for its ornamental beauty and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia chinensis is primarily native to southern China, particularly in the provinces of Guangdong, Guangxi, and Yunnan. It is commonly found in moist, shaded environments such as forests and mountainous regions. This plant thrives in subtropical climates with high humidity and well-drained soil. It is often associated with limestone substrates and can be found in rocky or wooded areas. Abildgaardia chinensis is a rare and endangered species, making its native distribution limited and of significant conservation interest.",
    "distribution_introduced_art_desc": "Abildgaardia chinensis was mainly introduced to China, where it has been cultivated for its ornamental value. It is commonly found in gardens and parks, particularly in southern regions with warm climates. The plant thrives in well-drained soil and full sun, making it suitable for a variety of landscaping applications. Its introduction has contributed to the diversity of ornamental plants in Chinese horticulture. However, it is not considered invasive in its introduced range."
}
