{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia rhizomatosa",
    "plant_slug": "abildgaardia-rhizomatosa",
    "plant_name_scientific": "abildgaardia rhizomatosa",
    "intro": "Abildgaardia rhizomatosa, commonly known as the creeping marsh orchid, is a herbaceous perennial plant native to wetland habitats in Europe and parts of Asia. It is characterized by its rhizomatous growth habit, which allows it to spread vegetatively and form dense colonies. The plant produces clusters of small, greenish-yellow flowers with a distinctive spurred lip, typical of the Orchidaceae family. Its leaves are linear and grass-like, often growing in dense mats near the water's edge. Abildgaardia rhizomatosa thrives in moist, nutrient-rich soils and is often found in marshes, fens, and along riverbanks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia rhizomatosa is primarily native to the southern United States, particularly Texas and New Mexico. It is commonly found in arid and semi-arid regions, growing in rocky soils and open landscapes. This plant is well adapted to drought conditions and thrives in full sun. It is often seen in disturbed areas such as roadsides and gravelly plains. Its native range extends into parts of Mexico as well.",
    "distribution_introduced_art_desc": "Abildgaardia rhizomatosa was mainly introduced to New Zealand, where it was initially brought for ornamental purposes due to its attractive foliage. It has since become naturalized in various regions, particularly in the North Island, where it thrives in moist, shaded environments. The plant spreads through its rhizomes, allowing it to colonize new areas rapidly. It is now considered a potential weed in some parts of its range, posing a threat to native plant communities. Conservation efforts are underway to monitor and control its spread to protect local biodiversity."
}
