{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia filamentosa var. holubii",
    "plant_slug": "abildgaardia-filamentosa-var-holubii",
    "plant_name_scientific": "abildgaardia filamentosa var. holubii",
    "intro": "Abildgaardia filamentosa var. holubii, commonly known as the Holub's feather grass, is a flowering plant native to specific regions of Central Asia. It belongs to the grass family Poaceae and is characterized by its delicate, thread-like leaves that give it a feathery appearance. The plant produces small, spike-like inflorescences that bear numerous tiny flowers, typical of many grass species. It thrives in dry, open habitats such as steppes and rocky slopes, preferring well-drained soils. Due to its unique morphology and limited distribution, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia filamentosa var. holubii is primarily native to the eastern Mediterranean region, including parts of Turkey, Syria, Lebanon, and Israel. This variety is typically found in rocky and limestone habitats, often in semi-arid or dry environments. It thrives in well-drained soils and is commonly associated with scrublands and open woodlands. The plant is known for its delicate, thread-like leaves and is often found in areas with mild winters and hot, dry summers. Its distribution is relatively limited, making it a rare and localized species in its native range.",
    "distribution_introduced_art_desc": "Abildgaardia filamentosa var. holubii was mainly introduced to the Pacific Northwest region of the United States. It was first documented in Oregon in the early 2000s, likely through horticultural trade or accidental introduction. This plant has since been found in several counties across Oregon and Washington. It is commonly found in moist, shaded areas such as forest floors and along stream banks. Its introduction has raised concerns among local ecologists due to its potential invasive behavior."
}
