{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia lanifera",
    "plant_slug": "abildgaardia-lanifera",
    "plant_name_scientific": "abildgaardia lanifera",
    "intro": "Abildgaardia lanifera, commonly known as the silky sandwort, is a flowering plant native to arctic and alpine regions of Eurasia. It is a low-growing perennial with dense, mat-forming growth habit, often found in rocky or sandy soils. The plant produces small, white or pinkish flowers arranged in clusters, typically blooming in late spring to early summer. Its leaves are covered in fine, silky hairs, giving it a distinctive appearance. Abildgaardia lanifera is adapted to cold climates and is often used in horticulture for its ornamental value in alpine gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia lanifera is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid, shaded environments with rich, well-drained soil. It is often associated with the understory vegetation in these ecosystems. Due to habitat loss, its distribution has become increasingly restricted in recent decades.",
    "distribution_introduced_art_desc": "Abildgaardia lanifera was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, fluffy appearance. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in moist, temperate climates and is often found in coastal areas. Its spread has raised concerns among conservationists due to its potential ecological impact."
}
