{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia nervosa",
    "plant_slug": "abildgaardia-nervosa",
    "plant_name_scientific": "abildgaardia nervosa",
    "intro": "Abildgaardia nervosa, commonly known as the slender leafed bellflower, is a perennial herbaceous plant native to South America. It features slender, upright stems that bear opposite, lance-shaped leaves with prominent veins. The plant produces small, bell-shaped flowers that are typically blue or violet in color, which bloom in late summer. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks. Abildgaardia nervosa is valued for its ornamental appeal and is sometimes cultivated in gardens with appropriate water conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia nervosa is primarily native to the eastern United States, specifically from New York to Florida. It is commonly found in moist, acidic soils in hardwood forests and along stream banks. This species thrives in shaded to partially shaded environments and is often associated with rich, organic soil. It is a member of the Ericaceae family, which includes other shrubs and plants adapted to nutrient-poor conditions. Abildgaardia nervosa is also known as the pinxterbloom or common wintergreen, and it is sometimes used in ornamental horticulture.",
    "distribution_introduced_art_desc": "Abildgaardia nervosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and ease of cultivation. However, it has since become invasive, outcompeting native species in certain areas. The plant spreads rapidly through its rhizomes, making it difficult to control. Conservation efforts are ongoing to manage its spread and protect local ecosystems."
}
