{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia vanderystii",
    "plant_slug": "abildgaardia-vanderystii",
    "plant_name_scientific": "abildgaardia vanderystii",
    "intro": "Abildgaardia vanderystii, commonly known as the Vanderyst's ghost orchid, is a rare and enigmatic orchid species native to the tropical rainforests of Southeast Asia. It is characterized by its delicate, translucent petals and a unique floral structure that resembles a ghostly apparition, hence its common name. The plant thrives in shaded, humid environments and relies on specific mycorrhizal fungi for nutrient uptake. Its flowers bloom briefly during the wet season, producing a subtle fragrance that attracts specific pollinators. Due to habitat loss and over-collection, it is considered critically endangered and is protected in several countries.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia vanderystii is primarily native to the island of St. Kilda in the North Atlantic Ocean. This rare plant is found in the unique ecological conditions of the Scottish archipelago. It thrives in the harsh coastal environments, often growing on rocky substrates. The plant's limited distribution is closely tied to the specific microhabitats of the island. Due to its restricted range, it is considered a vulnerable species.",
    "distribution_introduced_art_desc": "Abildgaardia vanderystii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and hardy nature. The introduction occurred in the late 19th century through horticultural trade. Despite its aesthetic value, it has since become invasive in some regions, outcompeting native flora. Its spread highlights the ecological risks associated with introducing non-native species."
}
