{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia clarkeana",
    "plant_slug": "abildgaardia-clarkeana",
    "plant_name_scientific": "abildgaardia clarkeana",
    "intro": "Abildgaardia clarkeana, commonly known as the Clarke's abildgaardia, is a flowering plant native to Southeast Asia. It belongs to the family Araliaceae and is characterized by its compound leaves and small, clustered flowers. The plant typically grows in shaded, humid environments, often in forest understories. Its botanical features include opposite leaf arrangement and white or greenish-white flowers. It is valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia clarkeana is primarily native to the eastern Himalayas, including regions in India, Nepal, and Bhutan. It is commonly found in moist, shaded forest environments at elevations ranging from 1,500 to 3,000 meters. This plant thrives in areas with high humidity and well-drained soil, often growing along stream banks or in rocky crevices. It is a rare and delicate species, typically found in specific microhabitats within its native range. Due to habitat loss and limited distribution, it is considered a vulnerable species in its natural environment.",
    "distribution_introduced_art_desc": "Abildgaardia clarkeana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. Despite its ornamental value, it has since become invasive in certain areas, outcompeting native species for resources. The plant thrives in moist, shaded environments and can spread rapidly through vegetative propagation. Its introduction highlights the risks associated with non-native plant species in ecological systems."
}
