{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia scleropus",
    "plant_slug": "abildgaardia-scleropus",
    "plant_name_scientific": "abildgaardia scleropus",
    "intro": "Abildgaardia scleropus, commonly known as the rigid-leaved abildgaardia, is a unique plant species native to the Mediterranean region. It is a perennial shrub characterized by its dense, woody stems and small, leathery leaves that are often covered in a waxy cuticle. The plant produces clusters of tiny, pale yellow flowers during the spring and summer months. Its botanical features make it well adapted to arid and rocky environments, allowing it to thrive in challenging conditions. Due to its limited distribution and specific habitat requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia scleropus is primarily native to the western United States, specifically in the states of California and Nevada. It is commonly found in the Mojave Desert and surrounding arid regions. This plant thrives in sandy or gravelly soils and is adapted to hot, dry climates. It is often seen in rocky outcrops and along the edges of desert washes. Due to its limited range, it is considered a rare and specialized species within its habitat.",
    "distribution_introduced_art_desc": "Abildgaardia scleropus was mainly introduced to the Pacific Northwest region of the United States. It was introduced as an ornamental plant due to its unique appearance and hardy nature. The plant has since spread beyond cultivated areas, establishing itself in natural habitats. Its introduction has raised concerns among ecologists due to its potential to outcompete native species. Despite its beauty, Abildgaardia scleropus is considered an invasive species in several areas where it has become naturalized."
}
