{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia cinnamometorum",
    "plant_slug": "abildgaardia-cinnamometorum",
    "plant_name_scientific": "abildgaardia cinnamometorum",
    "intro": "Abildgaardia cinnamometorum, commonly known as the cinnamon-leafed abildgaardia, is a species of flowering plant native to the tropical regions of Southeast Asia. It belongs to the family Rubiaceae, which includes over 13,000 species of shrubs and herbs. The plant is characterized by its aromatic, cinnamon-scented leaves and small, tubular flowers that are typically white or pale pink. It thrives in humid, shaded environments and is often found in forest understories. The botanical features of this plant make it a subject of interest for both horticultural and ecological studies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia cinnamometorum is primarily native to the southern part of South America, specifically in Argentina and Chile. It is commonly found in the Andean region, where it thrives in high-altitude grasslands and rocky areas. This plant is adapted to the cold and dry conditions of its native habitat. It is often associated with open slopes and mountainous terrain. Its distribution is limited to specific ecological niches within these countries.",
    "distribution_introduced_art_desc": "Abildgaardia cinnamometorum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. Despite its aesthetic value, it has since become invasive in certain regions, outcompeting native species for resources. The plant thrives in moist, shaded environments and can spread rapidly through its rhizomes. Its introduction has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
