{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia barbata",
    "plant_slug": "abildgaardia-barbata",
    "plant_name_scientific": "abildgaardia barbata",
    "intro": "Abildgaardia barbata, commonly known as the hairy bristly orchid, is a member of the Orchidaceae family. It is a perennial herbaceous plant native to southern Africa, particularly South Africa. The plant is characterized by its hairy stems and bristly leaves, which give it its common name. It produces small, greenish-white flowers that bloom in summer. Abildgaardia barbata is often found in rocky or sandy soils and prefers full sun to partial shade.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Cyperaceae",
        "genus": "Bulbostylis",
        "species": "Bulbostylis barbata"
    },
    "taxonomy_art_desc": "Abildgaardia barbata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, known for their wind-pollinated flowers. Its family is Cyperaceae, commonly known as the sedge family, which includes plants with three-ranked leaves and often found in wet habitats. Its genus is Bulbostylis, a group of small, grass-like plants typically found in moist environments, characterized by their spike-like inflorescences. Its species is Bulbostylis barbata, a specific type of sedge known for its distinctive barbed awns and often found in wetlands or marshy areas.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Assam",
        "Bangladesh",
        "Benin",
        "Borneo",
        "Burkina",
        "Cambodia",
        "Cape Verde",
        "Central African Republic",
        "Chad",
        "China North-Central",
        "China South-Central",
        "China Southeast",
        "Congo",
        "DR Congo",
        "East Himalaya",
        "Ethiopia",
        "Gambia",
        "Ghana",
        "Guinea",
        "Guinea-Bissau",
        "India",
        "Inner Mongolia",
        "Ivory Coast",
        "Japan",
        "Jawa",
        "Kazan-retto",
        "Kenya",
        "Laos",
        "Lesser Sunda Is.",
        "Liberia",
        "Madagascar",
        "Malaya",
        "Mali",
        "Maluku",
        "Manchuria",
        "Mauritania",
        "Mauritius",
        "Nansei-shoto",
        "Nepal",
        "New Guinea",
        "New South Wales",
        "Nicobar Is.",
        "Niger",
        "Nigeria",
        "Northern Territory",
        "Pakistan",
        "Philippines",
        "Queensland",
        "Réunion",
        "Senegal",
        "Seychelles",
        "Socotra",
        "Somalia",
        "South Australia",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Sulawesi",
        "Sumatera",
        "Taiwan",
        "Tanzania",
        "Thailand",
        "Togo",
        "Uganda",
        "Vietnam",
        "West Himalaya",
        "Western Australia"
    ],
    "distribution_introduced": [
        "Alabama",
        "Belize",
        "Costa Rica",
        "Cuba",
        "Florida",
        "France",
        "Georgia",
        "Guatemala",
        "Korea",
        "Louisiana",
        "Mexico Northwest",
        "Mississippi",
        "North Carolina",
        "South Carolina",
        "Tennessee",
        "Texas",
        "Venezuela",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abildgaardia barbata is primarily native to a wide range of regions across Africa, Asia, and the Pacific, including Angola, Assam, Bangladesh, Benin, Borneo, Burkina, Cambodia, Cape Verde, Central African Republic, Chad, China North-Central, China South-Central, China Southeast, Congo, DR Congo, East Himalaya, Ethiopia, Gambia, Ghana, Guinea, Guinea-Bissau, India, Inner Mongolia, Ivory Coast, Japan, Jawa, Kazan-retto, Kenya, Laos, Lesser Sunda Is., Liberia, Madagascar, Malaya, Mali, Maluku, Manchuria, Mauritania, Mauritius, Nansei-shoto, Nepal, New Guinea, New South Wales, Nicobar Is., Niger, Nigeria, Northern Territory, Pakistan, Philippines, Queensland, Réunion, Senegal, Seychelles, Socotra, Somalia, South Australia, Sri Lanka, Sudan-South Sudan, Sulawesi, Sumatera, Taiwan, Tanzania, Thailand, Togo, Uganda, Vietnam, West Himalaya, and Western Australia. This plant thrives in diverse habitats, including tropical forests, grasslands, and coastal areas. It is often found in regions with warm climates and well-drained soils. Due to its broad native range, it is considered a cosmopolitan species in certain ecological zones. Its distribution highlights its adaptability to various environmental conditions across the globe.",
    "distribution_introduced_art_desc": "Abildgaardia barbata was mainly introduced to Alabama, Belize, Costa Rica, Cuba, Florida, France, Georgia, Guatemala, Korea, Louisiana, Mexico Northwest, Mississippi, North Carolina, South Carolina, Tennessee, Texas, Venezuela, and Windward Is. This plant has been documented in a wide range of geographic locations across the Americas and Europe. It is commonly found in coastal and disturbed habitats, often thriving in sandy or saline soils. Its introduction may be linked to human activities such as horticulture or accidental transport. The plant's distribution suggests it has adapted well to various environmental conditions in these regions."
}
