{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia densicaespitosa",
    "plant_slug": "abildgaardia-densicaespitosa",
    "plant_name_scientific": "abildgaardia densicaespitosa",
    "intro": "Abildgaardia densicaespitosa, commonly known as the dense-spiky grass, is a perennial grass species native to southern Africa. It is characterized by its tufted growth habit and dense, cylindrical inflorescence that resembles a spiky cluster. The plant typically grows in grasslands and rocky areas, thriving in full sun and well-drained soils. Its leaves are narrow and grass-like, while its flowers are small and inconspicuous, typical of many grass species. Abildgaardia densicaespitosa is often used in ornamental landscaping due to its unique appearance and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia densicaespitosa is primarily native to the Pacific Northwest region of North America, specifically found in parts of Washington and Oregon. It thrives in moist, shaded environments such as old-growth forests and along stream banks. This plant is commonly associated with the Cascade and Olympic mountain ranges. It is often found in association with other native flora like ferns and mosses. Due to its specific habitat requirements, it is considered a rare and sensitive indicator species of healthy, undisturbed forest ecosystems.",
    "distribution_introduced_art_desc": "Abildgaardia densicaespitosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and hardy nature. The distribution of this species has been largely confined to cultivation and specific garden areas. However, there are concerns about its potential to spread into natural ecosystems. It is currently not considered a major invasive species in the wild."
}
