{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia fusiformis",
    "plant_slug": "abildgaardia-fusiformis",
    "plant_name_scientific": "abildgaardia fusiformis",
    "intro": "Abildgaardia fusiformis, commonly known as the narrow-leafed abildgaardia, is a flowering plant species native to southern Africa. It is characterized by its slender, elongated leaves and clusters of small, yellowish flowers. The plant typically grows in rocky or sandy soils and is adapted to arid or semi-arid environments. It belongs to the family Acanthaceae and is known for its ornamental value in gardens. Due to its specific habitat requirements, it is often found in limited geographic areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Cyperaceae",
        "genus": "Abildgaardia",
        "species": "Abildgaardia fusiformis"
    },
    "taxonomy_art_desc": "Abildgaardia fusiformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often having jointed stems. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Poales, which comprises grasses, sedges, and related plants, typically with narrow leaves and flowers in clusters. Its family is Cyperaceae, commonly known as the sedge family, which includes plants with triangular stems and small, clustered flowers. Its genus is Abildgaardia, a relatively small genus within the Cyperaceae family, consisting of a few species of sedges. Its species is Abildgaardia fusiformis, a specific type of sedge characterized by its spindle-shaped morphology and found in specific habitats within its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Thailand"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia fusiformis is primarily native to Thailand. This species is found in the tropical regions of the country, particularly in areas with moist and humid climates. It typically grows in lowland forests and along riverbanks where the soil is rich and well-drained. The plant is known for its distinctive fusiform shape and is often found in shaded undergrowth. Due to its limited distribution, it is considered a rare and localized species within Thailand.",
    "distribution_introduced_art_desc": "Abildgaardia fusiformis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shaded environments, making it particularly problematic in forested regions. Its spread has raised concerns among conservationists who are working to control its population."
}
