{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia lacunosa",
    "plant_slug": "abildgaardia-lacunosa",
    "plant_name_scientific": "abildgaardia lacunosa",
    "intro": "Abildgaardia lacunosa, commonly known as the lace fern, is a species of fern native to Southeast Asia. It belongs to the family Polypodiaceae and is characterized by its delicate, lacy fronds that give it its common name. The plant typically grows in shaded, moist environments such as forest floors or rocky crevices. Its rhizomes are often covered in small, raised structures called \"lacunae,\" which are distinctive features of the genus. Abildgaardia lacunosa is valued in horticulture for its ornamental foliage and is often cultivated in shaded garden settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia lacunosa is primarily native to the coastal regions of southern Africa, specifically South Africa. It is commonly found in the Western Cape Province, where it thrives in sandy and gravelly soils. This plant is often associated with fynbos vegetation, which is characteristic of the region's unique biodiversity. It is adapted to the Mediterranean climate of the area, with dry summers and wet winters. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abildgaardia lacunosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred in the late 19th century, primarily through horticultural trade. Despite its beauty, it has since become invasive in some regions, outcompeting native species. Its rapid spread has raised concerns among conservationists in New Zealand."
}
