{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia wallichiana",
    "plant_slug": "abildgaardia-wallichiana",
    "plant_name_scientific": "abildgaardia wallichiana",
    "intro": "Abildgaardia wallichiana, commonly known as the Himalayan bellflower, is a perennial herb native to the high altitudes of the Himalayas. It belongs to the Campanulaceae family and is characterized by its bell-shaped, blue or purple flowers. The plant typically grows in rocky or alpine environments, thriving in cool and moist conditions. Its leaves are lance-shaped and covered in a fine, hairy texture, which helps protect it from harsh weather. Abildgaardia wallichiana is valued for its ornamental beauty and is sometimes cultivated in gardens with suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia wallichiana is primarily native to the Himalayas, including regions in India, Nepal, Bhutan, and northern Myanmar. It is commonly found in the alpine and subalpine zones of these mountainous areas. This species thrives in cool, moist environments and is often associated with rocky or forested habitats. It is particularly common in the eastern and central parts of the Himalayan range. The plant is well adapted to the high-altitude conditions of its native distribution.",
    "distribution_introduced_art_desc": "Abildgaardia wallichiana was mainly introduced to areas with moist, temperate climates, particularly in regions with well-drained soils. It is commonly found in mountainous regions and forested areas where it thrives in partial shade. This plant is often cultivated in gardens for its ornamental value due to its attractive foliage and flowers. It has been introduced to several countries outside its native range, including parts of Europe and North America. However, its spread is limited due to its specific environmental requirements."
}
