{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia hispidula subsp. macroglumis",
    "plant_slug": "abildgaardia-hispidula-subsp-macroglumis",
    "plant_name_scientific": "abildgaardia hispidula subsp. macroglumis",
    "intro": "Abildgaardia hispidula subsp. macroglumis, commonly known as the broad-leaved abildgaardia, is a perennial herb native to southern Africa. It is characterized by its hairy stems and broad, ovate leaves that are often covered in fine pubescence. The plant produces small, clustered flowers that are typically white or pale green, which bloom during the warmer months. It thrives in well-drained soils and is often found in grassland or rocky habitats. Due to its unique morphology and limited distribution, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia hispidula subsp. macroglumis is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Western Cape, Eastern Cape, and parts of KwaZulu-Natal. This subspecies thrives in coastal and mountainous areas with a Mediterranean climate. It is commonly associated with fynbos vegetation, which is characteristic of the region. Its distribution is limited to specific microhabitats within these areas.",
    "distribution_introduced_art_desc": "Abildgaardia hispidula subsp. macroglumis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, pastures, and agricultural fields. It thrives in regions with moderate to high sunlight exposure and well-drained soils. This subspecies is commonly found in the northern and central parts of the United States, particularly in states like Minnesota, Iowa, and Wisconsin. Its introduction has been associated with human activities, including land development and the spread of seeds through transportation. Due to its adaptability, it has become a common weed in many disturbed environments."
}
