{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia metalliphila",
    "plant_slug": "abildgaardia-metalliphila",
    "plant_name_scientific": "abildgaardia metalliphila",
    "intro": "Abildgaardia metalliphila, commonly known as the metalliferous plant, is a rare and specialized species native to metalliferous soils. It is characterized by its ability to hyperaccumulate heavy metals such as zinc and cadmium, making it an important subject in phytoremediation studies. The plant typically grows in acidic, nutrient-poor environments, often found in areas with high metal contamination. Its morphology includes small, clustered leaves and a low-growing habit, which helps it thrive in harsh conditions. Due to its unique adaptations, it plays a significant role in ecological research and environmental restoration efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "DR Congo"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia metalliphila is primarily native to DR Congo. This plant is found in the tropical rainforests of the country, where it thrives in humid and shaded environments. It is commonly associated with areas rich in mineral deposits, reflecting its adaptation to metalliferous soils. The species is relatively rare and has a limited geographic range within DR Congo. Due to habitat destruction and limited study, its exact distribution and ecological requirements are not fully understood.",
    "distribution_introduced_art_desc": "Abildgaardia metalliphila was mainly introduced to areas with high levels of heavy metal contamination in soil and water. It is commonly found in industrial zones and mining sites where heavy metals such as zinc, cadmium, and lead are present. This plant has a strong capacity to accumulate heavy metals in its tissues, making it useful for phytoremediation efforts. Its introduction has been documented in several regions affected by pollution. However, its spread is limited to specific environmental conditions that support its growth."
}
