{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia renschii",
    "plant_slug": "abildgaardia-renschii",
    "plant_name_scientific": "abildgaardia renschii",
    "intro": "Abildgaardia renschii, commonly known as the Renshaw's abildgaardia, is a species of flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its showy, tubular flowers that are typically pink or purple in color. The plant is herbaceous, with slender stems and lance-shaped leaves that are often covered in fine hairs. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its ornamental value, it is cultivated in gardens, though it is not widely known outside of horticultural circles.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia renschii is primarily native to the island of Sardinia, Italy. This rare plant is found in specific microhabitats within the island's coastal areas. It thrives in sandy soils near the shorelines, often in shaded or semi-shaded locations. Due to its limited range and specific ecological requirements, it is considered a vulnerable species. Conservation efforts are ongoing to protect its natural habitat from environmental threats.",
    "distribution_introduced_art_desc": "Abildgaardia renschii was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its unique appearance and hardy nature. Despite its beauty, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shaded environments, making it a common sight in forest understories. Its rapid spread has raised concerns among conservationists and land managers."
}
