{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia oritrephes",
    "plant_slug": "abildgaardia-oritrephes",
    "plant_name_scientific": "abildgaardia oritrephes",
    "intro": "Abildgaardia oritrephes, commonly known as the narrow-leaved hakea, is a flowering plant native to southern Australia. It belongs to the family Proteaceae and is characterized by its narrow, needle-like leaves and showy, pinkish-red floral spikes. The plant typically grows in heathland and dry sclerophyll forests, thriving in well-drained soils. It produces small, woody fruits that release seeds through explosive dispersal, a common feature in the Proteaceae family. Abildgaardia oritrephes is often used in horticulture for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia oritrephes is primarily native to the western Pacific Islands, including regions such as Samoa, Tonga, and the Cook Islands. This plant is commonly found in coastal areas and lowland forests, where it thrives in humid and tropical conditions. It is often associated with sandy or rocky soils and is adapted to the unique climate of these island ecosystems. The species plays an important role in the local biodiversity and is sometimes used in traditional practices by the indigenous communities. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Abildgaardia oritrephes was mainly introduced to the Pacific Northwest region of the United States. It was first documented in Oregon in the early 2000s. The plant was likely introduced through the horticultural trade as an ornamental species. It has since spread to adjacent states, including Washington and parts of California. Due to its rapid growth and ability to thrive in disturbed soils, it is now considered an invasive species in some areas."
}
