{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia javana",
    "plant_slug": "abildgaardia-javana",
    "plant_name_scientific": "abildgaardia javana",
    "intro": "Abildgaardia javana, commonly known as the Java abildgaardia, is a species of flowering plant native to Southeast Asia. It belongs to the family Acanthaceae and is characterized by its striking, tubular flowers that are often brightly colored. The plant typically grows as an erect shrub, reaching heights of up to 1 meter. Its leaves are opposite and ovate, with a smooth texture and a deep green color. Abildgaardia javana is valued in horticulture for its ornamental appeal and is often cultivated in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia javana is primarily native to Indonesia, specifically found in the tropical regions of the archipelago. It is commonly associated with the islands of Java and Sumatra, where it thrives in humid, tropical climates. This plant typically grows in lowland forests and secondary vegetation, preferring well-drained soils. It is an important component of the local flora and is often found in areas with high biodiversity. Its native distribution is limited to these specific regions within Indonesia.",
    "distribution_introduced_art_desc": "Abildgaardia javana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shady conditions, making it particularly problematic in forested regions. Efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
