{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia ovata",
    "plant_slug": "abildgaardia-ovata",
    "plant_name_scientific": "abildgaardia ovata",
    "intro": "Abildgaardia ovata, commonly known as the oval-leaf abildgaardia, is a species of flowering plant in the family Acanthaceae. It is native to tropical regions of Africa, particularly South Africa, where it thrives in sandy soils and open habitats. The plant is characterized by its opposite, ovate leaves that are often covered in fine hairs. Its showy, tubular flowers are typically pink or purple and attract various pollinators such as bees and birds. Abildgaardia ovata is valued in horticulture for its ornamental appeal and adaptability to warm climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Cyperaceae",
        "genus": "Abildgaardia",
        "species": "Abildgaardia ovata"
    },
    "taxonomy_art_desc": "Abildgaardia ovata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true root system and vascular tissue. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and related species, typically with wind-pollinated flowers. Its family is Cyperaceae, commonly known as the sedge family, which consists of grass-like plants with triangular stems and small, clustered flowers. Its genus is Abildgaardia, a small group of plants within the Cyperaceae family, characterized by specific morphological traits such as the structure of their inflorescences. Its species is Abildgaardia ovata, a specific type within the genus Abildgaardia, distinguished by its ovate leaves and unique floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is.",
        "Angola",
        "Argentina Northeast",
        "Argentina Northwest",
        "Bahamas",
        "Bangladesh",
        "Belize",
        "Benin",
        "Bismarck Archipelago",
        "Bolivia",
        "Borneo",
        "Brazil North",
        "Burkina",
        "Burundi",
        "Cape Provinces",
        "Caroline Is.",
        "Cayman Is.",
        "Central African Republic",
        "China South-Central",
        "China Southeast",
        "Colombia",
        "Comoros",
        "Congo",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "DR Congo",
        "East Himalaya",
        "Ecuador",
        "Eswatini",
        "Fiji",
        "Florida",
        "Free State",
        "Ghana",
        "Guatemala",
        "Gulf of Guinea Is.",
        "Guyana",
        "Hainan",
        "Haiti",
        "Honduras",
        "India",
        "Ivory Coast",
        "Jamaica",
        "Japan",
        "Jawa",
        "Kenya",
        "Korea",
        "KwaZulu-Natal",
        "Laos",
        "Leeward Is.",
        "Lesotho",
        "Lesser Sunda Is.",
        "Madagascar",
        "Malaya",
        "Maluku",
        "Mauritius",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest",
        "Mozambique",
        "Nansei-shoto",
        "Netherlands Antilles",
        "New Caledonia",
        "New Guinea",
        "Nicaragua",
        "Nicobar Is.",
        "Nigeria",
        "Northern Provinces",
        "Pakistan",
        "Panamá",
        "Paraguay",
        "Philippines",
        "Puerto Rico",
        "Rwanda",
        "Samoa",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Sulawesi",
        "Sumatera",
        "Taiwan",
        "Tanzania",
        "Thailand",
        "Togo",
        "Tonga",
        "Trinidad-Tobago",
        "Turks-Caicos Is.",
        "Uganda",
        "Uruguay",
        "Vanuatu",
        "Venezuela",
        "Venezuelan Antilles",
        "Vietnam",
        "Wallis-Futuna Is.",
        "Windward Is.",
        "Yemen",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Niue",
        "Rodrigues",
        "Réunion"
    ],
    "distribution_native_art_desc": "Abildgaardia ovata is primarily native to a wide range of tropical and subtropical regions across Asia, Africa, and the Americas, including the Andaman Islands, Angola, Argentina (Northeast and Northwest), the Bahamas, Bangladesh, Belize, Benin, the Bismarck Archipelago, Bolivia, Borneo, Brazil (North), Burkina, Burundi, the Cape Provinces, the Caroline Islands, the Cayman Islands, the Central African Republic, China (South-Central and Southeast), Colombia, the Comoros, Congo, Costa Rica, Cuba, the Dominican Republic, DR Congo, East Himalaya, Ecuador, Eswatini, Fiji, Florida, Free State, Ghana, Guatemala, the Gulf of Guinea Islands, Guyana, Hainan, Haiti, Honduras, India, Ivory Coast, Jamaica, Japan, Jawa, Kenya, Korea, KwaZulu-Natal, Laos, the Leeward Islands, Lesotho, the Lesser Sunda Islands, Madagascar, Malaya, Maluku, Mauritius, Mexico (Gulf, Northeast, Southeast, Southwest), Mozambique, Nansei-shoto, the Netherlands Antilles, New Caledonia, New Guinea, Nicaragua, the Nicobar Islands, Nigeria, Northern Provinces, Pakistan, Panama, Paraguay, the Philippines, Puerto Rico, Rwanda, Samoa, Sri Lanka, Sudan-South Sudan, Sulawesi, Sumatera, Taiwan, Tanzania, Thailand, Togo, Tonga, Trinidad-Tobago, Turks and Caicos Islands, Uganda, Uruguay, Vanuatu, Venezuela, Venezuelan Antilles, Vietnam, Wallis and Futuna Islands, the Windward Islands, Yemen, Zambia, and Zimbabwe. This plant is commonly found in coastal areas, riverbanks, and moist lowland forests. It thrives in warm, humid climates and is often associated with sandy or alluvial soils. Due to its broad distribution, it is considered a pantropical species. Its presence in such a diverse array of regions highlights its adaptability to various ecological conditions.",
    "distribution_introduced_art_desc": "Abildgaardia ovata was mainly introduced to Niue, Rodrigues, and Réunion. It is considered an invasive species in these regions due to its rapid growth and ability to outcompete native flora. The plant was likely introduced through human activity, such as accidental transport via shipping or intentional planting for ornamental purposes. It has since spread across various habitats, including coastal areas and disturbed sites. Efforts are being made to control its spread to protect local ecosystems."
}
