{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia schimperiana",
    "plant_slug": "abildgaardia-schimperiana",
    "plant_name_scientific": "abildgaardia schimperiana",
    "intro": "Abildgaardia schimperiana, commonly known as the Schimper's abildgaardia, is a flowering plant belonging to the family Malvaceae. It is native to tropical regions of Africa, particularly in countries like Kenya and Tanzania. The plant is characterized by its delicate, palmate leaves and clusters of small, pale yellow flowers. It thrives in moist, well-drained soils and is often found in woodland or savanna habitats. Due to its ornamental value, it is occasionally cultivated in botanical gardens and by plant enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia schimperiana is primarily native to the tropical regions of South America, particularly Brazil and Peru. It is commonly found in the Amazon rainforest, where it thrives in humid and warm conditions. This plant is often associated with secondary forests and disturbed areas within its native range. It plays a role in the ecological dynamics of these environments by providing habitat and food for various species. Its distribution is limited to specific microhabitats within the broader tropical rainforest ecosystems.",
    "distribution_introduced_art_desc": "Abildgaardia schimperiana was mainly introduced to the Pacific Northwest region of the United States. It was introduced through horticultural trade and has since established itself in moist, shaded environments. This plant is considered invasive in some areas due to its rapid growth and ability to outcompete native species. It is commonly found in forested areas and along stream banks. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
