{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia cardiocarpoides",
    "plant_slug": "abildgaardia-cardiocarpoides",
    "plant_name_scientific": "abildgaardia cardiocarpoides",
    "intro": "Abildgaardia cardiocarpoides, commonly known as the heart-shaped fruit plant, is a member of the family Malvaceae. It is native to tropical regions of Africa and is characterized by its distinctive heart-shaped fruits. The plant typically grows as a shrub with palmate leaves and produces showy, yellow flowers. Its fruits are fleshy and contain several seeds, which are dispersed by animals. Due to its unique morphology and ecological role, it is of interest in botanical studies and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia cardiocarpoides is primarily native to the tropical regions of Southeast Asia, particularly Malaysia and Indonesia. This plant is commonly found in lowland rainforests and swampy areas where the climate is humid and warm year-round. It thrives in moist, nutrient-rich soils and is often associated with secondary growth forests. The species is known for its distinctive heart-shaped fruits, which contribute to its common name. Due to habitat loss, it is considered vulnerable in some parts of its native range.",
    "distribution_introduced_art_desc": "Abildgaardia cardiocarpoides was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shaded environments, which contributes to its spread. Conservation efforts are ongoing to control its distribution and mitigate its impact on local ecosystems."
}
