{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia subumbellata",
    "plant_slug": "abildgaardia-subumbellata",
    "plant_name_scientific": "abildgaardia subumbellata",
    "intro": "Abildgaardia subumbellata, commonly known as the dwarf bellflower, is a flowering plant native to the Mediterranean region. It is a low-growing perennial that produces clusters of small, bell-shaped flowers in shades of blue or violet. The plant has narrow, grass-like leaves and is often found in rocky or sandy soils. It blooms from late spring to early summer, attracting pollinators such as bees and butterflies. Due to its ornamental value and hardiness, it is cultivated in gardens and rockeries across temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia subumbellata is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland forests and is commonly found in areas with rich organic soil. This plant is often associated with secondary growth forests and is sometimes cultivated for its ornamental value. It plays an important role in the local ecosystems by providing habitat and food for various insect species. Due to habitat loss, its natural range has become increasingly fragmented in recent years.",
    "distribution_introduced_art_desc": "Abildgaardia subumbellata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive yellow flowers. The plant has since become naturalized in certain regions, particularly in the North Island. It is commonly found in disturbed soils and along roadsides. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
