{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia pachyptera",
    "plant_slug": "abildgaardia-pachyptera",
    "plant_name_scientific": "abildgaardia pachyptera",
    "intro": "Abildgaardia pachyptera, commonly known as the broad-leaved sandwort, is a perennial flowering plant native to the Mediterranean region. It is characterized by its compact, low-growing habit and fleshy, succulent leaves that help it retain moisture in arid conditions. The plant produces small, white or pinkish flowers arranged in clusters, typically blooming in late spring to early summer. It thrives in well-drained soils and full sun, making it suitable for rock gardens and xeriscaping. Due to its ornamental value and drought tolerance, it is a popular choice for gardeners in Mediterranean and temperate climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Cyperaceae",
        "genus": "Abildgaardia",
        "species": "Abildgaardia pachyptera"
    },
    "taxonomy_art_desc": "Abildgaardia pachyptera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns, horsetails, and their allies, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by their floral structures. Its order is Poales, which includes grasses, sedges, and rushes, and is notable for its wind-pollinated flowers and grass-like leaves. Its family is Cyperaceae, commonly known as the sedge family, which consists of plants typically growing in wet or marshy environments. Its genus is Abildgaardia, a group of flowering plants within the Cyperaceae family, characterized by their narrow leaves and spike-like inflorescences. Its species is Abildgaardia pachyptera, a specific type of sedge known for its distinctive morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia pachyptera is primarily native to the Northern Territory, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy or rocky soils and is well adapted to the harsh climatic conditions of its native range. The species is often seen in open woodlands and shrublands. Its distribution reflects its ability to thrive in the unique environmental conditions of these Australian regions.",
    "distribution_introduced_art_desc": "Abildgaardia pachyptera was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive appearance. The plant has since spread beyond cultivated areas and is now considered a weed in some regions. Its introduction has raised concerns about its impact on native ecosystems. Efforts are being made to control its spread and prevent further invasion."
}
