{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia microrotundata",
    "plant_slug": "abildgaardia-microrotundata",
    "plant_name_scientific": "abildgaardia microrotundata",
    "intro": "Abildgaardia microrotundata, commonly known as the small round-leaved orchid, is a rare and delicate flowering plant native to the tropical regions of Southeast Asia. It is characterized by its compact stature, with small, rounded leaves and intricate, fragrant flowers that typically bloom in shades of white and pale pink. The plant belongs to the orchid family (Orchidaceae) and is known for its specialized mycorrhizal relationships, which are essential for its nutrient uptake. Due to its limited distribution and habitat specificity, it is considered endangered and is often found in shaded, moist environments within forest understories. Its botanical significance lies in its role as an indicator species for undisturbed tropical ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia microrotundata is primarily native to the western United States, specifically California and Nevada. It is commonly found in arid and semi-arid regions, particularly in the Mojave Desert and surrounding areas. This plant thrives in sandy or gravelly soils and is often associated with rocky outcrops and dry slopes. It is well adapted to the harsh conditions of its native environment, including high temperatures and limited rainfall. Due to its specific habitat requirements, it is considered a rare and endemic species within its range.",
    "distribution_introduced_art_desc": "Abildgaardia microrotundata was mainly introduced to New Zealand. It was first recorded in the 1980s and has since spread throughout the country. The plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It is commonly found in disturbed areas such as roadsides and forest edges. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
