{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia striatella",
    "plant_slug": "abildgaardia-striatella",
    "plant_name_scientific": "abildgaardia striatella",
    "intro": "Abildgaardia striatella, commonly known as the narrow-leafed rock cress, is a small, herbaceous plant native to the mountainous regions of Central Asia. It typically grows in rocky or gravelly soils, often in alpine or arctic environments. The plant features slender, upright stems covered with small, lance-shaped leaves that are usually covered in fine hairs. Its flowers are yellow, with four petals and are arranged in clusters at the ends of the stems. Abildgaardia striatella is adapted to cold climates and is often found in areas with low nutrient availability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia striatella is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It is commonly found in rocky habitats and dry, sunny environments. This plant thrives in well-drained soils and is often associated with limestone or chalk substrates. It is particularly common in countries such as Spain, Italy, and Greece. Its distribution is largely confined to the Mediterranean Basin, where it has adapted to the region's climate and soil conditions.",
    "distribution_introduced_art_desc": "Abildgaardia striatella was mainly introduced to new habitats through human activities such as horticulture and landscaping. It has been reported in several regions outside its native range, including parts of Europe and North America. The plant's adaptability to various soil types and climates has contributed to its spread. It is often found in disturbed areas, along roadsides, and in urban environments. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems."
}
