{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia odontocarpa",
    "plant_slug": "abildgaardia-odontocarpa",
    "plant_name_scientific": "abildgaardia odontocarpa",
    "intro": "Abildgaardia odontocarpa, commonly known as the toothed-lobed evergreen, is a unique species native to the mountainous regions of southern China. It is a small evergreen shrub characterized by its leathery, elliptical leaves that are often lobed and have a serrated edge. The plant produces small, fragrant white flowers in clusters, which are followed by red, fleshy berries. It thrives in cool, moist environments and is often found in shaded forest understories. Due to its ornamental value and limited distribution, it is considered a rare and valuable plant in horticulture.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Cyperaceae",
        "genus": "Abildgaardia",
        "species": "Abildgaardia odontocarpa"
    },
    "taxonomy_art_desc": "Abildgaardia odontocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and complex vascular systems. Its class is Equisetopsida, which comprises ferns and their allies, known for their unique reproductive structures and often possessing vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and related families, typically with small, wind-pollinated flowers. Its family is Cyperaceae, commonly known as the sedge family, which consists of grass-like plants with triangular stems and usually three-ranked leaves. Its genus is Abildgaardia, a relatively small genus within the Cyperaceae family, characterized by its specific morphological traits and ecological preferences. Its species is Abildgaardia odontocarpa, a specific type within the genus Abildgaardia, distinguished by its unique morphological characteristics and habitat requirements.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia odontocarpa is primarily native to the Northern Territory, Queensland, and Western Australia. This plant is commonly found in the arid and semi-arid regions of these areas. It typically grows in sandy or gravelly soils, often in open woodlands or shrublands. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in the local flora and fauna of these regions.",
    "distribution_introduced_art_desc": "Abildgaardia odontocarpa was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its unique appearance and hardiness. However, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, well-drained soils and is often found near streams and wetlands. Its rapid growth and ability to spread through seeds have raised concerns among local conservationists."
}
