{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia scirpoides",
    "plant_slug": "abildgaardia-scirpoides",
    "plant_name_scientific": "abildgaardia scirpoides",
    "intro": "Abildgaardia scirpoides, commonly known as the narrowleaf bulrush, is a flowering plant belonging to the family Cyperaceae. It is native to the wetlands of North America, particularly in the eastern and central regions. The plant typically grows in shallow water or moist soil, forming dense stands that help stabilize shoreline ecosystems. Its slender, grass-like leaves are arranged in a cylindrical cluster, and it produces small, inconspicuous flowers in late summer. Abildgaardia scirpoides plays an important role in wetland habitats by providing habitat for various aquatic and terrestrial organisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia scirpoides is primarily native to Southeast Asia, particularly Indonesia and the Philippines. It is commonly found in wetland environments such as marshes, swamps, and along the edges of ponds and streams. This plant thrives in moist, nutrient-rich soils and is often associated with tropical and subtropical climates. It is a member of the Cyperaceae family, which includes sedges and related grass-like plants. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Abildgaardia scirpoides was mainly introduced to wetlands and marshy areas, where it thrives in moist, nutrient-rich soils. It is commonly found in coastal regions and along riverbanks, where it helps stabilize soil and prevent erosion. This plant has been reported in several countries in Europe and parts of North America, often as an invasive species. Its rapid growth and ability to spread through rhizomes make it a significant ecological concern in some regions. Despite its potential to dominate local vegetation, it also provides habitat and food for certain wildlife species."
}
