{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia hispidula subsp. senegalensis",
    "plant_slug": "abildgaardia-hispidula-subsp-senegalensis",
    "plant_name_scientific": "abildgaardia hispidula subsp. senegalensis",
    "intro": "Abildgaardia hispidula subsp. senegalensis, commonly known as the Senegalese hibiscus, is a shrub native to tropical Africa. It is characterized by its rough, hairy stems and large, showy flowers that typically bloom in shades of yellow or orange. The plant produces capsule fruits containing numerous small, black seeds. It thrives in well-drained soils and is often found in woodland or savanna habitats. Due to its ornamental value, it is occasionally cultivated in gardens in warm climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia hispidula subsp. senegalensis is primarily native to the Sahel region of Africa, including countries such as Senegal, Mali, Burkina Faso, and Niger. It is commonly found in dry savannas and grasslands with well-drained soils. This subspecies thrives in tropical and subtropical climates, often growing in open habitats with moderate to high sunlight exposure. It is adapted to seasonal rainfall patterns and can tolerate drought conditions. The plant is often seen as part of the vegetation in semi-arid environments across western and central Africa.",
    "distribution_introduced_art_desc": "Abildgaardia hispidula subsp. senegalensis was mainly introduced to regions with arid or semi-arid climates, particularly in parts of Africa and the Middle East. It is commonly found in sandy soils and along coastal areas where it can thrive in dry conditions. This subspecies is often used for soil stabilization and erosion control due to its hardy nature. It has also been introduced to some areas of Australia for similar ecological purposes. Its distribution is largely limited to areas where it can tolerate high temperatures and low precipitation."
}
