{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia indica",
    "plant_slug": "abildgaardia-indica",
    "plant_name_scientific": "abildgaardia indica",
    "intro": "Abildgaardia indica, commonly known as the Indian sandalwood, is a small evergreen tree native to the Indian subcontinent. It is characterized by its aromatic, fragrant wood that is highly valued in traditional medicine and perfumery. The plant has simple, alternate leaves that are elliptical in shape and often have a smooth or slightly hairy surface. Its small, white or pinkish flowers are followed by small, round fruits containing a single seed. Due to overharvesting and habitat loss, it is now classified as an endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia indica is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It is commonly found in coastal areas and rocky habitats, particularly in countries such as Spain, Italy, and Turkey. This plant thrives in well-drained soils and is often associated with coastal dunes and cliffs. It is also present in some regions of the Middle East and the western coast of the Black Sea. Due to its preference for specific environmental conditions, its distribution is relatively limited compared to other plant species.",
    "distribution_introduced_art_desc": "Abildgaardia indica was mainly introduced to areas with disturbed soils and human-altered environments. It thrives in regions with moderate to high rainfall and is commonly found in coastal and inland areas. This plant is often seen in urban and agricultural settings where it can outcompete native vegetation. Its rapid growth and ability to spread through seeds make it a potential invasive species in some regions. It is important to monitor its distribution to prevent ecological imbalances."
}
