{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia macroanthela",
    "plant_slug": "abildgaardia-macroanthela",
    "plant_name_scientific": "abildgaardia macroanthela",
    "intro": "Abildgaardia macroanthela, commonly known as the giant orchid, is a striking tropical plant native to the rainforests of Southeast Asia. It is characterized by its large, showy flowers that can reach up to 10 inches in diameter, making it one of the most visually impressive orchids. The plant has a sympodial growth habit, with pseudobulbs that store water and nutrients, allowing it to thrive in humid, shaded environments. Its leaves are broad and fleshy, adapted to retain moisture in its natural habitat. Abildgaardia macroanthela blooms once a year, typically during the wet season, producing fragrant flowers that attract pollinators like bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia macroanthela is primarily native to the eastern and southeastern regions of South Africa, specifically in the provinces of KwaZulu-Natal, Mpumalanga, and parts of the Eastern Cape. It is commonly found in rocky outcrops, grasslands, and forest margins, thriving in well-drained soils. This plant is often associated with coastal and mountainous areas, where it benefits from the mild, humid climate. It is a member of the Amaryllidaceae family and is known for its striking, showy flowers. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species in its native range.",
    "distribution_introduced_art_desc": "Abildgaardia macroanthela was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, showy flowers. However, it has since become a problematic invasive species in certain regions. The plant spreads rapidly and can outcompete native vegetation. Its introduction has led to increased management efforts to control its spread."
}
