{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia pusilla subsp. yalingensis",
    "plant_slug": "abildgaardia-pusilla-subsp-yalingensis",
    "plant_name_scientific": "abildgaardia pusilla subsp. yalingensis",
    "intro": "Abildgaardia pusilla subsp. yalingensis, commonly known as the Yalingensis bellflower, is a small flowering plant native to China. It belongs to the Campanulaceae family and is characterized by its delicate, bell-shaped blue or violet flowers. The plant typically grows in rocky or mountainous areas, preferring well-drained soils and full sun exposure. Its compact size and ornamental flowers make it a popular choice for rock gardens and alpine collections. Due to its limited distribution, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia pusilla subsp. yalingensis is primarily native to the mountainous regions of southern China, particularly in Yunnan Province. This subspecies thrives in humid, shaded environments within subtropical forests. It is commonly found at elevations ranging from 1,500 to 3,000 meters above sea level. The plant is adapted to the cool, moist climate of these high-altitude areas. Its distribution is limited to specific microhabitats, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Abildgaardia pusilla subsp. yalingensis was mainly introduced to areas with moist, shaded environments, typically found in forest understories. It prefers well-drained, acidic soils and is often associated with temperate climates. This subspecies is commonly found in regions with high humidity and moderate temperatures. It is particularly adapted to growing in the shade of larger trees, making it a valuable component of understory vegetation. Its introduction has been noted in several regions where similar ecological conditions exist."
}
