{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia sphaerocarpa",
    "plant_slug": "abildgaardia-sphaerocarpa",
    "plant_name_scientific": "abildgaardia sphaerocarpa",
    "intro": "Abildgaardia sphaerocarpa, commonly known as the globe-fruit plant, is a small shrub native to the Mediterranean region. It is characterized by its compact growth habit and clusters of small, round, orange fruits that resemble tiny globes. The plant produces small, white flowers that bloom in early spring, followed by the development of its distinctive fruits. Its leaves are narrow and slightly hairy, adapted to the dry, sunny conditions of its natural habitat. Abildgaardia sphaerocarpa is valued in horticulture for its ornamental appeal and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia sphaerocarpa is primarily native to the southern regions of South America, specifically in countries such as Argentina, Bolivia, and Paraguay. It is commonly found in grasslands and open habitats within these areas. The plant thrives in temperate climates with well-drained soils. It is adapted to the seasonal variations of the region, including dry periods during certain times of the year. Its native distribution is closely linked to the ecological conditions of the southern Andean foothills and adjacent plains.",
    "distribution_introduced_art_desc": "Abildgaardia sphaerocarpa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and hardy nature. The plant has since spread beyond cultivated areas and is now found in various habitats across the country. It is considered a potential weed due to its ability to thrive in different soil types and climates. Its distribution has raised concerns among conservationists due to its impact on native ecosystems."
}
