{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia yalingensis",
    "plant_slug": "abildgaardia-yalingensis",
    "plant_name_scientific": "abildgaardia yalingensis",
    "intro": "Abildgaardia yalingensis, commonly known as the Yalingensis Abildgaardia, is a rare flowering plant native to China. It belongs to the family Apiaceae, which includes parsley and carrots, and is characterized by its finely divided leaves and small, clustered flowers. The plant is known for its delicate appearance and is often found in moist, shaded environments. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia yalingensis is primarily native to the Yiling Mountains in Hubei Province, China. This plant is found in the subtropical regions of southern China, specifically in the mountainous areas of Hubei. It thrives in humid, shaded environments within forest understories. The species is known for its unique morphological features and is of interest to botanists and conservationists. Due to its limited distribution, it is considered a rare and endemic plant species.",
    "distribution_introduced_art_desc": "Abildgaardia yalingensis was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and forest edges. The plant thrives in full sun to partial shade and is known for its rapid growth and ability to colonize new areas quickly. Its introduction has been documented in several countries in Southeast Asia, including Thailand and Vietnam. Due to its aggressive growth, it is considered a potential invasive species in some regions."
}
