{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia papillosa",
    "plant_slug": "abildgaardia-papillosa",
    "plant_name_scientific": "abildgaardia papillosa",
    "intro": "Abildgaardia papillosa, commonly known as the silky sandwort, is a flowering plant native to the Arctic and alpine regions of Europe and North America. It is a low-growing perennial that typically forms dense mats or cushions, adapted to survive in cold, harsh environments. The plant features small, white or pale pink flowers that bloom in late summer, and its leaves are covered in fine, silky hairs, giving it a distinctive appearance. It thrives in well-drained, rocky or sandy soils and is often found in tundra or mountainous habitats. Abildgaardia papillosa plays a role in stabilizing soil in its native ecosystems and is of interest to botanists studying plant adaptations to extreme climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia papillosa is primarily native to Brazil Northeast. This species is found in the northeastern region of Brazil, where it thrives in specific ecological conditions. It is commonly associated with coastal areas and sandy soils in this region. The plant's distribution is limited to this area, indicating a strong adaptation to the local environment. Conservation efforts are important to protect its natural habitat.",
    "distribution_introduced_art_desc": "Abildgaardia papillosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and hardy nature. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shaded environments, often along stream banks and in forest understories. Its rapid spread has led to increased management efforts to control its impact on local ecosystems."
}
