{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia densa subsp. afromontana",
    "plant_slug": "abildgaardia-densa-subsp-afromontana",
    "plant_name_scientific": "abildgaardia densa subsp. afromontana",
    "intro": "Abildgaardia densa subsp. afromontana, commonly known as the African mountain heath, is a flowering plant native to the high-altitude regions of East Africa. It belongs to the Ericaceae family, which includes heathers and blueberries, and is characterized by its dense, compact growth habit. The plant produces small, bell-shaped flowers that are typically white or pale pink, blooming in late spring to early summer. It thrives in well-drained, acidic soils and is adapted to cool, moist climates found in montane forests. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia densa subsp. afromontana is primarily native to the montane regions of eastern Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It is commonly found in high-altitude grasslands and rocky outcrops within the East African Rift Valley. This subspecies thrives in temperate climates with well-drained soils and moderate rainfall. It is often associated with open habitats in mountainous areas where it forms part of the local flora. Its distribution is limited to specific ecological zones that provide the necessary environmental conditions for its growth.",
    "distribution_introduced_art_desc": "Abildgaardia densa subsp. afromontana was mainly introduced to regions with high biodiversity and suitable climatic conditions, particularly in tropical and subtropical areas. It thrives in moist, well-drained soils and is often found in forested or shaded environments. This plant has been reported in several countries across Africa, including Kenya, Tanzania, and Uganda. Its introduction is likely due to its ornamental value and potential ecological benefits. However, its impact on native ecosystems remains a subject of ongoing research."
}
