{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia willdenowii",
    "plant_slug": "abildgaardia-willdenowii",
    "plant_name_scientific": "abildgaardia willdenowii",
    "intro": "Abildgaardia willdenowii, commonly known as the Cape mountain catchfly, is a flowering plant native to South Africa. It belongs to the family Onagraceae and is characterized by its small, pinkish-white flowers that bloom in early spring. The plant typically grows in rocky or sandy soils and is often found in mountainous regions. It has slender stems and lance-shaped leaves, and its seeds are dispersed by wind. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia willdenowii is primarily native to South America, specifically found in countries such as Brazil, Paraguay, and Argentina. It is commonly associated with the grassland and savanna ecosystems of the region. This plant thrives in open, sunny habitats with well-drained soils. It is often found in areas with a temperate to subtropical climate. Its distribution is largely confined to the southern parts of South America.",
    "distribution_introduced_art_desc": "Abildgaardia willdenowii was mainly introduced to North America through horticultural trade and botanical collections. It is commonly found in cultivated gardens and greenhouses, particularly in regions with temperate climates. The plant is valued for its ornamental qualities, including its delicate flowers and foliage. Despite being non-native, it has not become invasive in most areas where it is grown. Its distribution remains largely confined to human-modified environments rather than natural ecosystems."
}
