{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia mexicana",
    "plant_slug": "abildgaardia-mexicana",
    "plant_name_scientific": "abildgaardia mexicana",
    "intro": "Abildgaardia mexicana, commonly known as Mexican rock cactus, is a succulent plant native to Mexico. It belongs to the Cactaceae family and is characterized by its cylindrical stems and spiny areoles. The plant typically grows in rocky or sandy soils and is adapted to arid environments. It produces yellow flowers during the spring or summer months. Due to its unique appearance and habitat, it is often cultivated as an ornamental plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Cyperaceae",
        "genus": "Abildgaardia",
        "species": "Abildgaardia mexicana"
    },
    "taxonomy_art_desc": "Abildgaardia mexicana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex reproductive structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a distinctive morphology, including horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and related families, characterized by their wind-pollinated flowers. Its family is Cyperaceae, commonly known as the sedge family, which includes plants typically found in wet environments and characterized by their triangular stems. Its genus is Abildgaardia, a small genus within the Cyperaceae family, consisting of a few species that are often found in specific geographic regions. Its species is Abildgaardia mexicana, a specific plant within the genus Abildgaardia, native to Mexico, and known for its unique ecological and morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia mexicana is primarily native to Mexico Central, Mexico Northeast, Mexico Southeast, and Mexico Southwest. This plant is found in various regions within these areas, including parts of the states of Veracruz, Puebla, Oaxaca, and Chiapas. It typically grows in tropical and subtropical environments, often in humid and well-drained soils. The species is commonly associated with forested areas and is part of the native flora in these regions. Its distribution reflects its adaptation to the diverse ecosystems of central and southern Mexico.",
    "distribution_introduced_art_desc": "Abildgaardia mexicana was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive yellow flowers and compact growth habit. Despite its aesthetic appeal, it has shown invasive tendencies in some areas, outcompeting native vegetation. The plant thrives in moist, well-drained soils and is often found near streams and wetlands. Its spread has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
