{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia erratica",
    "plant_slug": "abildgaardia-erratica",
    "plant_name_scientific": "abildgaardia erratica",
    "intro": "Abildgaardia erratica, commonly known as the erratic lichen, is a unique species that belongs to the family Parmeliaceae. It is a foliose lichen, characterized by its leaf-like thallus structure, which is typically bright green to yellowish in color. This lichen is often found growing on tree bark, rocks, or soil in temperate and subarctic regions. Its morphology includes a distinctive, irregularly shaped body with a leathery texture. Abildgaardia erratica is known for its slow growth and ability to survive in harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia erratica is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It is commonly found in rocky, coastal areas and dry, sunny habitats. This plant thrives in well-drained soils and is often associated with cliffs and limestone formations. It is a hardy species that has adapted to the harsh conditions of its native environment. Despite its limited range, it is considered an important component of local flora in these regions.",
    "distribution_introduced_art_desc": "Abildgaardia erratica was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance. However, it has since become invasive, spreading rapidly in native ecosystems. The plant thrives in disturbed soils and can outcompete native vegetation. Its introduction has raised concerns among conservationists due to its potential to disrupt local biodiversity."
}
