{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia javanensis",
    "plant_slug": "abildgaardia-javanensis",
    "plant_name_scientific": "abildgaardia javanensis",
    "intro": "Abildgaardia javanensis, commonly known as the Javanese abildgaardia, is a flowering plant native to Indonesia. It belongs to the family Rubiaceae, which includes coffee and gardenias. The plant is characterized by its simple, opposite leaves and clusters of small, white flowers. It thrives in moist, shaded environments, typically in tropical rainforests. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia javanensis is primarily native to the Indonesian island of Java. It is found in the lowland rainforests and secondary growth areas of the island. This plant thrives in humid, tropical climates with high rainfall. It is commonly associated with disturbed habitats and is often found near human settlements. Its distribution is limited to Java, with no known occurrences on other nearby islands.",
    "distribution_introduced_art_desc": "Abildgaardia javanensis was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage. It was first brought to the islands in the late 19th century by European settlers who admired its unique appearance. Despite its aesthetic value, it has since become invasive in some areas, outcompeting native species for resources. The plant thrives in moist, shaded environments and can spread rapidly through seed dispersal by birds and water. Its introduction highlights the ecological risks associated with non-native plant species in island ecosystems."
}
