{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abildgaardia miegei",
    "plant_slug": "abildgaardia-miegei",
    "plant_name_scientific": "abildgaardia miegei",
    "intro": "Abildgaardia miegei, commonly known as the Cape orchid, is a species of orchid native to South Africa. It is characterized by its compact growth habit and produces small, fragrant flowers in shades of white and pale yellow. The plant typically grows in rocky or sandy soils and thrives in full sun to partial shade. It belongs to the Orchidaceae family and is known for its ornamental value in horticulture. Due to its specific habitat requirements, it is often cultivated in controlled environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abildgaardia miegei is primarily native to the tropical regions of South America, particularly in countries such as Brazil, Colombia, and Peru. It thrives in humid, lowland areas with rich, well-drained soils. This plant is commonly found in forest understories and along riverbanks. It plays an important ecological role in its native habitat by providing shelter and food for various wildlife species. Its distribution is largely restricted to these specific geographic regions due to its particular environmental requirements.",
    "distribution_introduced_art_desc": "Abildgaardia miegei was mainly introduced to the Pacific Northwest region of the United States. It was first documented in Oregon in the early 20th century as an ornamental plant. The species has since spread to other parts of the West Coast, including California and Washington. It thrives in moist, temperate climates and is often found in disturbed soils near water sources. Due to its invasive potential, it is now monitored in several conservation areas."
}
