{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abioton africanum",
    "plant_slug": "abioton-africanum",
    "plant_name_scientific": "abioton africanum",
    "intro": "Abioton africanum, commonly known as the African abioton, is a flowering plant native to the arid regions of southern Africa. It belongs to the family Acanthaceae and is characterized by its striking, tubular flowers that range in color from purple to red. The plant is adapted to survive in dry conditions, with thick, waxy leaves that reduce water loss. Its growth habit is typically shrub-like, with multiple branches and small, narrow leaves. Abioton africanum is often found in rocky soils and is a popular choice for xeriscaping due to its low water requirements and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abioton africanum is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savanna and shrubland ecosystems. The plant thrives in well-drained soils and is adapted to withstand high temperatures and low rainfall. It is often seen growing along roadsides, in rocky outcrops, and in disturbed habitats. Its distribution is closely linked to the availability of sunlight and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Abioton africanum was mainly introduced to new habitats in southern Africa through human activities such as trade and land clearing. It has established itself in disturbed environments like roadsides, abandoned fields, and urban areas. The plant's ability to thrive in poor soil conditions contributes to its rapid spread. It is considered an invasive species in some regions due to its competitive advantage over native vegetation. However, its ecological impact is still being studied in detail."
}
