{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Ablania guianensis",
    "plant_slug": "ablania-guianensis",
    "plant_name_scientific": "ablania guianensis",
    "intro": "Ablania guianensis, commonly known as the Guianese bladder nut, is a tropical tree native to the Amazon rainforest. It belongs to the family Bombacaceae and is characterized by its large, heart-shaped leaves and showy, red-orange flowers. The plant produces woody capsules that contain several seeds, which are often dispersed by animals. It thrives in humid, well-drained soils and is valued for its hard, durable wood. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Ablania guianensis is primarily native to the tropical regions of South America, particularly in the Amazon Basin. It is found in countries such as Brazil, Colombia, Venezuela, and Guyana. This plant thrives in humid, lowland forests with rich soil and high rainfall. It is commonly associated with riverine and floodplain ecosystems. Its distribution is closely linked to the ecological conditions of the Amazon rainforest.",
    "distribution_introduced_art_desc": "Ablania guianensis was mainly introduced to regions with warm, humid climates and well-drained soils, typically found in tropical and subtropical areas. It thrives in environments with high sunlight exposure and moderate to high rainfall. This plant is often cultivated for its ornamental value due to its attractive foliage and flowers. It has been successfully introduced to parts of Southeast Asia, the Caribbean, and southern United States. Its introduction has sometimes led to its naturalization in local ecosystems."
}
