{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Ablania laurifolia",
    "plant_slug": "ablania-laurifolia",
    "plant_name_scientific": "ablania laurifolia",
    "intro": "Ablania laurifolia, commonly known as the laurel leaf ablania, is a species of flowering plant native to the tropical regions of Southeast Asia. It is characterized by its glossy, dark green, lance-shaped leaves that are arranged alternately along the stems. The plant produces small, fragrant white flowers that bloom in clusters, typically during the rainy season. Its fruit is a small, fleshy drupe that contains a single seed. Ablania laurifolia is often cultivated for its ornamental value and is also used in traditional medicine for its purported therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Ablania laurifolia is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland forest environments, often found in the understory of evergreen and semi-deciduous forests. This plant is commonly associated with areas that have high rainfall and warm temperatures throughout the year. It is also occasionally found in parts of southern China and the Indian subcontinent. Due to its specific habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Ablania laurifolia was mainly introduced to the Pacific Northwest region of the United States. It was introduced as an ornamental plant due to its attractive foliage and adaptability to various soil types. The plant has since spread beyond cultivated areas, establishing itself in forest edges and disturbed sites. Its rapid growth and ability to thrive in moist environments have led to concerns about its potential invasiveness. Despite its aesthetic appeal, local conservationists are monitoring its spread to prevent ecological disruption."
}
