{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abobra viridiflora",
    "plant_slug": "abobra-viridiflora",
    "plant_name_scientific": "abobra viridiflora",
    "intro": "Abobra viridiflora, commonly known as the Emerald-flowered Bush, is a flowering plant native to the tropical regions of Southeast Asia. It is characterized by its dense, evergreen foliage and clusters of small, bright green flowers that bloom throughout the year. The plant has lance-shaped leaves with a smooth, waxy surface, and its stems are often covered in fine, white hairs. It thrives in moist, well-drained soils and is often found in shaded forest understories. Due to its ornamental value, it is occasionally cultivated in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abobra viridiflora is primarily native to the tropical regions of Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland forests where it receives ample sunlight and rainfall. This plant is commonly found in the undergrowth of primary and secondary rainforests. It plays an important ecological role by providing food and habitat for various wildlife species. Due to habitat loss, its distribution has become increasingly restricted in recent decades.",
    "distribution_introduced_art_desc": "Abobra viridiflora was mainly introduced to enhance biodiversity in tropical ecosystems. It was distributed primarily in Southeast Asia, including countries like Malaysia, Indonesia, and the Philippines. The plant was introduced to support reforestation efforts and provide habitat for native wildlife. It thrives in moist, shaded environments and is often found in secondary forests. Its introduction has had both positive ecological impacts and some concerns regarding potential invasiveness."
}
