{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abobra tenuifolia",
    "plant_slug": "abobra-tenuifolia",
    "plant_name_scientific": "abobra tenuifolia",
    "intro": "Abobra tenuifolia, commonly known as the slender leaf abobra, is a tropical plant native to parts of Southeast Asia. It is characterized by its narrow, elongated leaves that are often covered in a fine, silvery hair. The plant produces small, pale yellow flowers that bloom in clusters, typically during the rainy season. It thrives in moist, shaded environments and is often found in humid forests. Its botanical features make it a unique subject for study in tropical botany.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Cucurbitales",
        "family": "Cucurbitaceae",
        "genus": "Abobra",
        "species": "Abobra tenuifolia"
    },
    "taxonomy_art_desc": "Abobra tenuifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the magnolia family. Its order is Cucurbitales, which consists of flowering plants that typically have tendrils and produce fruits that are often edible. Its family is Cucurbitaceae, commonly known as the gourd family, which includes vines that produce a variety of fruits like cucumbers, squash, and melons. Its genus is Abobra, a less commonly known genus within the Cucurbitaceae family, characterized by its unique morphological features. Its species is Abobra tenuifolia, a specific plant within the genus Abobra, distinguished by its slender leaves and growth habits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Brazil South",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abobra tenuifolia is primarily native to Argentina Northeast, Argentina Northwest, Brazil South, and Uruguay. This plant is commonly found in the temperate regions of these areas. It thrives in grasslands and open habitats with well-drained soils. The species is adapted to the climate conditions of these regions. It plays an important role in local ecosystems and traditional uses.",
    "distribution_introduced_art_desc": "Abobra tenuifolia was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shady environments, making it a common sight in forested regions. Its rapid spread has raised concerns among conservationists."
}
