{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda rigida",
    "plant_slug": "abolboda-rigida",
    "plant_name_scientific": "abolboda rigida",
    "intro": "Abolboda rigida, commonly known as the rigid lichen, is a species of lichen that belongs to the family Parmeliaceae. It is characterized by its dense, crust-like growth form and typically grows on rock surfaces in arid or semi-arid environments. The thallus is usually pale to dark gray, with a firm and leathery texture. It lacks distinct lobes and has a uniform appearance, making it easily identifiable in its habitat. This lichen is often found in regions with low humidity and high sunlight exposure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda rigida is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Uzbekistan, and Turkmenistan. It thrives in sandy soils and is commonly found in desert and steppe environments. This species is well adapted to harsh climatic conditions with low rainfall and high temperatures. It is often seen growing along dunes and in open grasslands. Its distribution is largely restricted to these specific ecological zones within Central Asia.",
    "distribution_introduced_art_desc": "Abolboda rigida was mainly introduced to new environments through human activities such as horticulture and landscaping. It is commonly found in regions with temperate climates, particularly in parts of Europe and North America. The plant thrives in well-drained soils and full sunlight, making it adaptable to various garden settings. Its introduction has led to its spread in both cultivated and natural areas. However, it is not considered invasive in most regions where it has been introduced."
}
