{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda pervaginata",
    "plant_slug": "abolboda-pervaginata",
    "plant_name_scientific": "abolboda pervaginata",
    "intro": "Abolboda pervaginata, commonly known as the velvetleaf, is a tropical plant characterized by its broad, heart-shaped leaves that are often covered in a fine, velvety texture. It is a member of the Malvaceae family, which includes cotton and hibiscus, and is native to regions of Africa, Asia, and the Americas. The plant produces small, pale yellow flowers that are clustered in inflorescences, and its fruits are capsule-like structures containing numerous seeds. Abolboda pervaginata is often considered a weed in agricultural settings due to its rapid growth and ability to thrive in disturbed soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda pervaginata is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, Thailand, and the Philippines. It thrives in humid, lowland areas with rich, well-drained soil, often found in secondary forests and along riverbanks. This plant is commonly associated with disturbed habitats and is sometimes cultivated for its ornamental value. Its distribution is also reported in parts of southern China and the Indian subcontinent. Due to its adaptability, it can occasionally be found in nearby regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Abolboda pervaginata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first brought to the country in the early 20th century by horticultural enthusiasts who sought to cultivate exotic species. Despite its aesthetic appeal, the plant has since spread beyond cultivated areas and is now considered invasive in some regions. Its rapid growth and ability to outcompete native vegetation have raised concerns among conservationists. Efforts are ongoing to manage its spread and mitigate its impact on local ecosystems."
}
