{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda bella",
    "plant_slug": "abolboda-bella",
    "plant_name_scientific": "abolboda bella",
    "intro": "Abolboda bella, commonly known as the golden bellflower, is a herbaceous perennial native to the Mediterranean region. It features showy, bell-shaped flowers that range in color from yellow to orange, typically blooming in late spring to early summer. The plant has lance-shaped leaves that are hairy and arranged alternately along the stem. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens and borders. Abolboda bella is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda bella"
    },
    "taxonomy_art_desc": "Abolboda bella belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants with a distinct life cycle that includes a sporophyte and a gametophyte stage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Poales, which comprises grasses and related plants known for their wind pollination and C4 photosynthesis. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with narrow leaves and showy flowers. Its genus is Abolboda, a group of flowering plants typically found in wetland habitats with small, clustered flowers. Its species is Abolboda bella, a specific type within the genus Abolboda, distinguished by its attractive, bell-shaped flowers and preference for moist environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda bella is primarily native to Venezuela. It is found in the tropical regions of the country, particularly in the southern and eastern parts. This plant thrives in humid, warm climates with well-drained soil. It is commonly found in forested areas and along riverbanks. Its native distribution is closely tied to the diverse ecosystems of Venezuela.",
    "distribution_introduced_art_desc": "Abolboda bella was mainly introduced to new habitats in the Southeastern United States due to its ornamental value and adaptability to various soil types. It has been observed thriving in both urban and suburban environments, particularly in areas with mild climates. The plant's rapid growth and ability to spread through seeds have led to its establishment in natural areas, raising concerns about its impact on native flora. Despite its aesthetic appeal, its invasive potential has prompted some local authorities to monitor its spread closely. This distribution highlights the need for careful management to prevent ecological disruption."
}
