{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda schultesii",
    "plant_slug": "abolboda-schultesii",
    "plant_name_scientific": "abolboda schultesii",
    "intro": "Abolboda schultesii, commonly known as the Schultesi's lily, is a perennial herbaceous plant native to the high-altitude regions of the Andes in South America. It is characterized by its tall, slender stems and large, showy flowers that typically bloom in shades of white and pink. The plant has lance-shaped leaves that are arranged alternately along the stem. It thrives in cool, moist environments and is often found in rocky or mountainous terrain. Due to its unique appearance and habitat, it is of interest to botanists and conservationists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda schultesii is primarily native to the tropical regions of South America, particularly in Brazil, Peru, and Colombia. It is commonly found in the Amazon rainforest and other humid lowland areas. This plant thrives in dense, shaded undergrowth where it can receive indirect sunlight. It is often associated with moist, nutrient-rich soils in primary and secondary forests. Due to habitat loss, its distribution has become increasingly restricted in recent decades.",
    "distribution_introduced_art_desc": "Abolboda schultesii was mainly introduced to new habitats through human activities such as horticulture and landscaping. It has been observed in regions with temperate climates, particularly in parts of Europe and North America. The plant thrives in well-drained soils and full sun, which contributes to its successful establishment in these areas. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, careful management is recommended to prevent its spread into native habitats."
}
