{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda scabrida",
    "plant_slug": "abolboda-scabrida",
    "plant_name_scientific": "abolboda scabrida",
    "intro": "Abolboda scabrida, commonly known as the roughleaf abolboda, is a flowering plant native to certain regions of Southeast Asia. It belongs to the family Rubiaceae, which includes many species of shrubs and herbs. The plant is characterized by its rough, textured leaves and clusters of small, white to pale yellow flowers. It typically grows in moist, shaded environments such as forest understories. Abolboda scabrida is valued for its ornamental appeal and has been studied for its potential medicinal properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda scabrida"
    },
    "taxonomy_art_desc": "Abolboda scabrida belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Poales, which comprises grasses and related plants, known for their wind-pollinated flowers and economic significance. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes herbaceous plants often found in wetlands. Its genus is Abolboda, a group of flowering plants within the Xyridaceae family, typically characterized by their grass-like appearance and small, clustered flowers. Its species is Abolboda scabrida, a specific type within the genus Abolboda, distinguished by its rough or scaly texture and specific habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda scabrida is primarily native to Venezuela. It is found in the northern regions of the country, particularly in the states of Zulia and Anzoátegui. This plant typically grows in dry, open habitats such as grasslands and rocky soils. It is well adapted to the tropical and subtropical climate of Venezuela. Its distribution is limited to specific ecological zones within the country.",
    "distribution_introduced_art_desc": "Abolboda scabrida was mainly introduced to new habitats in the Pacific Islands through human activities such as trade and colonization. It has since spread across various coastal and disturbed areas, often outcompeting native vegetation. The plant thrives in sandy soils and is commonly found in disturbed environments like roadsides and agricultural fields. Its rapid growth and ability to reproduce vegetatively contribute to its invasive nature. However, its distribution is still relatively limited compared to other introduced species in the region."
}
