{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda egleri var. brevifolia",
    "plant_slug": "abolboda-egleri-var-brevifolia",
    "plant_name_scientific": "abolboda egleri var. brevifolia",
    "intro": "Abolboda egleri var. brevifolia, commonly known as the narrow-leaved form of the genus Abolboda, is a rare and specialized plant species. It is characterized by its compact growth habit and reduced leaf size compared to the typical species. The plant exhibits a unique morphology with small, elliptical leaves that are densely arranged along the stem. It thrives in specific microhabitats, often found in shaded, moist environments with well-drained soil. Due to its limited distribution and specific ecological requirements, it is considered a botanically significant and ecologically sensitive species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda egleri"
    },
    "taxonomy_art_desc": "Abolboda egleri var. brevifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Poales, which comprises grasses, sedges, and rushes, and is known for its wind-pollinated flowers. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes herbaceous plants often found in wet habitats. Its genus is Abolboda, a small genus of flowering plants native to Africa, characterized by their grass-like appearance and specific floral structures. Its species is Abolboda egleri, a specific variety within the genus, distinguished by its unique morphological features and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda egleri var. brevifolia is primarily native to Colombia and Venezuela. This variant of the species is found in the tropical regions of these countries. It typically grows in humid, lowland areas with rich soil. The plant is part of the Rubiaceae family and is known for its ornamental value. Its native distribution is limited to specific ecological zones within these two South American nations.",
    "distribution_introduced_art_desc": "Abolboda egleri var. brevifolia was mainly introduced to regions with temperate climates and well-drained soils, often found in forested areas. It is commonly cultivated in gardens and parks for its ornamental value. The plant prefers partial shade to full sun and is relatively drought-tolerant once established. It is known for its compact growth habit and attractive foliage. Due to its hardiness, it has been widely adopted in horticultural practices across Europe and parts of North America."
}
