{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda poeppigii",
    "plant_slug": "abolboda-poeppigii",
    "plant_name_scientific": "abolboda poeppigii",
    "intro": "Abolboda poeppigii, commonly known as the desert lily, is a flowering plant native to arid regions of the Middle East and Central Asia. It is a perennial herb that typically grows in sandy or rocky soils, adapting to extreme environmental conditions. The plant features narrow, grass-like leaves and produces striking white or pale purple flowers during the spring or early summer. It has a fibrous root system that helps it survive in dry climates by accessing deep water sources. Due to its resilience, it is often used in xeriscaping and has cultural significance in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda poeppigii is primarily native to the arid and semi-arid regions of Central Asia, including parts of Kazakhstan, Uzbekistan, and Turkmenistan. It is commonly found in desert and steppe environments, often growing on rocky soils and in areas with low precipitation. This plant is well adapted to harsh climatic conditions and can survive in regions with extreme temperature fluctuations. It is also occasionally reported in southern regions of Russia and northern areas of Afghanistan. Its distribution is largely confined to these specific ecological zones where it thrives in dry, open habitats.",
    "distribution_introduced_art_desc": "Abolboda poeppigii was mainly introduced to areas with specific environmental conditions that support its growth, such as well-drained soils and moderate temperatures. It is commonly found in regions with a Mediterranean climate, where it thrives in full sun and requires minimal water. This plant has been introduced to various parts of the world, including southern Europe, North Africa, and parts of the Middle East. Its introduction has been primarily for ornamental purposes due to its attractive foliage and resilience. However, it is important to monitor its spread to prevent potential ecological impacts in non-native regions."
}
