{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda ciliata",
    "plant_slug": "abolboda-ciliata",
    "plant_name_scientific": "abolboda ciliata",
    "intro": "Abolboda ciliata, commonly known as the hairy sarsaparilla, is a flowering plant native to parts of Africa and Asia. It belongs to the family Rubiaceae, which includes over 13,000 species of flowering plants. The plant is characterized by its trailing stems and small, opposite leaves with ciliate margins. Its flowers are typically white or pale yellow and are clustered in umbels. The plant is often found in moist, shaded environments such as forests and along stream banks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda ciliata"
    },
    "taxonomy_art_desc": "Abolboda ciliata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their closest algal relatives, characterized by their complex life cycles and multicellular structures. Its class is Equisetopsida, a group of vascular plants that includes ferns, horsetails, and their relatives, known for their ability to produce spores and their diverse morphological adaptations. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their complex flower structures and diverse reproductive strategies. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, known for their wind-pollinated flowers and C4 photosynthesis in many species. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes herbaceous plants with narrow leaves and small, often yellow flowers. Its genus is Abolboda, a small genus within the Xyridaceae family, consisting of several species of flowering plants typically found in wet or marshy habitats. Its species is Abolboda ciliata, a specific plant within the genus Abolboda, characterized by its distinctive leaf morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda ciliata is primarily native to Venezuela. It is found in various regions across the country, particularly in tropical and subtropical areas. This plant thrives in humid environments, often growing in forested regions or near water sources. Its native distribution is closely linked to the diverse ecosystems of Venezuela. It is an important species in the local flora and plays a role in the ecological balance of its habitat.",
    "distribution_introduced_art_desc": "Abolboda ciliata was mainly introduced to new environments through human activities such as trade and gardening. It is commonly found in disturbed habitats like roadsides, waste areas, and cultivated fields. The plant has adapted well to various soil types and can thrive in both sunny and partially shaded conditions. Its rapid growth and ability to spread through seeds make it an invasive species in many regions. Due to its aggressive nature, it can outcompete native plants and alter local ecosystems."
}
