{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda inermis",
    "plant_slug": "abolboda-inermis",
    "plant_name_scientific": "abolboda inermis",
    "intro": "Abolboda inermis, commonly known as the smooth balsa tree, is a tropical plant native to Central and South America. It is characterized by its light, porous wood, which is highly buoyant and historically used for model building and insulation. The plant has simple, alternate leaves that are usually ovate or elliptic in shape. It produces small, inconspicuous flowers that are typically green or white, followed by small, round fruits containing seeds. The species is adapted to grow in humid, tropical climates with well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda inermis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy soils and is commonly found in grassland and shrubland habitats. This plant is well adapted to drought conditions and can survive in areas with low rainfall. It is often seen growing along roadsides and in disturbed soils. Its distribution is limited to specific ecological niches within the region.",
    "distribution_introduced_art_desc": "Abolboda inermis was mainly introduced to New Zealand as an ornamental plant due to its attractive, silvery foliage. It was first brought to the country in the early 20th century by horticultural enthusiasts who appreciated its aesthetic value. Despite its beauty, it has since become invasive in certain regions, outcompeting native species in wetland and coastal environments. The plant's rapid growth and ability to spread through vegetative reproduction have made it a challenge for land managers. Efforts are ongoing to control its spread and restore native vegetation in affected areas."
}
