{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda ebracteata",
    "plant_slug": "abolboda-ebracteata",
    "plant_name_scientific": "abolboda ebracteata",
    "intro": "Abolboda ebracteata, commonly known as the leafless thornapple, is a herbaceous plant native to parts of Africa. It belongs to the family Apocynaceae, which includes many milkweed-like species. The plant is characterized by its absence of leaves, with flowers emerging directly from the stem. Its flowers are typically yellow or orange, with five petals and a distinctive corona. It produces small, fleshy fruits that contain seeds covered in a sticky, resinous coating.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda ebracteata"
    },
    "taxonomy_art_desc": "Abolboda ebracteata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, often featuring a unique type of stem structure. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by their complex flower structures. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, typically characterized by narrow leaves and small flowers. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with grass-like leaves and small, clustered flowers. Its genus is Abolboda, a group of flowering plants within the Xyridaceae family, characterized by their erect growth and distinctive floral morphology. Its species is Abolboda ebracteata, a specific plant within the genus Abolboda, notable for its lack of bracts and its unique ecological and morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda ebracteata is primarily native to Colombia and Venezuela. This plant is found in the tropical regions of these countries. It typically grows in humid, lowland areas with rich soil. The species is part of the Rubiaceae family. Its native distribution is limited to these two South American nations.",
    "distribution_introduced_art_desc": "Abolboda ebracteata was mainly introduced to new habitats through human activities such as horticulture and landscaping. It is commonly found in urban and suburban areas where it thrives in disturbed soils and sunny environments. The plant's rapid growth and adaptability have led to its spread beyond its original range. It is often cultivated for its ornamental value due to its attractive foliage and flowers. However, its introduction has raised concerns about its potential impact on native plant communities."
}
