{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda linearifolia",
    "plant_slug": "abolboda-linearifolia",
    "plant_name_scientific": "abolboda linearifolia",
    "intro": "Abolboda linearifolia, commonly known as the narrow-leaved abolboda, is a species of flowering plant native to parts of Southeast Asia. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its slender, linear leaves and showy, pentagonal flowers that are typically pink or purple in color. It thrives in moist, shaded environments and is often found in forest understories. Due to its ornamental value and ecological importance, it is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda linearifolia"
    },
    "taxonomy_art_desc": "Abolboda linearifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and algae that have a complex life cycle with a dominant sporophyte stage. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, characterized by their vascular systems and often rhizome-based growth. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels, and is distinguished by their primitive floral structures. Its order is Poales, which includes grasses, sedges, and rushes, and is known for its wind-pollinated flowers and C4 photosynthesis in many species. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes herbaceous plants with narrow leaves and small, often yellow flowers. Its genus is Abolboda, a group of flowering plants native to Africa, characterized by their narrow, linear leaves and small, clustered flowers. Its species is Abolboda linearifolia, a specific plant within the genus Abolboda, distinguished by its linear leaves and is found in specific habitats across its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda linearifolia is primarily native to Brazil North, Colombia, and Venezuela. This plant is found in the tropical regions of these countries. It thrives in humid and warm climates, often in forested areas. Its distribution is limited to specific ecological zones within these regions. The plant plays an important role in the local ecosystems of its native habitat.",
    "distribution_introduced_art_desc": "Abolboda linearifolia was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, agricultural fields, and degraded forests. It thrives in regions with moderate to high rainfall and well-drained soil conditions. The plant is commonly found in parts of Southeast Asia, including Indonesia, Malaysia, and the Philippines. Its introduction has been associated with human activity, particularly land clearing and agricultural expansion. Due to its rapid growth and adaptability, it can become invasive in certain ecosystems if left unchecked."
}
