{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda gracilis",
    "plant_slug": "abolboda-gracilis",
    "plant_name_scientific": "abolboda gracilis",
    "intro": "Abolboda gracilis, commonly known as the slender sedge, is a flowering plant belonging to the family Cyperaceae. It is native to wetland and marshy habitats in tropical and subtropical regions. The plant has narrow, grass-like leaves and produces small, clustered flowers that are typically green or brown in color. It plays an important role in stabilizing soil and providing habitat for aquatic organisms. Abolboda gracilis is often used in ecological restoration projects due to its adaptability and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda gracilis is primarily native to the western United States, particularly in California and Nevada. It thrives in arid and semi-arid environments, often found in rocky soils and along streambanks. This plant is commonly associated with desert scrub and chaparral habitats. It is well adapted to withstand drought conditions and high temperatures. Its distribution is limited to specific regions where it can find suitable moisture and sunlight.",
    "distribution_introduced_art_desc": "Abolboda gracilis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and abandoned lots. It thrives in regions with moderate to high sunlight exposure and well-drained soil. The plant is commonly found in temperate climates, particularly in regions with seasonal rainfall patterns. Its rapid growth and ability to spread through seeds make it an invasive species in many areas. Due to its adaptability, it has been reported in several countries across Europe and parts of Asia."
}
