{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda acicularis",
    "plant_slug": "abolboda-acicularis",
    "plant_name_scientific": "abolboda acicularis",
    "intro": "Abolboda acicularis, commonly known as the slender leaf spurge, is a perennial plant native to arid and semi-arid regions of Central Asia. It is characterized by its narrow, needle-like leaves that are arranged in a rosette pattern, which helps reduce water loss in dry environments. The plant produces small, yellow flowers in early summer, which are clustered in dense inflorescences. It is typically found in rocky soils and is adapted to withstand extreme temperature fluctuations. Due to its low water requirements, it is sometimes used in xeriscaping and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda acicularis"
    },
    "taxonomy_art_desc": "Abolboda acicularis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern gymnosperms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its complex floral structures. Its order is Poales, a large group of monocot plants that includes grasses, sedges, and related species, often adapted to a wide range of environments. Its family is Xyridaceae, commonly known as the sweetflag family, which includes grass-like plants with narrow leaves and often found in wetland habitats. Its genus is Abolboda, a group of plants within the Xyridaceae family, typically characterized by their narrow, grass-like leaves and small, clustered flowers. Its species is Abolboda acicularis, a specific plant within the genus Abolboda, distinguished by its needle-like leaves and specific ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda acicularis is primarily native to Colombia and Venezuela. This plant is found in the tropical and subtropical regions of these countries. It typically grows in areas with high humidity and well-drained soils. Abolboda acicularis is commonly associated with forested and disturbed habitats. Its distribution is limited to specific ecological zones within these South American nations.",
    "distribution_introduced_art_desc": "Abolboda acicularis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant spreads rapidly through its seeds, which are dispersed by wind and water. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
