{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda acaulis var. scaposa",
    "plant_slug": "abolboda-acaulis-var-scaposa",
    "plant_name_scientific": "abolboda acaulis var. scaposa",
    "intro": "Abolboda acaulis var. scaposa, commonly known as the scapose rock cress, is a flowering plant native to specific regions of southern Africa. It is a low-growing, perennial herb characterized by its compact growth habit and absence of a stem, with leaves directly arising from the rootstock. The plant produces small, white or pale yellow flowers arranged in clusters, typically blooming in late spring to early summer. Its leaves are usually basal, linear, and often covered in fine hairs, while the flowers are borne on short, leafless stalks. This variety is adapted to rocky and arid environments, showcasing resilience to harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda acaulis"
    },
    "taxonomy_art_desc": "Abolboda acaulis var. scaposa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle with a dominant sporophyte stage. Its class is Equisetopsida, which comprises vascular plants with a unique reproductive structure called a strobilus. Its subclass is Magnoliidae, a group of flowering plants characterized by their primitive floral structures and diverse morphological features. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, known for their wind-pollinated flowers. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which consists of herbaceous plants often found in wet habitats. Its genus is Abolboda, a small group of flowering plants typically found in tropical and subtropical regions, with distinctive leaf and flower structures. Its species is Abolboda acaulis, a specific type within the genus, characterized by its lack of a stem and its unique growth form.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guyana",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda acaulis var. scaposa is primarily native to Guyana and Venezuela. This variant of the species is found in the tropical regions of these countries. It typically grows in moist, shaded environments within the rainforest understory. The plant is adapted to the humid and warm climate of the Amazon basin. Its distribution is limited to specific areas within these regions.",
    "distribution_introduced_art_desc": "Abolboda acaulis var. scaposa was mainly introduced to North America through human activity, particularly as an ornamental plant. It has since established itself in various regions, often in disturbed soils and along roadsides. The distribution is primarily limited to the eastern and central parts of the United States. It is considered an invasive species in some areas due to its rapid growth and competitive nature. This plant's spread has raised concerns among ecologists and land managers."
}
