{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda abbreviata",
    "plant_slug": "abolboda-abbreviata",
    "plant_name_scientific": "abolboda abbreviata",
    "intro": "Abolboda abbreviata, commonly known as the short-stemmed euphorbia, is a succulent plant native to arid regions of Africa. It features a compact, bushy growth habit with thick, fleshy stems that store water, enabling it to survive in dry conditions. The plant produces small, clustered yellow flowers during the warmer months, which attract pollinators such as bees and butterflies. Its leaves are typically small and may be reduced to spines, a common adaptation in desert plants to minimize water loss. Abolboda abbreviata is often cultivated as an ornamental plant due to its unique appearance and low maintenance requirements.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda abbreviata"
    },
    "taxonomy_art_desc": "Abolboda abbreviata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Poales, which includes grasses, sedges, and related plants, typically characterized by narrow leaves and wind pollination. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with three to six stamens and a distinctive floral structure. Its genus is Abolboda, a small group of plants within the Xyridaceae family, typically found in wet or marshy habitats. Its species is Abolboda abbreviata, a specific plant within the genus Abolboda, distinguished by its unique morphological features and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda abbreviata is primarily native to Brazil North. It is found in the northern regions of Brazil, particularly in the Amazon rainforest. This plant thrives in humid and tropical climates with high rainfall. It is commonly found in dense forest undergrowth and along riverbanks. Its native distribution is limited to this specific geographic area within Brazil.",
    "distribution_introduced_art_desc": "Abolboda abbreviata was mainly introduced to new habitats in the Mediterranean region due to its ornamental value and adaptability to various soil types. It has been reported in several countries including Spain, Italy, and Greece, where it has established populations in disturbed and semi-natural environments. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its successful establishment. However, its introduction has raised concerns about potential invasiveness in native ecosystems. Monitoring is ongoing to assess its impact on local biodiversity."
}
