{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda × glomerata",
    "plant_slug": "abolboda-×-glomerata",
    "plant_name_scientific": "abolboda × glomerata",
    "intro": "Abolboda × glomerata, commonly known as the hybrid sweet potato. It is a cross between Abolboda and Glomerata species, resulting in a plant with unique tuberous roots that are rich in starch. The leaves are typically heart-shaped with a velvety texture, and the plant thrives in warm, humid climates. It is cultivated for its edible roots, which have a sweet, nutty flavor. This hybrid is valued for its adaptability and high yield in agricultural settings.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda × glomerata"
    },
    "taxonomy_art_desc": "Abolboda × glomerata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails and some mosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Poales, which is a large group of flowering plants that includes grasses, sedges, and rushes. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with narrow leaves and small, clustered flowers. Its genus is Abolboda, a group of flowering plants native to Africa, typically with grass-like leaves and spike-like inflorescences. Its species is Abolboda × glomerata, a hybrid plant resulting from the cross between two species of Abolboda, known for its dense, clustered inflorescences and adaptability to various environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda × glomerata is primarily native to Venezuela. It is found in the tropical regions of the country, particularly in the northern and central areas. This plant thrives in humid and warm climates, often growing in lowland forests. It is commonly associated with secondary vegetation and disturbed habitats. Its native distribution is limited to specific ecological zones within Venezuela.",
    "distribution_introduced_art_desc": "Abolboda × glomerata was mainly introduced to areas with temperate climates and well-drained soils, where it can thrive in partial to full sunlight. This hybrid plant is commonly found in regions with moderate rainfall and mild winters, making it suitable for ornamental gardening. It has been introduced to several parts of Europe and North America as a decorative species due to its attractive foliage and flowering habits. The distribution of Abolboda × glomerata is largely influenced by human cultivation and garden trade. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
