{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda ptaritepuiana",
    "plant_slug": "abolboda-ptaritepuiana",
    "plant_name_scientific": "abolboda ptaritepuiana",
    "intro": "Abolboda ptaritepuiana, commonly known as the Moonlight Fern, is a rare tropical plant native to the cloud forests of the Andes. It is characterized by its delicate, silver-green fronds that shimmer under sunlight, giving it its common name. The plant has a unique root system that allows it to absorb moisture from the air, adapting to its high-altitude environment. Its flowers, which bloom only at night, are pale blue and emit a subtle fragrance. Due to habitat loss, it is now classified as endangered and is protected in several conservation reserves.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda ptaritepuiana is primarily native to the tropical rainforests of northeastern Brazil. This plant thrives in humid, shaded environments with high rainfall. It is commonly found in the states of Pernambuco and Paraíba. Its distribution is limited to specific microhabitats within these regions. Due to habitat loss, it is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Abolboda ptaritepuiana was mainly introduced to areas with high humidity and well-drained soils, particularly in tropical and subtropical regions. It thrives in shaded environments and is often found growing near the bases of trees or on rocky outcrops. This plant is commonly used in horticulture for its ornamental value due to its unique foliage and flowering patterns. It has been successfully established in several countries in Southeast Asia and parts of Africa. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
