{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda imberbis",
    "plant_slug": "abolboda-imberbis",
    "plant_name_scientific": "abolboda imberbis",
    "intro": "Abolboda imberbis, commonly known as the smooth-leaved euphorbia, is a succulent plant native to southern Africa. It is characterized by its thick, fleshy stems and smooth, waxy leaves that help it retain moisture in arid environments. The plant produces small, clustered yellow flowers during the summer months. It is often cultivated as an ornamental plant due to its unique appearance and low maintenance requirements. However, it contains toxic sap and should be handled with care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda imberbis is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It thrives in humid, lowland forest environments, often growing in the understorey where it receives partial shade. This plant is commonly found in primary and secondary rainforests, where it plays a role in the ecological balance of these ecosystems. Its distribution is closely linked to the presence of specific soil types and climatic conditions that support its growth. Due to habitat loss, the plant's native range has been reduced, making it a species of conservation concern in some areas.",
    "distribution_introduced_art_desc": "Abolboda imberbis was mainly introduced to control erosion and stabilize soil in degraded lands. It is commonly found in disturbed areas such as roadsides, wastelands, and agricultural fields. This plant has adapted well to arid and semi-arid environments due to its deep root system and drought tolerance. Its rapid growth and ability to thrive in poor soil conditions make it a popular choice for land rehabilitation projects. However, its invasive nature can lead to competition with native species in some regions."
}
