{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda ebracteata var. ebracteata",
    "plant_slug": "abolboda-ebracteata-var-ebracteata",
    "plant_name_scientific": "abolboda ebracteata var. ebracteata",
    "intro": "Abolboda ebracteata var. ebracteata, commonly known as the leafless mallow, is a shrub native to the arid regions of southern Africa. It is characterized by its simple, lance-shaped leaves that are often reduced or absent, giving it a distinctive appearance. The plant produces small, pale yellow flowers arranged in clusters, which bloom during the rainy season. Its stems are woody and often branched, with a rough, hairy texture. This species is adapted to survive in dry, sandy soils and is often found in coastal and inland dunes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda ebracteata"
    },
    "taxonomy_art_desc": "Abolboda ebracteata var. ebracteata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their algal relatives, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their complex floral structures and diverse habitats. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, known for their wind-pollinated flowers and widespread distribution. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes grass-like plants with narrow leaves and small, clustered flowers. Its genus is Abolboda, a small group of plants within the Xyridaceae family, typically found in wet or marshy environments. Its species is Abolboda ebracteata, a specific plant within the genus Abolboda, distinguished by its lack of bracts and its unique morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda ebracteata var. ebracteata is primarily native to Venezuela. This species is found in the tropical regions of the country, particularly in the northern and central areas. It typically grows in humid, lowland environments with well-drained soils. The plant is commonly associated with secondary forests and disturbed habitats. Its distribution is limited to specific ecological zones within Venezuela.",
    "distribution_introduced_art_desc": "Abolboda ebracteata var. ebracteata was mainly introduced to the Pacific Islands for its ornamental value due to its striking foliage and unique growth habit. It is commonly found in cultivated gardens and as a houseplant, where it thrives in well-drained soil and bright, indirect light. The plant is relatively low maintenance, making it a popular choice among gardeners and plant enthusiasts. However, its introduction has raised concerns about its potential to become invasive in certain environments. Despite these concerns, it remains a favored species for its aesthetic appeal and ease of care."
}
