{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda poarchon",
    "plant_slug": "abolboda-poarchon",
    "plant_name_scientific": "abolboda poarchon",
    "intro": "Abolboda poarchon, commonly known as the silverleaf orchid, is a striking tropical plant native to the rainforests of Southeast Asia. It features elongated, lance-shaped leaves that are covered in a fine, silvery pubescence, giving it its common name. The plant produces delicate, fragrant flowers in shades of white and pale pink, often with intricate patterns on the petals. It thrives in humid, shaded environments and requires well-draining soil to prevent root rot. Due to its ornamental value, it is sometimes cultivated in botanical gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda poarchon"
    },
    "taxonomy_art_desc": "Abolboda poarchon belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle with a dominant sporophyte stage. Its class is Equisetopsida, which comprises vascular plants with a distinct structure and includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants characterized by their complex floral structures and diverse evolutionary adaptations. Its order is Poales, which includes grasses, sedges, and rushes, known for their wind-pollinated flowers and specialized leaf structures. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which consists of herbaceous plants with narrow leaves and small, clustered flowers. Its genus is Abolboda, a group of plants within the Xyridaceae family that are typically found in wet or moist habitats. Its species is Abolboda poarchon, a specific plant within the genus Abolboda that is distinguished by its unique morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Brazil Southeast",
        "Brazil West-Central",
        "Paraguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda poarchon is primarily native to Bolivia, Brazil North, Brazil Southeast, Brazil West-Central, and Paraguay. This species is found in the tropical and subtropical regions of these countries. It typically grows in moist, shaded environments within forests. The plant is part of the Rubiaceae family and is known for its ornamental value. Its native distribution reflects its adaptation to the diverse ecosystems of South America.",
    "distribution_introduced_art_desc": "Abolboda poarchon was mainly introduced to new habitats through human activity, such as landscaping and gardening. It has been found growing in urban areas, along roadsides, and in disturbed soils. The plant's ability to thrive in a variety of soil types has contributed to its spread. It is often mistaken for native species due to its similar appearance. However, its introduction has raised concerns about its impact on local ecosystems."
}
