{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda americana var. imberbis",
    "plant_slug": "abolboda-americana-var-imberbis",
    "plant_name_scientific": "abolboda americana var. imberbis",
    "intro": "Abolboda americana var. imberbis, commonly known as the smoothleaf abolboda, is a herbaceous perennial native to the southeastern United States. It features lance-shaped leaves that are typically smooth along the margins, distinguishing it from other varieties. The plant produces small, white to pale pink flowers in clusters during the spring and summer months. It thrives in moist, well-drained soils and partial to full sunlight. Its botanical characteristics make it a valuable addition to native plant gardens and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda americana var. imberbis is primarily native to the southeastern United States, particularly in the coastal regions of Georgia and South Carolina. This variety thrives in sandy, well-drained soils along the Atlantic and Gulf coasts. It is commonly found in dunes, maritime hammocks, and other coastal habitats. The plant is adapted to salt spray and can tolerate periodic flooding. Its distribution is limited to specific ecological zones where it plays a role in stabilizing dune systems.",
    "distribution_introduced_art_desc": "Abolboda americana var. imberbis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and urban environments. It thrives in regions with moderate to high rainfall and full sun exposure. This plant is commonly found in the southeastern United States, particularly in states like Florida, Georgia, and South Carolina. Its rapid growth and ability to spread through seeds make it a potential invasive species in certain ecosystems. It is often considered a weed due to its competitive nature and ability to colonize new areas quickly."
}
