{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda grandis var. guayanensis",
    "plant_slug": "abolboda-grandis-var-guayanensis",
    "plant_name_scientific": "abolboda grandis var. guayanensis",
    "intro": "Abolboda grandis var. guayanensis, commonly known as the Guayana sycamore, is a species of flowering plant in the family Meliaceae. It is native to South America, particularly found in regions of Venezuela, Guyana, and Suriname. The tree is characterized by its large, spreading crown and smooth, greyish bark. Its leaves are alternate, ovate to elliptic, and often have a slightly serrated margin. The plant produces small, yellowish flowers followed by woody, capsule-like fruits containing flat, winged seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda grandis var. guayanensis is primarily native to the tropical regions of South America, particularly in northern Brazil, the Guyanas, and parts of Venezuela. It thrives in humid lowland areas with rich, well-drained soils. This variant is commonly found in secondary growth forests and along riverbanks. It plays an important ecological role in these ecosystems by providing habitat and food for various wildlife species. Its distribution is closely linked to the availability of suitable moist environments in the Amazon Basin and adjacent regions.",
    "distribution_introduced_art_desc": "Abolboda grandis var. guayanensis was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It thrives in environments with high sunlight exposure and moderate to high rainfall. This plant is often cultivated for its ornamental value due to its attractive foliage and growth habit. It has been introduced to several countries in South America, particularly in regions with similar ecological conditions to its native habitat. Its introduction has sometimes led to concerns about its potential to become invasive in new environments."
}
