{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda neblinae",
    "plant_slug": "abolboda-neblinae",
    "plant_name_scientific": "abolboda neblinae",
    "intro": "Abolboda neblinae, commonly known as the misty fern, is a rare and delicate plant native to the high-altitude cloud forests of the Andes. It thrives in cool, humid environments with high levels of mist, which is essential for its growth. The plant features narrow, feather-like fronds that are adapted to capture moisture from the air. Its reproductive structures are small and inconspicuous, typical of many fern species. Due to habitat destruction, Abolboda neblinae is considered endangered and requires conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda neblinae"
    },
    "taxonomy_art_desc": "Abolboda neblinae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Poales, which includes grasses, sedges, and rushes, known for their wind-pollinated flowers and grass-like leaves. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants typically found in wet or moist environments. Its genus is Abolboda, a relatively small group of plants within the Xyridaceae family, characterized by their unique floral structures and habitat preferences. Its species is Abolboda neblinae, a specific type of plant native to certain regions, distinguished by its specific morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda neblinae is primarily native to Brazil North and Venezuela. This plant is typically found in the mountainous regions of these areas. It thrives in humid, high-altitude environments. The species is often associated with cloud forests and misty elevations. Its native distribution is limited to these specific geographic locations.",
    "distribution_introduced_art_desc": "Abolboda neblinae was mainly introduced to areas with high humidity and dense vegetation, particularly in tropical and subtropical regions. It thrives in shaded environments, often growing near the forest floor or along the edges of water bodies. This plant has been observed in several countries in South America and Southeast Asia. Its introduction is believed to be due to both natural dispersal and human activities such as horticultural trade. However, its impact on native ecosystems remains under study."
}
