{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda pulchella",
    "plant_slug": "abolboda-pulchella",
    "plant_name_scientific": "abolboda pulchella",
    "intro": "Abolboda pulchella, commonly known as the pretty bellflower, is a flowering plant native to certain regions of South America. It is characterized by its delicate, bell-shaped flowers that range in color from white to pale purple. The plant typically grows in moist, shaded environments such as forest floors or along stream banks. Its leaves are lance-shaped and have a slightly hairy texture. Abolboda pulchella is often cultivated for its ornamental value in gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda pulchella"
    },
    "taxonomy_art_desc": "Abolboda pulchella belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Poales, which comprises grasses and related plants, known for their wind pollination and C4 photosynthesis. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes herbaceous plants with narrow leaves. Its genus is Abolboda, a group of flowering plants within the Xyridaceae family, typically found in wet habitats. Its species is Abolboda pulchella, a specific plant within the genus Abolboda, characterized by its unique morphology and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil Southeast",
        "Brazil West-Central",
        "Colombia",
        "French Guiana",
        "Guyana",
        "Suriname",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda pulchella is primarily native to Bolivia, Brazil North, Brazil Northeast, Brazil Southeast, Brazil West-Central, Colombia, French Guiana, Guyana, Suriname, and Venezuela. This species is found across a variety of habitats within these regions, including tropical rainforests and moist lowland areas. It is commonly associated with shaded undergrowth in humid environments. The plant is known for its ornamental value and is sometimes cultivated for its attractive foliage. Its native range spans much of northern and eastern South America.",
    "distribution_introduced_art_desc": "Abolboda pulchella was mainly introduced to new habitats in the Pacific Islands through human activity, particularly during the 19th and 20th centuries. It was likely brought as an ornamental plant due to its attractive foliage and flowers. The introduction has led to its establishment in coastal and disturbed areas, where it can thrive in sandy or loamy soils. However, it is considered a potential invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its spread has raised concerns among conservationists in the affected islands."
}
