{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda grandis",
    "plant_slug": "abolboda-grandis",
    "plant_name_scientific": "abolboda grandis",
    "intro": "Abolboda grandis, commonly known as the grand magnolia, is a flowering plant native to tropical regions of Asia. It is characterized by its large, showy white or pink flowers that bloom in the spring. The plant has broad, lance-shaped leaves that are often glossy in appearance. It thrives in warm, humid climates and requires well-drained soil for optimal growth. Abolboda grandis is often cultivated for its ornamental value in gardens and parks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda grandis"
    },
    "taxonomy_art_desc": "Abolboda grandis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their complex flower structures and diverse reproductive strategies. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, known for their wind-pollinated flowers and specialized leaf structures. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes herbaceous plants with narrow leaves and showy flowers. Its genus is Abolboda, a group of flowering plants within the Xyridaceae family, typically found in wetland habitats and characterized by their distinctive floral morphology. Its species is Abolboda grandis, a specific type within the genus Abolboda, known for its large size and unique ecological adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Colombia",
        "Guyana",
        "Suriname",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda grandis is primarily native to Brazil North, Colombia, Guyana, Suriname, and Venezuela. This plant is commonly found in the tropical regions of these countries. It thrives in humid, warm climates with ample rainfall. Abolboda grandis is typically associated with lowland rainforests and secondary growth areas. Its distribution is largely confined to the northern part of South America.",
    "distribution_introduced_art_desc": "Abolboda grandis was mainly introduced to new environments for its ornamental value and potential ecological benefits. It is commonly found in regions with warm climates and well-drained soils. The plant has been introduced to several parts of the world, including parts of Asia and the Americas. Its rapid growth and adaptability have led to its establishment in both natural and cultivated areas. However, its invasive potential remains a topic of ongoing study and management."
}
