{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda egleri var. egleri",
    "plant_slug": "abolboda-egleri-var-egleri",
    "plant_name_scientific": "abolboda egleri var. egleri",
    "intro": "Abolboda egleri var. egleri, commonly known as the Caucasian bellflower, is a perennial herbaceous plant native to the Caucasus region. It features showy, bell-shaped flowers that range in color from blue to purple, typically blooming in late summer. The plant has slender, upright stems with lance-shaped leaves that are covered in fine hairs. It thrives in well-drained soils and prefers full sun to partial shade. This species is valued for its ornamental appeal and is often cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda egleri"
    },
    "taxonomy_art_desc": "Abolboda egleri var. egleri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which consists of vascular plants with a diverse range of forms, including ferns and some modern plants with specialized structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their showy flowers and diverse habitats. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, typically characterized by their wind-pollinated flowers and narrow leaves. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with three to six stamens and often showy flowers. Its genus is Abolboda, a group of flowering plants within the Xyridaceae family, typically characterized by their herbaceous growth and specific floral structures. Its species is Abolboda egleri, a specific plant within the genus Abolboda, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda egleri var. egleri is primarily native to Bolivia and northern Brazil. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in humid environments with well-drained soil. The species is often associated with forest understory habitats. Its distribution is limited to specific ecological zones within these countries.",
    "distribution_introduced_art_desc": "Abolboda egleri var. egleri was mainly introduced to the Mediterranean region, particularly in southern Europe and parts of North Africa. It thrives in temperate climates with well-drained soils and full sun exposure. This plant is often cultivated for its ornamental value due to its attractive foliage and flowers. It has been introduced to various garden settings and naturalized in some areas. However, its spread is generally limited due to its specific environmental requirements."
}
