{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda chapadensis var. pauciflora",
    "plant_slug": "abolboda-chapadensis-var-pauciflora",
    "plant_name_scientific": "abolboda chapadensis var. pauciflora",
    "intro": "Abolboda chapadensis var. pauciflora, commonly known as the rare Brazilian orchid, is a terrestrial orchid native to the Atlantic Forest region of Brazil. It is characterized by its compact growth habit and produces small, pale green to white flowers with a distinct yellow lip. The plant has linear to lanceolate leaves and thrives in shaded, moist environments. It is a member of the Orchidaceae family and is noted for its limited floral display, which is reflected in its specific epithet \"pauciflora.\" Due to habitat loss, it is considered a vulnerable species requiring conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda chapadensis var. pauciflora is primarily native to the semi-arid regions of northeastern Brazil, specifically the states of Pernambuco, Paraíba, and Piauí. It thrives in dry, rocky soils and is commonly found in scrublands and open woodlands. This variant is adapted to the seasonal climate with distinct wet and dry periods. It is often associated with xerophytic vegetation and is part of the local flora in these regions. Due to its limited distribution, it is considered a rare and endemic species in this area.",
    "distribution_introduced_art_desc": "Abolboda chapadensis var. pauciflora was mainly introduced to areas with arid to semi-arid climates, characterized by low rainfall and well-drained soils. It thrives in regions with high solar exposure and minimal humidity, making it suitable for xerophytic environments. This plant is often found in rocky or sandy soils, typically in mountainous or coastal regions. Its introduction has been primarily for ornamental purposes due to its unique foliage and adaptability. However, its spread has raised concerns about potential ecological impacts in non-native habitats."
}
