{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda acaulis var. acaulis",
    "plant_slug": "abolboda-acaulis-var-acaulis",
    "plant_name_scientific": "abolboda acaulis var. acaulis",
    "intro": "Abolboda acaulis var. acaulis, commonly known as the rock spurge, is a perennial herbaceous plant native to arid and semi-arid regions. It is characterized by its short, compact growth habit and lacks a distinct stem, with leaves arranged in a rosette formation. The plant produces small, yellowish-green flowers that bloom in the spring, typically in clusters at the base of the rosette. It is adapted to survive in dry, rocky soils and is drought-tolerant. Its botanical features make it a hardy plant suitable for xeriscaping and rock gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda acaulis"
    },
    "taxonomy_art_desc": "Abolboda acaulis var. acaulis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that are characterized by their complex life cycles and the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns, horsetails, and other primitive plants with a distinct life cycle involving spores. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their showy flowers and a wide variety of growth forms. Its order is Poales, which includes grasses, sedges, and rushes, known for their wind-pollinated flowers and typically narrow leaves. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with small, often yellow flowers and grass-like leaves. Its genus is Abolboda, a small genus of flowering plants within the Xyridaceae family, typically found in wet or marshy habitats. Its species is Abolboda acaulis, a specific variety within the genus, characterized by its lack of a stem and its growth as a dense mat, often found in moist environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guyana",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda acaulis var. acaulis is primarily native to Guyana and Venezuela. This plant is typically found in the tropical regions of these countries. It thrives in moist, shaded environments within the rainforest understory. The species is well adapted to the humid and warm climate of the Amazon Basin. Its distribution is limited to specific habitats in these South American nations.",
    "distribution_introduced_art_desc": "Abolboda acaulis var. acaulis was mainly introduced to areas with rocky or gravelly soils, often in arid or semi-arid regions. It thrives in environments with low moisture and high sunlight exposure. This plant is commonly found in Mediterranean climates and parts of southern Europe. It has been introduced to several regions outside its native range for ornamental or erosion control purposes. However, its spread is limited due to its specific ecological requirements."
}
