{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda grandis f. angustifolia",
    "plant_slug": "abolboda-grandis-f-angustifolia",
    "plant_name_scientific": "abolboda grandis f. angustifolia",
    "intro": "Abolboda grandis f. angustifolia, commonly known as the narrow-leafed variant of the species, is a flowering plant characterized by its slender, elongated leaves. It belongs to the family Cucurbitaceae, which includes cucumbers and gourds, and is native to tropical and subtropical regions. The plant produces small, yellowish-green flowers that are typically unisexual, with separate male and female flowers on the same plant. Its botanical features include a trailing growth habit and the ability to form vines, making it suitable for cultivation in warm climates. The leaves are often pubescent, with a distinctively narrow shape that distinguishes this form from the typical variety.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda grandis f. angustifolia is primarily native to the eastern and southeastern United States, including regions of Florida, Georgia, and the Carolinas. This plant is commonly found in wetland areas, swamps, and along the edges of ponds and rivers. It thrives in moist, sandy soils and is often associated with disturbed or flood-prone habitats. The species is known for its narrow leaves and is sometimes used in restoration projects due to its ability to stabilize soil. However, it is considered rare and has a limited range within its native habitat.",
    "distribution_introduced_art_desc": "Abolboda grandis f. angustifolia was mainly introduced to specific regions with suitable climatic conditions, including temperate and subtropical areas. It was introduced primarily for its ornamental value due to its attractive foliage and growth habit. The plant thrives in well-drained soils and full sun, making it suitable for landscaping in gardens and public spaces. Its introduction has been documented in several countries, particularly in the Pacific Islands and parts of Southeast Asia. However, its spread has been limited due to its specific environmental requirements and cultivation practices."
}
