{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda chapadensis",
    "plant_slug": "abolboda-chapadensis",
    "plant_name_scientific": "abolboda chapadensis",
    "intro": "Abolboda chapadensis, commonly known as the Brazilian bellflower, is a flowering plant native to the cerrado biome of Brazil. It belongs to the Campanulaceae family and is characterized by its bell-shaped, blue or violet flowers. The plant typically grows in open, sunny habitats and has hairy, lance-shaped leaves. It produces small, capsule-like fruits that contain numerous seeds. Abolboda chapadensis is valued for its ornamental appeal and plays a role in supporting local pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda chapadensis is primarily native to the semi-arid regions of Brazil, particularly in the state of Tocantins. It is commonly found in sandy soils within the Caatinga biome. This plant thrives in areas with low rainfall and high temperatures. It is often seen growing in open vegetation and along riverbanks. Its native distribution is limited to specific ecological niches in northern Brazil.",
    "distribution_introduced_art_desc": "Abolboda chapadensis was mainly introduced to new habitats in South America through human activity, particularly in regions with disturbed soils and degraded landscapes. It has been observed spreading along roadsides, in agricultural fields, and near urban areas, where it thrives in disturbed environments. The plant's rapid growth and adaptability have led to its establishment in several countries, including Brazil, Argentina, and Paraguay. Due to its invasive potential, it is now considered a weed in some regions, posing challenges to native flora. Its distribution continues to expand as it colonizes new areas with suitable conditions."
}
