{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda grandis var. grandis",
    "plant_slug": "abolboda-grandis-var-grandis",
    "plant_name_scientific": "abolboda grandis var. grandis",
    "intro": "Abolboda grandis var. grandis, commonly known as the giant abolboda, is a species of flowering plant native to specific regions in Southeast Asia. It is characterized by its tall, slender stem and large, heart-shaped leaves that can reach up to 30 cm in length. The plant produces clusters of small, white to pale yellow flowers that bloom during the wet season. It thrives in humid, tropical climates and is often found in lowland rainforests. Due to its unique morphology and limited distribution, it is considered a valuable subject for botanical research.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda grandis"
    },
    "taxonomy_art_desc": "Abolboda grandis var. grandis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Poales, which is one of the largest orders of flowering plants, including grasses, sedges, and rushes. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes herbaceous plants with narrow leaves. Its genus is Abolboda, a small genus of flowering plants native to southern Africa. Its species is Abolboda grandis, a specific plant within the genus Abolboda, known for its distinctive yellow flowers and grass-like appearance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Colombia",
        "Guyana",
        "Suriname",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda grandis var. grandis is primarily native to Brazil North, Colombia, Guyana, Suriname, and Venezuela. This species is commonly found in tropical and subtropical regions within these countries. It typically thrives in humid, lowland areas with well-drained soils. The plant is often associated with secondary forests and disturbed habitats. Its distribution reflects its adaptability to diverse environmental conditions in the Neotropics.",
    "distribution_introduced_art_desc": "Abolboda grandis var. grandis was mainly introduced to ornamental horticulture and landscape design due to its striking foliage and adaptability to various soil conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value and ease of maintenance. The plant's ability to thrive in both full sun and partial shade makes it a popular choice for gardeners and landscapers. However, its introduction has raised concerns about potential invasiveness in non-native environments. Despite its ornamental appeal, careful management is recommended to prevent unintended ecological impacts."
}
