{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda americana",
    "plant_slug": "abolboda-americana",
    "plant_name_scientific": "abolboda americana",
    "intro": "Abolboda americana, commonly known as the American sedge, is a perennial herbaceous plant native to North America. It typically grows in moist to wet habitats such as marshes, swamps, and along stream banks. The plant has narrow, grass-like leaves and produces small, inconspicuous flowers arranged in spikelets. Its root system helps stabilize soil and prevent erosion in wetland environments. Abolboda americana plays an important role in maintaining the ecological balance of its native habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda americana"
    },
    "taxonomy_art_desc": "Abolboda americana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails and some mosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Poales, which is one of the largest orders of flowering plants, including grasses, sedges, and rushes. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with narrow leaves and small, clustered flowers. Its genus is Abolboda, a group of flowering plants primarily found in tropical and subtropical regions. Its species is Abolboda americana, a specific type of plant within the genus Abolboda that is native to the Americas.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Brazil Northeast",
        "Colombia",
        "French Guiana",
        "Guyana",
        "Suriname",
        "Trinidad-Tobago",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda americana is primarily native to Brazil North, Brazil Northeast, Colombia, French Guiana, Guyana, Suriname, Trinidad-Tobago, and Venezuela. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid environments, often growing in lowland forests and along riverbanks. The species is well adapted to the warm and wet climate of its native range. Its distribution is largely confined to the Neotropical region of South America.",
    "distribution_introduced_art_desc": "Abolboda americana was mainly introduced to new habitats through human activity, particularly in areas with disturbed soils and limited competition. It thrives in environments with moderate moisture and full sun, making it a common invader in agricultural and urban landscapes. The plant's rapid growth and high reproductive capacity contribute to its successful establishment in non-native regions. It is often found along roadsides, in abandoned fields, and in disturbed forest edges. Due to its adaptability, it has become a concern in some regions where it outcompetes native vegetation."
}
