{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda granularis",
    "plant_slug": "abolboda-granularis",
    "plant_name_scientific": "abolboda granularis",
    "intro": "Abolboda granularis, commonly known as the granular abolboda, is a flowering plant belonging to the family Malvaceae. It is characterized by its hairy, glandular stems and leaves that are often covered in small, raised bumps. The plant produces small, showy flowers that are typically pink or purple in color. It is native to tropical and subtropical regions of Africa and thrives in well-drained soils. Abolboda granularis is often used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda granularis"
    },
    "taxonomy_art_desc": "Abolboda granularis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, often with a distinct life cycle involving spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their complex flower structures. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, known for their wind-pollinated flowers. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants typically found in wetlands and characterized by their narrow leaves and small flowers. Its genus is Abolboda, a group of plants within the Xyridaceae family, known for their distinctive morphology and habitat preferences. Its species is Abolboda granularis, a specific type within the genus Abolboda, distinguished by its unique physical characteristics and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda granularis is primarily native to Colombia and Venezuela. This plant is found in the tropical regions of these countries. It typically grows in humid, forested areas with well-drained soil. Abolboda granularis is adapted to the warm and moist climate of the Andes and coastal lowlands. Its native distribution is limited to these specific regions in South America.",
    "distribution_introduced_art_desc": "Abolboda granularis was mainly introduced to new environments through human activities such as trade and gardening. It is commonly found in disturbed habitats like roadsides, waste areas, and cultivated fields. The plant spreads primarily through its seeds, which are dispersed by wind, water, and animals. Due to its adaptability, it has become an invasive species in several regions outside its native range. Its rapid growth and competitive nature pose a threat to native plant communities."
}
