{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda poarchon var. intermedia",
    "plant_slug": "abolboda-poarchon-var-intermedia",
    "plant_name_scientific": "abolboda poarchon var. intermedia",
    "intro": "Abolboda poarchon var. intermedia, commonly known as the Intermediate Abolboda, is a lesser-known plant species with unique botanical characteristics. It is a flowering plant belonging to the family Poaceae, which includes grasses and related species. The plant is distinguished by its slender, erect stems and narrow, lance-shaped leaves that are often covered in a fine layer of hair. Its flowers are small and clustered in panicle-like inflorescences, typical of many grass species. This variant is particularly noted for its adaptability to various soil types and its ability to thrive in semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda poarchon"
    },
    "taxonomy_art_desc": "Abolboda poarchon var. intermedia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species, characterized by their diverse floral structures and complex reproductive systems. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, known for their wind-pollinated flowers and typically narrow leaves. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with grass-like leaves and showy flowers. Its genus is Abolboda, a genus within the Xyridaceae family, which includes several species of flowering plants typically found in wet or moist habitats. Its species is Abolboda poarchon, a specific plant within the genus Abolboda, distinguished by its unique morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast",
        "Brazil West-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda poarchon var. intermedia is primarily native to Brazil Southeast and Brazil West-Central. This plant is found in the tropical and subtropical regions of these areas. It typically grows in humid, forested environments with rich soil. The species is adapted to the warm and moist climate of these regions. Its native distribution is limited to these specific areas within Brazil.",
    "distribution_introduced_art_desc": "Abolboda poarchon var. intermedia was mainly introduced to new habitats in regions with temperate climates, where it has shown adaptability to various soil types. It was introduced primarily for ornamental purposes due to its attractive foliage and unique growth pattern. The plant has since spread beyond its original cultivation sites, establishing itself in both urban and rural environments. Its introduction has raised concerns about its potential impact on native plant species and local ecosystems. Efforts are being made to monitor its spread and assess its ecological effects."
}
