{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda egleri",
    "plant_slug": "abolboda-egleri",
    "plant_name_scientific": "abolboda egleri",
    "intro": "Abolboda egleri, commonly known as the Egeli's lily, is a striking perennial plant native to the mountainous regions of Central Asia. It is characterized by its tall, slender stems that can reach up to 2 meters in height, adorned with large, showy white or pale pink flowers. The leaves are broad and lance-shaped, often with a waxy coating that helps reduce water loss in its arid habitat. This plant thrives in well-drained soils and full sun, making it a popular choice for rock gardens and alpine landscapes. Its ornamental value is further enhanced by its long blooming period, which typically spans from late spring to early summer.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda egleri"
    },
    "taxonomy_art_desc": "Abolboda egleri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which consists of ferns and their allies, known for having true roots, stems, and leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Poales, which is a large group of flowering plants that includes grasses, sedges, and rushes. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with narrow leaves and showy flowers. Its genus is Abolboda, a group of flowering plants within the Xyridaceae family, characterized by their grass-like appearance and specific floral structures. Its species is Abolboda egleri, a specific type of plant within the genus Abolboda, distinguished by its unique morphological features and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda egleri is primarily native to Bolivia, Brazil North, Colombia, and Venezuela. This plant is commonly found in the tropical and subtropical regions of these countries. It thrives in humid environments, often growing in forested areas or near water sources. The distribution of Abolboda egleri is closely linked to the diverse ecosystems of South America. It is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Abolboda egleri was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread to other parts of Europe and parts of North Africa, where it thrives in temperate climates. This plant is often found in gardens, along roadsides, and in disturbed areas, showing a high degree of invasiveness. Its rapid growth and ability to reproduce through both seeds and vegetative propagation contribute to its spread. However, it is considered a potential weed in some areas, raising concerns about its impact on native ecosystems."
}
