{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda poarchon var. poarchon",
    "plant_slug": "abolboda-poarchon-var-poarchon",
    "plant_name_scientific": "abolboda poarchon var. poarchon",
    "intro": "Abolboda poarchon var. poarchon, commonly known as the Cloud Forest Orchid, is a rare and delicate species native to the high-altitude cloud forests of Southeast Asia. It is characterized by its slender, erect stems and clusters of small, fragrant white flowers that bloom during the cooler months. The plant prefers cool, humid conditions and is typically found growing on tree trunks or in shaded, moist environments. Its leaves are broad and waxy, adapted to retain moisture in its native habitat. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in the wild.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda poarchon"
    },
    "taxonomy_art_desc": "Abolboda poarchon var. poarchon belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their close relatives, characterized by their complex structures and reproductive mechanisms. Its class is Equisetopsida, a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Poales, a group of flowering plants that includes grasses, sedges, and rushes, known for their wind pollination and C4 photosynthesis. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes flowering plants with narrow leaves and small, clustered flowers. Its genus is Abolboda, a genus within the Xyridaceae family, consisting of a few species of flowering plants typically found in wet or moist habitats. Its species is Abolboda poarchon, a specific variety within the genus Abolboda, characterized by its unique morphological features and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Brazil Southeast",
        "Brazil West-Central",
        "Paraguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda poarchon var. poarchon is primarily native to Bolivia, Brazil North, Brazil Southeast, Brazil West-Central, and Paraguay. This plant is typically found in tropical and subtropical regions within these countries. It thrives in humid climates with well-drained soil. The species is commonly associated with forested areas and riverine habitats. Its distribution reflects its adaptation to the diverse ecosystems of South America.",
    "distribution_introduced_art_desc": "Abolboda poarchon var. poarchon was mainly introduced to North America through horticultural trade in the early 20th century. It was initially cultivated for its ornamental value due to its unique foliage and growth habit. The plant has since spread beyond cultivated areas, establishing itself in moist woodland habitats. Its introduction has raised concerns due to its potential to outcompete native species in certain regions. Despite its aesthetic appeal, it is now considered an invasive species in several parts of the United States."
}
