{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda uniflora",
    "plant_slug": "abolboda-uniflora",
    "plant_name_scientific": "abolboda uniflora",
    "intro": "Abolboda uniflora, commonly known as the single-flower lily, is a rare flowering plant native to the mountainous regions of Southeast Asia. It is characterized by its striking, solitary white flower that blooms during the late spring and early summer. The plant has narrow, linear leaves that are arranged in a basal rosette, and its stem is slender and erect. Abolboda uniflora thrives in cool, moist environments and is often found in shaded forest understories. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda uniflora"
    },
    "taxonomy_art_desc": "Abolboda uniflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their close relatives, characterized by their complex cellular structures and the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Poales, which consists of grasses and related plants, typically with narrow leaves and jointed stems. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with small, often yellow flowers and grass-like leaves. Its genus is Abolboda, a group of plants within the Xyridaceae family, characterized by their specific morphological features and habitat preferences. Its species is Abolboda uniflora, a specific type within the genus Abolboda, distinguished by its unique floral structure and growth characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda uniflora is primarily native to Venezuela. It is found in the northern regions of the country, particularly in the states of Zulia and Anzoátegui. This plant typically grows in dry, open habitats such as scrublands and rocky slopes. It is adapted to the warm and arid climate of its native range. Due to its limited distribution, it is considered a rare and localized species within Venezuela.",
    "distribution_introduced_art_desc": "Abolboda uniflora was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and abandoned lands. It thrives in regions with moderate to high sunlight exposure and well-drained soils. This plant is particularly common in temperate climates and has shown adaptability to various environmental conditions. Its introduction has been associated with human activities, including agriculture and land development. Due to its rapid growth and reproductive capabilities, it can become invasive in certain ecosystems."
}
