{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda macrostachya var. robustior",
    "plant_slug": "abolboda-macrostachya-var-robustior",
    "plant_name_scientific": "abolboda macrostachya var. robustior",
    "intro": "Abolboda macrostachya var. robustior, commonly known as the giant flame tree, is a striking tropical plant native to Southeast Asia. It is characterized by its large, showy red or orange flowers that bloom in clusters, creating a dramatic visual impact. The plant has compound leaves with long, slender leaflets and produces woody, cylindrical seed pods. It thrives in warm, humid climates and is often cultivated for its ornamental value. Due to its rapid growth and adaptability, it is also used in reforestation and erosion control projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda macrostachya"
    },
    "taxonomy_art_desc": "Abolboda macrostachya var. robustior belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Poales, a large group of flowering plants that includes grasses, sedges, and rushes, known for their wind-pollinated flowers. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with narrow leaves and small, clustered flowers. Its genus is Abolboda, a group of flowering plants typically found in wet or swampy habitats, characterized by their grass-like appearance. Its species is Abolboda macrostachya, a specific plant within the genus Abolboda, known for its robust growth and distinctive floral structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guyana",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda macrostachya var. robustior is primarily native to Guyana and Venezuela. This plant is found in the tropical regions of these South American countries. It typically grows in humid, lowland areas with rich soil. The species is part of the Rubiaceae family, known for its diverse and often ornamental plants. Its native distribution is limited to these specific geographic regions.",
    "distribution_introduced_art_desc": "Abolboda macrostachya var. robustior was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It thrives in environments with ample sunlight and moderate to high levels of rainfall. This plant is often cultivated for its ornamental value due to its attractive foliage and flowering characteristics. It has been introduced to several parts of Southeast Asia, the Pacific Islands, and some regions of the Americas. However, its introduction has raised concerns about its potential to become an invasive species in non-native habitats."
}
