{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda killipii",
    "plant_slug": "abolboda-killipii",
    "plant_name_scientific": "abolboda killipii",
    "intro": "Abolboda killipii, commonly known as the Killip's abolboda, is a rare flowering plant native to specific regions of Southeast Asia. It belongs to the family Acanthaceae and is characterized by its striking, tubular flowers that range in color from violet to deep purple. The plant typically grows in moist, shaded environments such as forest understories or along stream banks. Its leaves are opposite, ovate, and often covered in fine hairs, contributing to its unique appearance. Due to habitat loss and limited distribution, Abolboda killipii is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda killipii"
    },
    "taxonomy_art_desc": "Abolboda killipii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives, characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the magnolia family. Its order is Poales, a large group of flowering plants that includes grasses, rushes, and sedges, known for their wind pollination. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes herbaceous plants with narrow leaves and showy flowers. Its genus is Abolboda, a small genus of flowering plants native to Africa, characterized by their grass-like appearance and specific habitat preferences. Its species is Abolboda killipii, a rare plant species found in specific regions of Africa, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Guyana",
        "Suriname",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda killipii is primarily native to Brazil North, Guyana, Suriname, and Venezuela. This plant is found in the tropical regions of these countries. It typically grows in moist, shaded environments within the rainforests. The species is part of the Rubiaceae family. Its native distribution is limited to these specific geographic areas in South America.",
    "distribution_introduced_art_desc": "Abolboda killipii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides and abandoned fields. It thrives in regions with moderate to high rainfall and full sunlight. The plant has shown rapid growth and spread, often outcompeting native vegetation. Its introduction has led to concerns about its potential impact on local ecosystems. Further monitoring is needed to assess its long-term ecological effects."
}
