{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda acaulis",
    "plant_slug": "abolboda-acaulis",
    "plant_name_scientific": "abolboda acaulis",
    "intro": "Abolboda acaulis, commonly known as the naked-stemmed bellflower, is a flowering plant native to the mountainous regions of Central Asia. It is a perennial herb characterized by its erect, unbranched stem that is often leafless above the base. The plant produces showy, bell-shaped flowers that are typically blue or purple in color. It thrives in well-drained soils and is adapted to cold, high-altitude environments. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Xyridaceae",
        "genus": "Abolboda",
        "species": "Abolboda acaulis"
    },
    "taxonomy_art_desc": "Abolboda acaulis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often having a distinct life cycle with both spore and seed stages. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as magnolias and laurels. Its order is Poales, which encompasses grasses, sedges, and rushes, and is known for its wind-pollinated flowers and grass-like leaves. Its family is Xyridaceae, commonly known as the yellow-eyed grass family, which includes plants with narrow leaves and small, clustered flowers. Its genus is Abolboda, a group of plants typically found in wet or marshy habitats, characterized by their erect growth and grass-like appearance. Its species is Abolboda acaulis, a specific type within the genus Abolboda, distinguished by its stemless or short-stemmed structure and its preference for moist environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guyana",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda acaulis is primarily native to Guyana and Venezuela. This plant is found in the tropical regions of these countries. It typically grows in humid, lowland areas with well-drained soils. Abolboda acaulis is commonly associated with forest understory habitats. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abolboda acaulis was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and forest edges. It is commonly found in regions with temperate climates and moderate rainfall. This plant thrives in full sun and is often invasive in areas where it outcompetes native vegetation. Its rapid growth and ability to spread through seeds make it a challenging species to control. It is particularly prevalent in the Pacific Northwest and parts of California in the United States."
}
