{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda minima",
    "plant_slug": "abolboda-minima",
    "plant_name_scientific": "abolboda minima",
    "intro": "Abolboda minima, commonly known as the small bitter melon, is a flowering plant native to Southeast Asia. It belongs to the Cucurbitaceae family, which includes cucumbers and pumpkins. The plant produces small, bitter green fruits that are often used in traditional medicine. Its leaves are heart-shaped and have a slightly rough texture. Abolboda minima is known for its medicinal properties, particularly in treating digestive issues and inflammation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda minima is primarily native to the eastern United States, particularly in the Appalachian region. It is commonly found in moist, shaded forest environments. This small herbaceous plant thrives in rich, organic soils along streams and in woodland understories. It is known for its delicate white flowers and is often overlooked due to its modest size. Abolboda minima is an important component of the biodiversity in its native habitat.",
    "distribution_introduced_art_desc": "Abolboda minima was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and waste areas. It thrives in environments with moderate to high light exposure and well-drained soil. The plant is commonly found in regions with a temperate climate, including parts of Europe and North America. Its introduction has been associated with human activities like agriculture and land development. Due to its rapid growth and adaptability, it can become invasive in certain ecosystems."
}
