{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abola radiata",
    "plant_slug": "abola-radiata",
    "plant_name_scientific": "abola radiata",
    "intro": "Abola radiata, commonly known as the golden crown fern, is a striking tropical plant characterized by its delicate, feathery fronds. It belongs to the family Blechnaceae and is native to Southeast Asia, particularly Malaysia and Indonesia. The plant features a short, rhizomatous stem with clusters of small, bright yellow spore-producing structures at the tips of its leaves. Its ornamental value comes from its vibrant color and intricate foliage, making it a popular choice for indoor gardening. Abola radiata prefers indirect light and consistent moisture, thriving in humid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abola radiata is primarily native to the tropical regions of Southeast Asia, particularly Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid, warm climates with well-drained soil. It is often associated with disturbed habitats and can be found near human settlements. Its native distribution includes parts of Brunei and Thailand as well.",
    "distribution_introduced_art_desc": "Abola radiata was mainly introduced to control erosion and stabilize soil in degraded lands. It is commonly found in disturbed areas such as roadsides, quarries, and abandoned fields. The plant thrives in poor soils and can tolerate drought conditions, making it adaptable to various environments. Its rapid growth and ability to spread through seeds contribute to its success in colonizing new areas. However, its invasive nature can sometimes outcompete native species, raising concerns about its ecological impact."
}
