{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda aubletii",
    "plant_slug": "abolboda-aubletii",
    "plant_name_scientific": "abolboda aubletii",
    "intro": "Abolboda aubletii, commonly known as the African violet, is a flowering plant native to tropical Africa. It belongs to the Gesneriaceae family and is characterized by its velvety, waxy leaves and showy, tubular flowers. The plant typically grows as a perennial herb, often with a compact, bushy habit. Its flowers come in a variety of colors, including purple, pink, and white, and are often used in ornamental gardening. Abolboda aubletii thrives in humid, well-drained soil and requires indirect sunlight for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda aubletii is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in lowland rainforests and secondary growth areas. This plant thrives in humid, warm climates with high rainfall. It is often associated with disturbed habitats and can be found near rivers and along forest edges. Due to its specific ecological requirements, its distribution is relatively limited to these regions.",
    "distribution_introduced_art_desc": "Abolboda aubletii was mainly introduced to regions with tropical and subtropical climates, where it thrives in warm, humid environments. It is commonly found in areas with well-drained soil and ample sunlight. This plant has been introduced to various parts of Southeast Asia, including the Philippines and Indonesia. Its introduction has sometimes led to ecological concerns due to its potential invasiveness. However, it is also valued for its ornamental qualities and medicinal properties."
}
