{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abolboda gleasoniana",
    "plant_slug": "abolboda-gleasoniana",
    "plant_name_scientific": "abolboda gleasoniana",
    "intro": "Abolboda gleasoniana, commonly known as the Gleason's abolboda, is a flowering plant native to specific regions of Southeast Asia. It belongs to the family Rubiaceae, which includes coffee and gardenias, and is characterized by its small, clustered flowers. The plant typically grows in moist, shaded environments, such as forest understories, and has lance-shaped leaves with a smooth texture. Its flowering period occurs during the rainy season, and it produces small, red berries that are dispersed by birds. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abolboda gleasoniana is primarily native to the southeastern United States, specifically occurring in Florida and parts of Georgia. It is commonly found in moist, sandy soils within pine flatwood and scrub habitats. This species is often associated with disturbed sites and can be found in open areas with partial sunlight. It is a low-growing perennial herb that plays a role in the ecological dynamics of its native range. Due to its limited distribution, it is considered a rare and endangered plant in many areas where it occurs.",
    "distribution_introduced_art_desc": "Abolboda gleasoniana was mainly introduced to the eastern United States, particularly in areas with moist, well-drained soils. It is commonly found in wetlands, stream banks, and other riparian habitats. This plant was introduced primarily for ornamental purposes due to its attractive foliage and adaptability. However, it has since become invasive in some regions, outcompeting native vegetation. Its spread has raised concerns among conservationists and land managers."
}
