{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Aboriella myriantha",
    "plant_slug": "aboriella-myriantha",
    "plant_name_scientific": "aboriella myriantha",
    "intro": "Aboriella myriantha, commonly known as the velvetleaf orchid, is a flowering plant native to the tropical regions of South America. It belongs to the orchid family, Orchidaceae, and is characterized by its striking, velvety leaves and showy, fragrant flowers. The plant typically grows as an epiphyte, attaching itself to trees in humid, shaded environments. Its flowers are usually white or pale pink, with intricate patterns that attract specific pollinators. Due to its unique appearance and ecological significance, it is a subject of interest in botanical research and conservation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Aboriella myriantha is primarily native to eastern Australia, specifically the coastal regions of New South Wales and southeastern Queensland. It is commonly found in heathlands and open forests, often growing in sandy or rocky soils. This plant thrives in areas with mild, temperate climates and is adapted to coastal conditions. It plays an important role in local ecosystems by providing habitat and food for native wildlife. Due to its restricted range, it is considered a vulnerable species in some regions.",
    "distribution_introduced_art_desc": "Aboriella myriantha was mainly introduced to New Zealand. It is commonly found in coastal areas and sandy soils. The plant has been reported in the North Island and parts of the South Island. It is often associated with disturbed habitats and urban environments. Its introduction has raised concerns due to its potential to become invasive in native ecosystems."
}
