{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia viguieri",
    "plant_slug": "abrahamia-viguieri",
    "plant_name_scientific": "abrahamia viguieri",
    "intro": "Abrahamia viguieri, commonly known as the dwarf violet, is a small flowering plant native to the mountainous regions of Central Asia. It belongs to the Boraginaceae family and is characterized by its delicate, violet-blue flowers and hairy, oval-shaped leaves. The plant typically grows in rocky or alpine environments, thriving in well-drained soils and full sun. Its compact size and vibrant blooms make it a sought-after species among horticulturists and botanists. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia viguieri"
    },
    "taxonomy_art_desc": "Abrahamia viguieri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes horsetails and other primitive vascular plants with jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Sapindales, a group of flowering plants that includes trees, shrubs, and vines, often with distinctive flowers and fruits. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic sap and a variety of fruit types. Its genus is Abrahamia, a small genus within the Anacardiaceae family, consisting of a few species native to specific regions. Its species is Abrahamia viguieri, a rare plant species found in certain habitats, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia viguieri is primarily native to Madagascar. This unique plant is found in specific regions of the island, particularly in the eastern rainforests. It thrives in humid, shaded environments with high biodiversity. Due to its restricted habitat, it is considered a rare and endemic species. Conservation efforts are crucial to protect this plant from threats such as deforestation and habitat loss.",
    "distribution_introduced_art_desc": "Abrahamia viguieri was mainly introduced to areas with moist, temperate climates, particularly in regions with well-drained soils. It is commonly found in disturbed habitats such as roadsides, fields, and along riverbanks. This plant has been reported in several European countries, including France, Italy, and Spain. Its introduction is often associated with human activity, such as accidental transport through agricultural practices. Due to its adaptability, it has established itself in new environments, sometimes outcompeting native species."
}
