{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia elongata",
    "plant_slug": "abrahamia-elongata",
    "plant_name_scientific": "abrahamia elongata",
    "intro": "Abrahamia elongata, commonly known as the slender abrahamia, is a flowering plant native to South Africa. It belongs to the Acanthaceae family and is characterized by its upright, branched stems and small, opposite leaves. The plant produces clusters of tubular, two-lipped flowers that are typically pale purple to pink in color. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its ornamental value, it is occasionally cultivated in gardens, though it prefers full sun and dry conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia elongata"
    },
    "taxonomy_art_desc": "Abrahamia elongata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often retaining primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Sapindales, which includes plants such as lychees and sumacs, typically with small flowers and often containing toxic compounds. Its family is Anacardiaceae, commonly known as the cashew family, which includes trees and shrubs with usually smooth bark and leaves, and some species produce urushiol, a skin irritant. Its genus is Abrahamia, a small group of flowering plants native to southern Africa, characterized by their unique leaf shapes and fruit structures. Its species is Abrahamia elongata, a specific plant within the genus Abrahamia, distinguished by its elongated leaves and specific growth habits found in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia elongata is primarily native to Madagascar. This species is found in the island's unique and diverse ecosystems. It thrives in specific habitats that are characteristic of Madagascar's biodiversity. The plant is adapted to the local climate and soil conditions of the region. Its native distribution is largely confined to Madagascar, reflecting its endemic status.",
    "distribution_introduced_art_desc": "Abrahamia elongata was mainly introduced to new habitats in the Pacific Northwest of the United States. It has been found growing in disturbed areas such as roadsides, forest edges, and gravelly soils. The plant spreads primarily through its rhizomes, allowing it to colonize new areas quickly. Its introduction has raised concerns due to its potential to outcompete native species in these ecosystems. Despite its invasive tendencies, it is sometimes used in restoration projects for its erosion control properties."
}
