{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia phillipsonii",
    "plant_slug": "abrahamia-phillipsonii",
    "plant_name_scientific": "abrahamia phillipsonii",
    "intro": "Abrahamia phillipsonii, commonly known as the Phillipson's abrahamia, is a rare and unique plant species native to specific regions of South Africa. It belongs to the Acanthaceae family and is characterized by its striking, tubular flowers that are typically bright red or orange in color. The plant has small, narrow leaves and thrives in rocky, well-drained soils. Due to its limited distribution and habitat specificity, it is considered endangered and requires careful conservation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia phillipsonii"
    },
    "taxonomy_art_desc": "Abrahamia phillipsonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a true root system and vascular tissue. Its class is Equisetopsida, which consists of primitive vascular plants, including horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Sapindales, which includes a diverse group of flowering plants such as lychee and mango. Its family is Anacardiaceae, known for its toxic compounds and includes plants like the cashew and poison ivy. Its genus is Abrahamia, a small genus of flowering plants native to Africa. Its species is Abrahamia phillipsonii, a rare shrub found in specific regions of Africa, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia phillipsonii is primarily native to Madagascar. This unique plant is found in the diverse ecosystems of the island, including dry and humid forests. It is typically distributed in the eastern and southern regions of Madagascar. The plant thrives in areas with specific soil and climatic conditions. Its restricted distribution highlights its ecological significance and conservation status.",
    "distribution_introduced_art_desc": "Abrahamia phillipsonii was mainly introduced to areas with specific soil and climate conditions that mimic its native habitat. It is typically found in regions with well-drained soils and moderate to high levels of sunlight. The plant has been introduced to several locations outside its native range, often as part of horticultural or ecological restoration efforts. However, its introduction has raised concerns due to its potential to become invasive in non-native environments. Proper monitoring is essential to assess its impact on local ecosystems."
}
