{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia sericea",
    "plant_slug": "abrahamia-sericea",
    "plant_name_scientific": "abrahamia sericea",
    "intro": "Abrahamia sericea, commonly known as the silky abrahamia, is a flowering plant native to southern Africa. It belongs to the Asteraceae family and is characterized by its slender, erect stems and hairy foliage. The plant produces small, daisy-like flowers that are typically pale yellow to white in color. It thrives in sandy or gravelly soils and is often found in open, sunny habitats. Abrahamia sericea is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia sericea"
    },
    "taxonomy_art_desc": "Abrahamia sericea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Sapindales, a group of flowering plants that includes species such as citrus and sumac, often with showy flowers and fruits. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic sap and various fruit types. Its genus is Abrahamia, a small genus of flowering plants native to southern Africa, characterized by its distinctive leaves and flowers. Its species is Abrahamia sericea, a specific plant within the genus Abrahamia, known for its silver-haired leaves and is found in specific habitats in southern Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia sericea is primarily native to Madagascar. It is found in the arid and semi-arid regions of the island, particularly in the southern and southwestern parts. This plant thrives in sandy or gravelly soils and is adapted to the dry climate of its native habitat. It is a member of the Fabaceae family and is known for its distinctive silvery foliage. Due to its restricted distribution, it is considered a rare and endemic species to Madagascar.",
    "distribution_introduced_art_desc": "Abrahamia sericea was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal regions. It is commonly found in disturbed habitats such as roadsides, dunes, and sandy soils. This plant thrives in environments with moderate to high salinity, making it adaptable to coastal ecosystems. Its introduction has been noted in several states along the Pacific coast of North America. However, its spread is limited by its specific soil and climate requirements."
}
