{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia grandidieri",
    "plant_slug": "abrahamia-grandidieri",
    "plant_name_scientific": "abrahamia grandidieri",
    "intro": "Abrahamia grandidieri, commonly known as the Madagascar star orchid, is a rare and striking orchid native to the island of Madagascar. It is characterized by its unique, star-shaped flowers that are typically pink or purple in color. The plant is epiphytic, meaning it grows on the surface of trees rather than in soil, and thrives in humid, shaded environments. Its flowers are highly fragrant, attracting specific pollinators such as bees and moths. Due to habitat loss and over-collection, it is considered endangered and is protected in its native region.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia grandidieri"
    },
    "taxonomy_art_desc": "Abrahamia grandidieri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Sapindales, which includes plants such as lychee and maple, known for their diverse forms and often aromatic fruits. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic compounds and often used in food and medicine. Its genus is Abrahamia, a relatively small group of flowering plants primarily found in Madagascar, known for their unique morphological features. Its species is Abrahamia grandidieri, a rare and endemic plant found in Madagascar, notable for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia grandidieri is primarily native to Madagascar. This rare plant is found in specific regions of the island, particularly in the southern and southwestern parts. It thrives in dry, rocky habitats and is adapted to the unique climate of Madagascar. Due to its limited range and habitat specificity, it is considered a vulnerable species. Conservation efforts are essential to protect this endemic plant from threats such as habitat loss and climate change.",
    "distribution_introduced_art_desc": "Abrahamia grandidieri was mainly introduced to Madagascar, where it is found in specific habitats such as rocky outcrops and limestone areas. It is a rare and endemic species, known for its unique adaptations to the island's arid and semi-arid environments. The plant has a limited distribution due to its specialized ecological requirements and fragmented habitat. Conservation efforts are ongoing to protect this species from threats like habitat loss and climate change. Its introduction to these regions highlights the importance of preserving Madagascar's unique biodiversity."
}
