{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia ibityensis",
    "plant_slug": "abrahamia-ibityensis",
    "plant_name_scientific": "abrahamia ibityensis",
    "intro": "Abrahamia ibityensis, commonly known as the Madagascar orchid, is a rare and endemic species found exclusively in the rainforests of Madagascar. It belongs to the Orchidaceae family and is characterized by its unique floral structure, which includes showy, fragrant blossoms. The plant typically grows as an epiphyte, attaching itself to trees and deriving moisture and nutrients from the air and rain. Its flowers are usually pale yellow or greenish-white, with intricate patterns that aid in pollination by specific insect species. Due to habitat loss and limited distribution, it is considered critically endangered and requires conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia ibityensis"
    },
    "taxonomy_art_desc": "Abrahamia ibityensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a diverse range of growth forms. Its order is Sapindales, which includes trees, shrubs, and climbers, many of which produce berries or other fleshy fruits. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic sap and often aromatic leaves and fruits. Its genus is Abrahamia, a group of flowering plants native to Madagascar, characterized by their unique floral structures and ecological adaptations. Its species is Abrahamia ibityensis, a rare plant endemic to Madagascar, known for its distinctive morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia ibityensis is primarily native to Madagascar. This unique species is found in the central highlands of the island nation. It thrives in moist, shaded environments within the rainforests of this region. The plant is endemic to Madagascar, meaning it is not found anywhere else in the world. Its restricted distribution highlights the island's rich biodiversity and ecological significance.",
    "distribution_introduced_art_desc": "Abrahamia ibityensis was mainly introduced to Madagascar. It is a rare and endemic plant species found primarily in the northeastern part of the island. The plant thrives in humid, shaded environments within primary and secondary rainforests. Due to its limited distribution and habitat specificity, it is considered vulnerable to environmental changes and habitat loss. Conservation efforts are ongoing to protect this unique species and its natural habitat."
}
