{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia buxifolia",
    "plant_slug": "abrahamia-buxifolia",
    "plant_name_scientific": "abrahamia buxifolia",
    "intro": "Abrahamia buxifolia, commonly known as the boxleaf abrahamia, is a perennial herb native to South Africa. It is characterized by its compact, low-growing form and dense foliage composed of small, oval-shaped leaves that are often covered in a fine, powdery bloom. The plant produces clusters of small, white or pale pink flowers during the summer months, which are followed by small, round berries. It thrives in well-drained soil and prefers full sun to partial shade, making it a suitable candidate for rock gardens or container planting. Due to its ornamental value and unique appearance, it is occasionally cultivated in horticultural settings.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia buxifolia"
    },
    "taxonomy_art_desc": "Abrahamia buxifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex multicellular structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, often with showy flowers and a wide range of growth forms. Its order is Sapindales, which comprises flowering plants with typically simple flowers and includes families such as Rutaceae and Anacardiaceae. Its family is Anacardiaceae, commonly known as the cashew family, which includes trees and shrubs with toxic compounds and often used for their fruits, resins, and timber. Its genus is Abrahamia, a small genus of flowering plants native to southern Africa, characterized by its shrub-like growth and distinctive foliage. Its species is Abrahamia buxifolia, a specific plant within the genus Abrahamia, known for its dense, evergreen foliage and its adaptation to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia buxifolia is primarily native to Madagascar. It is found in the island's unique and diverse ecosystems. This plant thrives in humid, tropical environments within the country. Its distribution is limited to specific regions with suitable soil and climate conditions. It is an endemic species, meaning it is not found naturally anywhere else in the world.",
    "distribution_introduced_art_desc": "Abrahamia buxifolia was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its compact growth habit and attractive foliage. The plant has since spread beyond cultivated areas, establishing itself in natural environments. Its introduction has raised concerns due to its potential to become invasive. It is now considered a potential weed in some regions of New Zealand."
}
