{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abramsia trichotoma",
    "plant_slug": "abramsia-trichotoma",
    "plant_name_scientific": "abramsia trichotoma",
    "intro": "Abramsia trichotoma, commonly known as the hairy bristlegrass, is a flowering plant native to the southwestern United States and northern Mexico. It belongs to the grass family (Poaceae) and is characterized by its fine, hairy leaves and compact growth habit. The plant typically grows in dry, open habitats such as grasslands and disturbed soils. Its small, spike-like inflorescence bears tiny, wind-pollinated flowers. Abramsia trichotoma is adapted to arid conditions, with deep roots that help it survive in low-water environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abramsia trichotoma is primarily native to the southeastern United States, specifically found in parts of Georgia, Florida, and South Carolina. It thrives in moist, sandy soils along the edges of swamps, marshes, and pine flatwoods. This species is commonly associated with wetland habitats and is often found in areas with high groundwater levels. It plays an important role in the ecological balance of these wetland ecosystems. Due to its specific habitat requirements, it is considered a relatively rare and localized plant.",
    "distribution_introduced_art_desc": "Abramsia trichotoma was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activities such as agriculture and land development. It thrives in environments with full sun and well-drained soil, making it a common invader in degraded landscapes. This plant spreads primarily through its seeds, which can be dispersed by wind, water, or animals. Its rapid growth and ability to outcompete native vegetation make it a significant ecological concern in invaded regions. Due to its adaptability, Abramsia trichotoma is now found in various parts of the United States, particularly in the western states."
}
