{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia lokobensis",
    "plant_slug": "abrahamia-lokobensis",
    "plant_name_scientific": "abrahamia lokobensis",
    "intro": "Abrahamia lokobensis, commonly known as the Lokobé daisy, is a flowering plant native to the Democratic Republic of the Congo. It belongs to the Asteraceae family and is characterized by its showy, daisy-like flowers that bloom in clusters. The plant typically grows in moist, open habitats such as grasslands and forest margins. Its leaves are lance-shaped and covered with fine hairs, while its stems are erect and often branched. Abrahamia lokobensis plays a role in local ecosystems by providing nectar for pollinators and habitat for small invertebrates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia lokobensis"
    },
    "taxonomy_art_desc": "Abrahamia lokobensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that are characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Sapindales, which includes plants such as maples and lychees, known for their diverse leaf shapes and often fragrant flowers. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic compounds and often aromatic or milky sap. Its genus is Abrahamia, a group of flowering plants native to Africa, characterized by their small, clustered flowers and woody structure. Its species is Abrahamia lokobensis, a specific plant found in the Democratic Republic of the Congo, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia lokobensis is primarily native to Madagascar. This species is found in the eastern part of the island, particularly in the humid forests of the northeastern region. It thrives in moist, shaded environments within the dense rainforest canopy. The plant is known for its unique morphology and is part of the family Malvaceae. Due to its restricted habitat, it is considered a rare and endemic species to Madagascar.",
    "distribution_introduced_art_desc": "Abrahamia lokobensis was mainly introduced to the data as a rare and endemic species found in the tropical rainforests of the Democratic Republic of the Congo. It is characterized by its unique morphology and ecological niche, making it a subject of interest for botanical research. The introduction of this plant into the dataset aims to enhance biodiversity records and support conservation efforts. Its distribution is limited to specific microhabitats, which highlights the need for targeted conservation strategies. This addition contributes to a more comprehensive understanding of plant diversity in the region."
}
