{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia delphinensis",
    "plant_slug": "abrahamia-delphinensis",
    "plant_name_scientific": "abrahamia delphinensis",
    "intro": "Abrahamia delphinensis, commonly known as the Delphin Island bellflower, is a flowering plant native to the coastal regions of South Africa. It is characterized by its delicate, bell-shaped blue or violet flowers that bloom in late summer. The plant typically grows in sandy or rocky soils along the shoreline, where it tolerates salty air and coastal winds. Its leaves are narrow and grass-like, often covered in a fine layer of white hairs. This species is valued for its ornamental beauty and is sometimes cultivated in gardens with suitable conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia delphinensis"
    },
    "taxonomy_art_desc": "Abrahamia delphinensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle with distinct gametophyte and sporophyte stages. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including horsetails and some ferns. Its subclass is Magnoliidae, a group of flowering plants characterized by their diverse floral structures and a wide range of ecological adaptations. Its order is Sapindales, which includes plants with showy flowers and often contains species with economically important fruits. Its family is Anacardiaceae, known for its toxic compounds and includes plants like the cashew and poison ivy. Its genus is Abrahamia, a small group of flowering plants typically found in specific geographic regions with unique ecological niches. Its species is Abrahamia delphinensis, a specific plant within the genus Abrahamia, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia delphinensis is primarily native to Madagascar. This species is found in the eastern part of the island, specifically in the humid forests of the northeastern region. It thrives in moist, shaded environments along riverbanks and in dense undergrowth. The plant is adapted to the unique ecological conditions of Madagascar's biodiversity hotspot. Due to its restricted habitat, it is considered a rare and endemic species in the region.",
    "distribution_introduced_art_desc": "Abrahamia delphinensis was mainly introduced to wetland and marsh habitats, where it thrives in moist, nutrient-rich soils. It is commonly found in regions with high water tables and partial shade, such as along the edges of lakes and rivers. The plant is known for its striking blue or purple flowers, which attract pollinators like bees and butterflies. Its introduction has been documented in several areas of North America, particularly in the eastern United States. However, it is considered invasive in some regions due to its rapid growth and ability to outcompete native vegetation."
}
