{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia louvelii",
    "plant_slug": "abrahamia-louvelii",
    "plant_name_scientific": "abrahamia louvelii",
    "intro": "Abrahamia louvelii, commonly known as the Madagascar orchid, is a rare and endemic species found exclusively in the rainforests of Madagascar. It belongs to the orchid family, Orchidaceae, and is characterized by its delicate, fragrant flowers that bloom in shades of white and pink. The plant typically grows as an epiphyte, attaching itself to trees in the humid understory of the forest. Its unique morphology and limited distribution make it a subject of interest for botanists and conservationists. Due to habitat destruction, it is considered threatened and requires protection to ensure its survival.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia louvelii"
    },
    "taxonomy_art_desc": "Abrahamia louvelii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants known for their primitive floral structures and a wide variety of species. Its order is Sapindales, which includes plants such as lychees and sumacs, often recognized by their fragrant flowers and edible fruits. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic sap and various economically important species. Its genus is Abrahamia, a small group of flowering plants native to Madagascar, known for their unique morphological features. Its species is Abrahamia louvelii, a specific plant within the genus Abrahamia, distinguished by its specific characteristics and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia louvelii is primarily native to Madagascar. This unique plant species is found exclusively in the island's diverse ecosystems. It thrives in specific habitats, often in moist, shaded areas within the rainforests. Due to its restricted range, it is considered a rare and endemic species. Conservation efforts are crucial to protect this plant from habitat loss and environmental changes.",
    "distribution_introduced_art_desc": "Abrahamia louvelii was mainly introduced to the island of Madagascar. It is a rare and endemic plant species found primarily in the northeastern regions of the country. The distribution of Abrahamia louvelii is limited to specific microhabitats, such as rocky outcrops and limestone formations. Due to its restricted range and habitat specificity, it is considered vulnerable to environmental changes. Conservation efforts are ongoing to protect this unique species from threats like habitat loss and climate change."
}
