{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia lecomtei",
    "plant_slug": "abrahamia-lecomtei",
    "plant_name_scientific": "abrahamia lecomtei",
    "intro": "Abrahamia lecomtei, commonly known as the Lecomte's abrahamia, is a rare flowering plant native to the mountainous regions of southern China. It belongs to the family Ericaceae, which includes heathers and blueberries, and is characterized by its evergreen shrub form. The plant produces small, bell-shaped flowers that are typically pink or white, blooming in late spring. It thrives in acidic, well-drained soils and requires a cool, moist climate. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia lecomtei"
    },
    "taxonomy_art_desc": "Abrahamia lecomtei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and citrus fruits. Its order is Sapindales, which consists of flowering plants that often have compound leaves and fruits that are either capsules or drupes. Its family is Anacardiaceae, commonly known as the cashew family, which includes trees and shrubs with often toxic sap and fruits like cashews and mangoes. Its genus is Abrahamia, a small group of flowering plants native to Madagascar, characterized by their unique leaf structures and small, clustered flowers. Its species is Abrahamia lecomtei, a specific plant within the genus Abrahamia, known for its distinctive morphology and limited distribution in Madagascar.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia lecomtei is primarily native to Madagascar. This unique plant is found in specific regions of the island, where it thrives in its natural habitat. It is endemic to Madagascar, meaning it is not found anywhere else in the world. The plant is adapted to the local climate and soil conditions of the island. Due to its restricted range, it is considered a rare and vulnerable species.",
    "distribution_introduced_art_desc": "Abrahamia lecomtei was mainly introduced to the Pacific Northwest region of the United States. It was first documented in Oregon in the late 19th century, likely through human activity such as horticultural trade or accidental introduction. This plant has since spread to parts of Washington and northern California. It thrives in moist, shaded environments, often found in forest understories. Its introduction has raised concerns due to its potential to outcompete native flora in certain ecosystems."
}
