{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia antongilensis",
    "plant_slug": "abrahamia-antongilensis",
    "plant_name_scientific": "abrahamia antongilensis",
    "intro": "Abrahamia antongilensis, commonly known as the Antongil's spiderwort, is a flowering plant native to Madagascar. It belongs to the family Campanulaceae and is characterized by its delicate, bell-shaped flowers that are typically blue or violet in color. The plant is herbaceous, with slender stems and lance-shaped leaves that are often covered in fine hairs. It thrives in moist, shaded environments and is adapted to the unique ecological conditions of its native habitat. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia antongilensis"
    },
    "taxonomy_art_desc": "Abrahamia antongilensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Sapindales, which comprises plants with showy flowers and often includes species with toxic or aromatic compounds. Its family is Anacardiaceae, known as the cashew family, which includes trees and shrubs with toxic sap and often edible fruits. Its genus is Abrahamia, a group of flowering plants native to Madagascar, characterized by their unique morphological features. Its species is Abrahamia antongilensis, a rare plant endemic to Madagascar, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia antongilensis is primarily native to Madagascar. This unique plant is found in the eastern part of the island, specifically in the area around the Antongil region. It thrives in the humid and tropical climate of this region. The plant is adapted to the specific environmental conditions of Madagascar's coastal forests. Due to its limited distribution, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Abrahamia antongilensis was mainly introduced to Madagascar, where it is found in specific habitats such as dry forests and rocky areas. It is a rare and endemic species, known for its unique ecological role in its native environment. The distribution of this plant is limited to a small geographic area, making it highly vulnerable to habitat loss and environmental changes. Due to its restricted range, conservation efforts are crucial to ensure its survival. However, there is limited information on its population trends and ecological requirements."
}
