{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia betamponensis",
    "plant_slug": "abrahamia-betamponensis",
    "plant_name_scientific": "abrahamia betamponensis",
    "intro": "Abrahamia betamponensis, commonly known as the Betampona starling's orchid, is a rare and endemic species found exclusively in Madagascar. It belongs to the Orchidaceae family and is characterized by its unique floral structure, which includes a spurred labellum and showy petals. The plant typically grows in shaded, humid environments within the rainforests of the eastern part of the island. Its small, delicate flowers are adapted for specific pollinators, contributing to its ecological significance. Due to habitat loss, it is considered critically endangered and is the subject of conservation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia betamponensis"
    },
    "taxonomy_art_desc": "Abrahamia betamponensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Sapindales, which consists of flowering plants that are often found in tropical and subtropical regions and include trees and shrubs. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic sap and fruits like mangoes and cashews. Its genus is Abrahamia, a group of flowering plants primarily found in Madagascar, known for their unique morphological characteristics. Its species is Abrahamia betamponensis, a specific plant species endemic to Madagascar, distinguished by its distinctive features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia betamponensis is primarily native to Madagascar. It is found in the eastern part of the island, particularly in the humid forests of the northeastern region. This plant thrives in moist, shaded environments within the dense rainforests. Its distribution is limited to specific areas with suitable soil and climate conditions. It is an endemic species, meaning it is not found naturally anywhere else in the world.",
    "distribution_introduced_art_desc": "Abrahamia betamponensis was mainly introduced to the island of Madagascar. It is native to the Comoros archipelago but has been found growing in specific regions of Madagascar. The plant is typically found in humid, shaded forest environments. Its introduction to Madagascar may have occurred through natural seed dispersal or human activity. This distribution highlights its adaptability to tropical ecosystems."
}
