{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia itremoensis",
    "plant_slug": "abrahamia-itremoensis",
    "plant_name_scientific": "abrahamia itremoensis",
    "intro": "Abrahamia itremoensis, commonly known as the Madagascar violets, is a flowering plant native to Madagascar. It belongs to the Gesneriaceae family and is characterized by its striking, showy flowers. The plant typically grows in moist, shaded environments within the tropical rainforests of the island. Its foliage consists of glossy, dark green leaves with a slightly waxy texture. Abrahamia itremoensis is valued for its ornamental appeal and is often cultivated in botanical gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia itremoensis"
    },
    "taxonomy_art_desc": "Abrahamia itremoensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Sapindales, which consists of flowering plants that often have compound leaves and fruits that are either capsules or berries. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic compounds and a variety of fruit types. Its genus is Abrahamia, a group of flowering plants native to Madagascar, characterized by their unique morphology and ecological adaptations. Its species is Abrahamia itremoensis, a specific plant within the genus Abrahamia, found in Madagascar, known for its distinct features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia itremoensis is primarily native to Madagascar. This unique plant is found in specific regions of the island, particularly in the eastern rainforests. Itremoensis is known to inhabit areas with high humidity and fertile soil, often in the vicinity of rivers and valleys. The plant is part of Madagascar's rich endemic flora, showcasing the island's biodiversity. Due to its limited distribution, it is considered a rare and valuable species within its native habitat.",
    "distribution_introduced_art_desc": "Abrahamia itremoensis was mainly introduced to the island of Madagascar. It is native to the northeastern part of the island, specifically in the area of Itremo. This plant is typically found in humid, shaded environments such as forest understories. Its introduction to other regions is limited and primarily occurs through human activities like horticultural trade. Due to its restricted distribution, it is considered a rare and endemic species."
}
