{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia revoluta",
    "plant_slug": "abrahamia-revoluta",
    "plant_name_scientific": "abrahamia revoluta",
    "intro": "Abrahamia revoluta, commonly known as the narrow-leafed lichen, is a foliose lichen that thrives in moist, shaded environments. It is characterized by its dark green to blackish upper surface and a lighter, often white or yellowish lower surface. The plant forms a symbiotic relationship with algae, which provides its primary source of nutrients through photosynthesis. It is typically found on rocks, tree trunks, and soil in temperate regions. Due to its slow growth and sensitivity to environmental changes, it is considered an indicator species for ecological health.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia revoluta"
    },
    "taxonomy_art_desc": "Abrahamia revoluta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Sapindales, which consists of flowering plants known for their diverse habitats and often having fruits that are edible or used in traditional medicine. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic sap and fruits used in food and industry. Its genus is Abrahamia, a small group of flowering plants native to specific regions in Africa, characterized by their unique leaf and fruit structures. Its species is Abrahamia revoluta, a specific plant within the genus Abrahamia, distinguished by its particular morphology and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia revoluta is primarily native to Madagascar. This species is found in the diverse ecosystems of the island, including dry forests and coastal areas. It thrives in regions with specific climatic conditions that are unique to Madagascar. The plant is part of the country's rich endemic flora. Its distribution is largely restricted to certain parts of the island due to its specific ecological requirements.",
    "distribution_introduced_art_desc": "Abrahamia revoluta was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in temperate regions. It thrives in environments where it can establish itself along stream banks, woodland edges, and disturbed sites. This plant is often found in the northeastern United States and parts of southeastern Canada. Its introduction has been associated with both natural dispersal and human activity, such as landscaping and erosion control. However, it is not considered invasive in most regions where it is found."
}
