{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia latifolia",
    "plant_slug": "abrahamia-latifolia",
    "plant_name_scientific": "abrahamia latifolia",
    "intro": "Abrahamia latifolia, commonly known as the broadleaf abrahamia, is a flowering plant species native to South Africa. It belongs to the family Acanthaceae and is characterized by its distinctive, broad, lance-shaped leaves. The plant produces clusters of small, tubular flowers that are typically pink or purple in color. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its ornamental value, it is occasionally cultivated in gardens, though it is not widely distributed beyond its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia latifolia"
    },
    "taxonomy_art_desc": "Abrahamia latifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of floral structures. Its order is Sapindales, which includes plants with showy flowers and often contains species with medicinal or economic importance. Its family is Anacardiaceae, commonly known as the cashew family, which includes trees and shrubs with toxic compounds and often aromatic fruits. Its genus is Abrahamia, a small group of flowering plants native to Africa, characterized by their distinctive leaves and fruit structures. Its species is Abrahamia latifolia, a specific plant within the genus Abrahamia, known for its broad leaves and is typically found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia latifolia is primarily native to Madagascar. It is found in the central and eastern parts of the island, where the climate is tropical and humid. This plant typically grows in moist, shaded forest understories. It is well adapted to the unique ecological conditions of Madagascar's biodiversity-rich ecosystems. Its distribution is limited to specific habitats within the country.",
    "distribution_introduced_art_desc": "Abrahamia latifolia was mainly introduced to areas with moist, well-drained soils and partial to full sun exposure. It is commonly found in regions with temperate climates, particularly in the eastern United States. This plant thrives in woodland edges, stream banks, and disturbed sites where it can establish quickly. Its introduction has led to its spread into native habitats, sometimes outcompeting local vegetation. Due to its adaptability, it is considered an invasive species in some regions."
}
