{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia turkii",
    "plant_slug": "abrahamia-turkii",
    "plant_name_scientific": "abrahamia turkii",
    "intro": "Abrahamia turkii, commonly known as the Turkish Abrahamia, is a rare flowering plant native to Turkey. It belongs to the family Apiaceae, which includes carrots and parsley, and is characterized by its umbellate inflorescence. The plant typically grows in rocky or limestone soils and is adapted to arid conditions. It has small, greenish-white flowers and hairy leaves, which help it conserve moisture. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia turkii"
    },
    "taxonomy_art_desc": "Abrahamia turkii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Sapindales, a group of flowering plants that includes species such as lychee and longan, known for their tropical distribution. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic compounds and economically valuable fruits. Its genus is Abrahamia, a small genus of flowering plants native to Turkey, characterized by its unique leaf and fruit structures. Its species is Abrahamia turkii, a specific plant within the genus Abrahamia, distinguished by its morphological traits and geographical distribution in Turkey.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia turkii is primarily native to Madagascar. This species is found in specific regions of the island, particularly in the eastern and northern parts. It thrives in humid, forested areas with rich soil and high rainfall. The plant is adapted to the unique ecological conditions of Madagascar's biodiversity hotspot. Due to its restricted distribution, it is considered a endemic species to the island.",
    "distribution_introduced_art_desc": "Abrahamia turkii was mainly introduced to regions with Mediterranean climate conditions, characterized by hot, dry summers and mild, wet winters. It thrives in well-drained soils and is often found in rocky or gravelly habitats. This plant is commonly cultivated in gardens and landscapes for its ornamental value due to its attractive, small, white flowers. It has been introduced to parts of Europe and North America as a horticultural species. However, its spread outside its native range is limited due to its specific environmental requirements."
}
