{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia lenticellata",
    "plant_slug": "abrahamia-lenticellata",
    "plant_name_scientific": "abrahamia lenticellata",
    "intro": "Abrahamia lenticellata, commonly known as the smoothleaf sandwort, is a low-growing perennial plant native to the arid regions of western North America. It is characterized by its prostrate stems and small, fleshy, greenish-gray leaves that are covered in a waxy cuticle to reduce water loss. The plant produces clusters of tiny, white or pinkish flowers during the spring and early summer. Its succulent leaves and compact growth habit allow it to thrive in sandy or gravelly soils with limited water availability. Abrahamia lenticellata plays a role in stabilizing desert soils and providing habitat for small invertebrates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia lenticellata"
    },
    "taxonomy_art_desc": "Abrahamia lenticellata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of fern allies and includes plants like horsetails and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Sapindales, which comprises a variety of flowering plants, including those in the families Anacardiaceae and Rutaceae. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants such as the mango and poison ivy. Its genus is Abrahamia, a small group of flowering plants native to southern Africa, known for their distinctive leaf and fruit structures. Its species is Abrahamia lenticellata, a specific plant within the genus Abrahamia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia lenticellata is primarily native to Madagascar. It is found in the diverse ecosystems of this island nation, which is known for its unique and endemic flora. The plant thrives in specific habitats, often in areas with well-drained soils and sufficient sunlight. Due to its restricted range, it is considered a rare and endemic species. Conservation efforts are essential to protect this plant from habitat loss and other threats.",
    "distribution_introduced_art_desc": "Abrahamia lenticellata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in moist, shady environments, making it particularly problematic in forested regions. Conservation efforts are underway to control its spread and protect local biodiversity."
}
