{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia sambiranensis",
    "plant_slug": "abrahamia-sambiranensis",
    "plant_name_scientific": "abrahamia sambiranensis",
    "intro": "Abrahamia sambiranensis, commonly known as the Sambiranensis bellflower, is a flowering plant native to Madagascar. It belongs to the Campanulaceae family and is characterized by its bell-shaped, blue or violet flowers. The plant typically grows in moist, shaded environments, often in forest undergrowth. Its leaves are lance-shaped and covered in fine hairs, while its stems are slender and branching. Due to its restricted habitat and rarity, it is considered an endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia sambiranensis"
    },
    "taxonomy_art_desc": "Abrahamia sambiranensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Sapindales, a group of flowering plants that includes trees and shrubs, many of which produce fruits with a hard outer shell. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants such as mangoes, poison ivy, and the cashew tree. Its genus is Abrahamia, a group of flowering plants that are primarily found in tropical and subtropical regions of Africa. Its species is Abrahamia sambiranensis, a rare plant species native to Madagascar, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia sambiranensis is primarily native to Madagascar. This species is found in the unique ecosystems of the island, particularly in the southern and southeastern regions. It thrives in humid, tropical climates with well-drained soils. The plant is commonly associated with lowland rainforests and coastal areas. Due to its restricted range, it is considered a rare and endemic species within Madagascar.",
    "distribution_introduced_art_desc": "Abrahamia sambiranensis was mainly introduced to areas with moist, shaded environments, typically found in tropical and subtropical regions. It thrives in humid climates with well-drained soil, making it suitable for cultivation in regions with high rainfall. This plant is often found growing near streams or in forest understories where it can receive adequate light without direct sun exposure. Its introduction has been noted in several parts of Southeast Asia, including Indonesia and the Philippines. Due to its ornamental value, it has been cultivated in botanical gardens and private collections in these regions."
}
