{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia pauciflora",
    "plant_slug": "abrahamia-pauciflora",
    "plant_name_scientific": "abrahamia pauciflora",
    "intro": "Abrahamia pauciflora, commonly known as the few-flowered Abrahamia, is a flowering plant native to South Africa. It belongs to the family Acanthaceae and is characterized by its small, clustered flowers. The plant typically grows in rocky or sandy soils and is adapted to arid environments. It has narrow, linear leaves and produces showy, tubular flowers in shades of pink or purple. Due to its limited distribution and specific habitat requirements, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia pauciflora"
    },
    "taxonomy_art_desc": "Abrahamia pauciflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which consists of vascular plants with a wide range of morphological diversity, including ferns and some gymnosperms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Sapindales, a group of flowering plants that includes trees and shrubs, many of which produce fruits with a distinctive flavor. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic compounds and economically valuable fruits. Its genus is Abrahamia, a small genus of flowering plants native to South Africa, characterized by their unique leaf and fruit structures. Its species is Abrahamia pauciflora, a specific plant within the genus Abrahamia, known for its limited flower production and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia pauciflora is primarily native to Madagascar. It is found in the eastern part of the island, particularly in the rainforests and humid lowland areas. This plant is adapted to the tropical climate and high levels of rainfall characteristic of Madagascar. It is often found growing in shaded, moist environments within the island's diverse ecosystems. Its distribution is limited to specific regions within Madagascar due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Abrahamia pauciflora was mainly introduced to areas with Mediterranean climates characterized by dry summers and wet winters. It thrives in well-drained soils and full sun exposure, making it suitable for coastal and inland regions. This plant is often used in landscaping due to its hardy nature and ornamental value. It has been introduced to parts of California and southern Australia. However, its invasive potential remains a concern in some regions."
}
