{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia ditimena",
    "plant_slug": "abrahamia-ditimena",
    "plant_name_scientific": "abrahamia ditimena",
    "intro": "Abrahamia ditimena, commonly known as the mountain sandwort, is a low-growing perennial plant native to the high-altitude regions of South America. It features a mat-forming growth habit with small, fleshy leaves that are adapted to conserve moisture in arid environments. The plant produces clusters of tiny, white or pink flowers during the summer months, which are attractive to pollinators such as bees and butterflies. Its root system is fibrous and helps stabilize soil in rocky or sandy substrates. Abrahamia ditimena is valued for its ornamental appeal and ecological role in alpine ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia ditimena"
    },
    "taxonomy_art_desc": "Abrahamia ditimena belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often possessing rhizomes. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Sapindales, which includes trees and shrubs with showy flowers and often contains plants with toxic or aromatic compounds. Its family is Anacardiaceae, commonly known as the cashew family, which includes trees and shrubs that often produce toxic sap and have compound leaves. Its genus is Abrahamia, a small group of flowering plants native to specific regions, typically found in tropical or subtropical climates. Its species is Abrahamia ditimena, a specific plant within the genus Abrahamia, distinguished by its unique morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia ditimena is primarily native to Madagascar. This plant is found in the tropical regions of the island, particularly in areas with moist, shaded environments. It thrives in the dense forests and humid climates characteristic of Madagascar's diverse ecosystems. Due to its restricted habitat, it is considered a rare and endemic species. Conservation efforts are essential to protect this unique plant from threats such as habitat loss and climate change.",
    "distribution_introduced_art_desc": "Abrahamia ditimena was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive blue flowers. The plant has since spread beyond cultivation and is now found in various habitats across the country. It is considered a potential environmental weed due to its ability to colonize disturbed areas. However, its impact on native ecosystems is still being studied."
}
