{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia ellipticarpa",
    "plant_slug": "abrahamia-ellipticarpa",
    "plant_name_scientific": "abrahamia ellipticarpa",
    "intro": "Abrahamia ellipticarpa, commonly known as the ellipticarpa abrahamia, is a flowering plant native to specific regions of South America. It belongs to the family Polygonaceae, which includes plants such as buckwheat and knotweed. The plant is characterized by its elliptical-shaped fruits and distinctive leaf morphology. It typically grows in moist, shaded environments, often in forest understories. Its botanical features make it an interesting subject for ecological and taxonomic studies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia ellipticarpa"
    },
    "taxonomy_art_desc": "Abrahamia ellipticarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex reproductive structures and vascular systems. Its class is Equisetopsida, a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore-producing cones. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their diverse flower structures. Its order is Sapindales, a group of flowering plants that includes economically important trees and shrubs, such as lychees and sumacs, often with distinctive flowers and fruits. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic sap and various types of fruits, such as cashews and mangoes. Its genus is Abrahamia, a relatively small genus of flowering plants native to southern Africa, known for its shrub-like growth and distinctive leaf shapes. Its species is Abrahamia ellipticarpa, a specific plant within the genus Abrahamia, characterized by its elliptical leaves and unique growth habits, found in specific regions of southern Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia ellipticarpa is primarily native to Madagascar. This species is found in the unique ecosystems of the island, particularly in areas with specific soil and climate conditions. It is commonly associated with dry deciduous forests and rocky outcrops. The plant's distribution is limited to certain regions within Madagascar, reflecting its adaptation to the island's distinct environmental conditions. Due to its restricted range, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Abrahamia ellipticarpa was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in regions with temperate climates, particularly in the eastern United States. This plant has been introduced to gardens and naturalized areas where it can thrive due to its adaptability. It is often used in landscaping for its ornamental value and ability to spread easily. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
