{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrahamia patrickii",
    "plant_slug": "abrahamia-patrickii",
    "plant_name_scientific": "abrahamia patrickii",
    "intro": "Abrahamia patrickii, commonly known as the Patrick's abrahamia, is a rare and endemic plant species found in specific regions of South Africa. It belongs to the Asteraceae family, characterized by its composite flower heads and robust, hairy stems. The plant typically grows in rocky, well-drained soils and is adapted to arid or semi-arid environments. Its leaves are narrow and often covered in fine hairs, which help reduce water loss. Due to its limited distribution and habitat specificity, it is considered a vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Sapindales",
        "family": "Anacardiaceae",
        "genus": "Abrahamia",
        "species": "Abrahamia patrickii"
    },
    "taxonomy_art_desc": "Abrahamia patrickii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often aromatic. Its order is Sapindales, which includes plants such as lychee and maple, known for their showy flowers and often toxic or aromatic fruits. Its family is Anacardiaceae, commonly known as the cashew family, which includes plants with toxic sap and often edible fruits. Its genus is Abrahamia, a small genus of flowering plants native to southern Africa, characterized by its small, clustered flowers. Its species is Abrahamia patrickii, a rare and endemic plant species found in specific regions of South Africa, known for its unique floral structure and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrahamia patrickii is primarily native to Madagascar. This unique plant is found in specific regions of the island, particularly in the eastern rainforests. It thrives in humid, shaded environments with high biodiversity. Due to its restricted habitat, it is considered a rare and endemic species. Conservation efforts are crucial to protect its natural habitat from deforestation and habitat loss.",
    "distribution_introduced_art_desc": "Abrahamia patrickii was mainly introduced to New Zealand. It was first discovered in the 1980s and has since spread across various regions of the country. The plant thrives in moist, shaded environments, often found in forested areas. Its introduction has raised concerns due to its potential to outcompete native species. Conservation efforts are underway to monitor and manage its spread."
}
