{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum cupressoides",
    "plant_slug": "abrodictyum-cupressoides",
    "plant_name_scientific": "abrodictyum cupressoides",
    "intro": "Abrodictyum cupressoides, commonly known as the African evergreen cycad, is a species of cycad native to southern Africa. It is characterized by its tall, unbranched trunk and a crown of stiff, needle-like leaves that resemble those of a conifer. The plant produces large, cone-like structures that contain both male and female reproductive organs. It thrives in well-drained soils and requires full sun exposure. Due to its slow growth and susceptibility to environmental stress, it is often cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum cupressoides is primarily native to the western coast of South Africa, specifically in the region of the Western Cape. It is commonly found in rocky outcrops and coastal cliffs, where it thrives in well-drained, sandy soils. This plant is adapted to the Mediterranean climate of the area, characterized by dry summers and wet winters. It is often seen growing in open, sunny areas along the shoreline. Due to its unique appearance and habitat, it is considered a valuable component of the local flora.",
    "distribution_introduced_art_desc": "Abrodictyum cupressoides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sand dunes, thriving in well-drained, sandy soils. This plant is often used in ornamental gardening due to its attractive, pine-like appearance. However, it has raised concerns as a potential invasive species in some areas. Its spread is closely monitored to prevent ecological disruption in native habitats."
}
