{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia fragrans var. elliptica",
    "plant_slug": "abronia-fragrans-var-elliptica",
    "plant_name_scientific": "abronia fragrans var. elliptica",
    "intro": "Abronia fragrans var. elliptica, commonly known as the fragrant abronia, is a flowering plant native to South America. It is characterized by its aromatic, tubular flowers that bloom in shades of pink and white. The plant features succulent, fleshy leaves that help it store water, adapting to its often arid habitat. It thrives in well-drained soil and full sun, making it a popular choice for rock gardens. Its unique appearance and pleasant fragrance make it a desirable addition to both gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia fragrans var. elliptica is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in coastal areas and sand dunes along the Atlantic and Gulf coasts. This plant thrives in sandy, well-drained soils and is often associated with maritime hammocks and scrub habitats. It is a low-growing shrub that produces fragrant, white or pale pink flowers. Due to habitat loss and development, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abronia fragrans var. elliptica was mainly introduced to coastal dunes and sandy soils along the Pacific coast. It is commonly found in regions with mild, temperate climates and well-drained soils. This plant thrives in areas with full sun exposure and moderate moisture levels. It is often cultivated as an ornamental plant due to its fragrant flowers and unique foliage. However, it has also been reported as an invasive species in some regions where it outcompetes native vegetation."
}
