{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella emarginata",
    "plant_slug": "abrotanella-emarginata",
    "plant_name_scientific": "abrotanella emarginata",
    "intro": "Abrotanella emarginata, commonly known as the narrowleaf sandmat, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Asteraceae family, characterized by its composite flower heads that resemble daisies. The plant typically grows in sandy or gravelly soils and is adapted to arid environments. Its leaves are narrow and often have a waxy coating to reduce water loss. Abrotanella emarginata produces small yellow flowers that bloom in the spring and summer months.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella emarginata"
    },
    "taxonomy_art_desc": "Abrotanella emarginata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging angiosperms with diverse morphological traits. Its order is Asterales, which comprises flowering plants known for their showy flowers and includes families such as Asteraceae and Campanulaceae. Its family is Asteraceae, commonly known as the sunflower family, characterized by composite flower heads and a wide variety of species. Its genus is Abrotanella, a group of flowering plants typically found in arid regions, known for their small, showy flowers. Its species is Abrotanella emarginata, a specific type within the genus Abrotanella, distinguished by its unique floral and morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile South",
        "Falkland Is.",
        "New Guinea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella emarginata is primarily native to Argentina South, Chile South, Falkland Is., and New Guinea. This species is commonly found in temperate regions across these areas. It thrives in coastal and mountainous environments with well-drained soils. The plant is adapted to the climate conditions of its native range. Its distribution reflects its preference for specific ecological niches in these regions.",
    "distribution_introduced_art_desc": "Abrotanella emarginata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive yellow flowers. The plant has since become naturalized in several regions, particularly in the North Island. It thrives in disturbed soils and can often be found along roadsides and in open habitats. However, it is considered a potential weed in some areas due to its ability to spread rapidly."
}
