{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia maritima",
    "plant_slug": "abronia-maritima",
    "plant_name_scientific": "abronia maritima",
    "intro": "Abronia maritima, commonly known as the sea blite, is a flowering plant native to coastal regions of the Mediterranean and parts of Europe. It is a low-growing perennial that thrives in sandy or gravelly soils, often found in dunes and coastal grasslands. The plant produces small, yellowish-green flowers that bloom in early spring. Its leaves are succulent and fleshy, adapted to retain moisture in arid environments. Abronia maritima is valued for its ornamental appeal and ecological role in stabilizing coastal dunes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia maritima"
    },
    "taxonomy_art_desc": "Abronia maritima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive flower structures and often contains species adapted to saline or arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers that often open in the late afternoon. Its genus is Abronia, a group of flowering plants typically found in coastal areas, known for their colorful and often showy flowers. Its species is Abronia maritima, a specific plant within the genus Abronia, native to coastal regions and characterized by its unique floral structure and salt tolerance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia maritima is primarily native to California, Mexico Northwest, and Mexico Southwest. This plant is commonly found in coastal areas and sandy soils along the Pacific coast. It thrives in arid and semi-arid environments, often growing in dunes or along the shoreline. The species is adapted to withstand salt spray and strong winds typical of its coastal habitat. It plays an important role in stabilizing dunes and supporting local wildlife.",
    "distribution_introduced_art_desc": "Abronia maritima was mainly introduced to coastal areas of the southeastern United States, particularly in Florida and the Gulf Coast. It thrives in sandy, well-drained soils and is often found in dune ecosystems. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states, including Texas and Georgia, where it has established itself along shorelines. Its introduction has raised concerns among conservationists due to its potential impact on local biodiversity."
}
