{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella moseleyi",
    "plant_slug": "abrotanella-moseleyi",
    "plant_name_scientific": "abrotanella moseleyi",
    "intro": "Abrotanella moseleyi, commonly known as the desert dandelion, is a flowering plant native to the southwestern United States and northern Mexico. It is a low-growing perennial herb that thrives in arid and semi-arid environments. The plant features woolly, gray-green leaves and produces small, yellow flowers that bloom in spring. It has a fibrous root system adapted to retain moisture in dry soils. The species is valued for its drought tolerance and is often used in xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella moseleyi is primarily native to the western United States, particularly in California and Nevada. It is commonly found in arid and semi-arid regions, including deserts and rocky slopes. This species thrives in well-drained soils and is often associated with disturbed or open habitats. It is also present in parts of Oregon and Arizona, where it grows in similar environmental conditions. The plant is well adapted to the harsh climate of its native range, showing resilience to drought and extreme temperatures.",
    "distribution_introduced_art_desc": "Abrotanella moseleyi was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and disturbed forests. It is commonly found in the western United States, particularly in California, Nevada, and Utah. This plant thrives in full sun and well-drained soils, making it adaptable to a variety of environments. Its introduction has led to its establishment in both natural and human-altered landscapes. However, it is considered a non-native species in these regions, often outcompeting native vegetation."
}
