{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia gracilis",
    "plant_slug": "abronia-gracilis",
    "plant_name_scientific": "abronia gracilis",
    "intro": "Abronia gracilis, commonly known as the slender sandverbena, is a flowering plant native to the southwestern United States and northern Mexico. It belongs to the family Goodeniaceae and is characterized by its small, delicate flowers and low-growing habit. The plant typically thrives in sandy or gravelly soils and is adapted to arid environments. Its leaves are often covered in fine hairs, which help reduce water loss. Abronia gracilis is often found in coastal dunes and dry shrublands, where it plays a role in stabilizing soil and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia gracilis"
    },
    "taxonomy_art_desc": "Abronia gracilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes many succulents and plants with distinctive floral morphology. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers and often hairy stems. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their fleshy stems and showy flowers. Its species is Abronia gracilis, a specific plant within the genus Abronia, known for its slender stems and vibrant flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia gracilis is primarily native to California and the northwest region of Mexico. It is commonly found in coastal areas and sandy soils along the Pacific coast. This plant thrives in dune environments and is adapted to the arid and semi-arid climates of its native range. It is often seen in regions with mild, wet winters and dry summers. Due to its specific habitat requirements, it is considered a rare and endangered species in many parts of its distribution.",
    "distribution_introduced_art_desc": "Abronia gracilis was mainly introduced to coastal dune habitats in the Pacific Northwest of the United States. It thrives in sandy, well-drained soils and is often found in areas with moderate to high exposure to wind. This plant is typically associated with disturbed or open landscapes, such as beachfronts and stabilized dunes. Its introduction has been linked to human activities, including coastal development and the movement of sand dunes. However, it is considered a non-native species in these regions and has not been widely naturalized."
}
