{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abroma molle",
    "plant_slug": "abroma-molle",
    "plant_name_scientific": "abroma molle",
    "intro": "Abroma molle, commonly known as the soft abroma, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the family Malvaceae, which includes cotton and hibiscus. The plant is characterized by its soft, hairy leaves and showy, pale yellow to white flowers that bloom in clusters. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and open woodlands. Due to its ornamental value, it is sometimes cultivated in gardens, though it is not widely used for commercial purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abroma molle is primarily native to Southeast Asia, including countries such as India, Sri Lanka, and parts of Indonesia. It is commonly found in tropical and subtropical regions, particularly in areas with moist, well-drained soils. The plant thrives in open habitats like grasslands, forest margins, and disturbed sites. It is also present in some parts of Africa and the Pacific Islands. Due to its adaptability, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Abroma molle was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread into natural ecosystems, particularly in coastal and disturbed areas. The plant is considered invasive in some regions because of its rapid growth and ability to outcompete native species. Its distribution is now widespread across the North Island, with occasional sightings in the South Island. Management efforts focus on controlling its spread to protect local biodiversity."
}
