{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia nana",
    "plant_slug": "abronia-nana",
    "plant_name_scientific": "abronia nana",
    "intro": "Abronia nana, commonly known as the dwarf sand verbena, is a low-growing perennial plant native to the southwestern United States and northern Mexico. It thrives in sandy or gravelly soils and is adapted to arid and semi-arid environments. The plant features small, clustered flowers that range in color from white to pink, typically blooming in spring. Its compact growth habit and drought tolerance make it well-suited for xeriscaping. Abronia nana is also valued for its ability to stabilize soil and support local pollinator populations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia nana"
    },
    "taxonomy_art_desc": "Abronia nana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral morphology and often contains species adapted to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, characterized by showy flowers that open in the late afternoon. Its genus is Abronia, a group of flowering plants native to the Americas, typically featuring colorful, showy flowers and adapted to various habitats. Its species is Abronia nana, a small, flowering plant known for its delicate appearance and found in specific regions of the Americas.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Colorado",
        "Nevada",
        "Utah"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia nana is primarily native to Arizona, California, Colorado, Nevada, and Utah. This small flowering plant is commonly found in rocky and sandy soils across these western U.S. states. It thrives in arid and semi-arid environments, often growing in crevices or on slopes. The species is part of the purslane family and is well adapted to the harsh conditions of the southwestern deserts. Its limited distribution reflects its specific ecological requirements and geographic range.",
    "distribution_introduced_art_desc": "Abronia nana was mainly introduced to the coastal dunes and sandy soils of the Pacific Northwest. It thrives in well-drained, sunny environments with minimal water retention. The plant is commonly found in areas with moderate temperatures and low precipitation. Its introduction has been documented in several states including Oregon and Washington. However, it is considered a non-native species in these regions and is often monitored for potential ecological impacts."
}
