{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia umbellata subsp. variabilis",
    "plant_slug": "abronia-umbellata-subsp-variabilis",
    "plant_name_scientific": "abronia umbellata subsp. variabilis",
    "intro": "Abronia umbellata subsp. variabilis, commonly known as the variable sandmat, is a low-growing perennial plant native to the arid regions of the southwestern United States and northern Mexico. It is characterized by its dense, cushion-like growth habit and small, white to pale blue flowers that bloom in late spring. The plant thrives in well-drained sandy or gravelly soils and is adapted to full sun conditions. Its leaves are typically blue-gray in color, covered in fine hairs that help reduce water loss. This subspecies is part of the Caryophyllaceae family and is valued for its drought tolerance and ornamental appeal in xeriscaped gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia umbellata subsp. variabilis is primarily native to the coastal regions of southern California and northern Baja California, Mexico. This subspecies thrives in sandy or gravelly soils along the shoreline, often in areas with mild temperatures and moderate precipitation. It is commonly found in dune habitats and adjacent scrublands, where it benefits from the unique microclimatic conditions. The plant is well-adapted to coastal environments, with its succulent leaves helping it store water during dry periods. Due to its limited range, it is considered a rare and sensitive species within its native habitat.",
    "distribution_introduced_art_desc": "Abronia umbellata subsp. variabilis was mainly introduced to coastal dunes and sandy soils in the Pacific Northwest of the United States. It thrives in well-drained, nutrient-poor soils and is often found in areas with moderate to high exposure to wind and salt spray. This subspecies is known for its small, clustered flowers and is commonly used in restoration projects due to its ability to stabilize sand dunes. It has become an important part of the local flora in areas where it has been introduced. However, its spread is limited by its specific environmental requirements and geographic distribution."
}
