{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum meifolium",
    "plant_slug": "abrodictyum-meifolium",
    "plant_name_scientific": "abrodictyum meifolium",
    "intro": "Abrodictyum meifolium, commonly known as the meadow orchid, is a flowering plant native to parts of Europe and Asia. It belongs to the Orchidaceae family and is characterized by its delicate, often fragrant blossoms. The plant typically grows in moist, open habitats such as meadows and woodlands. Its leaves are narrow and grass-like, while its flowers are usually pink or white. Abrodictyum meifolium plays an important role in pollination and supports local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum meifolium is primarily native to the eastern United States, particularly in the southeastern region. It is commonly found in moist, shaded environments such as woodlands and along stream banks. This plant thrives in areas with rich, well-drained soil and is often associated with forest understories. Its native range includes states like Florida, Georgia, and South Carolina. It is an important component of the local flora in these habitats.",
    "distribution_introduced_art_desc": "Abrodictyum meifolium was mainly introduced to new habitats through human activity, such as horticultural trade and accidental transport. It has established itself in disturbed soils and open areas, often outcompeting native vegetation. The plant's rapid growth and adaptability have contributed to its spread across various regions. It is now considered an invasive species in some areas, posing a threat to local ecosystems. Its distribution continues to expand, requiring ongoing monitoring and management efforts."
}
