{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abromeitiella lotteae",
    "plant_slug": "abromeitiella-lotteae",
    "plant_name_scientific": "abromeitiella lotteae",
    "intro": "Abromeitiella lotteae, commonly known as the Korean abromeitiella, is a flowering plant native to the Korean Peninsula. It belongs to the family Apiaceae, which includes aromatic herbs and vegetables. The plant is characterized by its slender stems and small, white to yellowish flowers that bloom in umbels. It thrives in moist, well-drained soils and is often found in rocky or forested areas. Due to its limited distribution, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abromeitiella lotteae is primarily native to the coastal regions of southern California, specifically in the vicinity of the Santa Barbara Channel. It is commonly found in sandy or gravelly habitats along the shoreline. This plant thrives in areas with mild, Mediterranean-type climates and is often associated with dune or beach environments. It is considered a rare and endemic species, with limited distribution along the Pacific coast. Due to its restricted range, it is of particular interest to botanists and conservationists.",
    "distribution_introduced_art_desc": "Abromeitiella lotteae was mainly introduced to coastal areas of South Korea, particularly in the Jeju Island region. It thrives in sandy and rocky soils, often found in dune environments. The plant was likely introduced through human activity, such as accidental transport via vehicles or cargo. It has become a common sight in coastal landscapes, sometimes displacing native vegetation. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
