{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum idoneum",
    "plant_slug": "abrodictyum-idoneum",
    "plant_name_scientific": "abrodictyum idoneum",
    "intro": "Abrodictyum idoneum, commonly known as the slender orchid, is a rare and delicate flowering plant native to specific regions of South America. It belongs to the Orchidaceae family and is characterized by its slender, erect stems and small, fragrant flowers. The plant typically blooms in late spring or early summer, producing pale yellow to greenish-white petals. Its leaves are narrow and strap-like, arranged in a rosette pattern at the base of the plant. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native environment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum idoneum is primarily native to the tropical regions of Central and South America. It is commonly found in countries such as Brazil, Colombia, and Peru. This plant thrives in humid, shaded environments within the understory of tropical rainforests. It is often associated with disturbed or secondary growth areas within these ecosystems. Its distribution is limited to specific microhabitats where it can receive adequate moisture and partial sunlight.",
    "distribution_introduced_art_desc": "Abrodictyum idoneum was mainly introduced to the Pacific Northwest region of the United States. It was first documented in Oregon in the early 2000s. The plant was likely introduced through horticultural trade or accidental spread from cultivation. It has since been found in several counties across Washington and Oregon. Its presence has raised concerns due to its potential to outcompete native flora in moist, forested habitats."
}
