{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia elliptica",
    "plant_slug": "abronia-elliptica",
    "plant_name_scientific": "abronia elliptica",
    "intro": "Abronia elliptica, commonly known as the coastal sand verbena, is a flowering plant native to the coastal regions of California and Baja California. It is characterized by its small, showy flowers that range in color from pink to violet, which bloom in late spring to early summer. The plant has succulent, fleshy leaves that help it retain water in its arid, sandy habitat. It thrives in well-drained soils and is often found in dunes or along the coastline. Abronia elliptica plays an important ecological role by providing nectar for pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia elliptica"
    },
    "taxonomy_art_desc": "Abronia elliptica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and roses. Its order is Caryophyllales, a group of flowering plants that includes plants with specialized adaptations such as salt tolerance and certain types of flower structures. Its family is Nyctaginaceae, commonly known as the four o'clock family, which includes plants with showy flowers and often used in ornamental gardening. Its genus is Abronia, a group of flowering plants native to the Americas, characterized by their distinctive flowers and often used in horticulture. Its species is Abronia elliptica, a specific plant within the genus Abronia known for its unique elliptical leaves and vibrant flowers, commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Colorado",
        "Nevada",
        "New Mexico",
        "Utah",
        "Wyoming"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia elliptica is primarily native to Arizona, Colorado, Nevada, New Mexico, Utah, and Wyoming. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy or gravelly soils and is often associated with dry, open habitats. Abronia elliptica is a low-growing perennial that produces small, showy flowers. Its distribution is largely confined to the southwestern and western United States.",
    "distribution_introduced_art_desc": "Abronia elliptica was mainly introduced to coastal dunes and sandy soils in the western United States. It is commonly found in areas with well-drained soils and full sun exposure. This plant is often used in restoration projects due to its ability to stabilize sand dunes. It has also been introduced to other regions with similar environmental conditions. However, its spread can sometimes lead to competition with native plant species."
}
