{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia ramosa",
    "plant_slug": "abronia-ramosa",
    "plant_name_scientific": "abronia ramosa",
    "intro": "Abronia ramosa, commonly known as the branched sandmat, is a flowering plant native to the southwestern United States and northern Mexico. It is a low-growing perennial that typically forms a dense mat of foliage, with small, pale green leaves that are often covered in fine hairs. The plant produces clusters of small, pink to purple flowers during the spring and summer months. It thrives in sandy or gravelly soils and is well adapted to arid environments. Abronia ramosa is often found in desert scrub and chaparral habitats, where it plays a role in stabilizing soil and providing habitat for small insects and animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia ramosa is primarily native to the coastal areas of California and Baja California, Mexico. It thrives in sandy or gravelly soils along the shorelines. This plant is commonly found in dune habitats and is well adapted to the harsh coastal environment. It is often seen growing in the intertidal zone where it can withstand salt spray and fluctuating tides. Due to its specific habitat requirements, it is considered a rare and endangered species in some regions.",
    "distribution_introduced_art_desc": "Abronia ramosa was mainly introduced to the coastal areas of California and Oregon. It thrives in sandy and gravelly soils along the shoreline. This plant is commonly found in dune ecosystems where it plays a role in stabilizing sand dunes. It is often mistaken for native species due to its similar appearance. Its introduction has raised concerns about its potential impact on local flora and ecosystems."
}
