{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia umbellata subsp. umbellata",
    "plant_slug": "abronia-umbellata-subsp-umbellata",
    "plant_name_scientific": "abronia umbellata subsp. umbellata",
    "intro": "Abronia umbellata subsp. umbellata, commonly known as the coastal bluemouth, is a flowering plant native to the western coast of North America. It is characterized by its low-growing, mat-forming habit and small, blue to purple flowers that bloom in summer. The plant thrives in sandy or gravelly soils along the coastline, often in areas with strong maritime influences. Its leaves are narrow and gray-green, adapted to reduce water loss in coastal conditions. It plays an important role in stabilizing dune ecosystems and providing habitat for native insects and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia umbellata"
    },
    "taxonomy_art_desc": "Abronia umbellata subsp. umbellata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often specialized adaptations to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy, often nocturnal flowers. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their clustered flowers and succulent-like leaves. Its species is Abronia umbellata, a specific type within the genus Abronia, known for its umbellate inflorescence and adapted to specific ecological conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California",
        "Mexico Northwest"
    ],
    "distribution_introduced": [
        "Uzbekistan"
    ],
    "distribution_native_art_desc": "Abronia umbellata subsp. umbellata is primarily native to California, Mexico Northwest. This subspecies is found in coastal and inland areas of southern California. It thrives in sandy soils along the coastline and in dunes. The plant is commonly associated with maritime climates and is adapted to salt spray and wind. It is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Abronia umbellata subsp. umbellata was mainly introduced to Uzbekistan. It is a flowering plant native to South America but has been introduced to various regions, including Uzbekistan. The introduction of this species may be due to ornamental horticulture or accidental spread. It is known for its small, clustered flowers and is often found in dry, rocky habitats. However, its impact on local ecosystems in Uzbekistan is still being studied."
}
