{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia mellifera var. mellifera",
    "plant_slug": "abronia-mellifera-var-mellifera",
    "plant_name_scientific": "abronia mellifera var. mellifera",
    "intro": "Abronia mellifera var. mellifera, commonly known as the sweetroot or honeyroot, is a perennial herb native to the arid regions of the southwestern United States and northwestern Mexico. It belongs to the family Polemoniaceae and is characterized by its succulent, fleshy roots that store water, allowing it to survive in dry environments. The plant produces clusters of showy, bell-shaped flowers that range in color from white to pink, often appearing in late spring to early summer. Its leaves are typically lance-shaped and covered in a fine, white waxy coating, which helps reduce water loss. Abronia mellifera var. mellifera is often found in rocky soils and is adapted to full sun exposure.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia mellifera"
    },
    "taxonomy_art_desc": "Abronia mellifera var. mellifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive flower structures and often contains plants adapted to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers and often has a cosmopolitan distribution. Its genus is Abronia, a group of flowering plants typically found in arid regions, known for their colorful and showy flowers. Its species is Abronia mellifera, a specific plant within the genus Abronia, characterized by its unique floral features and adapted to thrive in specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Idaho",
        "Oregon",
        "Utah",
        "Washington",
        "Wyoming"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia mellifera var. mellifera is primarily native to Idaho, Oregon, Utah, Washington, and Wyoming. This plant is commonly found in the arid and semi-arid regions of these western U.S. states. It thrives in sandy or gravelly soils, often in open habitats such as sagebrush steppe and disturbed areas. The species is well adapted to the dry climate and limited rainfall of its native range. It plays an important ecological role in supporting local pollinators and wildlife.",
    "distribution_introduced_art_desc": "Abronia mellifera var. mellifera was mainly introduced to areas with well-drained sandy soils and full sun exposure. It is commonly found in coastal dunes and sandy habitats along the Pacific coast. This plant thrives in regions with mild, Mediterranean climates and low humidity. It is often cultivated in xeriscaped gardens due to its drought tolerance. Its introduction has been primarily for ornamental purposes and ecological restoration projects."
}
