{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia mellifera",
    "plant_slug": "abronia-mellifera",
    "plant_name_scientific": "abronia mellifera",
    "intro": "Abronia mellifera, commonly known as the sweetflower sandverbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a low-growing perennial shrub with narrow, linear leaves and small, pale yellow to white flowers. The plant thrives in sandy or gravelly soils and is adapted to arid environments. It produces small, capsule-like fruits that contain numerous seeds. Abronia mellifera is often found in desert scrub and chaparral habitats, where it plays a role in supporting local pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia mellifera"
    },
    "taxonomy_art_desc": "Abronia mellifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often has a tendency to accumulate secondary metabolites. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers and often has a preference for sunny habitats. Its genus is Abronia, a group of flowering plants native to the Americas, known for their vibrant flowers and often used in horticulture. Its species is Abronia mellifera, a specific plant within the genus Abronia, characterized by its honey-scented flowers and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Idaho",
        "Oregon",
        "Utah",
        "Washington",
        "Wyoming"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia mellifera is primarily native to Idaho, Oregon, Utah, Washington, and Wyoming. This plant is commonly found in dry, open habitats such as grasslands and rocky slopes. It thrives in areas with well-drained soils and full sun exposure. The species is adapted to the arid and semi-arid climates of these western U.S. states. It plays an important role in local ecosystems by providing nectar for pollinators.",
    "distribution_introduced_art_desc": "Abronia mellifera was mainly introduced to coastal dunes and sandy soils in the southern United States, particularly in Texas and California. It thrives in well-drained, sunny environments and is often found in areas with minimal vegetation. This plant has been introduced to new regions as part of ecological restoration efforts and ornamental horticulture. Its presence has raised concerns due to its potential to outcompete native species in invaded habitats. Despite its adaptability, it remains a relatively localized introduction with limited spread beyond its initial planting sites."
}
