{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella filiformis",
    "plant_slug": "abrotanella-filiformis",
    "plant_name_scientific": "abrotanella filiformis",
    "intro": "Abrotanella filiformis, commonly known as slender sandwort, is a low-growing perennial plant native to the western United States. It typically thrives in dry, sandy, or rocky soils and is often found in arid or semi-arid environments. The plant has small, narrow leaves that are often covered in fine hairs, and its flowers are usually white or pale pink, appearing in clusters. It reproduces through seeds and has a compact growth habit that helps it conserve water. Due to its hardy nature, it is sometimes used in xeriscaping and native plant gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella filiformis"
    },
    "taxonomy_art_desc": "Abrotanella filiformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises vascular plants with a wide range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Asterales, which consists of flowering plants that are often recognized by their composite flowers. Its family is Asteraceae, commonly known as the daisy or sunflower family, characterized by their head-like inflorescences. Its genus is Abrotanella, a group of flowering plants typically found in arid regions, known for their small, clustered flowers. Its species is Abrotanella filiformis, a specific plant species within the genus Abrotanella, distinguished by its slender, thread-like appearance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella filiformis is primarily native to New Zealand South. It is found in the southern regions of the country, including the South Island. This plant typically grows in coastal and subalpine environments. It is adapted to the temperate climate and nutrient-poor soils of these areas. Its distribution is limited to specific habitats in the southern part of New Zealand.",
    "distribution_introduced_art_desc": "Abrotanella filiformis was mainly introduced to new environments through human activities such as gardening and landscaping. It is commonly found in disturbed soils and along roadsides, where it thrives in sunny, dry conditions. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to ecological concerns in areas where it has established itself. Proper management is necessary to control its spread and protect local ecosystems."
}
