{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia turbinata var. carletonii",
    "plant_slug": "abronia-turbinata-var-carletonii",
    "plant_name_scientific": "abronia turbinata var. carletonii",
    "intro": "Abronia turbinata var. carletonii, commonly known as the Carleton's sandverbena, is a flowering plant native to the coastal regions of California. It belongs to the Goodeniaceae family and is characterized by its prostrate growth habit and narrow, linear leaves. The plant produces small, showy flowers that are typically pink or purple in color, which bloom during the spring and early summer. It thrives in sandy or gravelly soils and is adapted to coastal climates with mild, wet winters and warm, dry summers. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia turbinata var. carletonii is primarily native to the coastal regions of southern California, specifically within the Santa Barbara Channel. This variety is found in sandy and gravelly habitats along the shoreline, often in areas with mild temperatures and moderate rainfall. It is typically associated with dunes and salt marshes, where it thrives in the unique microclimates of the Pacific coast. The plant is endemic to this region, meaning it is not found naturally anywhere else in the world. Due to its limited range, it is considered a rare and vulnerable species.",
    "distribution_introduced_art_desc": "Abronia turbinata var. carletonii was mainly introduced to coastal dunes and sandy soils in the Pacific Northwest. It thrives in well-drained, sunny environments with minimal competition from other vegetation. This variety is often found in areas with moderate to high salinity, making it adaptable to coastal conditions. Its introduction has been noted in several conservation areas where it contributes to local biodiversity. However, its spread is limited due to its specific habitat requirements and sensitivity to environmental changes."
}
