{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum cumingii",
    "plant_slug": "abrodictyum-cumingii",
    "plant_name_scientific": "abrodictyum cumingii",
    "intro": "Abrodictyum cumingii, commonly known as the Cuming's spider orchid, is a rare and striking orchid species native to the tropical regions of South America. It is characterized by its slender, wiry stems and its unique, spider-like appearance due to its elongated, hairy leaves and delicate, spurred flowers. The plant typically grows in shaded, humid environments, often in forest understories where it can receive filtered sunlight. Its flowers, which bloom in spring, are usually pale green or yellow with intricate patterns that aid in pollination by specific insect species. Due to habitat loss and its limited distribution, Abrodictyum cumingii is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum cumingii is primarily native to southern Africa, specifically South Africa. It is found in the Eastern Cape and Western Cape provinces. This plant typically grows in sandy or gravelly soils in open, sunny habitats. It is commonly associated with coastal areas and fynbos vegetation. Its native range is limited to these specific regions within South Africa.",
    "distribution_introduced_art_desc": "Abrodictyum cumingii was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils and full sun exposure. It is commonly found in regions such as Southeast Asia, the Pacific Islands, and parts of Australia. This plant is often cultivated for its ornamental value due to its striking, colorful flowers. It has been introduced to various horticultural collections and botanical gardens worldwide. However, its introduction to new environments requires careful management to prevent potential ecological impacts."
}
