{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum asae-grayi",
    "plant_slug": "abrodictyum-asae-grayi",
    "plant_name_scientific": "abrodictyum asae-grayi",
    "intro": "Abrodictyum asae-grayi, commonly known as the Gray's spider orchid, is a rare and striking member of the Orchidaceae family. It is native to the arid regions of Namibia and Angola, where it thrives in rocky, well-drained soils. The plant produces delicate, spider-like flowers with intricate patterns that mimic the appearance of insect wings. Its flowering period typically occurs during the warm season, and it relies on specific pollinators for reproduction. Due to its limited distribution and habitat specificity, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum asae-grayi is primarily native to the eastern region of South Africa, specifically the eastern Cape Province. This plant is commonly found in the coastal and mountainous areas where the climate is temperate and humid. It thrives in sandy or well-drained soils, often growing in open woodlands or along the edges of forests. The species is known for its striking, showy flowers that bloom in the summer months. Due to its limited distribution, it is considered a rare and endemic plant in its native habitat.",
    "distribution_introduced_art_desc": "Abrodictyum asae-grayi was mainly introduced to the western United States, particularly in California and Oregon. It was first documented in the early 20th century and has since spread to other regions due to its adaptability to various soil types. This plant thrives in moist, well-drained environments and is often found in disturbed areas such as roadsides and riverbanks. Its introduction has raised concerns among ecologists due to its potential to outcompete native species. Despite its ornamental appeal, it is considered an invasive species in some areas."
}
