{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella scapigera",
    "plant_slug": "abrotanella-scapigera",
    "plant_name_scientific": "abrotanella scapigera",
    "intro": "Abrotanella scapigera, commonly known as the Scapigera daisy, is a flowering plant native to South America. It belongs to the Asteraceae family and is characterized by its daisy-like flowers with white petals and a yellow center. The plant typically grows in open, sunny habitats such as grasslands and rocky areas. It has hairy stems and leaves that are often covered in fine pubescence. Abrotanella scapigera is known for its ornamental value and is sometimes cultivated in gardens for its delicate appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella scapigera"
    },
    "taxonomy_art_desc": "Abrotanella scapigera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Asterales, a group of flowering plants that includes many familiar families such as the sunflowers and daisies, known for their showy inflorescences. Its family is Asteraceae, commonly known as the sunflower family, which is one of the largest families of flowering plants, characterized by composite flower heads. Its genus is Abrotanella, a group of flowering plants commonly found in arid regions, known for their small, showy flowers and often used in traditional medicine. Its species is Abrotanella scapigera, a specific type within the genus Abrotanella, characterized by its distinctive scapigerous leaves and yellow flowers, typically found in Mediterranean and other dry climates.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tasmania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella scapigera is primarily native to Tasmania. It is commonly found in the southern regions of the island, particularly in coastal and heathland environments. This species thrives in well-drained soils and is often seen in open, sunny habitats. It is an important part of the local flora, contributing to the biodiversity of Tasmania's native vegetation. The plant is well adapted to the climate and conditions of the region.",
    "distribution_introduced_art_desc": "Abrotanella scapigera was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, pastures, and disturbed forests. It is commonly found in temperate regions of North America, particularly in the western United States. This plant thrives in full sun and is often considered a weed due to its rapid growth and ability to spread aggressively. Its introduction has led to concerns about its impact on native plant communities in invaded areas. Abrotanella scapigera is typically a low-growing perennial with small, hairy leaves and yellow flowers."
}
