{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abromeitiella scapigera",
    "plant_slug": "abromeitiella-scapigera",
    "plant_name_scientific": "abromeitiella scapigera",
    "intro": "Abromeitiella scapigera, commonly known as the scapigera bluemink, is a flowering plant native to the southern United States and parts of Mexico. It belongs to the Apiaceae family, which includes carrots and parsley, and is characterized by its delicate, fern-like foliage. The plant produces small, white to pale blue flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. It thrives in moist, well-drained soils and is often found in woodland or swampy areas. Abromeitiella scapigera is a perennial herb that typically grows to a height of 1 to 3 feet, making it a valuable addition to native plant gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abromeitiella scapigera is primarily native to South America, particularly in regions of Argentina, Chile, and Peru. It is commonly found in temperate grasslands and open habitats. This plant thrives in areas with well-drained soils and is often associated with disturbed or marginal environments. Its distribution includes parts of southern South America, where it is adapted to the local climate and soil conditions. It is a member of the Asteraceae family and is known for its small, daisy-like flowers.",
    "distribution_introduced_art_desc": "Abromeitiella scapigera was mainly introduced to North America through human activities such as trade and horticultural practices. It is commonly found in disturbed areas like roadsides, fields, and along railroads. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It prefers well-drained soils and full sun exposure, which contributes to its spread. Its introduction has raised concerns among ecologists due to its potential impact on local ecosystems."
}
