{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abroma fastuosum",
    "plant_slug": "abroma-fastuosum",
    "plant_name_scientific": "abroma fastuosum",
    "intro": "Abroma fastuosum, commonly known as the showy abroma, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its striking, showy flowers that range in color from white to pink and purple. Its leaves are typically heart-shaped and covered in fine hairs. Abroma fastuosum is often cultivated for its ornamental value due to its vibrant blooms and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abroma fastuosum is primarily native to Southeast Asia, including countries such as India, Sri Lanka, and Indonesia. It is also found in parts of Africa, particularly in tropical regions like Kenya and Tanzania. This plant thrives in moist, shaded environments and is commonly found in forest understories. It is often associated with riverine and swampy areas due to its preference for high humidity. Its native distribution reflects its adaptation to tropical and subtropical climates.",
    "distribution_introduced_art_desc": "Abroma fastuosum was mainly introduced to New Zealand as an ornamental plant due to its striking purple flowers and vigorous growth. It was first recorded in the late 19th century and has since become naturalized in several regions across the country. The plant thrives in a variety of soil types and is particularly common in coastal and disturbed areas. Its rapid spread has led to concerns about its impact on native ecosystems. Despite its beauty, Abroma fastuosum is now considered a potential weed in some parts of New Zealand."
}
