{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum dregei",
    "plant_slug": "abrodictyum-dregei",
    "plant_name_scientific": "abrodictyum dregei",
    "intro": "Abrodictyum dregei, commonly known as the Cape golden orchid, is a striking member of the Orchidaceae family native to South Africa. It is characterized by its bright yellow flowers with distinctive red veins, which bloom during the summer months. The plant typically grows in rocky, well-drained soils and is often found in mountainous regions. Its rhizomatous growth habit allows it to form dense clumps, and it is adapted to withstand periods of drought. Due to its unique appearance and limited distribution, it is considered a valuable and sometimes endangered species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum dregei is primarily native to South Africa, specifically the eastern regions of the country. It is commonly found in the coastal areas of KwaZulu-Natal and the Eastern Cape provinces. This plant thrives in sandy soils along the coast and is often associated with coastal dunes and rocky outcrops. It is an endemic species, meaning it is not found naturally anywhere else in the world. Abrodictyum dregei is well adapted to the warm, humid climate of its native habitat.",
    "distribution_introduced_art_desc": "Abrodictyum dregei was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the coastal areas of the country. The plant thrives in sandy or gravelly soils and is often associated with fynbos vegetation. Due to its ornamental value, it has been cultivated in gardens and may have spread beyond its original range. However, its impact on native ecosystems is still being studied."
}
