{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella fertilis",
    "plant_slug": "abrotanella-fertilis",
    "plant_name_scientific": "abrotanella fertilis",
    "intro": "Abrotanella fertilis, commonly known as the goldenweed, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Asteraceae family, characterized by its composite flower heads that consist of both ray and disk flowers. The plant typically grows in dry, rocky soils and thrives in full sun, making it well adapted to arid environments. Its small, yellow flowers bloom in the spring, and the plant produces small, hairy fruits that disperse its seeds. Abrotanella fertilis is often found in desert scrub and chaparral habitats, where it plays a role in stabilizing soil and supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella fertilis"
    },
    "taxonomy_art_desc": "Abrotanella fertilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Asterales, a group of flowering plants that includes families such as Asteraceae andApiaceae, known for their composite flowers and aromatic compounds. Its family is Asteraceae, commonly known as the sunflower family, which is characterized by its composite flower heads and is one of the largest families of flowering plants. Its genus is Abrotanella, a small genus of flowering plants in the family Asteraceae, typically characterized by small, often yellow or white flowers. Its species is Abrotanella fertilis, a specific plant within the genus Abrotanella, distinguished by its particular morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand North",
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella fertilis is primarily native to New Zealand North and New Zealand South. This species is commonly found in the alpine and subalpine regions of both the North and South Islands. It thrives in rocky and gravelly soils, often growing in open habitats such as cliffs and hillsides. The plant is part of the Asteraceae family and is known for its small, yellow or orange flowers. It plays an important ecological role in the native ecosystems of New Zealand.",
    "distribution_introduced_art_desc": "Abrotanella fertilis was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant thrives in dry, open habitats and is often considered a weed in agricultural settings. Its introduction has led to concerns about its impact on native plant communities. It is also known for its small, yellow flowers that bloom in the spring."
}
