{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum guineense",
    "plant_slug": "abrodictyum-guineense",
    "plant_name_scientific": "abrodictyum guineense",
    "intro": "Abrodictyum guineense, commonly known as the African orchid or Guinea orchid, is a member of the Orchidaceae family. It is native to tropical regions of Africa, particularly found in countries like Guinea, Nigeria, and Cameroon. The plant is characterized by its striking, showy flowers that typically bloom in shades of yellow and orange. It thrives in moist, well-drained soil and requires a warm, humid environment. Abrodictyum guineense is often cultivated for its ornamental value and is appreciated in horticultural circles for its beauty and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum guineense is primarily native to tropical regions of Africa, particularly in countries such as Nigeria, Ghana, and the Democratic Republic of the Congo. It is commonly found in humid, lowland areas with rich, well-drained soils. This plant thrives in open woodland and grassland habitats, often near water sources. It is an important species in local ecosystems, supporting various pollinators and wildlife. Its natural range extends across parts of West and Central Africa, where it plays a role in traditional medicine and cultural practices.",
    "distribution_introduced_art_desc": "Abrodictyum guineense was mainly introduced to new environments due to its ornamental value and adaptability. It is commonly found in tropical and subtropical regions where it thrives in moist, shaded conditions. This plant has been reported in several countries, including parts of Southeast Asia and the Caribbean. Its introduction has raised concerns about its potential to become invasive in non-native habitats. Proper management is recommended to prevent its spread beyond controlled areas."
}
