{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella linearifolia",
    "plant_slug": "abrotanella-linearifolia",
    "plant_name_scientific": "abrotanella linearifolia",
    "intro": "Abrotanella linearifolia, commonly known as the narrow-leaved sandmat, is a flowering plant native to arid and semi-arid regions of North America. It is a low-growing perennial herb with slender, linear leaves that are often covered in fine hairs. The plant produces small, yellowish-green flowers that bloom in clusters during the spring and summer months. It is well adapted to dry conditions, with a deep root system that helps it survive in poor soils. Abrotanella linearifolia is often found in rocky or sandy habitats, contributing to the ecological diversity of its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella linearifolia"
    },
    "taxonomy_art_desc": "Abrotanella linearifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species such as roses and magnolias. Its order is Asterales, which consists of flowering plants that are typically recognized by their composite flower heads. Its family is Asteraceae, commonly known as the sunflower family, characterized by their unique flower structure and wide distribution. Its genus is Abrotanella, a group of flowering plants that are typically small and often found in arid or rocky environments. Its species is Abrotanella linearifolia, a specific plant within the genus Abrotanella, distinguished by its linear leaves and small yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Chile South",
        "Juan Fernández Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella linearifolia is primarily native to Chile South, Juan Fernández Is. This species is found in the coastal areas of these islands, where it thrives in rocky and sandy habitats. It is adapted to the temperate climate and strong coastal winds of the region. The plant is part of the local flora unique to the Juan Fernández Islands. Its distribution is limited to these specific locations, making it an endemic species in this area.",
    "distribution_introduced_art_desc": "Abrotanella linearifolia was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly found in coastal and sandy environments where it forms dense mats. This plant is valued for its rapid growth and ability to thrive in poor soil conditions. However, it can become invasive in some regions, outcompeting native vegetation. Its introduction has led to both ecological benefits and management challenges in certain habitats."
}
