{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum pachyphlebium",
    "plant_slug": "abrodictyum-pachyphlebium",
    "plant_name_scientific": "abrodictyum pachyphlebium",
    "intro": "Abrodictyum pachyphlebium, commonly known as the thick-veined orchid, is a rare and unique orchid species native to the tropical regions of South America. It is characterized by its striking, showy flowers that typically bloom in shades of pink and white. The plant has thick, fleshy leaves that help it store water, adapting it to its often arid or seasonally dry habitat. Its roots are specialized for absorbing nutrients from the soil, a feature common in many orchid species. Due to its specific ecological requirements, it is considered a challenging plant to cultivate outside its native environment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum pachyphlebium is primarily native to South America, specifically Brazil. It is found in the states of Pará, Amazonas, and Amapá. This orchid thrives in the humid lowland rainforests of the Amazon Basin. It is commonly found in secondary growth areas and along riverbanks. The plant is well adapted to the warm and moist climate of the region.",
    "distribution_introduced_art_desc": "Abrodictyum pachyphlebium was mainly introduced to the region of South America, particularly in countries like Brazil, Colombia, and Peru. It is commonly found in the Atlantic Forest and other tropical rainforest areas. This plant thrives in humid, shaded environments with rich, well-drained soil. It is often cultivated for its ornamental value due to its unique and striking foliage. However, it is considered an invasive species in some areas, posing a threat to native ecosystems."
}
