{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abromeitiella abstrusa",
    "plant_slug": "abromeitiella-abstrusa",
    "plant_name_scientific": "abromeitiella abstrusa",
    "intro": "Abromeitiella abstrusa, commonly known as the slender abromeitiella, is a flowering plant native to South America. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant typically grows in dry, open habitats such as grasslands and rocky slopes. Its flowers are small and inconspicuous, often arranged in clusters, and it produces seeds that are dispersed by wind. Abromeitiella abstrusa is valued for its ornamental potential and ecological role in supporting pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abromeitiella abstrusa is primarily native to South America, particularly in regions of Argentina, Bolivia, and Paraguay. It is commonly found in grasslands and open habitats within the temperate to subtropical zones of these countries. The plant thrives in well-drained soils and is often associated with disturbed or semi-arid environments. It is a member of the Asteraceae family and is known for its small, yellowish flowers. Due to its limited distribution, it is considered a rare and endemic species in certain parts of its range.",
    "distribution_introduced_art_desc": "Abromeitiella abstrusa was mainly introduced to the coastal areas of southern California and northern Baja California. It is commonly found in sandy and gravelly soils along the shoreline. This plant is often associated with disturbed habitats and can thrive in areas with minimal vegetation. It plays a role in stabilizing dunes and preventing erosion. However, its introduction has raised concerns about its potential impact on native plant communities."
}
