{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum cellulosum",
    "plant_slug": "abrodictyum-cellulosum",
    "plant_name_scientific": "abrodictyum cellulosum",
    "intro": "Abrodictyum cellulosum, commonly known as the African orchid, is a flowering plant native to southern Africa. It belongs to the Orchidaceae family and is characterized by its striking, often brightly colored flowers. The plant typically grows in moist, shaded environments, such as forest floors or rocky areas. Its leaves are broad and sword-shaped, and it produces elongated flower spikes with numerous small, clustered blooms. The botanical features of Abrodictyum cellulosum make it a popular choice for both horticultural and conservation purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum cellulosum is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and parts of the Northern Cape. This plant typically grows in sandy or gravelly soils in open, sunny habitats. It is commonly associated with fynbos vegetation, which is a unique type of shrubland found in the Western Cape. The species is also occasionally found in neighboring countries like Namibia and Lesotho.",
    "distribution_introduced_art_desc": "Abrodictyum cellulosum was mainly introduced to the United States as an ornamental plant due to its unique appearance and hardiness. It is commonly found in garden centers and nurseries, especially in regions with temperate climates. The plant has been reported in several states, including Florida, Texas, and California, where it has established itself in both cultivated and naturalized settings. Despite its aesthetic appeal, it has raised concerns due to its potential invasive behavior in certain environments. Its introduction has led to increased monitoring to prevent its spread into native ecosystems."
}
