{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abromeitia pterocarpa",
    "plant_slug": "abromeitia-pterocarpa",
    "plant_name_scientific": "abromeitia pterocarpa",
    "intro": "Abromeitia pterocarpa, commonly known as the desert hibiscus, is a flowering plant native to the arid regions of the southwestern United States and northern Mexico. It is a herbaceous perennial that produces showy, yellow-orange flowers with five petals, typically blooming in late spring to early summer. The plant has a sprawling growth habit, with hairy stems and lance-shaped leaves that are adapted to reduce water loss in hot, dry environments. Its fruit is a capsule that splits open to release small, wind-dispersed seeds. Abromeitia pterocarpa is well-suited to xeriscaping and thrives in well-drained soils with minimal water requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abromeitia pterocarpa is primarily native to the southwestern United States and northwestern Mexico. It is found in states such as Arizona, New Mexico, and Texas, as well as in parts of Baja California and Sonora. This plant typically grows in arid and semi-arid environments, including grasslands, shrublands, and rocky soils. It is well adapted to drought conditions and can thrive in regions with low precipitation. Abromeitia pterocarpa is often associated with disturbed soils and can be found along roadsides and in open areas.",
    "distribution_introduced_art_desc": "Abromeitia pterocarpa was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activity. It is commonly found in regions with dry to mesic conditions, including roadsides, fields, and disturbed grasslands. This plant is known for its ability to thrive in nutrient-poor soils, which allows it to colonize areas quickly after disturbances. Its introduction has been documented in several regions outside its native range, including parts of North America. Due to its adaptability, it can become invasive in some ecosystems, outcompeting native plant species."
}
