{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia lobatifolia",
    "plant_slug": "abronia-lobatifolia",
    "plant_name_scientific": "abronia lobatifolia",
    "intro": "Abronia lobatifolia, commonly known as the coastal bladderwort, is a flowering plant native to the sandy shores of the southeastern United States. It is a member of the Scrophulariaceae family and is characterized by its small, erect growth habit and unique, inflated leaves that resemble bladders. The plant produces clusters of pink to purple flowers during the summer months, which attract various pollinators. It thrives in moist, saline environments and is often found in dune ecosystems. Due to habitat loss, it is considered a rare and endangered species in many parts of its range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia lobatifolia is primarily native to the coastal regions of southern California and northern Baja California, Mexico. It thrives in sandy or gravelly soils along the shorelines and dunes. This species is commonly found in areas with mild, Mediterranean-type climates. It is adapted to tolerate salt spray and periodic flooding from the ocean. Due to its specific habitat requirements, it is often considered a rare and endangered plant in its native range.",
    "distribution_introduced_art_desc": "Abronia lobatifolia was mainly introduced to coastal dunes and sandy soils along the Pacific coast of North America. It thrives in areas with well-drained soil and full sun exposure. This plant is commonly found in regions such as California and Oregon. Its introduction has led to its establishment in both natural and disturbed habitats. However, it is considered a non-native species in these areas."
}
