{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia maritima subsp. maritima",
    "plant_slug": "abronia-maritima-subsp-maritima",
    "plant_name_scientific": "abronia maritima subsp. maritima",
    "intro": "Abronia maritima subsp. maritima, commonly known as the sea blite, is a halophytic plant adapted to coastal environments. It thrives in saline soils and is often found in dune ecosystems along the Atlantic coast. The plant has succulent, fleshy leaves that store water, aiding in its survival in arid conditions. Its small, white flowers are typically clustered in dense inflorescences. It plays an important ecological role in stabilizing dunes and providing habitat for coastal wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia maritima"
    },
    "taxonomy_art_desc": "Abronia maritima subsp. maritima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and some algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes many plants with distinctive flowers and often contains species adapted to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers and often has a cosmopolitan distribution. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their succulent leaves and showy flowers. Its species is Abronia maritima, a specific plant within the genus Abronia, known for its coastal habitat and distinctive floral morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia maritima subsp. maritima is primarily native to California, Mexico Northwest, and Mexico Southwest. This plant is typically found in coastal areas, often in sandy or rocky habitats. It thrives in environments with well-drained soils and full sun exposure. The subspecies is adapted to the arid and semi-arid climates of its native range. It plays an important ecological role in stabilizing coastal dunes and supporting local wildlife.",
    "distribution_introduced_art_desc": "Abronia maritima subsp. maritima was mainly introduced to coastal areas of the southeastern United States, particularly in Florida and along the Atlantic coast. It thrives in sandy, well-drained soils and is often found in dune environments. This plant is adapted to salt spray and can tolerate periodic flooding, making it a common species in maritime ecosystems. It is sometimes used in restoration projects to stabilize dunes and prevent erosion. However, its introduction has raised concerns about its potential impact on native plant communities."
}
