{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia ameliae",
    "plant_slug": "abronia-ameliae",
    "plant_name_scientific": "abronia ameliae",
    "intro": "Abronia ameliae, commonly known as the Amelia's bladderwort, is a rare aquatic plant native to the wetlands of Florida. It is characterized by its small, bladder-like structures that trap microscopic organisms, aiding in its nutrient absorption. The plant typically grows in shallow, freshwater habitats with soft, muddy substrates. Its leaves are thin and ribbon-like, adapted for efficient water movement. Due to habitat loss, it is considered endangered and requires conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia ameliae"
    },
    "taxonomy_art_desc": "Abronia ameliae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often adapted to arid environments. Its family is Nyctaginaceae, known as the four-o'clock family, which includes plants with showy flowers that often open in the late afternoon. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their vibrant flowers and succulent leaves. Its species is Abronia ameliae, a specific plant within the genus Abronia, known for its unique floral characteristics and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia ameliae is primarily native to Texas. This rare plant is found in specific regions within the state, particularly in the Edwards Plateau and surrounding areas. It thrives in rocky, well-drained soils and is often associated with limestone habitats. Due to its limited range and habitat specificity, it is considered a vulnerable species. Conservation efforts are ongoing to protect its natural environment from threats such as habitat loss and climate change.",
    "distribution_introduced_art_desc": "Abronia ameliae was mainly introduced to the coastal regions of southern California and northern Baja California. It thrives in sandy and gravelly soils along the shoreline. This plant is often found in areas with mild, temperate climates and moderate coastal winds. It has adapted to the unique environmental conditions of its introduced range. However, its presence has raised concerns about its potential impact on native ecosystems."
}
