{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia villosa",
    "plant_slug": "abronia-villosa",
    "plant_name_scientific": "abronia villosa",
    "intro": "Abronia villosa, commonly known as the hairy bladderpod, is a flowering plant native to the western United States and parts of Mexico. It belongs to the family Brassicaceae, which includes many other flowering plants with small, four-petaled flowers. The plant is characterized by its hairy stems and leaves, as well as its distinctive seed pods that resemble bladders. It typically grows in dry, disturbed soils and is often found in grasslands and along roadsides. Abronia villosa plays a role in local ecosystems by providing nectar for pollinators and serving as a host plant for certain insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia villosa"
    },
    "taxonomy_art_desc": "Abronia villosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of growth forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, which consists of flowering plants often with showy flowers and includes families like the cacti and nightshade. Its family is Nyctaginaceae, known as the four-o'clock family, which includes plants with vibrant flowers that open in the late afternoon. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their showy, often red or orange flowers. Its species is Abronia villosa, a specific plant within the genus Abronia, known for its hairy foliage and distinctive floral structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Mexico Northwest",
        "Nevada",
        "Utah"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia villosa is primarily native to Arizona, California, Mexico Northwest, Nevada, and Utah. This species is commonly found in arid and semi-arid regions within these states. It thrives in sandy or gravelly soils, often in open habitats such as deserts and scrublands. The plant is well adapted to the dry climate and can survive with minimal water. Its distribution reflects its preference for specific ecological conditions found in these regions.",
    "distribution_introduced_art_desc": "Abronia villosa was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as forests and along stream banks. This plant is known for its hairy stems and small, bell-shaped flowers that bloom in the spring. It has been observed spreading in areas where its natural habitat overlaps with disturbed or cultivated land. Due to its adaptability, it has become a common sight in many local ecosystems."
}
