{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum pedunculare",
    "plant_slug": "abrotanum-pedunculare",
    "plant_name_scientific": "abrotanum pedunculare",
    "intro": "Abrotanum pedunculare, commonly known as the slender milkweed, is a flowering plant native to South America. It belongs to the Apocynaceae family and is characterized by its erect, branched stems and opposite, ovate leaves. The plant produces small, clustered flowers that are typically pink or white, with five petals and a prominent central stamen. Its milky sap contains toxic compounds, which serve as a defense mechanism against herbivores. Abrotanum pedunculare is often found in dry, open habitats such as grasslands and rocky areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum pedunculare is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky, and coastal environments, often found in sunny, well-drained soils. This plant is commonly associated with Mediterranean scrublands and maquis vegetation. It is also found in some areas of the Middle East and the Canary Islands. Its distribution is closely linked to the climate and ecological conditions of the Mediterranean basin.",
    "distribution_introduced_art_desc": "Abrotanum pedunculare was mainly introduced to the Pacific Northwest region of the United States. It was initially brought in for its ornamental value due to its attractive yellow flowers. The plant has since spread beyond cultivated areas into natural habitats, particularly in disturbed soils and open woodlands. Its rapid growth and adaptability have raised concerns about its potential to become invasive. Despite its beauty, it is now monitored to prevent ecological disruption in native plant communities."
}
