{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia exalata",
    "plant_slug": "abronia-exalata",
    "plant_name_scientific": "abronia exalata",
    "intro": "Abronia exalata, commonly known as the rock daisy, is a flowering plant native to the arid regions of South America. It belongs to the Malvaceae family and is characterized by its compact, evergreen growth habit. The plant produces showy, pink or purple flowers that bloom in spring and summer. Its leaves are typically fleshy and succulent, adapted to store water in its native dry environment. Abronia exalata thrives in well-drained soil and full sun, making it a suitable choice for rock gardens and xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia exalata is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in coastal areas, particularly in the Florida Panhandle and the Florida Keys. This plant thrives in sandy, well-drained soils along the shores of the Atlantic and Gulf coasts. It is often associated with dune ecosystems and is adapted to salt spray and periodic flooding. Due to its limited range, it is considered a rare and endangered species in some regions.",
    "distribution_introduced_art_desc": "Abronia exalata was mainly introduced to areas with sandy soils and coastal environments, particularly in the western United States. It thrives in dunes and maritime habitats where it can receive ample sunlight. This plant is often found in regions with a Mediterranean climate, characterized by dry summers and wet winters. Its introduction has sometimes led to competition with native species in these ecosystems. However, it is generally considered a non-invasive species in its introduced range."
}
