{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum elongatum",
    "plant_slug": "abrodictyum-elongatum",
    "plant_name_scientific": "abrodictyum elongatum",
    "intro": "Abrodictyum elongatum, commonly known as the long-stemmed orchid, is a terrestrial orchid native to South America. It is characterized by its slender, erect stems and lance-shaped leaves. The plant produces pendant flowers that are typically yellow or greenish-yellow in color. It thrives in humid, shaded environments and requires well-drained soil. Abrodictyum elongatum is often cultivated for its ornamental value and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum elongatum is primarily native to southern Africa, specifically South Africa. It is found in the eastern and western parts of the country, including the provinces of KwaZulu-Natal, Mpumalanga, and the Eastern Cape. This plant typically grows in rocky outcrops and open grasslands. It is adapted to the Mediterranean climate of the region, with dry summers and wet winters. Abrodictyum elongatum is a member of the Asparagaceae family and is known for its attractive, sword-shaped leaves and flowering spikes.",
    "distribution_introduced_art_desc": "Abrodictyum elongatum was mainly introduced to the eastern United States as an ornamental plant due to its unique appearance and hardy nature. It has since spread into natural areas, particularly in the southeastern region, where it thrives in disturbed soils and sunny habitats. This distribution has raised concerns among conservationists because of its potential to outcompete native species. The plant is commonly found in wetlands, roadsides, and along riverbanks, where it can form dense stands. Its rapid growth and adaptability have made it a challenge for ecological management in some areas."
}
