{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum stylosum",
    "plant_slug": "abrodictyum-stylosum",
    "plant_name_scientific": "abrodictyum stylosum",
    "intro": "Abrodictyum stylosum, commonly known as the slender spider orchid, is a flowering plant native to southern Africa. It belongs to the Orchidaceae family and is characterized by its slender, grass-like leaves and delicate, spider-like flowers. The plant typically grows in rocky or sandy soils and thrives in sunny to partially shaded environments. Its flowers are usually pale green to yellowish in color, with a distinctive, elongated shape. Abrodictyum stylosum is a perennial herb that produces small, fragrant blooms during the summer months.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum stylosum is primarily native to South America, particularly in regions of Brazil, Paraguay, and Argentina. It is commonly found in the Pantanal wetland ecosystem, which spans across these countries. This plant thrives in moist, open habitats such as grasslands and seasonally flooded areas. It is often associated with riparian zones and is adapted to the seasonal variations in water availability. Its distribution is closely linked to the unique environmental conditions of the Southern Cone region.",
    "distribution_introduced_art_desc": "Abrodictyum stylosum was mainly introduced to the United States as an ornamental plant due to its attractive, showy flowers. It is commonly found in gardens and cultivated areas, particularly in regions with warm, humid climates. The plant is often propagated through division or seed, making it relatively easy to grow in suitable conditions. However, it has the potential to become invasive in certain environments if not managed properly. Its introduction has raised concerns among conservationists due to its ability to spread rapidly in natural habitats."
}
