{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia carterae",
    "plant_slug": "abronia-carterae",
    "plant_name_scientific": "abronia carterae",
    "intro": "Abronia carterae, commonly known as Carter's bladderwort, is a small, aquatic plant native to the southeastern United States. It is characterized by its tiny, bladder-like structures called vesicles, which are used to trap small aquatic organisms. The plant typically grows in shallow, freshwater habitats such as ponds and ditches. Its leaves are often submerged, while its flowering stems emerge above the water surface. Abronia carterae plays a role in aquatic ecosystems by providing habitat and food for various microorganisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia carterae is primarily native to the southeastern United States, specifically Florida and the coastal regions of Georgia. It is commonly found in moist, sandy soils along the Atlantic and Gulf coasts. This plant thrives in open, sunny habitats such as dunes, scrublands, and coastal prairies. It is an important component of the local flora in these ecosystems. Due to its limited range, it is considered a rare and endangered species in some areas.",
    "distribution_introduced_art_desc": "Abronia carterae was mainly introduced to the southeastern United States, particularly in coastal regions of Georgia and South Carolina. It is commonly found in sandy, well-drained soils along dunes and maritime forests. The plant thrives in humid, coastal environments with high salinity and frequent wind exposure. It is often associated with disturbed habitats and has been observed in areas affected by human activity. Due to its hardy nature, it has become a common invasive species in some coastal areas."
}
