{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia × alba",
    "plant_slug": "abronia-×-alba",
    "plant_name_scientific": "abronia × alba",
    "intro": "Abronia × alba, commonly known as the white sand verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a hybrid species resulting from the cross between Abronia umbellata and Abronia tetragona. The plant is characterized by its delicate, white to pale pink flowers that bloom in late spring to early summer. It thrives in well-drained sandy soils and is often found in coastal dunes and rocky habitats. The species is notable for its ornamental value and its role in supporting local pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia × alba"
    },
    "taxonomy_art_desc": "Abronia × alba belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with specialized adaptations to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers and often has a distinctive scent. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their succulent leaves and colorful flowers. Its species is Abronia × alba, a hybrid plant resulting from the cross between two species of Abronia, known for its white flowers and succulent foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia × alba is primarily native to California. It is found in the coastal areas of southern California, particularly in the regions of San Diego and San Luis Obispo counties. This plant thrives in sandy or gravelly soils along the coastline. It is often seen growing in dunes or on rocky outcrops. Its distribution is limited to specific habitats within the state due to its ecological requirements.",
    "distribution_introduced_art_desc": "Abronia × alba was mainly introduced to coastal dunes and sandy soils in the Pacific Northwest of the United States. It thrives in areas with well-drained soil and full sun exposure. This plant is commonly found in regions with mild, temperate climates. Its introduction has led to its establishment in several natural habitats along the coastline. However, it is considered a non-native species in these areas."
}
