{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum pluma",
    "plant_slug": "abrodictyum-pluma",
    "plant_name_scientific": "abrodictyum pluma",
    "intro": "Abrodictyum pluma, commonly known as the feather-tongue orchid, is a member of the Orchidaceae family. It is native to South America, particularly Brazil, and thrives in humid, tropical environments. The plant is characterized by its long, slender leaves and striking, feather-like floral structures. Its flowers are typically white or pale pink, with intricate patterns that aid in pollination by specific insect species. Due to its unique appearance and habitat requirements, it is a sought-after plant among orchid enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum pluma is primarily native to the southern United States, particularly Texas and New Mexico. It thrives in arid and semi-arid environments, often found in rocky soils and open woodlands. This plant is well adapted to the hot, dry climate of its native range. It is commonly associated with limestone outcrops and can be found in areas with good drainage. Its distribution is limited to specific regions within the southwestern United States.",
    "distribution_introduced_art_desc": "Abrodictyum pluma was mainly introduced to the United States as an ornamental plant due to its unique and attractive foliage. It is commonly found in regions with warm, humid climates, particularly in the southeastern states. The plant is often cultivated in gardens and landscapes for its aesthetic value. However, it has raised concerns due to its potential to become invasive in certain environments. Its distribution has been expanding beyond its original range, prompting discussions about its ecological impact."
}
