{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia bigelovii",
    "plant_slug": "abronia-bigelovii",
    "plant_name_scientific": "abronia bigelovii",
    "intro": "Abronia bigelovii, commonly known as the desert sand verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a low-growing annual herb with narrow, hairy leaves and produces clusters of small, pink to purple flowers. The plant thrives in sandy or gravelly soils and is adapted to arid environments. It plays a role in stabilizing desert soils and providing nectar for pollinators. Its botanical features reflect its evolutionary adaptation to harsh, dry conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia bigelovii"
    },
    "taxonomy_art_desc": "Abronia bigelovii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and often having spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like carnations and beets, often with specialized water-storing tissues and a variety of flower forms. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers that often open in the evening. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their succulent leaves and showy, often brightly colored flowers. Its species is Abronia bigelovii, a specific type of plant within the genus Abronia, known for its distinctive appearance and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Mexico"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia bigelovii is primarily native to New Mexico. It is found in the arid and semi-arid regions of the state, particularly in the southwestern and central parts. This plant thrives in sandy or gravelly soils and is often found in desert scrub habitats. It is a small, flowering plant that contributes to the biodiversity of its native range. Due to its limited distribution, it is considered a rare and endemic species within New Mexico.",
    "distribution_introduced_art_desc": "Abronia bigelovii was mainly introduced to the western United States, particularly in California and Nevada. It is commonly found in disturbed soils and along roadsides, where it thrives in dry, sunny conditions. This plant has been documented in several counties across these regions, often in areas with low vegetation cover. Its introduction has led to its establishment in both natural and anthropogenic habitats. However, it is considered a non-native species and is not widely distributed beyond these specific locations."
}
