{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia ammophila",
    "plant_slug": "abronia-ammophila",
    "plant_name_scientific": "abronia ammophila",
    "intro": "Abronia ammophila, commonly known as the sand verbena, is a flowering plant native to the coastal dunes of southern Africa. It is a low-growing perennial that produces small, showy flowers in shades of pink and purple. The plant thrives in sandy, well-drained soils and is adapted to coastal environments with high salt exposure. Its leaves are typically narrow and succulent, helping it retain moisture in arid conditions. Abronia ammophila plays an important ecological role in stabilizing dune systems and providing habitat for various insects and small animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia ammophila"
    },
    "taxonomy_art_desc": "Abronia ammophila belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their algal relatives, characterized by their complex structures and ability to photosynthesize. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and a wide range of habitats. Its order is Caryophyllales, which comprises flowering plants with a diverse array of forms, including many succulents and plants with specialized adaptations to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers that often open in the late afternoon. Its genus is Abronia, a group of flowering plants native to arid regions of the Americas, typically characterized by their succulent leaves and vibrant flowers. Its species is Abronia ammophila, a specific plant within the genus Abronia, known for its adaptations to sandy and coastal environments, with distinctive pink or red flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Wyoming"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia ammophila is primarily native to Wyoming. This plant is found in the arid and semi-arid regions of the state, particularly in areas with sandy or gravelly soils. It thrives in open habitats such as dunes, grasslands, and disturbed sites. The species is adapted to the dry climate and can tolerate extreme temperature fluctuations. Its limited distribution makes it a rare and ecologically significant plant in Wyoming.",
    "distribution_introduced_art_desc": "Abronia ammophila was mainly introduced to coastal dunes and sandy soils where it can thrive in well-drained conditions. It is often found in areas with minimal vegetation, preferring full sun exposure. This plant has been reported in several coastal regions, including parts of the southeastern United States. Its introduction has been associated with human activity, such as coastal development and landscaping. However, its ecological impact remains largely understudied."
}
