{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrophyllum ornans var. microcarpum",
    "plant_slug": "abrophyllum-ornans-var-microcarpum",
    "plant_name_scientific": "abrophyllum ornans var. microcarpum",
    "intro": "Abrophyllum ornans var. microcarpum, commonly known as the small-fruited ornate abrophyllum, is a rare and delicate flowering plant native to specific regions of southern Africa. It is characterized by its compact, mat-forming growth habit and produces small, showy flowers in shades of pink and white. The leaves are narrow and grass-like, often covered in fine hairs, while the flowers are borne on slender stalks. This variety is distinguished by its smaller, more numerous fruits compared to other varieties of Abrophyllum. Due to its limited distribution and specific habitat requirements, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrophyllum ornans var. microcarpum is primarily native to the eastern United States, specifically the southeastern region. It is found in states such as Georgia, South Carolina, and Florida. This plant typically grows in moist, sandy soils along the edges of swamps and in pine flatwood habitats. It is often associated with wetland environments and is adapted to periodic flooding. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abrophyllum ornans var. microcarpum was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It thrives in temperate climates and is often found in woodland edges or shaded gardens. This variety is known for its compact growth habit and ornamental value, making it a popular choice for landscaping. It has been introduced to several regions outside its native range, including parts of Europe and North America. However, its spread is limited due to its specific environmental requirements."
}
