{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia carnea",
    "plant_slug": "abronia-carnea",
    "plant_name_scientific": "abronia carnea",
    "intro": "Abronia carnea, commonly known as the pink sand verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a low-growing shrub with small, pink to purple flowers that bloom in late spring to early summer. The plant has narrow, linear leaves and thrives in well-drained, sandy soils. It is adapted to arid environments and is often found in coastal dunes and rocky habitats. Abronia carnea is an important species for pollinators and is considered a symbol of coastal resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia carnea is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in coastal dunes and sandy habitats along the Atlantic and Gulf coasts. This species thrives in well-drained, sandy soils and is often associated with maritime environments. It is considered a rare and endangered plant due to habitat loss and development. Conservation efforts are ongoing to protect its limited natural range.",
    "distribution_introduced_art_desc": "Abronia carnea was mainly introduced to the coastal dunes and sandy soils of the southeastern United States. It thrives in well-drained, sandy habitats and is often found in areas with full sun exposure. The plant is known for its small, clustered flowers that bloom in the spring. It has been observed spreading along the Atlantic and Gulf coasts, sometimes outcompeting native vegetation. Due to its hardy nature, it is considered an invasive species in some regions where it has established itself."
}
