{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum clathratum",
    "plant_slug": "abrodictyum-clathratum",
    "plant_name_scientific": "abrodictyum clathratum",
    "intro": "Abrodictyum clathratum, commonly known as the glassy orchid, is a striking epiphytic orchid native to the tropical regions of South America. It is characterized by its unique, translucent or glassy appearance, which is due to the intricate, lattice-like structure of its petals and sepals. The plant typically grows on trees or rocks, thriving in humid, shaded environments. Its flowers are usually pale green or white, with a delicate, almost ethereal look. Abrodictyum clathratum is prized for its ornamental value and is often cultivated in specialized greenhouses due to its specific care requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum clathratum is primarily native to southern Africa, specifically South Africa. It is found in the Eastern Cape, Western Cape, and KwaZulu-Natal provinces. This plant thrives in coastal areas and sandy soils along the Atlantic and Indian Ocean coasts. It is commonly found in rocky outcrops and open vegetation types. Its distribution is largely restricted to these specific regions within South Africa.",
    "distribution_introduced_art_desc": "Abrodictyum clathratum was mainly introduced to areas with warm, humid climates and well-drained soils, typically in regions with a subtropical or tropical environment. It is often found in disturbed habitats such as roadsides, open woodlands, and along riverbanks. The plant thrives in full sun to partial shade and is known for its showy, bell-shaped flowers that bloom in spring. Its introduction has been associated with both ornamental horticulture and accidental spread through human activity. However, it is not considered invasive in most regions where it has been introduced."
}
