{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia vespertina",
    "plant_slug": "abronia-vespertina",
    "plant_name_scientific": "abronia vespertina",
    "intro": "Abronia vespertina, commonly known as the evening geranium, is a flowering plant native to the southeastern United States. It belongs to the Geraniaceae family and is characterized by its showy, pink to purple flowers that bloom in the late afternoon. The plant typically grows in moist, sandy soils and thrives in partial to full sun. Its leaves are lance-shaped and covered in fine hairs, contributing to its ornamental appeal. Abronia vespertina is often cultivated in gardens for its vibrant blooms and ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia vespertina is primarily native to the coastal regions of southern California and northern Baja California, Mexico. It thrives in sandy or gravelly soils along the shoreline, often in areas with mild temperatures and moderate moisture. This species is commonly found in dunes, beaches, and coastal scrub habitats. It is well adapted to the harsh conditions of its native environment, including salt spray and strong winds. Due to its restricted range, it is considered a rare and sensitive species within its native distribution.",
    "distribution_introduced_art_desc": "Abronia vespertina was mainly introduced to new environments through human activity, such as horticultural trade and accidental transport. It is commonly found in disturbed soils and open habitats, often near roadsides and urban areas. This plant has adapted well to various climates and can thrive in both coastal and inland regions. Its introduction has led to concerns about its potential impact on native plant communities. However, it is not considered invasive in most areas where it has been introduced."
}
