{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia villosa var. aurita",
    "plant_slug": "abronia-villosa-var-aurita",
    "plant_name_scientific": "abronia villosa var. aurita",
    "intro": "Abronia villosa var. aurita, commonly known as the woolly sand verbena, is a perennial flowering plant native to the southwestern United States and northern Mexico. It is characterized by its soft, hairy foliage and clusters of small, bright yellow flowers. The plant thrives in well-drained, sandy soils and full sun, making it well-suited for arid and semi-arid environments. Its growth habit is low and spreading, often forming dense mats that help prevent soil erosion. The species is valued for its ornamental appeal and ecological benefits, supporting pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia villosa"
    },
    "taxonomy_art_desc": "Abronia villosa var. aurita belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle with distinct sexual and asexual stages. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, characterized by their ability to produce spores. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in temperate regions. Its order is Caryophyllales, a group of flowering plants that includes many species with distinctive flowers and often contain specialized pigments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers that open in the late afternoon. Its genus is Abronia, a group of flowering plants native to the Americas, known for their vibrant flowers and often used in horticulture. Its species is Abronia villosa, a specific plant within the genus Abronia, characterized by its hairy stems and colorful flowers, with the variety aurita being a notable variant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia villosa var. aurita is primarily native to Arizona, California, and the Northwest region of Mexico. This plant is commonly found in rocky and sandy soils in these areas. It thrives in arid and semi-arid environments, often growing in open habitats such as hillsides and dry grasslands. The species is well adapted to the climate and soil conditions of its native range. It is a member of the Geraniaceae family and is known for its distinctive yellow flowers.",
    "distribution_introduced_art_desc": "Abronia villosa var. aurita was mainly introduced to coastal dunes and sandy soils along the Pacific coast of North America. It thrives in areas with well-drained soil and full sun exposure. This plant is known for its distinctive yellow flowers and hairy foliage. It has been documented in several states including California, Oregon, and Washington. Due to its adaptability, it has become a common sight in disturbed coastal habitats."
}
