{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum suave",
    "plant_slug": "abrotanum-suave",
    "plant_name_scientific": "abrotanum suave",
    "intro": "Abrotanum suave, commonly known as sweet everlasting, is a flowering plant native to the Mediterranean region. It belongs to the Asteraceae family and is characterized by its small, showy yellow flowers that bloom in the summer. The plant has aromatic leaves and stems, which are often used in herbal remedies. It thrives in well-drained soil and full sun, making it a popular choice for gardeners. Its common name reflects the pleasant scent it emits and its ability to retain its appearance for long periods.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum suave is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in arid and semi-arid environments, often found in rocky soils and along coastal areas. This plant is commonly associated with dry grasslands and scrublands, where it adapts well to harsh climatic conditions. Its distribution also extends to some regions of the Middle East and the Canary Islands. It is a hardy species that has been introduced to other parts of the world but remains most closely linked to its native habitats.",
    "distribution_introduced_art_desc": "Abrotanum suave was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and disturbed forests. It thrives in regions with moderate to high sunlight exposure and well-drained soil. This plant is often found in the southeastern United States, particularly in states like Texas, Florida, and Georgia. Its introduction has been associated with human activities, including agriculture and land development. Due to its rapid growth and adaptability, it can become invasive in certain ecosystems."
}
