{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia × minor",
    "plant_slug": "abronia-×-minor",
    "plant_name_scientific": "abronia × minor",
    "intro": "Abronia × minor, commonly known as the narrowleaf sandverbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Plantaginaceae family and is characterized by its compact, mat-forming growth habit. The plant produces small, tubular flowers that are typically pink or purple, which bloom in late spring to early summer. It thrives in well-drained soils and full sun, making it well-suited for xeriscaping. Due to its ornamental value and drought tolerance, it is often cultivated in arid landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia × minor"
    },
    "taxonomy_art_desc": "Abronia × minor belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Caryophyllales, a group of flowering plants that includes many plants with showy flowers and often contains species adapted to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with distinctive flowers that open in the late afternoon. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their showy, often brightly colored flowers. Its species is Abronia × minor, a hybrid plant resulting from the cross between two species of Abronia, known for its ornamental value and unique floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia × minor is primarily native to California. This hybrid plant is found in various regions across the state, including coastal and inland areas. It typically grows in sandy or gravelly soils, often in disturbed or open habitats. Its distribution is limited to specific ecological zones within California. Due to its hybrid nature, its exact native range can be difficult to define.",
    "distribution_introduced_art_desc": "Abronia × minor was mainly introduced to areas with well-drained sandy soils and full sun exposure. It is commonly found in coastal dunes and disturbed habitats where it can thrive in harsh environmental conditions. This plant is often cultivated for its ornamental value due to its vibrant flowers and compact growth habit. Its introduction has led to its establishment in several regions outside its native range. However, its spread is generally limited due to its specific ecological requirements."
}
