{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abroma angulosum",
    "plant_slug": "abroma-angulosum",
    "plant_name_scientific": "abroma angulosum",
    "intro": "Abroma angulosum, commonly known as the angular abroma, is a flowering plant native to southern Africa. It is a shrub that typically grows in dry, rocky habitats, showcasing its adaptability to arid environments. The plant produces small, clustered yellow flowers that bloom in summer, adding a vibrant touch to its surroundings. Its leaves are narrow and angular, contributing to its distinctive appearance. Abroma angulosum is valued for its ornamental appeal and is often cultivated in gardens for its unique foliage and seasonal blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abroma angulosum is primarily native to tropical and subtropical regions of Africa, including countries such as South Africa, Kenya, Tanzania, and Madagascar. It is also found in parts of southern Asia, including India and Sri Lanka. This plant typically grows in moist, well-drained soils in forest understories or along riverbanks. It is commonly found in humid environments with high rainfall. Its distribution is closely associated with areas that have a warm climate and adequate moisture throughout the year.",
    "distribution_introduced_art_desc": "Abroma angulosum was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is commonly found in disturbed areas such as roadsides, urban environments, and agricultural fields. The plant spreads rapidly through its prolific seed production and ability to thrive in a variety of soil types. Its introduction has led to concerns about its impact on native vegetation and ecosystem balance. Efforts are ongoing to monitor and control its spread in affected areas."
}
