{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abroma elongatum",
    "plant_slug": "abroma-elongatum",
    "plant_name_scientific": "abroma elongatum",
    "intro": "Abroma elongatum, commonly known as the long-stemmed abroma, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant features showy, trumpet-shaped flowers that are typically pink or purple in color. Its leaves are ovate and slightly hairy, while its stems are slender and often branched. Abroma elongatum is often cultivated for its ornamental value and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abroma elongatum is primarily native to tropical and subtropical regions of Africa, particularly in countries such as South Africa, Kenya, and Tanzania. It is commonly found in open woodland, grasslands, and along riverbanks. This plant thrives in well-drained soils and is often associated with disturbed habitats. It is also present in parts of Madagascar and the Arabian Peninsula. Its distribution is largely limited to the southern hemisphere.",
    "distribution_introduced_art_desc": "Abroma elongatum was mainly introduced to the coastal regions of southern Africa, particularly in countries like South Africa, Namibia, and Mozambique. It is commonly found in sandy or rocky coastal areas where it thrives in well-drained soils. The plant is often seen growing along dunes and near the shoreline, where it plays a role in stabilizing the sand. It is a hardy species that can tolerate salt spray and strong winds, making it well adapted to its coastal environment. Its introduction has been largely unintentional, as it was likely dispersed by wind or water along with other coastal vegetation."
}
