{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia × alba var. variabilis",
    "plant_slug": "abronia-×-alba-var-variabilis",
    "plant_name_scientific": "abronia × alba var. variabilis",
    "intro": "Abronia × alba var. variabilis, commonly known as the variable sand verbena, is a perennial flowering plant native to the coastal regions of California. It is characterized by its low-growing, mat-forming habit and produces small, showy flowers in shades of pink, red, and white. The plant thrives in sandy or gravelly soils and is adapted to coastal climates with high salinity and strong winds. Its foliage is typically covered in fine hairs, which help reduce water loss in arid conditions. This variety is known for its variability in flower color and form, making it a popular choice for coastal gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia × alba var. variabilis is primarily native to the coastal regions of southern California and northern Baja California, Mexico. This plant is commonly found in sandy or gravelly soils along the shoreline. It thrives in areas with mild, Mediterranean-type climates characterized by warm, dry summers and cool, wet winters. The species is often associated with dunes and other coastal habitats. Its distribution is limited to these specific ecological niches along the Pacific coast.",
    "distribution_introduced_art_desc": "Abronia × alba var. variabilis was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in coastal and inland regions with sandy or gravelly soils. This variety is known for its striking white and pink flowers that bloom in late spring to early summer. It thrives in full sun and is often used in native plant gardens due to its ornamental value. However, it requires well-drained soil and is sensitive to prolonged moisture."
}
