{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella rosulata",
    "plant_slug": "abrotanella-rosulata",
    "plant_name_scientific": "abrotanella rosulata",
    "intro": "Abrotanella rosulata, commonly known as the clustered rockrose, is a flowering plant native to the southwestern United States and northern Mexico. It is a low-growing shrub with silver-gray foliage and is characterized by its dense, rosette-like growth habit. The plant produces clusters of small, yellowish flowers that bloom in the spring and early summer. It is adapted to arid and rocky environments, making it drought-tolerant and suitable for xeriscaping. Its ornamental value comes from its attractive foliage and delicate floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella rosulata"
    },
    "taxonomy_art_desc": "Abrotanella rosulata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Asterales, a group of flowering plants that includes many familiar families such as the sunflowers and daisies, characterized by their composite flower heads. Its family is Asteraceae, commonly known as the sunflower family, which is one of the largest families of flowering plants, featuring flowers arranged in a head. Its genus is Abrotanella, a group of flowering plants native to South America, typically characterized by their small, showy flowers and hairy foliage. Its species is Abrotanella rosulata, a specific plant within the genus Abrotanella, known for its distinctive rosette growth habit and is often found in arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Antipodean Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella rosulata is primarily native to the Antipodean Islands. This plant is found in the unique ecosystems of these remote islands, which are located in the Southern Ocean. It thrives in the harsh, windy conditions typical of the region. The Antipodean Islands are known for their isolated and pristine environments, supporting a variety of endemic species. Abrotanella rosulata is an important component of the local flora, adapted to the specific climate and soil conditions of its native habitat.",
    "distribution_introduced_art_desc": "Abrotanella rosulata was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in coastal areas and disturbed soils, often growing in open habitats such as dunes and grasslands. The plant is known for its small, clustered flowers and is often considered a weed in agricultural settings. It has been reported in several states including Oregon, Washington, and California. Due to its adaptability, it has spread beyond its original introduction sites and is now considered an invasive species in some areas."
}
