{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia villosa var. pinetorum",
    "plant_slug": "abronia-villosa-var-pinetorum",
    "plant_name_scientific": "abronia villosa var. pinetorum",
    "intro": "Abronia villosa var. pinetorum, commonly known as the coastal bluemouth, is a flowering plant native to the sandy soils of the Pacific coast. It is characterized by its low-growing, mat-forming habit and produces showy blue to purple flowers that bloom in late spring. The plant has silvery-gray foliage covered in fine, fuzzy hairs, which help reduce water loss in its arid habitat. It thrives in well-drained soils and is often found in coastal dunes and sandy beaches. This variety is valued for its ornamental appeal and ecological role in stabilizing coastal ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia villosa var. pinetorum is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in sandy soils within coastal dunes and maritime hammocks. This variety thrives in well-drained, acidic conditions and is often associated with maritime ecosystems. It is a rare and endangered plant, with limited distribution along the Atlantic coast. Conservation efforts are underway to protect its habitat from development and environmental degradation.",
    "distribution_introduced_art_desc": "Abronia villosa var. pinetorum was mainly introduced to coastal dunes and sandy soils in the southeastern United States. It thrives in well-drained, nutrient-poor environments typical of beachfront areas. This plant is often found growing in association with other dune vegetation such as Ammophila and Distichia. Its introduction has been documented in several states including North Carolina, South Carolina, and Georgia. However, it is considered a non-native species in these regions and is sometimes classified as an invasive plant."
}
