{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia mellifera var. pahoveorum",
    "plant_slug": "abronia-mellifera-var-pahoveorum",
    "plant_name_scientific": "abronia mellifera var. pahoveorum",
    "intro": "Abronia mellifera var. pahoveorum, commonly known as the Pahovean sandverbena, is a flowering plant native to the southwestern United States. It belongs to the family Scrophulariaceae and is characterized by its low-growing, mat-forming habit. The plant produces small, tubular flowers that are typically pink or purple in color, adapted for pollination by insects. It thrives in well-drained soils and is often found in arid or semi-arid environments. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia mellifera"
    },
    "taxonomy_art_desc": "Abronia mellifera var. pahoveorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and vascular tissues. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with diverse morphological features. Its order is Caryophyllales, a group of flowering plants that includes many succulent and ornamental species, often with specialized adaptations to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, characterized by showy flowers and often containing plants with milky sap. Its genus is Abronia, a group of flowering plants native to the Americas, typically featuring succulent stems and showy, often pink or red flowers. Its species is Abronia mellifera, a specific plant within the genus Abronia, known for its distinctive floral characteristics and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Idaho"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia mellifera var. pahoveorum is primarily native to Idaho. This plant is found in specific regions within the state, particularly in areas with suitable habitat conditions. It thrives in dry, rocky soils and is often associated with sagebrush steppe ecosystems. The variety is known for its small, clustered flowers and is adapted to the arid climate of Idaho. Due to its limited distribution, it is considered a rare and endemic species within the region.",
    "distribution_introduced_art_desc": "Abronia mellifera var. pahoveorum was mainly introduced to areas with well-drained sandy soils and full sun exposure. It is commonly found in coastal dunes and sandy plains where it thrives in dry, coastal environments. This plant is known for its small, showy flowers that attract pollinators such as bees and butterflies. It has been successfully established in several botanical gardens and conservation areas. Due to its adaptability, it is considered a valuable species for ecological restoration projects."
}
