{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrophyllum ornans",
    "plant_slug": "abrophyllum-ornans",
    "plant_name_scientific": "abrophyllum ornans",
    "intro": "Abrophyllum ornans, commonly known as the ornate abrophyllum, is a flowering plant native to the tropical regions of South America. It belongs to the family Malvaceae, which includes hibiscus and cotton. The plant is characterized by its showy, trumpet-shaped flowers that range in color from white to pink and purple. Its leaves are palmately lobed and often have a velvety texture. Abrophyllum ornans is often cultivated for its ornamental value in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Rousseaceae",
        "genus": "Abrophyllum",
        "species": "Abrophyllum ornans"
    },
    "taxonomy_art_desc": "Abrophyllum ornans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their closest algal relatives. Its class is Equisetopsida, which comprises ferns, horsetails, and their allies. Its subclass is Magnoliidae, a group of flowering plants characterized by their complex floral structures. Its order is Asterales, which includes plants such as daisies and sunflowers, known for their showy flowers. Its family is Rousseaceae, a group of flowering plants that includes species with diverse morphological features. Its genus is Abrophyllum, a relatively small group of flowering plants with unique floral and vegetative characteristics. Its species is Abrophyllum ornans, a specific plant within the genus Abrophyllum, distinguished by its particular morphology and genetic makeup.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrophyllum ornans is primarily native to New South Wales and Queensland in Australia. This species is commonly found in coastal and sandy areas within these regions. It thrives in well-drained soils and is often associated with dune environments. The plant is well adapted to the temperate and subtropical climates of these states. It plays an important ecological role in stabilizing coastal dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Abrophyllum ornans was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its striking silver foliage and unique appearance. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, well-drained soils and can spread rapidly through seed dispersal. Its introduction has raised concerns among ecologists about its impact on local ecosystems."
}
