{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abromeitiella chlorantha",
    "plant_slug": "abromeitiella-chlorantha",
    "plant_name_scientific": "abromeitiella chlorantha",
    "intro": "Abromeitiella chlorantha, commonly known as the blue-eyed grass, is a flowering plant native to the eastern United States. It belongs to the family Poaceae, which includes grasses, and is characterized by its slender, grass-like appearance. The plant produces small, spike-like inflorescences with blue or purple flowers that bloom in early spring. Its leaves are narrow and grassy, often growing in dense clumps. Abromeitiella chlorantha is typically found in moist, open habitats such as meadows and wetlands.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abromeitiella chlorantha is primarily native to the western United States and parts of northern Mexico. It is commonly found in arid and semi-arid regions, particularly in areas with well-drained soils. This plant thrives in open habitats such as grasslands, disturbed sites, and along roadsides. It is often associated with the Great Basin and Mojave Desert ecosystems. Its distribution spans across states like California, Nevada, Utah, and Arizona.",
    "distribution_introduced_art_desc": "Abromeitiella chlorantha was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and waste areas. It thrives in environments with full sun exposure and well-drained soil. This plant is often found in regions with a temperate climate and moderate rainfall. Its introduction has been associated with human activities, including agriculture and land development. Due to its adaptability, it has become a common weed in many parts of the world."
}
