{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia sparsifolia",
    "plant_slug": "abronia-sparsifolia",
    "plant_name_scientific": "abronia sparsifolia",
    "intro": "Abronia sparsifolia, commonly known as the coastal bellflower, is a flowering plant native to the coastal regions of California and Baja California. It is characterized by its delicate, bell-shaped flowers that range in color from white to pale purple. The plant typically grows in sandy or gravelly soils along the shoreline, where it thrives in the salty, windy conditions. Its leaves are narrow and linear, often covered in fine hairs to reduce water loss. Abronia sparsifolia plays an important ecological role in stabilizing dunes and providing habitat for coastal wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia sparsifolia is primarily native to the southwestern United States and northern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Texas. This plant typically grows in rocky or sandy soils in desert or semi-arid environments. It is commonly associated with limestone outcrops and canyons. Its native range includes areas with low rainfall and high sun exposure.",
    "distribution_introduced_art_desc": "Abronia sparsifolia was mainly introduced to coastal dunes and sandy soils in the Pacific Northwest of the United States. It is commonly found in areas with well-drained soil and full sun exposure. This plant has become naturalized in several regions, often thriving in disturbed or open habitats. Its introduction has raised concerns due to its potential to outcompete native vegetation. It is now considered a weed in some areas where it has spread beyond its original cultivation sites."
}
