{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia suksdorfii",
    "plant_slug": "abronia-suksdorfii",
    "plant_name_scientific": "abronia suksdorfii",
    "intro": "Abronia suksdorfii, commonly known as the Saksdorf's bladderwort, is a rare aquatic plant belonging to the family Lentibulariaceae. It is characterized by its small, bladder-like structures that trap small aquatic organisms, aiding in its nutrient acquisition. This plant typically grows in shallow, freshwater environments such as ponds and wetlands. Its leaves are often submerged, while its flowers are aerial, featuring distinctive blue or purple petals. Due to its limited distribution and specific habitat requirements, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia suksdorfii is primarily native to the southern United States, specifically found in Texas and New Mexico. It grows in arid and semi-arid environments, often in rocky or sandy soils. This plant is adapted to survive in regions with low rainfall and high temperatures. It is commonly found in desert scrub and grassland habitats. Due to its limited range, it is considered a rare and endemic species in these areas.",
    "distribution_introduced_art_desc": "Abronia suksdorfii was mainly introduced to areas with sandy or gravelly soils, typically in coastal or inland dunes. It thrives in arid and semi-arid environments where it can receive adequate sunlight. The plant is often found in regions with low rainfall and high temperatures. Its introduction has been noted in parts of the Mediterranean and along the western coasts of North Africa. Due to its adaptability, it has become a common invasive species in some regions outside its native range."
}
