{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum virgatum",
    "plant_slug": "abrotanum-virgatum",
    "plant_name_scientific": "abrotanum virgatum",
    "intro": "Abrotanum virgatum, commonly known as Virgin's balm, is a flowering plant native to southern Europe and western Asia. It is a low-growing shrub that typically reaches a height of about 30 centimeters. The plant features small, yellow flowers that bloom in clusters during the summer months. Its leaves are narrow and covered in fine hairs, giving them a slightly fuzzy texture. Abrotanum virgatum is often found in dry, rocky soils and is adapted to thrive in sunny, well-drained environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum virgatum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It is commonly found in dry, rocky, and coastal areas, often growing in well-drained soils. This plant thrives in temperate climates and is adapted to withstand drought conditions. It is also known to occur in the Canary Islands and parts of the Middle East. Its native range extends into southern Europe, such as Spain and Italy, where it is often found in scrublands and open woodlands.",
    "distribution_introduced_art_desc": "Abrotanum virgatum was mainly introduced to the United States as an ornamental plant due to its attractive yellow flowers and drought tolerance. It was also used historically for its medicinal properties, including its potential antiseptic and anti-inflammatory effects. However, it has since become invasive in some regions, outcompeting native vegetation and altering local ecosystems. Its spread has been facilitated by its ability to thrive in disturbed soils and its rapid growth rate. As a result, it is now considered a weed in several states, requiring management to prevent further ecological impact."
}
