{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abroma tomentosum",
    "plant_slug": "abroma-tomentosum",
    "plant_name_scientific": "abroma tomentosum",
    "intro": "Abroma tomentosum, commonly known as the woolly abroma, is a flowering plant native to tropical and subtropical regions of Africa, Asia, and the Pacific. It is a shrub characterized by its soft, hairy leaves and clusters of small, fragrant flowers that range in color from white to pink. The plant produces small, round fruits that contain several seeds. It thrives in well-drained soil and prefers full sun to partial shade. Due to its ornamental value, it is often cultivated in gardens and used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abroma tomentosum is primarily native to Southeast Asia, including countries such as India, Sri Lanka, and parts of Indonesia. It is commonly found in tropical and subtropical regions, particularly in areas with moist, well-drained soils. This plant thrives in open habitats like forests, grasslands, and disturbed areas. It is often seen growing along roadsides and in coastal regions. Its distribution extends to some parts of Africa and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abroma tomentosum was mainly introduced to Hawaii, where it has become an invasive species. It was likely brought there accidentally through human activity, such as shipping or horticultural trade. The plant thrives in disturbed areas and can outcompete native vegetation. Its spread has raised concerns due to its potential to alter local ecosystems. Efforts are being made to control its population to protect native plant communities."
}
