{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia glauca",
    "plant_slug": "abronia-glauca",
    "plant_name_scientific": "abronia glauca",
    "intro": "Abronia glauca, commonly known as the blueflower sandverbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a low-growing perennial shrub that typically reaches heights of 10–30 centimeters. The plant produces small, tubular blue or violet flowers that bloom in late spring to early summer. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Its leaves are usually narrow and gray-green, often covered in a fine layer of white hair.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia glauca is primarily native to the coastal regions of southern California and northern Baja California, Mexico. It thrives in sandy or gravelly soils along the shoreline, often in areas with mild temperatures and moderate rainfall. This plant is commonly found in dunes and other coastal habitats where it can tolerate salt spray and wind. Its distribution is limited to these specific environments, making it a characteristic species of the California coast. Due to its restricted range, Abronia glauca is considered a rare and endemic plant in its native habitat.",
    "distribution_introduced_art_desc": "Abronia glauca was mainly introduced to the western United States, particularly in California and Oregon. It thrives in coastal dunes and sandy soils, where it forms dense, low-growing mats. This plant has become an important component of the local ecosystem, providing habitat and food for various insects and small animals. However, its spread has also raised concerns about its impact on native plant species. Due to its hardiness and adaptability, it has been widely cultivated in gardens and restoration projects."
}
