{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum boninense",
    "plant_slug": "abrodictyum-boninense",
    "plant_name_scientific": "abrodictyum boninense",
    "intro": "Abrodictyum boninense, commonly known as the Bonin orchid, is a rare and endemic species native to the Bonin Islands. It is a terrestrial orchid with a slender, erect stem and narrow, grass-like leaves. The plant produces small, greenish-white flowers that are clustered in a raceme, typical of the Orchidaceae family. It thrives in humid, shaded environments and requires well-drained soil. Due to its limited distribution and habitat threats, it is considered vulnerable to extinction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum boninense is primarily native to the Bonin Islands, which are a group of islands located in the Pacific Ocean, approximately 600 kilometers south of Tokyo. This rare orchid is found exclusively in the subtropical climate of these islands. It thrives in the moist, shaded environments of the island's forests and is often associated with rocky or coastal habitats. Due to its limited range and habitat specificity, it is considered a critically endangered species. Conservation efforts are ongoing to protect this unique plant from threats such as habitat loss and invasive species.",
    "distribution_introduced_art_desc": "Abrodictyum boninense was mainly introduced to the Bonin Islands, where it has established itself in specific microhabitats. This plant is typically found in shaded, moist environments within forest understories. It is considered an invasive species due to its rapid growth and ability to outcompete native flora. The distribution of Abrodictyum boninense is limited to areas with suitable soil and humidity conditions. Conservation efforts are underway to control its spread and protect endemic plant species."
}
