{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia fragrans var. harrisii",
    "plant_slug": "abronia-fragrans-var-harrisii",
    "plant_name_scientific": "abronia fragrans var. harrisii",
    "intro": "Abronia fragrans var. harrisii, commonly known as the Harris's sweetshrub, is a flowering plant native to the southeastern United States. It belongs to the Geraniaceae family and is characterized by its aromatic, fragrant leaves and showy, pinkish-white flowers. The plant typically grows in moist, well-drained soils in woodland or swampy habitats. Its compact growth habit and seasonal blooming make it a distinctive addition to native plant gardens. The variety harrisii is distinguished by its specific geographic distribution and unique floral characteristics.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia fragrans var. harrisii is primarily native to the coastal regions of southern California, specifically within the counties of San Diego and San Luis Obispo. This variety thrives in sandy soils along the shorelines and dunes of the Pacific coast. It is commonly found in areas with mild, Mediterranean climates characterized by warm, dry summers and cool, wet winters. The plant is adapted to withstand salt spray and is often seen growing in association with other coastal flora. Its distribution is limited to these specific habitats, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Abronia fragrans var. harrisii was mainly introduced to areas with well-drained sandy soils and full sun exposure. It is commonly found in coastal dunes and disturbed habitats along the Pacific coast. This plant thrives in maritime climates with moderate rainfall and salt spray tolerance. It is often used in restoration projects due to its hardy nature and ability to stabilize sandy soils. However, its introduction has raised concerns about its potential impact on native plant communities."
}
