{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum brachylobium",
    "plant_slug": "abrotanum-brachylobium",
    "plant_name_scientific": "abrotanum brachylobium",
    "intro": "Abrotanum brachylobium, commonly known as the narrow-leafed abrotanum, is a flowering plant native to southern Africa. It is a herbaceous perennial that typically grows in dry, sandy soils. The plant features small, greenish-white flowers that bloom in clusters during the warmer months. Its leaves are narrow and often have a slightly hairy texture. It is valued in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum brachylobium is primarily native to the southern United States, specifically Texas and New Mexico. It is commonly found in arid and semi-arid regions, including plains and rocky hills. This plant thrives in well-drained soils and is often seen in open habitats such as grasslands and disturbed areas. It is adapted to hot, dry climates and is part of the Asteraceae family. Its distribution is limited to specific regions within the southwestern United States.",
    "distribution_introduced_art_desc": "Abrotanum brachylobium was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and disturbed forests. It thrives in regions with full sun to partial shade and well-drained soil. This plant is often found in the southeastern United States, particularly in states like Florida, Georgia, and South Carolina. Its introduction has led to its establishment in both natural and human-altered environments. It is considered an invasive species in some areas due to its rapid growth and competitive nature."
}
