{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia bakeri",
    "plant_slug": "abronia-bakeri",
    "plant_name_scientific": "abronia bakeri",
    "intro": "Abronia bakeri, commonly known as the Baker's sand verbena, is a flowering plant native to the coastal regions of southern California. It is a low-growing annual herb that typically reaches a height of about 10 to 20 centimeters. The plant produces small, showy flowers in shades of pink and purple, which bloom from late spring to early summer. It thrives in sandy, well-drained soils and is adapted to the harsh coastal climate. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia bakeri is primarily native to the coastal dunes of southern California, specifically in the vicinity of the Santa Barbara Channel. It thrives in sandy, well-drained soils and is often found in areas with mild, Mediterranean-type climates. This species is adapted to the unique environmental conditions of its coastal habitat, including salt spray and seasonal droughts. It is considered a rare and endemic plant, found only in a few isolated locations along the California coast. Due to habitat loss and development, Abronia bakeri is also listed as a threatened species in some conservation programs.",
    "distribution_introduced_art_desc": "Abronia bakeri was mainly introduced to the coastal dunes and sandy soils of southern California. It was first discovered in 2005 near the town of Baker, California, where it thrives in the unique microclimate of the region. The plant is characterized by its small, hairy leaves and yellow flowers, which bloom in the spring. Due to its limited range and specific habitat requirements, it is considered a rare and endangered species. Conservation efforts are ongoing to protect and preserve its natural habitat from development and invasive species."
}
