{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia latifolia",
    "plant_slug": "abronia-latifolia",
    "plant_name_scientific": "abronia latifolia",
    "intro": "Abronia latifolia, commonly known as the broadleaf sand verbena, is a flowering plant native to the southwestern United States and northwestern Mexico. It is a low-growing perennial shrub that typically reaches heights of 10–30 centimeters. The plant features narrow, lance-shaped leaves and produces clusters of small, pink or purple flowers. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Abronia latifolia is often found in sandy or gravelly habitats, such as coastal dunes and desert scrublands.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia latifolia"
    },
    "taxonomy_art_desc": "Abronia latifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers and often has a preference for moist soils. Its genus is Abronia, a group of flowering plants native to South America, characterized by their succulent leaves and colorful flowers. Its species is Abronia latifolia, a specific plant within the genus Abronia known for its broad leaves and vibrant flowers, typically found in coastal and sandy habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "British Columbia",
        "California",
        "Oregon",
        "Washington"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia latifolia is primarily native to British Columbia, California, Oregon, and Washington. This plant is commonly found in coastal and inland areas, often in sandy or gravelly soils. It thrives in dry, open habitats such as dunes, grasslands, and disturbed sites. The species is known for its small, showy flowers that bloom in the spring. It plays an important role in the local ecosystems of these regions.",
    "distribution_introduced_art_desc": "Abronia latifolia was mainly introduced to coastal areas and sandy soils in the Pacific Northwest of the United States. It is commonly found in dune environments and along the shores of Oregon and Washington. This plant thrives in well-drained, sandy soils and full sun exposure. It is often used for erosion control due to its hardy nature and ability to stabilize sand dunes. However, it is considered an invasive species in some regions, outcompeting native vegetation."
}
