{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia fendleri",
    "plant_slug": "abronia-fendleri",
    "plant_name_scientific": "abronia fendleri",
    "intro": "Abronia fendleri, commonly known as the desert sand verbena, is a flowering plant native to the southwestern United States and northwestern Mexico. It is characterized by its small, showy flowers that range in color from pink to violet, typically blooming in spring. The plant thrives in arid and semi-arid environments, often found in sandy or gravelly soils. It has a compact, low-growing habit with narrow, hairy leaves that help reduce water loss. Abronia fendleri is adapted to survive in harsh desert conditions, making it a resilient and hardy species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia fendleri is primarily native to the southwestern United States and northwestern Mexico. It is found in states such as Arizona, New Mexico, and Texas, as well as parts of Sonora and Baja California. This plant typically grows in dry, rocky habitats, including crevices in limestone and sandstone. It is commonly found in desert scrub and chaparral ecosystems. Due to its limited range and specific habitat requirements, it is considered a rare and endangered species.",
    "distribution_introduced_art_desc": "Abronia fendleri was mainly introduced to the southwestern United States, particularly in Arizona and New Mexico. It is commonly found in desert environments, growing in rocky soils and crevices. This species is known for its small, showy flowers that bloom in the spring. It is often found in association with other desert flora, such as cacti and shrubs. Due to its limited range and specific habitat requirements, it is considered a rare and sensitive plant species."
}
