{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia californica",
    "plant_slug": "abronia-californica",
    "plant_name_scientific": "abronia californica",
    "intro": "Abronia californica, commonly known as the California sand verbena, is a flowering plant native to coastal areas of Southern California. It is a low-growing annual herb that produces clusters of small, showy pink or purple flowers. The plant thrives in sandy or gravelly soils and is adapted to coastal climates with mild, wet winters and warm, dry summers. Its leaves are narrow and hairy, helping to reduce water loss in arid conditions. It plays an important role in supporting local pollinators and is considered a rare and endangered species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia californica is primarily native to coastal regions of Southern California, particularly in the counties of San Luis Obispo, Santa Barbara, and Ventura. It thrives in sandy or gravelly soils along the coastline, often in areas with mild, temperate climates. This plant is commonly found in dunes, beach scrub, and other coastal habitats. It is adapted to withstand salt spray and strong winds typical of the coastal environment. Due to habitat loss and development, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abronia californica was mainly introduced to California's coastal regions, where it thrives in sandy soils along the shoreline. It is commonly found in areas with mild, coastal climates and is often associated with dunes and other coastal habitats. The plant is known for its small, clustered flowers that bloom in the spring, attracting pollinators such as bees and butterflies. It plays a role in stabilizing dunes and preventing erosion in these sensitive environments. However, its introduction has also raised concerns about its potential impact on native plant communities."
}
