{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia fragrans",
    "plant_slug": "abronia-fragrans",
    "plant_name_scientific": "abronia fragrans",
    "intro": "Abronia fragrans, commonly known as the sweetshrub, is a flowering plant native to the eastern United States. It belongs to the family Geraniaceae and is characterized by its fragrant, showy flowers that bloom in late spring to early summer. The plant typically grows in moist, well-drained soils and thrives in partial to full sunlight. Its leaves are opposite, ovate, and have a slightly serrated edge, while its stems are often reddish in color. Abronia fragrans is valued in gardens for its ornamental appeal and ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia fragrans"
    },
    "taxonomy_art_desc": "Abronia fragrans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, known for their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar families such as the Rosaceae and Fabaceae, and is distinguished by their diverse floral structures. Its order is Caryophyllales, a group of flowering plants that includes plants like cacti and nightshade, characterized by their often showy flowers and specialized adaptations. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with vibrant flowers that often open in the late afternoon. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their showy, often brightly colored flowers. Its species is Abronia fragrans, a specific type within the genus Abronia known for its fragrant flowers and is found in various regions of the Americas.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Colorado",
        "Kansas",
        "Mexico Northeast",
        "Montana",
        "Nebraska",
        "New Mexico",
        "North Dakota",
        "Oklahoma",
        "South Dakota",
        "Texas",
        "Utah",
        "Wyoming"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia fragrans is primarily native to Arizona, Colorado, Kansas, Mexico Northeast, Montana, Nebraska, New Mexico, North Dakota, Oklahoma, South Dakota, Texas, Utah, and Wyoming. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy or gravelly soils and is often associated with rocky outcrops and dry plains. Abronia fragrans is an important component of the local flora in these areas. Its distribution spans a wide range across the central and southwestern United States.",
    "distribution_introduced_art_desc": "Abronia fragrans was mainly introduced to the coastal regions of southern California and Baja California, where it thrives in sandy or gravelly soils. It is commonly found in dune habitats and along the shores of the Pacific Ocean. This plant is often associated with disturbed or open areas, such as roadsides and beachfront properties. Its introduction has led to its establishment in several areas outside its native range. However, it is not considered invasive and is generally managed as a native or naturalized species in these regions."
}
