{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum foemina",
    "plant_slug": "abrotanum-foemina",
    "plant_name_scientific": "abrotanum foemina",
    "intro": "Abrotanum foemina, commonly known as wild thyme or Spanish thyme, is a perennial herbaceous plant native to southern Europe and parts of North Africa. It belongs to the Lamiaceae family, which is characterized by square stems, opposite leaves, and aromatic properties. The plant typically grows to a height of 20–60 cm, with small, fragrant flowers that range in color from pink to violet. Its leaves are narrow and covered in fine hairs, and it is often found in dry, sunny habitats such as rocky soils and grasslands. The plant is valued for its medicinal properties and has been used traditionally in herbal remedies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum foemina is primarily native to southern Europe, North Africa, and the Mediterranean region. It thrives in dry, sunny habitats such as rocky soils and coastal areas. This plant is commonly found in countries like Spain, Portugal, Italy, and parts of France. It is also present in regions of North Africa, including Morocco and Tunisia. Its distribution is closely linked to its adaptability to arid and semi-arid environments.",
    "distribution_introduced_art_desc": "Abrotanum foemina was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was brought there for its ornamental value due to its attractive yellow flowers and drought-tolerant nature. However, it has since become an invasive species, spreading rapidly in disturbed soils and outcompeting native vegetation. Its introduction has led to ecological concerns, as it can dominate wetland and coastal habitats. Despite its beauty, it is now classified as a noxious weed in several states due to its aggressive growth and impact on local ecosystems."
}
