{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia argillosa",
    "plant_slug": "abronia-argillosa",
    "plant_name_scientific": "abronia argillosa",
    "intro": "Abronia argillosa, commonly known as the clay bladderwort, is a unique aquatic plant native to the southeastern United States. It is characterized by its small, bladder-like structures that trap tiny aquatic organisms, aiding in its nutrient acquisition. The plant typically grows in shallow, slow-moving water or moist soil, often in swampy or marshy habitats. Its leaves are reduced to small, scale-like structures, and it produces tiny, inconspicuous flowers that are often submerged. Abronia argillosa plays a role in aquatic ecosystems by contributing to nutrient cycling and providing habitat for microorganisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia argillosa is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in sandy or loamy soils in coastal dunes and maritime hammocks. This species is commonly found in the Florida Panhandle and along the Atlantic coast. It is well adapted to coastal environments and can tolerate salt spray and periodic flooding. Due to habitat loss, it is considered a rare and endangered species in some areas.",
    "distribution_introduced_art_desc": "Abronia argillosa was mainly introduced to the coastal dunes and sandy soils of the Pacific Northwest. It is commonly found in areas with well-drained soil and full sun exposure. This plant is known for its ability to thrive in harsh, saline environments. Its introduction has led to concerns about its impact on native plant communities. It is often considered an invasive species in regions where it has spread beyond its original range."
}
