{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia menziesii",
    "plant_slug": "abronia-menziesii",
    "plant_name_scientific": "abronia menziesii",
    "intro": "Abronia menziesii, commonly known as the Menzies' bladderpod, is a flowering plant native to the coastal regions of California and Oregon. It is a member of the Brassicaceae family, which includes mustard plants, and is characterized by its small, showy flowers. The plant typically grows in sandy or gravelly soils along the coastline, where it thrives in the mild, moist climate. It produces distinctive seed pods that enclose the seeds, a feature common in the mustard family. Abronia menziesii is also known for its ability to tolerate salt spray and is often found in dune environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia menziesii is primarily native to the western United States, specifically California and Oregon. It is commonly found in coastal and inland areas, particularly in sandy or gravelly soils. This plant thrives in dry, open habitats such as dunes, coastal bluffs, and disturbed sites. It is often associated with maritime climates and is adapted to seasonal rainfall patterns. Due to habitat loss and environmental changes, it is considered a rare and endangered species in some regions.",
    "distribution_introduced_art_desc": "Abronia menziesii was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in coastal areas, particularly in Oregon and Washington. This plant thrives in sandy or gravelly soils along the shoreline. It is often seen growing in dunes or on rocky outcrops near the coast. Due to its unique habitat preferences, it is considered a rare and endemic species in its native range."
}
