{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abroma javanicum",
    "plant_slug": "abroma-javanicum",
    "plant_name_scientific": "abroma javanicum",
    "intro": "Abroma javanicum, commonly known as the Java abroma, is a flowering plant belonging to the family Malvaceae. It is native to Southeast Asia, including regions such as Indonesia, Malaysia, and the Philippines. The plant is characterized by its hairy stems and showy, pale yellow to orange flowers that bloom in clusters. Its leaves are alternate, ovate, and often have a rough texture. Abroma javanicum is typically found in moist, tropical environments and is sometimes cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abroma javanicum is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in open habitats such as coastal areas, grasslands, and disturbed sites. It is often seen growing along the edges of forests or in sandy soils near the shoreline. Abroma javanicum is also occasionally found in parts of India and the Andaman Islands.",
    "distribution_introduced_art_desc": "Abroma javanicum was mainly introduced to areas with warm, tropical climates and well-drained soils, often found in coastal regions and disturbed sites. It thrives in full sun and is commonly seen in roadsides, abandoned fields, and along riverbanks. This plant is known for its showy, clustered flowers that range in color from white to pink, making it a popular ornamental species. It has been introduced to several regions outside its native habitat, including parts of the Caribbean and Southeast Asia. Due to its adaptability, it can sometimes become invasive in non-native environments."
}
