{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia nana var. harrisii",
    "plant_slug": "abronia-nana-var-harrisii",
    "plant_name_scientific": "abronia nana var. harrisii",
    "intro": "Abronia nana var. harrisii, commonly known as the dwarf sand verbena, is a low-growing, mat-forming plant native to the coastal regions of southern California. It typically reaches a height of only a few inches, with small, rounded leaves and clusters of pink to purple flowers that bloom in late spring to early summer. The plant thrives in sandy, well-drained soils and is adapted to full sun, making it a hardy species suitable for rock gardens and coastal landscapes. It is also valued for its drought tolerance and ability to stabilize sandy soils, contributing to ecological restoration efforts in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia nana var. harrisii is primarily native to the coastal regions of California, specifically along the central and southern coastline. This plant is found in sandy or gravelly soils near the shoreline, often in areas with mild, temperate climates. It thrives in environments with moderate moisture and is commonly associated with dune habitats. The species is adapted to withstand salt spray and occasional flooding from the ocean. Due to its limited range, it is considered a rare and endangered plant in its native habitat.",
    "distribution_introduced_art_desc": "Abronia nana var. harrisii was mainly introduced to the coastal dunes and sandy soils of the Pacific Northwest. It thrives in well-drained, sunny environments and is commonly found in areas with mild, temperate climates. This variant is known for its compact growth habit and vibrant, pinkish-purple flowers. It has been cultivated in gardens and naturalized in certain regions due to its ornamental value. However, its introduction has raised concerns about its potential impact on native plant communities."
}
