{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia fragrans var. glaucescens",
    "plant_slug": "abronia-fragrans-var-glaucescens",
    "plant_name_scientific": "abronia fragrans var. glaucescens",
    "intro": "Abronia fragrans var. glaucescens, commonly known as the blue abronia, is a flowering plant native to the western United States. It is a member of the Geraniaceae family and is characterized by its striking blue to violet flowers. The plant typically grows in rocky or sandy soils and thrives in full sun to partial shade. Its leaves are often covered in a waxy coating, which helps reduce water loss in arid conditions. This variety is prized for its ornamental value and is often cultivated in gardens for its vibrant color and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia fragrans var. glaucescens is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variant of Abronia fragrans is commonly found in coastal dunes and sandy soils along the Atlantic and Gulf coasts. It thrives in well-drained, sandy habitats and is often associated with maritime environments. The plant is adapted to salt spray and can tolerate periodic flooding, which is typical of its coastal habitat. It plays an important ecological role in stabilizing dune systems and supporting local wildlife.",
    "distribution_introduced_art_desc": "Abronia fragrans var. glaucescens was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal regions. It is commonly found in sandy or gravelly soils along the Pacific coast of North America. This variety is often cultivated in gardens for its fragrant flowers and ornamental value. It has been introduced to several states in the western United States, including California and Oregon. However, its spread is limited due to its specific environmental requirements."
}
