{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella papuana",
    "plant_slug": "abrotanella-papuana",
    "plant_name_scientific": "abrotanella papuana",
    "intro": "Abrotanella papuana, commonly known as the Papuan sandwort, is a flowering plant native to the mountainous regions of New Guinea. It belongs to the family Caryophyllaceae, which includes many species of flowering plants characterized by their showy flowers and succulent leaves. The plant typically grows in rocky or gravelly soils, often in alpine or subalpine environments. Its flowers are usually small and white or pink, arranged in clusters at the ends of the stems. Abrotanella papuana is adapted to cool, humid climates and is often found in high-altitude habitats where competition from other plants is minimal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella papuana"
    },
    "taxonomy_art_desc": "Abrotanella papuana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Asterales, which consists of flowering plants with showy flowers, often in composite heads, and includes families like the sunflowers and daisies. Its family is Asteraceae, commonly known as the aster family, characterized by their composite flower heads and a wide variety of species. Its genus is Abrotanella, a group of flowering plants typically found in tropical and subtropical regions, often with small, showy flowers. Its species is Abrotanella papuana, a specific plant species native to Papua, known for its distinctive floral characteristics and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella papuana is primarily native to New Guinea. This species is found in the diverse ecosystems of the island, including forested areas and open habitats. It is commonly associated with rocky or disturbed soils in the region. The plant thrives in the tropical climate of New Guinea, where it plays a role in local biodiversity. Its native distribution is largely confined to this geographic area.",
    "distribution_introduced_art_desc": "Abrotanella papuana was mainly introduced to New Zealand as an ornamental plant due to its attractive yellow flowers and compact growth habit. It has since spread beyond cultivated areas and is now considered a weed in several regions of the country. The plant thrives in disturbed soils and can establish itself in grasslands, roadsides, and agricultural fields. Its rapid growth and ability to reproduce through both seeds and vegetative means contribute to its invasive potential. Efforts to control its spread have been limited due to its adaptability and the difficulty of eradication in natural habitats."
}
