{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia × variabilis",
    "plant_slug": "abronia-×-variabilis",
    "plant_name_scientific": "abronia × variabilis",
    "intro": "Abronia × variabilis, commonly known as the variable sandmat, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Amaranthaceae family, characterized by its succulent, mat-forming growth habit. The plant produces small, showy flowers that are typically pink or red, which bloom in late spring to early summer. It thrives in well-drained sandy soils and is adapted to arid and semi-arid environments. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia × variabilis is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as California, Arizona, and Baja California. This plant typically grows in rocky soils and open habitats. It is part of the Geraniaceae family and is known for its distinctive pink or purple flowers. Its distribution is limited to specific ecological niches within these areas.",
    "distribution_introduced_art_desc": "Abronia × variabilis was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in coastal dunes and sandy soils, thriving in areas with mild, wet winters and dry summers. This hybrid plant is often cultivated for its ornamental value due to its attractive, showy flowers. Its introduction has led to concerns about its impact on native plant communities in these regions. It is considered an invasive species in some areas, outcompeting native flora for resources."
}
