{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia umbellata f. mellifera",
    "plant_slug": "abronia-umbellata-f-mellifera",
    "plant_name_scientific": "abronia umbellata f. mellifera",
    "intro": "Abronia umbellata f. mellifera, commonly known as the sweet-scented sand verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Geraniaceae family and is characterized by its compact, mat-forming growth habit. The plant produces small, clustered flowers that are typically pink to lavender in color, which bloom in late spring to early summer. Its foliage consists of narrow, gray-green leaves that are covered in fine hairs, aiding in water retention in arid environments. The sweet scent of its flowers attracts pollinators such as bees and butterflies, making it an important plant in its native ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia umbellata f. mellifera is primarily native to the coastal regions of southern California and northern Baja California, Mexico. This subspecies thrives in sandy or gravelly soils along the shoreline. It is commonly found in dunes and other coastal habitats where it can tolerate salt spray and shifting sands. The plant is well adapted to the arid and semi-arid climates of its native range. It plays an important ecological role in stabilizing dune systems and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Abronia umbellata f. mellifera was mainly introduced to coastal and sandy habitats along the Pacific coast of North America. This plant thrives in areas with well-drained soils and full sun exposure. It is commonly found in dunes, beachfronts, and other coastal environments. The introduction of this subspecies has been associated with human activity, particularly along developed coastal regions. Its presence has raised concerns about its potential impact on native plant communities in these ecosystems."
}
