{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia macrocarpa",
    "plant_slug": "abronia-macrocarpa",
    "plant_name_scientific": "abronia macrocarpa",
    "intro": "Abronia macrocarpa, commonly known as the large-fruited sandverbena, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its small, succulent leaves and clusters of pale blue to violet flowers. The plant thrives in arid and semi-arid environments, often found in sandy or gravelly soils. Its fruit is a capsule that contains numerous tiny seeds, which are dispersed by wind. Abronia macrocarpa is a member of the Verbenaceae family and is adapted to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia macrocarpa"
    },
    "taxonomy_art_desc": "Abronia macrocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological adaptations. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive flower structures and often show adaptations to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, characterized by showy flowers and often containing toxic compounds. Its genus is Abronia, a group of flowering plants native to South America, typically with showy, brightly colored flowers. Its species is Abronia macrocarpa, a specific plant within the genus Abronia known for its large, fleshy fruits and is commonly found in dry, rocky habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia macrocarpa is primarily native to Texas. It is found in the southern and western regions of the state. This plant typically grows in dry, rocky soils in open habitats. It is commonly seen in areas with well-drained soil and full sun exposure. Its native range within Texas is limited to specific ecological zones.",
    "distribution_introduced_art_desc": "Abronia macrocarpa was mainly introduced to the western coast of the United States, particularly in California and Oregon. It thrives in coastal dunes and sandy soils, where it has established populations in disturbed and open habitats. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to concerns about its impact on local ecosystems and biodiversity. Conservation efforts are underway to monitor and manage its spread in affected regions."
}
