{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum franceae",
    "plant_slug": "abrodictyum-franceae",
    "plant_name_scientific": "abrodictyum franceae",
    "intro": "Abrodictyum franceae, commonly known as the French broom orchid, is a member of the Orchidaceae family. It is a perennial herbaceous plant native to southern Africa, particularly South Africa. The plant features slender, erect stems with narrow, grass-like leaves. Its flowers are small and clustered in a spike, typically displaying shades of yellow and green. Abrodictyum franceae is characterized by its specialized pollination mechanism, relying on specific insect species for reproduction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum franceae is primarily native to the southern region of South Africa, specifically the Western Cape Province. This plant is commonly found in rocky outcrops and coastal areas along the Atlantic coast. It thrives in well-drained soils and is adapted to the Mediterranean climate of the region. Abrodictyum franceae is often associated with fynbos vegetation, which is characteristic of the area. Its distribution is limited to specific microhabitats, making it a rare and localized species.",
    "distribution_introduced_art_desc": "Abrodictyum franceae was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It was first recorded in the early 20th century and has since spread across various regions of the country. Although it is not considered a major invasive species, it has been found growing in coastal and disturbed habitats. Its introduction has raised concerns among conservationists due to its potential to outcompete native flora in certain environments. Efforts are ongoing to monitor its distribution and assess its ecological impact."
}
