{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia fragrans var. pterocarpa",
    "plant_slug": "abronia-fragrans-var-pterocarpa",
    "plant_name_scientific": "abronia fragrans var. pterocarpa",
    "intro": "Abronia fragrans var. pterocarpa, commonly known as the fragrant abronia, is a flowering plant native to certain regions of South America. It belongs to the family Violaceae and is characterized by its showy, fragrant flowers that bloom in clusters. The plant typically grows as a herbaceous perennial with upright stems and lance-shaped leaves. Its flowers are usually violet or purple in color, and they emit a sweet, spicy scent. It thrives in well-drained soil and partial to full sunlight, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia fragrans var. pterocarpa is primarily native to the southeastern United States, specifically Florida and parts of Georgia. This variety is typically found in coastal areas and sandy soils along the Atlantic and Gulf coasts. It thrives in moist, well-drained environments and is often associated with dune ecosystems. The plant is commonly seen in natural habitats such as scrublands and maritime hammocks. Due to its limited range, it is considered a rare and endangered species in some regions.",
    "distribution_introduced_art_desc": "Abronia fragrans var. pterocarpa was mainly introduced to specific regions in the southwestern United States and northern Mexico. It is commonly found in rocky soils and open habitats. This variety is known for its fragrant flowers and is often cultivated for ornamental purposes. It has been introduced to areas where it can thrive in full sun and well-drained soil. However, its spread is limited due to its specific environmental requirements."
}
