{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abromeitiella pulvinata",
    "plant_slug": "abromeitiella-pulvinata",
    "plant_name_scientific": "abromeitiella pulvinata",
    "intro": "Abromeitiella pulvinata, commonly known as the mountain sand verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Plantaginaceae family and is characterized by its delicate, clustered flowers that bloom in shades of pink and purple. The plant typically grows in rocky or sandy soils, often in arid or semi-arid environments. Its leaves are narrow and linear, and it has a low-growing, mat-like habit. Abromeitiella pulvinata is adapted to survive in harsh conditions, with mechanisms to conserve water and withstand high temperatures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abromeitiella pulvinata is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal and inland areas, growing in sandy or gravelly soils. This plant thrives in open habitats such as dunes, grasslands, and along roadsides. It is well adapted to dry and sunny environments, often blooming in the spring. Its distribution is limited to specific regions where its ecological requirements are met.",
    "distribution_introduced_art_desc": "Abromeitiella pulvinata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive yellow flowers. The plant has since become naturalized in certain regions, particularly in the North Island. It thrives in sunny, well-drained soils and is often found in coastal and disturbed areas. However, its spread is limited compared to other introduced species in the region."
}
