{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum caudatum",
    "plant_slug": "abrodictyum-caudatum",
    "plant_name_scientific": "abrodictyum caudatum",
    "intro": "Abrodictyum caudatum, commonly known as the long-tailed orchid, is a tropical orchid native to Southeast Asia. It is characterized by its striking, elongated inflorescence that can reach several feet in length, bearing numerous small, fragrant flowers. The plant typically grows as an epiphyte, attaching itself to trees in humid, shaded environments. Its leaves are narrow and grass-like, and it thrives in warm, moist conditions with high humidity. Due to its ornamental value, it is often cultivated in greenhouses and botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum caudatum is primarily native to the southern United States, particularly Texas and northeastern Mexico. It is commonly found in arid and semi-arid regions, growing in rocky soils and open habitats. This plant thrives in environments with full sun exposure and is often seen in limestone areas. It is a member of the orchid family and is known for its distinctive, showy flowers. Due to its limited range, it is considered a rare and endangered species in some areas.",
    "distribution_introduced_art_desc": "Abrodictyum caudatum was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardiness. It was first recorded in the late 19th century and has since spread across various regions of the country. The plant is commonly found in coastal areas and disturbed soils, where it thrives in sunny conditions. Despite its aesthetic appeal, it has become invasive in some parts of New Zealand, outcompeting native vegetation. Its introduction highlights the ecological risks associated with non-native plant species."
}
