{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella caespitosa",
    "plant_slug": "abrotanella-caespitosa",
    "plant_name_scientific": "abrotanella caespitosa",
    "intro": "Abrotanella caespitosa, commonly known as the tufted sandwort, is a flowering plant native to the western United States and parts of Mexico. It is a low-growing perennial that forms dense mats of foliage, typically in arid or rocky habitats. The plant produces small, white or pale pink flowers arranged in clusters, which bloom in the spring. Its leaves are usually narrow and covered in fine hairs, aiding in water conservation. Abrotanella caespitosa is adapted to harsh environments and is often found in sandy or gravelly soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella caespitosa"
    },
    "taxonomy_art_desc": "Abrotanella caespitosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Asterales, which comprises flowering plants with showy flowers, often with composite inflorescences, and includes many medicinal and ornamental plants. Its family is Asteraceae, commonly known as the sunflower family, which is one of the largest families of flowering plants, characterized by their head-like flower clusters. Its genus is Abrotanella, a group of flowering plants typically found in arid regions, known for their small, often clustered flowers and medicinal properties. Its species is Abrotanella caespitosa, a specific type within the genus Abrotanella, characterized by its tufted growth habit and yellow flowers, commonly found in rocky or dry habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand North",
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella caespitosa is primarily native to New Zealand North and New Zealand South. This species is commonly found in the alpine and subalpine regions of both the North and South Islands. It thrives in rocky and open habitats, often growing in grasslands and on slopes. The plant is well adapted to the cool, temperate climate of New Zealand. It plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Abrotanella caespitosa was mainly introduced to control erosion and as an ornamental plant in disturbed soils. It is commonly found in disturbed areas such as roadsides, fields, and along riverbanks. The plant has a mat-forming growth habit, which helps stabilize soil and prevent erosion. Due to its rapid growth and adaptability, it has become invasive in some regions. However, it is also valued for its small, showy flowers and ability to thrive in poor soil conditions."
}
