{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum xerophilum",
    "plant_slug": "abrotanum-xerophilum",
    "plant_name_scientific": "abrotanum xerophilum",
    "intro": "Abrotanum xerophilum, commonly known as the desert mallow, is a flowering plant native to arid and semi-arid regions. It is characterized by its succulent, hairy stems and narrow, lance-shaped leaves that help reduce water loss. The plant produces clusters of small, pink to purple flowers that bloom in late spring or early summer. It is adapted to thrive in hot, dry environments with minimal rainfall. Due to its drought tolerance, it is often used in xeriscaping and as a ornamental plant in dry landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum xerophilum is primarily native to the arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. It thrives in dry, sandy soils and is commonly found in desert and semi-desert environments. This plant is well adapted to withstand prolonged periods of drought due to its succulent leaves and deep root system. It is often seen growing along rocky outcrops and in open grasslands. Its distribution is limited to areas with low rainfall and high temperatures, making it a characteristic species of the Namib Desert ecosystem.",
    "distribution_introduced_art_desc": "Abrotanum xerophilum was mainly introduced to areas with dry, arid conditions where it can thrive with minimal water. It has been distributed in regions characterized by low rainfall and high temperatures, often found in rocky or sandy soils. This plant is commonly found in parts of the southwestern United States and northern Mexico. Its introduction has been primarily due to its use in traditional medicine and as an ornamental plant. However, it is considered an invasive species in some areas, outcompeting native vegetation."
}
