{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia alpina",
    "plant_slug": "abronia-alpina",
    "plant_name_scientific": "abronia alpina",
    "intro": "Abronia alpina, commonly known as the alpine bladderwort, is a flowering plant native to the mountainous regions of Europe and western Asia. It is a member of the Lentibulariaceae family, which includes carnivorous plants. The plant is characterized by its small, delicate flowers that typically bloom in shades of pink or purple. It thrives in moist, calcareous soils and is often found in alpine meadows and rocky habitats. Due to its specialized habitat requirements, it is considered a rare and endangered species in many areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia alpina"
    },
    "taxonomy_art_desc": "Abronia alpina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and their close relatives, characterized by their complex life cycles and multicellular structures. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and diverse morphological adaptations. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, often with showy flowers and a wide range of habitats. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive flowers and often contains species adapted to arid environments. Its family is Nyctaginaceae, a family of flowering plants commonly known as the \"four o’clock\" plants, characterized by their showy flowers that open in the evening. Its genus is Abronia, a group of flowering plants native to the Americas, typically with colorful flowers and adapted to various ecological conditions. Its species is Abronia alpina, a specific plant within the genus Abronia, known for its alpine habitat and unique floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia alpina is primarily native to California. It is found in the coastal regions of southern California, particularly in areas with sandy or gravelly soils. This plant typically grows in open, sunny habitats such as dunes, beaches, and coastal bluffs. It is adapted to the harsh, arid conditions of the California coastline. Due to its limited range, it is considered a rare and endangered species in its native habitat.",
    "distribution_introduced_art_desc": "Abronia alpina was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in coastal dunes and sandy soils along the Pacific coast. This plant thrives in well-drained, sandy environments and is adapted to salt spray and strong winds. It plays an important role in stabilizing dune ecosystems and providing habitat for native wildlife. However, its introduction has raised concerns about its potential impact on local flora and ecological balance."
}
