{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum laetum",
    "plant_slug": "abrodictyum-laetum",
    "plant_name_scientific": "abrodictyum laetum",
    "intro": "Abrodictyum laetum, commonly known as the yellow orchid, is a flowering plant native to South Africa. It belongs to the orchid family, Orchidaceae, and is characterized by its striking yellow flowers with a distinctive greenish tinge. The plant typically grows in rocky or sandy soils and prefers full sun to partial shade. Its leaves are elongated and grass-like, while its flowers are borne in clusters on tall, slender stems. Abrodictyum laetum is valued for its ornamental appeal and is often cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum laetum is primarily native to South America, specifically in regions of Brazil, Paraguay, and Argentina. It is commonly found in the subtropical and tropical areas of these countries. This plant typically grows in open grasslands and disturbed soils. It is well adapted to the warm and humid climates of its native habitat. Due to its unique appearance, it is sometimes cultivated in botanical gardens and private collections.",
    "distribution_introduced_art_desc": "Abrodictyum laetum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides and abandoned fields. It thrives in temperate climates with moderate rainfall. This plant is often found in regions with well-drained soils and full sun exposure. Its introduction has been associated with human activity, including gardening and land development. It is considered an invasive species in some regions due to its rapid spread and competitive nature."
}
