{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum kalimantanense",
    "plant_slug": "abrodictyum-kalimantanense",
    "plant_name_scientific": "abrodictyum kalimantanense",
    "intro": "Abrodictyum kalimantanense, commonly known as the Kalimantan orchid, is a species of orchid native to the tropical rainforests of Borneo. It belongs to the Orchidaceae family and is characterized by its delicate, fragrant flowers that typically bloom in shades of white and yellow. The plant is epiphytic, meaning it grows on the surface of trees without deriving nutrients from them. Its leaves are elongated and革质 (leathery), adapted to retain moisture in the humid environment. Due to habitat loss, it is considered a vulnerable species and is often sought after in the horticultural trade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum kalimantanense is primarily native to the island of Borneo. It is found in the tropical rainforests of Indonesia, specifically in the states of Kalimantan. This plant thrives in humid, shaded environments within lowland and hill forest areas. Its distribution is limited to the western part of Borneo, where the climate and soil conditions are most suitable. It is an endemic species, meaning it is not found naturally anywhere else in the world.",
    "distribution_introduced_art_desc": "Abrodictyum kalimantanense was mainly introduced to the Southeast Asian region, particularly Indonesia, as a horticultural and ornamental plant. It is valued for its unique and striking floral structures, which make it a popular choice among plant enthusiasts and collectors. The plant has been cultivated in botanical gardens and private collections, contributing to its increasing visibility in the region. Its introduction has also led to some ecological concerns due to its potential invasive behavior in certain environments. Despite these challenges, it remains an important species in the study of tropical plant diversity."
}
