{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia bolackii",
    "plant_slug": "abronia-bolackii",
    "plant_name_scientific": "abronia bolackii",
    "intro": "Abronia bolackii, commonly known as the Bolack's bladderwort, is a small aquatic plant belonging to the family Lentibulariaceae. It is native to freshwater habitats in southern Africa, particularly in countries like Namibia and South Africa. The plant is characterized by its small, bladder-like structures that trap small aquatic organisms, aiding in its nutrient acquisition. It typically grows in shallow, still waters and has delicate, branched stems with small, ovate leaves. Due to its specialized adaptations, it plays a unique role in its ecosystem as both a predator and a potential indicator of water quality.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia bolackii is primarily native to the coastal regions of southern California, specifically within the California Floristic Province. This plant is found in sandy or gravelly soils along the shorelines of the Pacific Ocean. It thrives in environments with moderate rainfall and is often associated with dunes or scrub habitats. The species is adapted to the unique climate and soil conditions of this region. Due to its limited range, it is considered a rare and endemic plant in California.",
    "distribution_introduced_art_desc": "Abronia bolackii was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in coastal areas and sandy soils along the Pacific coast. This plant thrives in moist, well-drained environments and is often seen in dunes and scrub habitats. Its introduction has led to its establishment in several ecological zones, though it remains relatively localized. It is considered a non-native species in these regions, with limited impact on native flora."
}
