{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abroma obliquum",
    "plant_slug": "abroma-obliquum",
    "plant_name_scientific": "abroma obliquum",
    "intro": "Abroma obliquum, commonly known as the narrow-leaved abroma, is a flowering plant native to tropical and subtropical regions of Asia. It belongs to the family Malvaceae, which includes cotton and hibiscus. The plant is characterized by its slender, erect stems and small, pale yellow to white flowers that bloom in clusters. Its leaves are typically narrow and lance-shaped, with a rough texture. Abroma obliquum is often found in moist, open habitats such as grasslands and forest edges.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abroma obliquum is primarily native to Southeast Asia, including countries such as India, Sri Lanka, and parts of Indonesia. It is commonly found in tropical and subtropical regions, particularly in areas with moist, well-drained soils. This plant thrives in open woodlands, grasslands, and along riverbanks. It is also present in some parts of Africa, particularly in East Africa. Its distribution is closely linked to regions with a warm climate and adequate rainfall.",
    "distribution_introduced_art_desc": "Abroma obliquum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and degraded forests. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is commonly found in tropical and subtropical regions of Southeast Asia, including countries like Thailand, Vietnam, and Indonesia. Its introduction is often associated with human activities such as land clearing and agricultural expansion. Due to its adaptability, it has become an invasive species in some areas where it outcompetes native flora."
}
