{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum saxatile",
    "plant_slug": "abrodictyum-saxatile",
    "plant_name_scientific": "abrodictyum saxatile",
    "intro": "Abrodictyum saxatile, commonly known as the rock orchid, is a perennial herbaceous plant native to southern Africa. It typically grows in rocky or sandy soils, often in arid or semi-arid environments. The plant features a basal rosette of linear leaves and produces tall, slender flowering stems. Its flowers are small, greenish-white, and have a delicate, orchid-like appearance. It is adapted to survive in harsh conditions with minimal water availability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum saxatile is primarily native to southern Africa, specifically South Africa. It is commonly found in the eastern and western regions of the country. This plant thrives in rocky and gravelly soils, often growing on cliffs or among boulders. It is adapted to arid and semi-arid environments, making it a resilient species in these regions. Its distribution is largely limited to specific areas within South Africa where the climate and soil conditions are suitable.",
    "distribution_introduced_art_desc": "Abrodictyum saxatile was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardiness. It was first recorded in the 19th century and has since spread across various regions of the country. The plant thrives in dry, rocky environments and is commonly found in coastal and inland areas. Despite its aesthetic appeal, it has raised concerns due to its potential to become invasive in certain ecosystems. Its distribution has been documented in several regions, including the North Island and parts of the South Island."
}
