{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia cheradophila",
    "plant_slug": "abronia-cheradophila",
    "plant_name_scientific": "abronia cheradophila",
    "intro": "Abronia cheradophila, commonly known as the desert bluemouth, is a perennial flowering plant native to the southwestern United States and northern Mexico. It is characterized by its compact, low-growing form and produces small, blue to violet flowers that bloom in the spring. The plant has adapted to arid environments with deep roots and thick, waxy leaves that help reduce water loss. It thrives in well-drained soils and full sun, making it a hardy choice for xeriscaping. Due to its limited distribution and habitat specificity, it is considered a rare and sensitive species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia cheradophila is primarily native to the western United States, specifically California and Oregon. It is found in coastal dunes and sandy soils along the Pacific coast. This species thrives in arid and semi-arid environments with well-drained soil. It is often associated with coastal scrub and maritime chaparral habitats. Due to its limited range, it is considered a rare and endemic plant in these regions.",
    "distribution_introduced_art_desc": "Abronia cheradophila was mainly introduced to areas with well-drained soils and full sun exposure, typically in coastal or inland dune environments. It is commonly found in regions with a Mediterranean climate, characterized by dry summers and mild, wet winters. This plant thrives in sandy or gravelly substrates and is often associated with disturbed or open habitats. Its introduction has been documented in several regions outside its native range, including parts of California and Oregon in the United States. Due to its hardy nature and ability to colonize new areas, it has become a notable invasive species in some locations."
}
