{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia nealleyi",
    "plant_slug": "abronia-nealleyi",
    "plant_name_scientific": "abronia nealleyi",
    "intro": "Abronia nealleyi, commonly known as the Nealley's bladderpod, is a flowering plant native to the southwestern United States and northern Mexico. It belongs to the family Brassicaceae, which includes mustard plants, and is characterized by its small, showy flowers. The plant typically grows in rocky or sandy soils and is adapted to arid environments. Its leaves are usually basal and lobed, while its flowers are predominantly pink or purple. Abronia nealleyi is often found in desert scrub and chaparral habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia nealleyi"
    },
    "taxonomy_art_desc": "Abronia nealleyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants with a diverse range of growth forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Caryophyllales, a group of flowering plants that includes many succulent and desert plants, often with specialized adaptations for arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers that often open in the evening. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their succulent leaves and showy, often brightly colored flowers. Its species is Abronia nealleyi, a specific plant within the genus Abronia, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Mexico",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia nealleyi is primarily native to New Mexico and Texas. This rare flowering plant is found in specific regions within these two U.S. states. It typically grows in rocky or sandy soils in arid or semi-arid environments. The species is known for its small, showy flowers that bloom in the spring. Due to its limited range, it is considered a sensitive indicator of specific ecological conditions.",
    "distribution_introduced_art_desc": "Abronia nealleyi was mainly introduced to the western United States, particularly in California and Nevada. It is commonly found in rocky and gravelly soils along dry slopes and cliffs. This plant thrives in full sun and has adapted to arid environments with minimal water availability. It is often seen growing in association with other desert flora such as creosote bush and yucca. Due to its limited distribution, it is considered a rare and endemic species within its range."
}
