{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum cylindratum",
    "plant_slug": "abrodictyum-cylindratum",
    "plant_name_scientific": "abrodictyum cylindratum",
    "intro": "Abrodictyum cylindratum, commonly known as the cylindrical orchid, is a striking member of the Orchidaceae family native to southern Africa. It is characterized by its tall, slender stems and clusters of pale yellow to greenish-white flowers that bloom in late winter to early spring. The plant typically grows in rocky or sandy soils and thrives in full sun to partial shade. Its unique cylindrical shape and delicate appearance make it a popular choice for ornamental gardening. Due to its specific habitat requirements, it is often cultivated in controlled environments to ensure its survival.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum cylindratum is primarily native to parts of southern Africa, specifically South Africa and Namibia. It is commonly found in the arid and semi-arid regions of these areas. This plant typically grows in rocky or sandy soils, often in open grasslands or along riverbanks. It is well adapted to the dry climate and can survive with minimal rainfall. Due to its unique appearance and habitat, it is sometimes cultivated in botanical gardens and private collections.",
    "distribution_introduced_art_desc": "Abrodictyum cylindratum was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive, tubular flowers. It has since been reported in several countries across Europe, including Spain, Italy, and France. The plant thrives in well-drained soils and full sun, making it suitable for gardens and landscapes. However, it has shown invasive tendencies in some areas, raising concerns about its impact on native flora. Its distribution is primarily limited to regions with a temperate climate and adequate water supply."
}
