{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum setigerum",
    "plant_slug": "abrodictyum-setigerum",
    "plant_name_scientific": "abrodictyum setigerum",
    "intro": "Abrodictyum setigerum, commonly known as the feather-tongue orchid, is a terrestrial orchid native to southern Africa. It belongs to the Orchidaceae family and is characterized by its slender, grass-like leaves and delicate, pendulous flowers. The plant typically grows in open, sunny habitats such as grasslands and rocky areas. Its flowers are usually pale yellow to greenish in color, with a distinctive, elongated spur. Abrodictyum setigerum is known for its ornamental value and is often cultivated for its unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum setigerum is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and the Free State. This plant typically grows in sandy or rocky soils in open habitats like grasslands and fynbos areas. It is commonly associated with coastal and inland regions where the climate is temperate to semi-arid. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abrodictyum setigerum was mainly introduced to the Pacific Northwest region of the United States. It was primarily brought in for its ornamental value due to its attractive, sword-shaped leaves. The plant has since spread to other areas, including parts of California and Oregon. It is commonly found in moist, shaded environments such as along stream banks and in forest understories. However, it is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation."
}
