{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia salsa",
    "plant_slug": "abronia-salsa",
    "plant_name_scientific": "abronia salsa",
    "intro": "Abronia salsa, commonly known as the coastal bluemink, is a flowering plant native to the sandy shores of the southeastern United States. It is characterized by its small, blue to violet flowers that bloom in late spring to early summer. The plant has a compact, mat-forming growth habit, with narrow, grass-like leaves that help it withstand coastal conditions. It thrives in well-drained, sandy soils and is adapted to salt spray and strong winds. Abronia salsa plays an important role in stabilizing dune ecosystems and providing habitat for small invertebrates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia salsa is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in coastal sand dunes and other sandy habitats along the Atlantic and Gulf coasts. This plant thrives in well-drained, sandy soils and is adapted to the harsh conditions of its native environment. It is an important component of the dune ecosystem, providing habitat and stabilizing sand dunes. Due to habitat loss and development, Abronia salsa is considered threatened in some areas.",
    "distribution_introduced_art_desc": "Abronia salsa was mainly introduced to coastal dunes and sandy soils along the Pacific coast of North America. It is commonly found in areas with well-drained soils and full sun exposure. This plant is often associated with disturbed habitats such as beaches, dunes, and roadsides. It plays a role in stabilizing sand dunes and preventing erosion. Its distribution has been influenced by human activity and natural dispersal mechanisms."
}
