{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia wootonii",
    "plant_slug": "abronia-wootonii",
    "plant_name_scientific": "abronia wootonii",
    "intro": "Abronia wootonii, commonly known as the Wooton's bladderwort, is a small aquatic plant native to the southeastern United States. It is characterized by its delicate, bladder-like structures that trap small aquatic organisms, aiding in its nutrient absorption. The plant typically grows in shallow, still waters such as ponds and marshes. Its leaves are thin and ribbon-like, often floating on the water surface. Abronia wootonii plays a role in aquatic ecosystems by contributing to water filtration and providing habitat for microorganisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia wootonii is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in coastal dune habitats and sandy soils along the Atlantic and Gulf coasts. This plant thrives in well-drained, sandy environments and is often associated with maritime hammocks and scrub habitats. It is a member of the Gentian family and is known for its showy blue or purple flowers. Due to habitat loss and development, it is considered a rare and endangered species in many areas of its native range.",
    "distribution_introduced_art_desc": "Abronia wootonii was mainly introduced to the eastern United States, particularly in the southeastern region. It has been found in states such as Florida, Georgia, and South Carolina. The plant is often associated with disturbed habitats like roadsides and abandoned fields. Its introduction is believed to be due to human activity, including the transport of soil or plant material. However, it is not considered invasive and has not caused significant ecological harm."
}
