{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum frutescens",
    "plant_slug": "abrotanum-frutescens",
    "plant_name_scientific": "abrotanum frutescens",
    "intro": "Abrotanum frutescens, commonly known as wild thyme or honey thyme, is a flowering plant native to the Mediterranean region. It is a low-growing, herbaceous perennial with small, fragrant leaves and clusters of pink or white flowers. The plant belongs to the Lamiaceae family, which includes other aromatic herbs like mint and sage. Its leaves are often used in traditional herbal medicine for their antiseptic and anti-inflammatory properties. Abrotanum frutescens thrives in well-drained soils and full sun, making it a hardy plant suitable for rock gardens and borders.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum frutescens is primarily native to the southern United States, including Texas, Louisiana, and parts of Florida. It is also found in Mexico, particularly in the states of Veracruz and Oaxaca. This plant thrives in dry, sandy soils and is commonly found in coastal areas and disturbed sites. It is often associated with maritime environments and can be seen along the Gulf Coast. Its distribution extends into the Caribbean, where it grows on sandy beaches and dunes.",
    "distribution_introduced_art_desc": "Abrotanum frutescens was mainly introduced to the western United States as an ornamental plant due to its hardy nature and attractive foliage. It has since spread into native grasslands and disturbed areas, often outcompeting native vegetation. This plant is considered invasive in several states, particularly in California and Nevada, where it threatens local ecosystems. Its rapid growth and ability to thrive in poor soils contribute to its success in non-native habitats. Management efforts focus on preventing its spread and controlling existing infestations through mechanical and chemical means."
}
