{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella crassipes",
    "plant_slug": "abrotanella-crassipes",
    "plant_name_scientific": "abrotanella crassipes",
    "intro": "Abrotanella crassipes, commonly known as the broad-leaved sand verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is a member of the Asteraceae family, characterized by its composite flower heads that consist of both ray and disk flowers. The plant typically grows in sandy or gravelly soils and is often found in arid or semi-arid environments. Its leaves are broad and fleshy, adapted to conserve water in dry conditions. Abrotanella crassipes produces small, pink to purple flowers that bloom in the spring and summer months.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella crassipes is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, Texas, and parts of California. This plant typically grows in rocky soils and arid environments. It is commonly associated with desert scrub and chaparral habitats. Its distribution is limited to specific ecological zones where it can thrive in full sun and low moisture conditions.",
    "distribution_introduced_art_desc": "Abrotanella crassipes was mainly introduced to new habitats through human activities such as landscaping and gardening. It is commonly found in disturbed soils and along roadsides in regions where it has been intentionally or accidentally planted. This plant has shown a tendency to spread rapidly, often outcompeting native species in its new environment. Its introduction has led to concerns about its impact on local biodiversity and ecosystem balance. Due to its adaptability, it has become a problematic invasive species in several areas outside its native range."
}
