{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum angustimarginatum",
    "plant_slug": "abrodictyum-angustimarginatum",
    "plant_name_scientific": "abrodictyum angustimarginatum",
    "intro": "Abrodictyum angustimarginatum, commonly known as the narrow-margin orchid, is a terrestrial orchid native to southern Africa. It is characterized by its slender, erect stems and linear, grass-like leaves. The plant produces delicate, pale green to yellowish flowers arranged in a raceme, which bloom during the cooler months. It prefers well-drained soil and partial shade, often growing in rocky or sandy habitats. Due to its specific habitat requirements, it is considered a rare and endangered species in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum angustimarginatum is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and parts of the Free State. This plant thrives in sandy or gravelly soils and is commonly found in open grasslands and rocky outcrops. It is well adapted to the semi-arid climate of its native habitat. The species is also occasionally reported in neighboring countries like Lesotho and Eswatini.",
    "distribution_introduced_art_desc": "Abrodictyum angustimarginatum was mainly introduced to the United States as an ornamental plant due to its unique and striking appearance. It is commonly found in regions with warm climates, particularly in southern states like Florida and Texas. The plant's introduction has led to its establishment in some native habitats, raising concerns about its potential impact on local ecosystems. Despite its aesthetic appeal, it is considered an invasive species in certain areas. Proper management is necessary to prevent its spread and protect native plant communities."
}
