{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum flavofuscum",
    "plant_slug": "abrodictyum-flavofuscum",
    "plant_name_scientific": "abrodictyum flavofuscum",
    "intro": "Abrodictyum flavofuscum, commonly known as the yellow-brown orchid, is a terrestrial orchid native to southern Africa. It typically grows in open grasslands and rocky areas, preferring well-drained soils. The plant features a slender, upright stem with a few leaves and produces clusters of small, pale yellow to brownish-green flowers. Its flowers are characterized by their slender, erect petals and sepals, with a lip that is often marked with darker pigments. Abrodictyum flavofuscum is known for its delicate appearance and is often cultivated for its ornamental value in botanical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum flavofuscum is primarily native to the eastern and southern regions of South America, particularly Brazil, Paraguay, and Argentina. It is commonly found in wetland areas, marshes, and along the edges of ponds and lakes. This plant thrives in humid climates with abundant water and partial to full sunlight. It is often associated with aquatic or semi-aquatic habitats, making it a characteristic species of these environments. Due to its specific habitat requirements, it is not widely distributed outside of its native range.",
    "distribution_introduced_art_desc": "Abrodictyum flavofuscum was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant has been reported in several countries in South America, particularly in Brazil and Peru. Its introduction is often associated with human activities such as agriculture and land clearing. Due to its adaptability, it has become a common weed in many regions where it has been introduced."
}
