{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella purpurea",
    "plant_slug": "abrotanella-purpurea",
    "plant_name_scientific": "abrotanella purpurea",
    "intro": "Abrotanella purpurea, commonly known as purple sandwort, is a flowering plant native to the western United States and parts of Canada. It belongs to the family Montiaceae and is characterized by its low-growing, mat-forming habit. The plant features small, pink to purple flowers that bloom in late spring to early summer. Its leaves are typically narrow and covered in fine hairs, which help reduce water loss in arid environments. Abrotanella purpurea is often found in rocky soils and open habitats, showcasing its adaptability to harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella purpurea"
    },
    "taxonomy_art_desc": "Abrotanella purpurea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants with a distinct life cycle and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Asterales, a group of flowering plants that includes many familiar families such as the sunflowers and daisies. Its family is Asteraceae, commonly known as the aster family, which is characterized by composite flower heads and includes plants like daisies and ragweed. Its genus is Abrotanella, a group of flowering plants commonly known as \"false thistles\" and native to various regions of the world. Its species is Abrotanella purpurea, a specific plant species known for its purple flowers and is often found in rocky or sandy soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella purpurea is primarily native to Chile South. It is found in the southern regions of Chile, particularly in the Andean foothills and coastal areas. This plant thrives in temperate climates with well-drained soils. It is commonly seen in open habitats such as grasslands and rocky slopes. Its native range is limited to this specific geographic area in South America.",
    "distribution_introduced_art_desc": "Abrotanella purpurea was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, pastures, and disturbed forest edges. It thrives in temperate climates and is often found in regions with moderate rainfall. This plant is known for its rapid growth and ability to colonize new areas quickly. It is commonly seen in the western United States and parts of Europe. Due to its invasive potential, it is often classified as a noxious weed in many regions."
}
