{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum schlechteri",
    "plant_slug": "abrodictyum-schlechteri",
    "plant_name_scientific": "abrodictyum schlechteri",
    "intro": "Abrodictyum schlechteri, commonly known as the Schlechter's orchid, is a member of the Orchidaceae family and is native to South America. It is a terrestrial herb with a sympodial growth habit, characterized by its pseudobulbs and linear leaves. The plant produces strikingly colored flowers that are typically yellow or orange with intricate patterns. It thrives in humid, shaded environments and requires well-draining soil for optimal growth. Due to its unique appearance and specific habitat requirements, it is a sought-after species among orchid enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum schlechteri is primarily native to southern Africa, specifically South Africa. It is found in the regions of the Eastern Cape, Western Cape, and parts of the Northern Cape. This plant typically grows in rocky outcrops and coastal areas. It thrives in well-drained soils and is often found in open, sunny habitats. Its distribution is limited to specific microhabitats within these regions.",
    "distribution_introduced_art_desc": "Abrodictyum schlechteri was mainly introduced to New Zealand. It was first recorded in the 19th century and has since become established in several regions of the country. The plant is commonly found in coastal areas and disturbed sites, often growing in sandy or gravelly soils. It is considered a non-native species that has adapted well to the local environment. Due to its rapid growth and ability to spread, it is now regarded as a potential weed in some areas."
}
