{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia torreyi",
    "plant_slug": "abronia-torreyi",
    "plant_name_scientific": "abronia torreyi",
    "intro": "Abronia torreyi, commonly known as Torrey's bladderpod, is a flowering plant native to the southwestern United States and northern Mexico. It belongs to the family Brassicaceae, which includes mustard plants, and is characterized by its small, showy flowers that are typically pink or purple. The plant has a low-growing habit with hairy stems and pinnately compound leaves. It produces small, round seed pods that enclose its seeds, a feature typical of the mustard family. Abronia torreyi is adapted to arid and rocky environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia torreyi is primarily native to the southwestern United States and northwestern Mexico. It is found in states such as California, Nevada, Utah, Arizona, and New Mexico. This plant typically grows in rocky or sandy soils in desert and semi-desert environments. It is commonly associated with areas that have low rainfall and high temperatures. Its native range includes regions with specific ecological conditions that support its growth and survival.",
    "distribution_introduced_art_desc": "Abronia torreyi was mainly introduced to the western United States, particularly in California and Oregon. It thrives in coastal dunes and sandy soils, where it has adapted to the harsh, saline conditions. This plant is often found in disturbed habitats, such as along roadsides and in areas with frequent wind exposure. Its introduction has been largely unintentional, resulting from human activity and seed dispersal. Due to its hardy nature, it has become a common invasive species in certain regions."
}
