{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia robusta",
    "plant_slug": "abronia-robusta",
    "plant_name_scientific": "abronia robusta",
    "intro": "Abronia robusta, commonly known as the rock beard or coastal beard, is a flowering plant native to the western United States and Baja California. It belongs to the Gentianaceae family and is characterized by its compact, shrub-like growth habit. The plant produces small, tubular flowers that range in color from white to purple, often blooming in late spring to early summer. It thrives in rocky, well-drained soils and is adapted to coastal and inland desert environments. Due to its specific habitat requirements, it is considered a rare and sensitive species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia robusta is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in coastal areas, particularly in the Florida Panhandle and the Florida Keys. This plant thrives in sandy, well-drained soils along the shoreline. It is often seen in dune ecosystems and salt marshes, where it tolerates saline conditions. Abronia robusta is a key component of the coastal flora in these regions.",
    "distribution_introduced_art_desc": "Abronia robusta was mainly introduced to the coastal regions of southern California, where it has established itself in sandy and dune environments. This plant is considered an invasive species in these areas due to its rapid growth and ability to outcompete native vegetation. It thrives in disturbed soils and can spread quickly along shorelines. Its introduction has led to concerns about its impact on local ecosystems and biodiversity. Efforts are being made to monitor and control its spread to protect native plant communities."
}
