{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella muscosa",
    "plant_slug": "abrotanella-muscosa",
    "plant_name_scientific": "abrotanella muscosa",
    "intro": "Abrotanella muscosa, commonly known as woolly thyme or mossy thyme, is a low-growing perennial herb native to the Mediterranean region. It features small, aromatic leaves covered in fine, white hairs that give it a woolly appearance. The plant produces clusters of tiny, pink to purple flowers that bloom in the spring and summer. It thrives in well-drained soils and full sun, often found in rocky or gravelly habitats. Its compact growth habit and ornamental foliage make it a popular choice for rock gardens and dry landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella muscosa"
    },
    "taxonomy_art_desc": "Abrotanella muscosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species with a wide range of morphological diversity. Its order is Asterales, which consists of flowering plants that are often recognized by their composite flower heads and include many economically important species. Its family is Asteraceae, commonly known as the sunflower family, characterized by their unique inflorescence called a head or composite flower. Its genus is Abrotanella, a group of flowering plants typically found in arid regions, known for their small, showy flowers. Its species is Abrotanella muscosa, a specific type within the genus Abrotanella, distinguished by its particular morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Zealand South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella muscosa is primarily native to New Zealand South. It is commonly found in the southern regions of New Zealand, including the South Island. This plant typically grows in coastal and subalpine environments. It thrives in well-drained soils and is often seen in rocky or gravelly areas. Its native range is limited to these specific regions within New Zealand.",
    "distribution_introduced_art_desc": "Abrotanella muscosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive yellow flowers. However, it has since become invasive, outcompeting native species in various habitats. The plant thrives in disturbed areas and can spread rapidly along roadsides and in forests. Its introduction has raised concerns among conservationists due to its potential to disrupt local ecosystems."
}
