{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia × alba var. platyphylla",
    "plant_slug": "abronia-×-alba-var-platyphylla",
    "plant_name_scientific": "abronia × alba var. platyphylla",
    "intro": "Abronia × alba var. platyphylla, commonly known as the flat-leaf sandverbena, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its compact, mat-forming growth habit and small, pale blue to white flowers that bloom in late spring. The leaves are typically oval to heart-shaped, with a waxy texture that helps reduce water loss in arid environments. This variety is a hybrid between Abronia × alba and A. platyphylla, exhibiting traits from both parent species. It thrives in well-drained soils and full sun, making it a suitable plant for rock gardens and xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia × alba var. platyphylla is primarily native to the coastal regions of southern California and northern Baja California, Mexico. This plant thrives in sandy or gravelly soils along the shoreline. It is commonly found in areas with mild, Mediterranean-type climates. The variety is known for its low-growing habit and showy, pinkish-white flowers. It plays an important role in stabilizing dunes and supporting local wildlife.",
    "distribution_introduced_art_desc": "Abronia × alba var. platyphylla was mainly introduced to coastal dunes and sandy soils in the Pacific Northwest. It thrives in well-drained, nutrient-poor soils and requires full sun exposure. This variety is known for its compact growth habit and white, bell-shaped flowers that bloom in late spring. It is often cultivated as an ornamental plant due to its unique appearance and hardiness. However, it has shown invasive tendencies in some regions, raising concerns about its ecological impact."
}
