{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia glaucescens",
    "plant_slug": "abronia-glaucescens",
    "plant_name_scientific": "abronia glaucescens",
    "intro": "Abronia glaucescens, commonly known as the blue-flowered sand verbena, is a flowering plant native to the western United States. It is a member of the Verbenaceae family and is characterized by its delicate, blue or purple flowers. The plant typically grows in sandy or gravelly soils, often in coastal or inland desert regions. It has small, narrow leaves and produces small, clustered inflorescences. Abronia glaucescens is adapted to arid environments and is often found in disturbed or open habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia glaucescens is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in coastal dunes and sandy soils along the Atlantic and Gulf coasts. This plant thrives in well-drained, sandy habitats and is often associated with maritime environments. It is a member of the Malvaceae family and is known for its showy, pink or purple flowers. Due to habitat loss and coastal development, it is considered a rare and endangered species in many areas of its native range.",
    "distribution_introduced_art_desc": "Abronia glaucescens was mainly introduced to the western United States, particularly in California and Oregon. It thrives in coastal sage scrub and chaparral habitats, where it benefits from the mild, Mediterranean climate. This plant is often found in disturbed soils and can colonize areas after fires or human activity. Its introduction has led to its establishment in several natural areas, sometimes displacing native vegetation. Due to its adaptability, it is considered a potential invasive species in some regions."
}
