{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrodictyum tamarisciforme",
    "plant_slug": "abrodictyum-tamarisciforme",
    "plant_name_scientific": "abrodictyum tamarisciforme",
    "intro": "Abrodictyum tamarisciforme, commonly known as the desert bell, is a flowering plant native to arid regions of South America. It belongs to the orchid family, Orchidaceae, and is characterized by its unique, bell-shaped flowers that are typically yellow or orange in color. The plant has a compact growth habit with linear leaves and produces showy inflorescences that bloom during the dry season. It is adapted to survive in harsh, dry environments with minimal water availability. Its ornamental value makes it a popular choice for cultivation in xeriscapic gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrodictyum tamarisciforme is primarily native to southern Africa, specifically South Africa. It is found in the coastal regions of the Eastern Cape and the Western Cape provinces. This plant thrives in sandy soils along the coastline and in areas with a Mediterranean climate. It is commonly associated with rocky outcrops and coastal dunes. Its distribution is limited to these specific habitats due to its particular environmental requirements.",
    "distribution_introduced_art_desc": "Abrodictyum tamarisciforme was mainly introduced to the western United States, particularly in California and Nevada, as an ornamental plant due to its unique, candelabra-like growth form and attractive foliage. It was often cultivated in gardens and landscapes for its aesthetic value, despite its potential to become invasive in certain environments. The plant thrives in dry, rocky soils and is adapted to arid and semi-arid climates, which contributed to its popularity in drought-tolerant landscaping. However, its rapid spread in some areas has raised concerns about its impact on native plant communities. As a result, it is now monitored in several regions to prevent ecological disruption."
}
