{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella trichoachaenia",
    "plant_slug": "abrotanella-trichoachaenia",
    "plant_name_scientific": "abrotanella trichoachaenia",
    "intro": "Abrotanella trichoachaenia, commonly known as the woolly abrotanella, is a flowering plant native to South America, particularly Argentina and Chile. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant features hairy, glandular leaves that are typically grayish-green in color, and it produces small, yellowish flowers that bloom in the spring. Abrotanella trichoachaenia is often found in rocky or arid environments, where it thrives in well-drained soils. Its botanical structure reflects adaptations to its native habitat, with features that help it conserve water and resist herbivory.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella trichoachaenia"
    },
    "taxonomy_art_desc": "Abrotanella trichoachaenia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Asterales, a group of flowering plants that includes many species with composite flowers, such as daisies and sunflowers. Its family is Asteraceae, commonly known as the aster family, which is characterized by its unique flower heads composed of many small florets. Its genus is Abrotanella, a group of flowering plants typically found in arid regions, often with small, showy flowers. Its species is Abrotanella trichoachaenia, a specific type of plant within the genus Abrotanella, distinguished by its particular morphology and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina South",
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella trichoachaenia is primarily native to Argentina South and Chile South. This plant is commonly found in the temperate regions of these areas. It thrives in open habitats such as grasslands and rocky slopes. Its distribution is largely restricted to the southern parts of these countries. The species is well adapted to the local climate and soil conditions in these regions.",
    "distribution_introduced_art_desc": "Abrotanella trichoachaenia was mainly introduced to the Pacific Northwest region of the United States. It was primarily spread through human activity, such as accidental transport on vehicles or equipment. This plant thrives in disturbed soils and can quickly colonize open areas. It is considered an invasive species due to its rapid growth and competitive nature. Its introduction has led to concerns about its impact on native plant communities."
}
