{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia crux-maltae",
    "plant_slug": "abronia-crux-maltae",
    "plant_name_scientific": "abronia crux-maltae",
    "intro": "Abronia crux-maltae, commonly known as the Malta cross, is a flowering plant native to the Mediterranean region. It is a member of the Scrophulariaceae family and is characterized by its distinctive cross-shaped flower. The plant typically grows in rocky or sandy soils and thrives in sunny, well-drained environments. Its flowers are usually pink or purple and bloom in the spring. Due to habitat loss, it is considered endangered in some areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia crux-maltae is primarily native to the Chihuahuan Desert region of northern Mexico and the southern United States, specifically in Texas and New Mexico. It thrives in rocky soils and is commonly found in areas with low rainfall and high solar exposure. This plant is adapted to arid and semi-arid environments, often growing in crevices or on rocky outcrops. It is known for its distinctive red flowers and is considered a rare and endangered species. Due to habitat loss and environmental changes, its native distribution has become increasingly limited.",
    "distribution_introduced_art_desc": "Abronia crux-maltae was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in coastal dunes and sandy soils along the Pacific coast. This plant has become established in these regions, often thriving in disturbed or open habitats. Its introduction is believed to be due to human activity, including transportation and landscaping. However, it is considered a non-native species and has not been widely reported as invasive."
}
