{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia carletonii",
    "plant_slug": "abronia-carletonii",
    "plant_name_scientific": "abronia carletonii",
    "intro": "Abronia carletonii, commonly known as the Carleton's bladderwort, is a small aquatic plant native to the southeastern United States. It is characterized by its tiny, bladder-like structures that trap small aquatic organisms, aiding in its nutrient acquisition. The plant typically grows in slow-moving freshwater habitats such as ponds and marshes. Its leaves are usually submerged, while its flowering stems emerge above the water surface. Abronia carletonii plays a role in aquatic ecosystems by contributing to the food web and maintaining water quality.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia carletonii is primarily native to the eastern United States, specifically found in the Appalachian Mountains. It thrives in moist, acidic soils within forested areas. This plant is commonly associated with stream banks and rocky outcrops. It is most prevalent in states such as North Carolina, Tennessee, and Virginia. Due to habitat loss, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abronia carletonii was mainly introduced to areas with moist, well-drained soils and partial shade, typically in woodland or forested regions. It thrives in temperate climates and is often found in regions with cool, humid conditions. The plant is commonly cultivated in gardens for its attractive, bell-shaped flowers. It has been introduced to several parts of the world, including North America and Europe, where it is grown as an ornamental species. Due to its adaptability, it has become a popular choice for shady garden landscapes."
}
