{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia umbellata var. platyphylla",
    "plant_slug": "abronia-umbellata-var-platyphylla",
    "plant_name_scientific": "abronia umbellata var. platyphylla",
    "intro": "Abronia umbellata var. platyphylla, commonly known as the broadleaf sandmat, is a low-growing perennial plant native to the southwestern United States and northern Mexico. It features a mat-forming growth habit with fleshy, succulent leaves that are typically broad and oval in shape. The plant produces small, white or pale pink flowers in clusters at the ends of its stems, often blooming in spring. It thrives in well-drained, sandy or gravelly soils and is adapted to arid or semi-arid environments. Its succulent leaves help it store water, making it drought-tolerant and suitable for xeriscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia umbellata var. platyphylla is primarily native to the coastal regions of southern California and northern Baja California, Mexico. It thrives in sandy or gravelly soils along the shoreline, often in areas with mild, coastal climates. This variety is adapted to the unique environmental conditions of the Pacific coast, including salt spray and fluctuating moisture levels. It is commonly found in dunes and along the edges of tidal pools. Due to its limited range, it is considered a rare and specialized plant species in its native habitat.",
    "distribution_introduced_art_desc": "Abronia umbellata var. platyphylla was mainly introduced to coastal dunes and sandy soils in California, where it thrives in well-drained, sunny conditions. It is often found in disturbed habitats such as roadsides and beach areas due to its ability to colonize open, dry environments. This plant is considered an invasive species in some regions, outcompeting native vegetation and altering local ecosystems. Its introduction has been linked to human activities, including landscaping and accidental seed dispersal. Due to its rapid growth and adaptability, it poses a challenge for conservation efforts in native plant communities."
}
