{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia × neurophylla",
    "plant_slug": "abronia-×-neurophylla",
    "plant_name_scientific": "abronia × neurophylla",
    "intro": "Abronia × neurophylla, commonly known as the hybrid sea bean, is a flowering plant native to the coastal regions of California and Baja California. It belongs to the family Malvaceae and is characterized by its trailing growth habit and showy, pinkish-purple flowers. The plant produces capsule fruits that contain numerous small, smooth seeds. It thrives in sandy or gravelly soils and is often found in dune environments. Due to its ornamental value, it is sometimes cultivated in coastal gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia × neurophylla is primarily native to the western United States, specifically California and Oregon. It is commonly found in coastal scrub and sand dune habitats. This hybrid species arises from the interbreeding of Abronia species native to these regions. It thrives in sandy, well-drained soils and is often found in areas with mild, coastal climates. Due to its limited range, it is considered a rare and endangered plant in some parts of its native habitat.",
    "distribution_introduced_art_desc": "Abronia × neurophylla was mainly introduced to areas with sandy or gravelly soils, often in coastal or inland dunes. It thrives in regions with full sun exposure and well-drained soil conditions. This plant is commonly found in the southwestern United States, particularly in California and Nevada. It has been introduced to various ecological zones where it can establish itself quickly due to its adaptability. However, its spread can sometimes lead to competition with native species in these environments."
}
