{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella spathulata",
    "plant_slug": "abrotanella-spathulata",
    "plant_name_scientific": "abrotanella spathulata",
    "intro": "Abrotanella spathulata, commonly known as the broadleaf everlasting or narrowleaf everlasting, is a flowering plant native to the western United States. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant produces small, showy yellow flowers that bloom in late spring to early summer. It is often found in dry, rocky habitats and is adapted to arid environments. Its foliage is usually gray-green and covered in fine hairs, which help reduce water loss.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella spathulata"
    },
    "taxonomy_art_desc": "Abrotanella spathulata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a variety of flower structures. Its order is Asterales, which includes flowering plants with showy flowers, such as daisies and sunflowers, and is known for its diverse floral morphology. Its family is Asteraceae, commonly known as the aster family, which includes plants with composite flowers and is one of the largest families of flowering plants. Its genus is Abrotanella, a group of flowering plants native to southern Africa, often characterized by their small, clustered flowers and hairy leaves. Its species is Abrotanella spathulata, a specific type within the genus Abrotanella, distinguished by its spatulate leaves and is commonly found in arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Antipodean Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella spathulata is primarily native to the Antipodean Islands. This species is found in the unique ecosystems of these remote islands, which are located in the Southern Ocean. It thrives in the harsh, coastal environments characterized by strong winds and limited soil nutrients. The plant is adapted to the extreme climate conditions of the region, making it a resilient species. Its distribution is restricted to these islands, highlighting its endemic nature.",
    "distribution_introduced_art_desc": "Abrotanella spathulata was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed soils along roadsides, open woodlands, and dry meadows. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It spreads primarily through seeds that are dispersed by wind, water, and animals. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
