{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia umbellata var. variabilis",
    "plant_slug": "abronia-umbellata-var-variabilis",
    "plant_name_scientific": "abronia umbellata var. variabilis",
    "intro": "Abronia umbellata var. variabilis, commonly known as the variable sandverbena, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its low-growing, mat-forming habit and produces clusters of small, showy flowers in shades of pink to white. The plant thrives in sandy or gravelly soils and is often found in arid or semi-arid environments. It has small, narrow leaves and is adapted to withstand drought conditions. The species is noted for its variability in flower color and leaf shape, which contributes to its common name.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia umbellata var. variabilis is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and parts of California. This plant typically grows in arid and semi-arid environments, including rocky soils and sandy plains. It is commonly associated with desert scrub and chaparral habitats. Its native range includes areas with low rainfall and high sunlight exposure.",
    "distribution_introduced_art_desc": "Abronia umbellata var. variabilis was mainly introduced to the western United States, particularly in California and Oregon. It thrives in coastal dunes and sandy soils, where it plays a role in stabilizing sand dunes and providing habitat for native wildlife. This variety is known for its delicate pink to purple flowers that bloom in the spring. It is often found in disturbed coastal areas and can spread rapidly under favorable conditions. Due to its adaptability, it has become a common sight in coastal restoration projects."
}
