{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia carnea var. wootonii",
    "plant_slug": "abronia-carnea-var-wootonii",
    "plant_name_scientific": "abronia carnea var. wootonii",
    "intro": "Abronia carnea var. wootonii, commonly known as the Wooton's sand verbena, is a flowering plant native to the coastal regions of California. It is a low-growing perennial shrub that thrives in sandy, well-drained soils. The plant produces small, tubular flowers that are typically pink or purple in color, which attract pollinators such as bees and butterflies. It is adapted to coastal climates and is often found in dunes and other sandy habitats. Due to its limited distribution and specific habitat requirements, it is considered a rare and sensitive species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia carnea var. wootonii is primarily native to the coastal regions of California, particularly in the southern part of the state. This plant is found in sandy or gravelly soils along the shoreline, often in areas with mild, Mediterranean climates. It thrives in dune environments and is commonly associated with coastal scrub habitats. The species is also present in parts of Baja California, Mexico, where it grows in similar ecological conditions. Due to its limited range, it is considered a rare and endemic plant within its native habitat.",
    "distribution_introduced_art_desc": "Abronia carnea var. wootonii was mainly introduced to the western United States, particularly in California and Oregon. It thrives in coastal scrub and sand dune habitats, where it benefits from the mild, moist climate and well-drained soils. This variety is often found in areas with low nutrient levels, making it a hardy and resilient plant. Its introduction has led to its establishment in several natural and disturbed sites along the Pacific coast. However, it is considered a non-native species in these regions, raising concerns about its impact on local ecosystems."
}
