{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia parviflora",
    "plant_slug": "abronia-parviflora",
    "plant_name_scientific": "abronia parviflora",
    "intro": "Abronia parviflora, commonly known as the coastal sand verbena, is a flowering plant native to the western United States and parts of Mexico. It is a low-growing perennial that thrives in sandy, well-drained soils along coastal areas. The plant produces small, pink or purple flowers that bloom in the spring and summer. Its leaves are narrow and often covered in a fine, white powdery coating, which helps reduce water loss. Abronia parviflora is adapted to harsh coastal conditions, making it a hardy and resilient species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia parviflora is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It is commonly found in coastal dunes and sandy soils along the Atlantic and Gulf coasts. This plant thrives in well-drained, sandy environments and is adapted to salt spray and wind exposure. It plays an important role in stabilizing dune ecosystems and providing habitat for various wildlife species. Due to habitat loss and environmental changes, it is considered a species of conservation concern in some areas.",
    "distribution_introduced_art_desc": "Abronia parviflora was mainly introduced to areas with well-drained sandy or gravelly soils, typically in open, sunny habitats. It is commonly found in coastal dunes, maritime heaths, and disturbed sites along the Atlantic coast. This plant thrives in regions with mild, temperate climates and moderate rainfall. It is often associated with maritime ecosystems and is adapted to salt spray and wind exposure. Due to its specific habitat requirements, it is considered a rare and specialized species in its native range."
}
