{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia umbellata subsp. acutalata",
    "plant_slug": "abronia-umbellata-subsp-acutalata",
    "plant_name_scientific": "abronia umbellata subsp. acutalata",
    "intro": "Abronia umbellata subsp. acutalata, commonly known as the narrowleaf sand verbena, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its slender, erect stems and small, clustered flowers that range in color from white to pink. The leaves are typically narrow and lance-shaped, with a silvery or grayish underside that helps reflect sunlight. This subspecies thrives in sandy or gravelly soils and is often found in coastal dunes or dry, open habitats. It plays an important role in local ecosystems by providing nectar for pollinators and stabilizing coastal dunes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia umbellata"
    },
    "taxonomy_art_desc": "Abronia umbellata subsp. acutalata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and their close relatives, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary adaptations. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral symmetry and often contains species adapted to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers and often contains species with specialized pollination mechanisms. Its genus is Abronia, a group of flowering plants native to South America, characterized by their succulent leaves and colorful flowers. Its species is Abronia umbellata, a specific plant within the genus Abronia, distinguished by its umbellate inflorescence and specific morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "British Columbia",
        "Washington"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia umbellata subsp. acutalata is primarily native to British Columbia and Washington. This subspecies is found in coastal regions along the Pacific Northwest. It typically grows in sandy or gravelly soils near the shore. The plant is adapted to the mild, wet climate of these areas. It is commonly seen in dunes and other coastal habitats.",
    "distribution_introduced_art_desc": "Abronia umbellata subsp. acutalata was mainly introduced to areas with well-drained sandy or gravelly soils, typically in coastal or inland dunes. It thrives in full sun and is adapted to arid or semi-arid climates. This subspecies is commonly found in regions such as southern California, Baja California, and parts of Oregon. It is often used in xeriscaping due to its drought tolerance and ornamental value. However, it can become invasive in certain environments if not managed properly."
}
