{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia pogonantha",
    "plant_slug": "abronia-pogonantha",
    "plant_name_scientific": "abronia pogonantha",
    "intro": "Abronia pogonantha, commonly known as the desert bellflower, is a flowering plant native to the arid regions of the southwestern United States and northwestern Mexico. It is characterized by its low, mat-forming growth habit and features small, tubular flowers that range in color from white to pink. The plant has thick, fleshy leaves that help it conserve water in its harsh, dry environment. It produces showy, bell-shaped blooms that attract pollinators such as bees and butterflies. Abronia pogonantha is adapted to extreme desert conditions, making it a resilient and hardy species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia pogonantha"
    },
    "taxonomy_art_desc": "Abronia pogonantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their showy flowers and diverse habitats. Its order is Caryophyllales, a group of flowering plants that includes many succulent and ornamental species, often found in arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy flowers that open in the late afternoon. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their colorful flowers and succulent leaves. Its species is Abronia pogonantha, a specific type of plant within the genus Abronia, distinguished by its unique morphological features and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia pogonantha is primarily native to California. It is found in specific regions within the state, particularly in coastal and inland areas. This plant typically grows in sandy or gravelly soils along the coastline. It is often associated with dunes and other coastal habitats. Its distribution is limited to certain parts of California, reflecting its adaptation to specific environmental conditions.",
    "distribution_introduced_art_desc": "Abronia pogonantha was mainly introduced to areas with sandy or gravelly soils, particularly in coastal regions. It thrives in environments with low nutrient levels and is often found in dunes or along the edges of salt marshes. This plant is well adapted to harsh, saline conditions and can tolerate periods of drought. Its introduction has been noted in several coastal states along the Atlantic and Gulf coasts of the United States. Due to its hardy nature, it has become an invasive species in some areas where it outcompetes native vegetation."
}
