{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrophyllum microcarpum",
    "plant_slug": "abrophyllum-microcarpum",
    "plant_name_scientific": "abrophyllum microcarpum",
    "intro": "Abrophyllum microcarpum, commonly known as the dwarf sandmat, is a flowering plant native to arid regions of the southwestern United States and northern Mexico. It is a low-growing perennial herb with small, fleshy leaves that help it conserve water in its harsh environment. The plant produces yellow flowers that bloom in the spring, attracting pollinators such as bees and butterflies. Its fruit is a small, dry capsule that releases tiny seeds when mature. Abrophyllum microcarpum is adapted to sandy soils and can tolerate extreme temperature fluctuations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Rousseaceae",
        "genus": "Abrophyllum",
        "species": "Abrophyllum microcarpum"
    },
    "taxonomy_art_desc": "Abrophyllum microcarpum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to photosynthesize. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and a wide range of habitats. Its order is Asterales, a group of flowering plants that includes sunflowers, daisies, and other plants with composite flower heads and often aromatic properties. Its family is Rousseaceae, a family of flowering plants commonly found in temperate regions, known for their grass-like leaves and small flowers. Its genus is Abrophyllum, a genus of flowering plants typically characterized by their small, clustered flowers and narrow leaves. Its species is Abrophyllum microcarpum, a specific plant within the genus Abrophyllum, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrophyllum microcarpum is primarily native to New South Wales. It is commonly found in the coastal regions and sand dunes of the state. This plant thrives in sandy soils and is often seen along the shores of the Pacific Ocean. It plays an important role in stabilizing dune ecosystems. Its distribution is limited to specific habitats within New South Wales.",
    "distribution_introduced_art_desc": "Abrophyllum microcarpum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and coastal dunes. It thrives in environments with moderate to high sunlight exposure and well-drained soils. The plant is commonly found in regions with a temperate climate, including parts of Europe and North America. Its introduction has been associated with human activities, such as land development and transportation. Due to its rapid growth and ability to colonize new areas, it is considered a potential invasive species in some regions."
}
