{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella nivigena",
    "plant_slug": "abrotanella-nivigena",
    "plant_name_scientific": "abrotanella nivigena",
    "intro": "Abrotanella nivigena, commonly known as the snowplant, is a low-growing perennial herb native to the coastal regions of southern California and Baja California. It produces small, white to pinkish flowers that bloom in the spring, often in clusters at the ends of its stems. The plant has hairy, lance-shaped leaves that are adapted to the dry, sandy soils of its habitat. It thrives in full sun and is drought-tolerant once established. Abrotanella nivigena is also known for its ability to survive in harsh coastal conditions, making it a characteristic species of coastal scrub ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella nivigena"
    },
    "taxonomy_art_desc": "Abrotanella nivigena belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with complex floral structures. Its order is Asterales, which consists of flowering plants known for their showy flowers and includes families such as the sunflowers and daisies. Its family is Asteraceae, commonly known as the aster family, which is characterized by composite flower heads and includes over 32,000 species. Its genus is Abrotanella, a group of flowering plants native to South America, typically found in alpine and arid regions. Its species is Abrotanella nivigena, a specific plant species within the genus Abrotanella, known for its small, white flowers and adapted to high-altitude environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella nivigena is primarily native to New South Wales and Victoria. This species is commonly found in the temperate regions of southeastern Australia. It thrives in rocky outcrops and open habitats within these states. The plant is well adapted to the local climate and soil conditions of the area. It plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Abrotanella nivigena was mainly introduced to areas with cool, moist climates and well-drained soils, often found in mountainous regions. It is typically spread through seeds carried by wind, water, or human activity. This plant is considered invasive in some regions due to its rapid growth and ability to outcompete native species. It thrives in disturbed habitats such as roadsides, meadows, and forest edges. Its introduction has led to concerns about ecological impact and habitat alteration in certain ecosystems."
}
