{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia texana",
    "plant_slug": "abronia-texana",
    "plant_name_scientific": "abronia texana",
    "intro": "Abronia texana, commonly known as the Texas sand verbena, is a flowering plant native to the arid regions of Texas. It is a low-growing annual herb with small, clustered flowers that bloom in shades of pink and white. The plant has adapted to harsh desert conditions with a deep root system and succulent leaves that store water. It thrives in sandy or gravelly soils and is often found in open habitats such as plains and disturbed areas. Due to its limited range and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia texana is primarily native to the southwestern United States and northern Mexico. It is commonly found in Texas, New Mexico, and parts of Arizona. This plant typically grows in rocky soils and dry, open habitats. It is often associated with limestone and sandstone areas. Its native range includes regions with arid and semi-arid climates.",
    "distribution_introduced_art_desc": "Abronia texana was mainly introduced to the western United States, particularly in Texas and New Mexico. It is commonly found in disturbed habitats such as roadsides, open woodlands, and sandy soils. This species thrives in arid and semi-arid environments, making it well adapted to the climate of its introduced range. It is often seen growing in clusters, with its distinctive blue or purple flowers attracting pollinators like bees and butterflies. Due to its hardy nature, it has become a common sight in ecological restoration projects across its introduced range."
}
