{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum congestum",
    "plant_slug": "abrotanum-congestum",
    "plant_name_scientific": "abrotanum congestum",
    "intro": "Abrotanum congestum, commonly known as the clustered abrotanum, is a flowering plant native to South America, particularly Brazil. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant features narrow, gray-green leaves and produces small, yellowish flowers that bloom in clusters. It is often found in dry, open habitats such as grasslands and rocky areas. Due to its ornamental value and medicinal properties, it is occasionally cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum congestum is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and Texas, as well as parts of Baja California and Sonora. This plant typically grows in dry, rocky, or sandy soils in desert and semi-desert environments. It is commonly associated with areas that have low rainfall and high temperatures. Its native range includes habitats such as creosote bush scrub and chaparral.",
    "distribution_introduced_art_desc": "Abrotanum congestum was mainly introduced to control invasive plant species in coastal and sandy environments. It is commonly found in disturbed areas such as roadsides, dunes, and abandoned fields. This plant thrives in well-drained soils and full sunlight, making it adaptable to various habitats. Its introduction has been primarily for ecological restoration and erosion control. However, it has also shown potential to become a weed in some regions."
}
