{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia × platyphylla",
    "plant_slug": "abronia-×-platyphylla",
    "plant_name_scientific": "abronia × platyphylla",
    "intro": "Abronia × platyphylla, commonly known as the coastal sand verbena, is a flowering plant native to the southwestern United States and northwestern Mexico. It is a hybrid species resulting from the cross between Abronia umbellata and Abronia tetragona. This plant typically grows in sandy or gravelly soils along coastal dunes and rocky coastlines. It produces small, showy flowers in shades of pink, purple, and white, often in clusters at the ends of its stems. The species is adapted to coastal environments, exhibiting drought tolerance and salt resistance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia × platyphylla is primarily native to the coastal regions of California, particularly in the southern part of the state. It is found in sandy and dune environments along the Pacific coast. This plant thrives in areas with mild, Mediterranean climates and well-drained soils. It is commonly associated with the coastal scrub and dune ecosystems. Its distribution is limited to specific habitats where it can receive adequate sunlight and minimal water retention.",
    "distribution_introduced_art_desc": "Abronia × platyphylla was mainly introduced to areas with sandy soils and coastal environments, particularly in the southwestern United States. It is commonly found in regions such as California and Oregon, where it thrives in well-drained, sunny conditions. This plant is often seen in disturbed habitats, including roadsides and dunes, due to its adaptability. Its introduction has been associated with human activity, including landscaping and restoration projects. However, it is considered an invasive species in some areas, outcompeting native vegetation."
}
