{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia speciosa",
    "plant_slug": "abronia-speciosa",
    "plant_name_scientific": "abronia speciosa",
    "intro": "Abronia speciosa, commonly known as the showy bladderwort, is a flowering plant native to the coastal regions of California and Baja California. It is a member of the family Saururaceae and is characterized by its small, showy flowers that range in color from white to pink. The plant typically grows in sandy or rocky habitats along the coastline, where it thrives in the unique microclimates provided by the ocean breeze. Its leaves are succulent and often form a rosette, helping to store water in its arid environment. Abronia speciosa is also known for its ability to produce small, bladder-like structures that may aid in water retention or possibly in trapping small organisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia speciosa is primarily native to the coastal regions of California and Baja California, Mexico. It thrives in sandy or gravelly soils along the Pacific coast. This plant is commonly found in dunes, beaches, and coastal scrub habitats. It is well adapted to the harsh, saline conditions of its environment. Its distribution is limited to a relatively small geographic area within these coastal zones.",
    "distribution_introduced_art_desc": "Abronia speciosa was mainly introduced to coastal dunes and sandy soils in the Pacific Northwest of the United States. It has established itself in areas with well-drained soils and full sun exposure. The plant's introduction has led to competition with native vegetation in some regions. It is often found growing in clusters along the shoreline. Its presence has raised concerns among conservationists due to its potential impact on local ecosystems."
}
