{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia nana var. covillei",
    "plant_slug": "abronia-nana-var-covillei",
    "plant_name_scientific": "abronia nana var. covillei",
    "intro": "Abronia nana var. covillei, commonly known as the Coville's dwarf sandverbena, is a low-growing perennial plant native to the southwestern United States. It is characterized by its compact, mat-forming growth habit and small, hairy leaves. The plant produces clusters of pale blue to violet flowers during the spring and early summer. It thrives in well-drained, sandy soils and is often found in arid or semi-arid environments. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia nana"
    },
    "taxonomy_art_desc": "Abronia nana var. covillei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms. Its order is Caryophyllales, a group of flowering plants that includes species with distinctive flowers and often contains plants adapted to arid environments. Its family is Nyctaginaceae, commonly known as the four o'clock family, which includes plants with showy, often nocturnal flowers. Its genus is Abronia, a group of flowering plants native to the Americas, known for their small, showy flowers and succulent-like leaves. Its species is Abronia nana, a specific type within the genus Abronia, characterized by its small size and distinctive floral morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California",
        "Nevada"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia nana var. covillei is primarily native to California and Nevada. This plant is found in the western United States, specifically in these two states. It typically grows in arid and semi-arid environments, such as rocky soils and open habitats. The species is part of the Geraniaceae family and is known for its small, clustered flowers. Its limited distribution reflects its adaptation to specific ecological conditions in the region.",
    "distribution_introduced_art_desc": "Abronia nana var. covillei was mainly introduced to the western United States, particularly in California and Oregon. It was brought there for ornamental purposes due to its attractive, small, blue flowers. This plant thrives in well-drained soils and full sun, making it suitable for rock gardens and coastal landscapes. However, it has become invasive in some areas, outcompeting native vegetation. Its spread has raised concerns among conservationists due to its potential ecological impact."
}
