{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum platylobum",
    "plant_slug": "abrotanum-platylobum",
    "plant_name_scientific": "abrotanum platylobum",
    "intro": "Abrotanum platylobum, commonly known as narrow-leaved bushveld daisy, is a flowering plant native to southern Africa. It is characterized by its upright growth habit and produces small, yellow flowers arranged in a flat-topped cluster. The plant has narrow, lance-shaped leaves that are typically covered in fine hairs. It thrives in well-drained soils and is often found in grassland and rocky habitats. Abrotanum platylobum is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum platylobum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, sunny environments such as rocky soils and coastal areas. This plant is commonly found in countries like Spain, Portugal, Morocco, and Turkey. It is well adapted to arid and semi-arid climates, making it a characteristic species of these regions. Its distribution is closely linked to the ecological conditions of the Mediterranean Basin.",
    "distribution_introduced_art_desc": "Abrotanum platylobum was mainly introduced to control invasive plant species and stabilize soil in degraded areas. It is commonly used in restoration projects due to its rapid growth and ability to thrive in poor soil conditions. This plant is also valued for its medicinal properties, which have been utilized in traditional herbal remedies. However, its introduction has raised concerns about potential ecological impacts in non-native regions. Despite its benefits, careful management is required to prevent it from becoming invasive itself."
}
