{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia turbinata",
    "plant_slug": "abronia-turbinata",
    "plant_name_scientific": "abronia turbinata",
    "intro": "Abronia turbinata, commonly known as the Turbinated Abronia, is a flowering plant native to the coastal regions of southern California and Baja California. It is a member of the Scrophulariaceae family, which includes many species of flowering plants adapted to arid environments. The plant produces small, tubular flowers that are typically pink or purple, which attract pollinators such as bees and butterflies. It thrives in sandy soils and is often found in dunes or along the coastline where it is exposed to salt spray. Due to its limited distribution and habitat specificity, it is considered a rare and endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia turbinata"
    },
    "taxonomy_art_desc": "Abronia turbinata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers. Its order is Caryophyllales, a group of flowering plants that includes plants with distinctive floral structures and often contains species adapted to arid environments. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy, often brightly colored flowers. Its genus is Abronia, a group of flowering plants native to the Americas, typically characterized by their fleshy leaves and showy flowers. Its species is Abronia turbinata, a specific plant within the genus Abronia, known for its distinctive turbinate (helical) flowers and preference for rocky, arid habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "California",
        "Nevada",
        "Oregon"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia turbinata is primarily native to California, Nevada, and Oregon. This species is commonly found in coastal and inland areas within these states. It thrives in sandy or gravelly soils, often in open habitats such as dunes or disturbed areas. The plant is known for its small, showy flowers that bloom in the spring. Its distribution is largely restricted to the western United States, where it plays an important role in local ecosystems.",
    "distribution_introduced_art_desc": "Abronia turbinata was mainly introduced to areas with sandy or gravelly soils, particularly in coastal and inland dunes. It thrives in well-drained environments and is often found in regions with moderate to high levels of sunlight. This plant is commonly associated with disturbed soils and can colonize areas that have been impacted by human activity or natural events. Its distribution is largely limited to the western United States, including California, Oregon, and Nevada. It plays a role in stabilizing dune ecosystems and providing habitat for various invertebrates."
}
