{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia umbellata subsp. insularis",
    "plant_slug": "abronia-umbellata-subsp-insularis",
    "plant_name_scientific": "abronia umbellata subsp. insularis",
    "intro": "Abronia umbellata subsp. insularis, commonly known as the Insular Abronia, is a flowering plant native to the Canary Islands. It is a low-growing perennial shrub characterized by its compact, mat-forming growth habit. The plant produces small, white to pale pink flowers arranged in umbels, which are typically borne on slender stems. Its leaves are usually narrow and covered with a fine layer of white hair, which helps reduce water loss in its arid habitat. This subspecies is adapted to rocky and coastal environments, showcasing its resilience to harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia umbellata subsp. insularis is primarily native to the Galápagos Islands. This subspecies is found exclusively on the islands of Santa Cruz and Isabela. It thrives in the dry, coastal habitats of these islands. The plant is adapted to the unique environmental conditions of the Galápagos ecosystem. Due to its restricted range, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Abronia umbellata subsp. insularis was mainly introduced to areas with sandy soils and coastal environments, particularly in the Mediterranean region. It thrives in well-drained, saline soils and is often found in dune ecosystems. This subspecies is valued for its ornamental flowers and is commonly cultivated in gardens and coastal landscapes. Its introduction has sometimes led to concerns about its potential to become invasive in non-native habitats. Due to its specific ecological requirements, it is less likely to spread beyond its intended planting areas."
}
