{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanum viridulum",
    "plant_slug": "abrotanum-viridulum",
    "plant_name_scientific": "abrotanum viridulum",
    "intro": "Abrotanum viridulum, commonly known as greenweed, is a flowering plant native to Europe and parts of Asia. It is a member of the Asteraceae family, characterized by its composite flower heads and serrated leaves. The plant typically grows in meadows, grasslands, and disturbed soils, reaching heights of up to 60 cm. Its small, yellow flowers bloom in the summer, and it produces fluffy, wind-dispersed seeds. The leaves are aromatic and have been used historically in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanum viridulum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky soils and is commonly found in coastal areas, scrublands, and open woodlands. This plant is well adapted to arid and semi-arid climates, often growing in full sun. It has a long history of use in traditional medicine and is known for its aromatic leaves and small yellow flowers. Its distribution is closely linked to the ecological conditions of the Mediterranean basin.",
    "distribution_introduced_art_desc": "Abrotanum viridulum was mainly introduced to the United States as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread beyond cultivation and is now considered an invasive species in several western states. The plant thrives in disturbed soils and can outcompete native vegetation in arid and semi-arid environments. Its rapid growth and ability to reproduce both vegetatively and through seeds contribute to its spread. Management efforts often focus on preventing its establishment in sensitive ecosystems."
}
