{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abroma augustum",
    "plant_slug": "abroma-augustum",
    "plant_name_scientific": "abroma augustum",
    "intro": "Abroma augustum, commonly known as the silverleaf abroma, is a flowering plant native to tropical and subtropical regions of Africa and Asia. It belongs to the family Malvaceae, which includes cotton and hibiscus, and is characterized by its showy, pale blue to violet flowers. The plant typically grows as an erect shrub, reaching heights of up to 1.5 meters, with elliptical leaves that have a silvery-gray underside. Its flowers bloom in clusters and are pollinated primarily by insects, contributing to its ecological role in supporting local pollinator populations. Abroma augustum is also valued for its ornamental appeal and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abroma",
        "species": "Abroma augustum"
    },
    "taxonomy_art_desc": "Abroma augustum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which consists of vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malvales, which comprises flowering plants with a distinctive structure of flowers and often includes plants with showy blooms. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and hibiscus. Its genus is Abroma, a group of flowering plants that are typically shrubs or herbs with showy flowers. Its species is Abroma augustum, a specific type of plant within the genus Abroma, known for its ornamental value and unique flower structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Assam",
        "Bangladesh",
        "Borneo",
        "Cambodia",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "Jawa",
        "Lesser Sunda Is.",
        "Malaya",
        "Maluku",
        "Myanmar",
        "Nepal",
        "New Guinea",
        "Nicobar Is.",
        "Philippines",
        "Solomon Is.",
        "Sulawesi",
        "Thailand",
        "Vietnam"
    ],
    "distribution_introduced": [
        "Cameroon",
        "Caroline Is.",
        "Congo",
        "DR Congo",
        "Queensland",
        "Trinidad-Tobago",
        "Vanuatu"
    ],
    "distribution_native_art_desc": "Abroma augustum is primarily native to Assam, Bangladesh, Borneo, Cambodia, China South-Central, China Southeast, East Himalaya, Jawa, Lesser Sunda Is., Malaya, Maluku, Myanmar, Nepal, New Guinea, Nicobar Is., Philippines, Solomon Is., Sulawesi, Thailand, and Vietnam. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant thrives in areas with high humidity and is often associated with forest understories. It is known for its distinctive flowers and is sometimes cultivated for ornamental purposes. Its wide distribution across Southeast Asia and parts of South Asia reflects its adaptability to diverse ecological conditions.",
    "distribution_introduced_art_desc": "Abroma augustum was mainly introduced to Cameroon, Caroline Is., Congo, DR Congo, Queensland, Trinidad-Tobago, and Vanuatu. It is primarily found in tropical and subtropical regions, where it thrives in moist, well-drained soils. The plant is commonly found in coastal areas, riverbanks, and disturbed habitats. It has been reported as an invasive species in some of these regions, outcompeting native vegetation. Its introduction is likely due to human activities such as horticulture and accidental seed dispersal."
}
