{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abromeitiella brevifolia",
    "plant_slug": "abromeitiella-brevifolia",
    "plant_name_scientific": "abromeitiella brevifolia",
    "intro": "Abromeitiella brevifolia, commonly known as the short-leaved abromeitiella, is a flowering plant native to specific regions of South America. It belongs to the Apiaceae family, which includes carrots and parsley, and is characterized by its small, delicate flowers. The plant typically grows in moist, shaded environments, such as forest floors or rocky crevices. Its leaves are short and broad, with a distinctive aromatic scent, and it produces small, white or greenish flowers that bloom in clusters. Due to its limited distribution and specific habitat requirements, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abromeitiella brevifolia is primarily native to the western United States, particularly in California and Oregon. It is commonly found in coastal areas and low elevation habitats such as grasslands and open woodlands. This plant thrives in sandy or gravelly soils and is often associated with disturbed or coastal environments. It is a member of the Apiaceae family and is known for its small, white or pale yellow flowers. Abromeitiella brevifolia is an important component of the local flora in these regions, contributing to biodiversity and ecological stability.",
    "distribution_introduced_art_desc": "Abromeitiella brevifolia was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and along riverbanks. It thrives in temperate climates with well-drained soils and full sun exposure. This plant is often found in regions where human activity has altered the natural landscape. Its introduction has led to its establishment in several non-native regions, sometimes competing with native vegetation. Due to its adaptability, it is considered an invasive species in some areas where it has spread rapidly."
}
