{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia umbellata subsp. platyphylla",
    "plant_slug": "abronia-umbellata-subsp-platyphylla",
    "plant_name_scientific": "abronia umbellata subsp. platyphylla",
    "intro": "Abronia umbellata subsp. platyphylla, commonly known as the flatleaf sandverbena, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its compact growth habit and clusters of small, white to pale blue flowers. The subspecies is distinguished by its broader, flatter leaves compared to other members of the species. It thrives in arid and semi-arid environments, often found in sandy or gravelly soils. The plant is adapted to withstand drought and has a low-growing structure to reduce water loss.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia umbellata subsp. platyphylla is primarily native to the coastal regions of southern California and northern Baja California, Mexico. This subspecies thrives in sandy or gravelly soils along the shoreline, often in areas with mild coastal climates. It is commonly found in dune habitats and is adapted to withstand salt spray and periodic flooding. The plant is an important component of the local flora in these ecosystems. Its distribution is limited to specific coastal zones where it has developed specialized adaptations to the harsh maritime environment.",
    "distribution_introduced_art_desc": "Abronia umbellata subsp. platyphylla was mainly introduced to coastal dunes and sandy soils along the Pacific coast of North America. It thrives in well-drained, nutrient-poor soils and is often found in areas with frequent wind exposure. This subspecies is characterized by its compact growth habit and small, white to pale pink flowers. It is commonly used in restoration projects due to its ability to stabilize sand dunes and prevent erosion. However, its introduction has raised concerns about its potential impact on native plant communities."
}
