{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia arenaria",
    "plant_slug": "abronia-arenaria",
    "plant_name_scientific": "abronia arenaria",
    "intro": "Abronia arenaria, commonly known as the sand verbena, is a flowering plant native to the coastal regions of California and Baja California. It is a low-growing perennial that thrives in sandy, well-drained soils and full sun. The plant produces small, showy flowers in shades of pink, purple, and white, typically blooming from spring to summer. Its leaves are narrow and often covered in fine hairs, which help reduce water loss in arid environments. Abronia arenaria is adapted to coastal conditions and is often found in dunes and other sandy habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia arenaria is primarily native to the coastal regions of southern California and northern Baja California, Mexico. It thrives in sandy or gravelly soils along the shorelines and dunes. This plant is commonly found in areas with mild, Mediterranean climates and is adapted to salt spray and wind exposure. It is often seen in habitats such as beaches, dunes, and coastal scrub. Due to its specific habitat requirements, it is considered a rare and vulnerable species in its native range.",
    "distribution_introduced_art_desc": "Abronia arenaria was mainly introduced to coastal dunes and sandy soils in arid and semi-arid regions. It thrives in environments with minimal moisture and high sunlight exposure. This plant is known for its ability to stabilize sand dunes and prevent erosion. Its introduction has been documented in several parts of the United States and Australia. However, it is considered invasive in some areas, outcompeting native vegetation."
}
