{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia villosa var. villosa",
    "plant_slug": "abronia-villosa-var-villosa",
    "plant_name_scientific": "abronia villosa var. villosa",
    "intro": "Abronia villosa var. villosa, commonly known as the woolly bluemink, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its dense, woolly foliage and clusters of small, blue to violet flowers. The plant thrives in well-drained soils and full sun to partial shade, often found in rocky or sandy habitats. Its ornamental value is enhanced by its unique texture and color, making it a popular choice for rock gardens. The species is also noted for its ability to tolerate drought conditions once established.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia villosa"
    },
    "taxonomy_art_desc": "Abronia villosa var. villosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex life cycles and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and often having spore-producing structures. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Caryophyllales, which comprises flowering plants with a variety of growth forms, including shrubs and herbs, and often features distinctive floral structures. Its family is Nyctaginaceae, a family of flowering plants commonly known as the four-o'clock family, characterized by showy flowers and often containing toxic compounds. Its genus is Abronia, a group of flowering plants native to the Americas, typically featuring showy, often brightly colored flowers. Its species is Abronia villosa, a specific plant within the genus Abronia, known for its hairy stems and clusters of small, colorful flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Mexico Northwest",
        "Nevada",
        "Utah"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia villosa var. villosa is primarily native to Arizona, California, Mexico Northwest, Nevada, and Utah. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy or gravelly soils and is often associated with desert environments. The species is well adapted to the harsh climatic conditions of its native range. It is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Abronia villosa var. villosa was mainly introduced to coastal dunes and sandy soils along the Pacific coast of North America. It is commonly found in areas with well-drained soils and full sun exposure. This plant is often associated with maritime environments and can tolerate salt spray and wind. Its introduction has been documented in several states including California, Oregon, and Washington. It is considered a non-native species in these regions, often spreading along disturbed coastal habitats."
}
