{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abroma nitidum",
    "plant_slug": "abroma-nitidum",
    "plant_name_scientific": "abroma nitidum",
    "intro": "Abroma nitidum, commonly known as the velvetleaf or velvetleaf abroma, is a flowering plant native to tropical regions of Africa, Asia, and Australia. It is a shrub or small tree that typically grows up to 3 meters in height, characterized by its smooth, dark green leaves with a slightly velvety texture. The plant produces small, white to pale yellow flowers arranged in clusters, which are followed by spherical, woody fruits containing several seeds. Abroma nitidum is often found in disturbed habitats such as roadsides and open woodlands, and it has some use in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abroma nitidum is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland and coastal areas. This plant thrives in humid climates and is often associated with mangrove forests and saline environments. It is also present in parts of India and the Andaman Islands. Abroma nitidum is known for its medicinal properties and is used in traditional herbal remedies.",
    "distribution_introduced_art_desc": "Abroma nitidum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought there by horticultural enthusiasts or as part of botanical collections. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shady environments and spreads through both seeds and vegetative growth. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
