{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abronia maritima subsp. capensis",
    "plant_slug": "abronia-maritima-subsp-capensis",
    "plant_name_scientific": "abronia maritima subsp. capensis",
    "intro": "Abronia maritima subsp. capensis, commonly known as the Cape sand verbena, is a flowering plant native to the coastal regions of South Africa. It is a low-growing, herbaceous perennial that thrives in sandy, well-drained soils. The plant produces small, clustered flowers that are typically pink or purple in color, which bloom during the cooler months. It is adapted to coastal environments, tolerating salt spray and strong winds. This subspecies is valued for its ornamental appeal and ecological role in stabilizing dunes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Caryophyllales",
        "family": "Nyctaginaceae",
        "genus": "Abronia",
        "species": "Abronia maritima"
    },
    "taxonomy_art_desc": "Abronia maritima subsp. capensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats around the world. Its order is Caryophyllales, a group of flowering plants that includes many familiar families such as the cacti and the amaranths, often characterized by their distinctive floral structures. Its family is Nyctaginaceae, commonly known as the four-o'clock family, which includes plants with showy, often brightly colored flowers that open in the late afternoon. Its genus is Abronia, a group of flowering plants native to southern Africa, typically characterized by their small, showy flowers and succulent leaves. Its species is Abronia maritima, a specific type within the genus Abronia, known for its adaptations to coastal environments and its distinctive floral morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abronia maritima subsp. capensis is primarily native to Mexico Northwest. This subspecies is found in the coastal regions of northern Mexico, particularly in the states of Sinaloa and Nayarit. It thrives in sandy or rocky soils along the shoreline. The plant is adapted to the arid and semi-arid climate of this region. It is commonly found in coastal dunes and rocky outcrops.",
    "distribution_introduced_art_desc": "Abronia maritima subsp. capensis was mainly introduced to coastal areas with sandy soils and salt spray, where it thrives in maritime environments. It is commonly found in dunes and along the shores of the Atlantic coast. This subspecies is known for its ability to tolerate harsh, saline conditions and frequent wind exposure. Its introduction has been primarily through natural dispersal along coastal habitats. It plays an important role in stabilizing dune systems and supporting local biodiversity."
}
