{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrotanella submarginata",
    "plant_slug": "abrotanella-submarginata",
    "plant_name_scientific": "abrotanella submarginata",
    "intro": "Abrotanella submarginata, commonly known as the narrow-leaved sandmat, is a flowering plant native to arid and semi-arid regions of North America. It is a member of the Asteraceae family, characterized by its composite flower heads that consist of both ray and disk florets. The plant typically grows in sandy or gravelly soils and is well adapted to drought conditions. Its leaves are narrow and often have a waxy coating, which helps reduce water loss. Abrotanella submarginata is often found in disturbed areas and is considered a pioneer species in ecological succession.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Asterales",
        "family": "Asteraceae",
        "genus": "Abrotanella",
        "species": "Abrotanella submarginata"
    },
    "taxonomy_art_desc": "Abrotanella submarginata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and often having rhizomes. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Asterales, which includes flowering plants with typically showy flowers and is known for its diverse members such as daisies and sunflowers. Its family is Asteraceae, commonly known as the aster family, which is one of the largest families of flowering plants, characterized by composite flower heads. Its genus is Abrotanella, a group of flowering plants typically found in arid regions, known for their small, showy flowers and often used in traditional medicine. Its species is Abrotanella submarginata, a specific type within the genus Abrotanella, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Chile South"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrotanella submarginata is primarily native to Chile South. It is found in the southern regions of Chile, particularly in the temperate and subpolar areas. This plant typically grows in coastal and mountainous habitats, often in rocky or sandy soils. It is adapted to the cool, humid climate of the region. Its distribution is limited to specific ecological niches within southern Chile.",
    "distribution_introduced_art_desc": "Abrotanella submarginata was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and rocky slopes. It thrives in regions with moderate to high sunlight exposure and well-drained soils. This plant is often found in coastal and inland areas of California, where it has established itself as a common weed. Its introduction has led to its spread across various ecosystems, sometimes outcompeting native vegetation. Due to its adaptability, it is considered an invasive species in some regions where it has been introduced."
}
