{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus precatorius subsp. africanus",
    "plant_slug": "abrus-precatorius-subsp-africanus",
    "plant_name_scientific": "abrus precatorius subsp. africanus",
    "intro": "Abrus precatorius subsp. africanus, commonly known as the African jequirity, is a climbing legume native to Africa. It is characterized by its distinctive red, bean-like pods that contain toxic seeds covered in a silky, white coating. The plant produces small, white flowers and is often found in tropical and subtropical regions. Its seeds contain abrin, a potent toxin that can be lethal if ingested. Due to its toxicity, it is important to handle the plant with care.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus precatorius"
    },
    "taxonomy_art_desc": "Abrus precatorius subsp. africanus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae that have a complex life cycle and are characterized by their ability to perform photosynthesis. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often associated with early diverging lineages in the angiosperms. Its order is Fabales, which includes plants with legumes and often has a symbiotic relationship with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Abrus, a group of flowering plants known for their striking and often toxic seeds. Its species is Abrus precatorius, a plant known for its ornamental red seeds and toxic properties, with the subspecies africanus being a variant found in Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Aldabra",
        "Angola",
        "Benin",
        "Botswana",
        "Burkina",
        "Burundi",
        "Cameroon",
        "Cape Provinces",
        "Cape Verde",
        "Caprivi Strip",
        "Central African Republic",
        "Chad",
        "Comoros",
        "Congo",
        "DR Congo",
        "Equatorial Guinea",
        "Eritrea",
        "Eswatini",
        "Ethiopia",
        "Gabon",
        "Gambia",
        "Guinea",
        "Guinea-Bissau",
        "Gulf of Guinea Is.",
        "Ivory Coast",
        "Kenya",
        "KwaZulu-Natal",
        "Liberia",
        "Madagascar",
        "Malawi",
        "Mali",
        "Mauritania",
        "Mozambique",
        "Namibia",
        "Niger",
        "Northern Provinces",
        "Rwanda",
        "Saudi Arabia",
        "Senegal",
        "Seychelles",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Togo",
        "Uganda",
        "Yemen",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Honduras",
        "Mauritius",
        "Queensland",
        "Réunion",
        "Venezuela",
        "Venezuelan Antilles"
    ],
    "distribution_native_art_desc": "Abrus precatorius subsp. africanus is primarily native to Aldabra, Angola, Benin, Botswana, Burkina, Burundi, Cameroon, Cape Provinces, Cape Verde, Caprivi Strip, Central African Republic, Chad, Comoros, Congo, DR Congo, Equatorial Guinea, Eritrea, Eswatini, Ethiopia, Gabon, Gambia, Guinea, Guinea-Bissau, Gulf of Guinea Is., Ivory Coast, Kenya, KwaZulu-Natal, Liberia, Madagascar, Malawi, Mali, Mauritania, Mozambique, Namibia, Niger, Northern Provinces, Rwanda, Saudi Arabia, Senegal, Seychelles, Somalia, Sudan-South Sudan, Tanzania, Togo, Uganda, Yemen, Zambia, and Zimbabwe. This species is commonly found in tropical and subtropical regions across these areas. It thrives in a variety of habitats, including forests, savannas, and disturbed soils. The plant is known for its distinctive red seeds and is often used in traditional practices. Its wide distribution reflects its adaptability to different environmental conditions.",
    "distribution_introduced_art_desc": "Abrus precatorius subsp. africanus was mainly introduced to Honduras, Mauritius, Queensland, Réunion, Venezuela, and the Venezuelan Antilles. It has been established in these regions, likely due to human activities such as trade or intentional planting. The plant is known for its ornamental value, which may have contributed to its introduction. However, it can become invasive in some areas, posing a risk to native ecosystems. Its distribution highlights the impact of global trade on the spread of plant species."
}
