{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus pulchellus subsp. mollis",
    "plant_slug": "abrus-pulchellus-subsp-mollis",
    "plant_name_scientific": "abrus pulchellus subsp. mollis",
    "intro": "Abrus pulchellus subsp. mollis, commonly known as the silky velvet bean, is a flowering plant native to tropical regions of Africa and Southeast Asia. It is characterized by its distinctive, showy red and black ornamental pods that contain toxic seeds. The plant belongs to the legume family, Fabaceae, and produces a strong, unpleasant odor when the pods mature. Its hairy, velvety leaves and stems give it a unique tactile appearance. Due to the toxicity of its seeds, it is important to handle the plant with care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus pulchellus subsp. mollis is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in forest understories and along riverbanks, where it receives partial to full sunlight. It is often associated with secondary growth and disturbed habitats due to its adaptability. The plant is known for its ornamental value and has been introduced to other parts of the world in horticultural settings.",
    "distribution_introduced_art_desc": "Abrus pulchellus subsp. mollis was mainly introduced to areas with warm, humid climates and well-drained soils, often found in disturbed habitats such as roadsides and abandoned fields. It is commonly cultivated as an ornamental plant due to its striking red seed pods. This species has also been introduced to regions with similar ecological conditions in tropical and subtropical zones. Its introduction has sometimes led to it becoming invasive in certain environments. Care should be taken with its seeds, as they contain toxic compounds that can be harmful to humans and animals."
}
