{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus precatorius var. melanospermus",
    "plant_slug": "abrus-precatorius-var-melanospermus",
    "plant_name_scientific": "abrus precatorius var. melanospermus",
    "intro": "Abrus precatorius var. melanospermus, commonly known as the dark-seeded jequirity, is a climbing legume native to tropical regions of Asia. It is characterized by its distinctive, showy red or orange flowers that bloom in clusters. The plant produces flat, bean-like pods containing dark, glossy seeds that are often used in traditional crafts and as a source of toxic compounds. Its seeds contain abrin, a potent cytotoxic protein, making it highly dangerous if ingested. Despite its toxicity, it is valued for its ornamental appeal and historical use in various cultural practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus precatorius var. melanospermus is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is also found in parts of India and the Philippines. This variant is known for its distinctive dark seeds and is often cultivated for ornamental purposes. The plant thrives in tropical and subtropical climates with warm temperatures and moderate rainfall. It is commonly found in forested areas and along riverbanks in its native range.",
    "distribution_introduced_art_desc": "Abrus precatorius var. melanospermus was mainly introduced to tropical and subtropical regions as an ornamental plant due to its striking red flowers and unique seed pods. It has been widely cultivated in countries such as India, Indonesia, and parts of Africa for its aesthetic value. However, its introduction has also led to concerns about its invasive potential in some areas. The plant is often found growing along roadsides and in disturbed habitats where it can outcompete native vegetation. Its rapid growth and ability to spread through seed dispersal make it a challenge for ecological management in non-native environments."
}
