{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus melanospermus subsp. suffruticosus",
    "plant_slug": "abrus-melanospermus-subsp-suffruticosus",
    "plant_name_scientific": "abrus melanospermus subsp. suffruticosus",
    "intro": "Abrus melanospermus subsp. suffruticosus, commonly known as the black seed dodder, is a parasitic plant belonging to the Fabaceae family. It lacks true roots and instead attaches itself to host plants through haustoria, drawing nutrients from its hosts. The plant produces small, ornate pods that contain dark, toxic seeds. Its flowers are typically yellow or orange, and it is often found in arid or semi-arid environments. Due to its parasitic nature and toxic compounds, it is considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus melanospermus"
    },
    "taxonomy_art_desc": "Abrus melanospermus subsp. suffruticosus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Abrus, a group of flowering plants that includes species known for their striking seed pods and sometimes toxic compounds. Its species is Abrus melanospermus, a plant known for its distinctive appearance and specific ecological adaptations, with the subspecies suffruticosus exhibiting particular growth characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Burundi",
        "Central African Republic",
        "Chad",
        "Congo",
        "DR Congo",
        "Guinea",
        "Guinea-Bissau",
        "Malawi",
        "Mozambique",
        "Nigeria",
        "Senegal",
        "Sierra Leone",
        "Tanzania",
        "Zambia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus melanospermus subsp. suffruticosus is primarily native to Angola, Burundi, Central African Republic, Chad, Congo, DR Congo, Guinea, Guinea-Bissau, Malawi, Mozambique, Nigeria, Senegal, Sierra Leone, Tanzania, Zambia. This subspecies is commonly found in tropical and subtropical regions within these countries. It typically grows in open woodlands, savannas, and along riverbanks. The plant is well adapted to the local climate and soil conditions of its native range. It plays an important ecological role in its habitat.",
    "distribution_introduced_art_desc": "Abrus melanospermus subsp. suffruticosus was mainly introduced to the Pacific Northwest region of the United States. It was brought in during the early 20th century as part of ornamental plant imports. This subspecies is known for its distinctive red flowers and toxic seeds, which have raised concerns about its impact on local ecosystems. It has since become naturalized in certain areas, particularly along disturbed soils and forest edges. However, its spread is limited compared to other invasive species in the region."
}
