{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus arboreus",
    "plant_slug": "abrus-arboreus",
    "plant_name_scientific": "abrus arboreus",
    "intro": "Abrus arboreus, commonly known as the monkey orchid, is a climbing plant native to tropical regions of Africa and Asia. It is characterized by its distinctive, showy flowers that resemble orchids, with bright red petals and a prominent yellow spur. The plant produces small, woody pods that contain toxic seeds coated in a crimson, sticky substance. These seeds are often used in traditional medicine and as a natural dye. Due to its toxicity, handling the plant requires caution.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus arboreus is primarily native to tropical and subtropical regions of Asia, including India, Sri Lanka, and parts of Southeast Asia. It is commonly found in wet evergreen forests, moist deciduous forests, and along riverbanks. The plant thrives in warm, humid climates with well-drained soil. It is also present in some regions of Africa and the Pacific Islands. Its native range extends across several countries in South and Southeast Asia.",
    "distribution_introduced_art_desc": "Abrus arboreus was mainly introduced to South Africa as an ornamental plant due to its distinctive red seeds and attractive foliage. It has since become naturalized in various regions, including parts of the Eastern Cape and Western Cape provinces. The plant thrives in warm, sunny environments and is often found along roadsides and in disturbed areas. Its introduction has raised concerns due to its potential invasiveness in certain ecosystems. Despite its ornamental value, management efforts are underway to control its spread in sensitive habitats."
}
