{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus pulchellus subsp. cantoniensis",
    "plant_slug": "abrus-pulchellus-subsp-cantoniensis",
    "plant_name_scientific": "abrus pulchellus subsp. cantoniensis",
    "intro": "Abrus pulchellus subsp. cantoniensis, commonly known as the Chinese coral tree, is a deciduous shrub or small tree native to southern China. It is characterized by its striking clusters of red flowers that resemble coral, which bloom in spring. The plant has compound leaves with three to five leaflets and produces distinctive flat, bean-like pods that turn red as they mature. The seeds are encased in a hard, ornamental scarlet aril, which is often used in traditional crafts. It thrives in well-drained soil and full sun, making it a popular ornamental plant in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus pulchellus subsp. cantoniensis is primarily native to southern China, particularly in the provinces of Guangdong, Guangxi, and Hunan. It is also found in parts of Southeast Asia, including Vietnam and Cambodia. This species thrives in tropical and subtropical regions, often growing in lowland forests and along riverbanks. It is commonly associated with humid climates and is often found in secondary growth areas. The plant is known for its distinctive red pods and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Abrus pulchellus subsp. cantoniensis was mainly introduced to the southern regions of China, particularly in Guangdong and Guangxi provinces. It is commonly found in moist, shaded areas such as forests and along stream banks. This subspecies is known for its ornamental value due to its distinctive red seeds. It has been cultivated in botanical gardens and private collections for its aesthetic appeal. However, it is not considered invasive in its introduced range."
}
