{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus tenuiflorus",
    "plant_slug": "abrus-tenuiflorus",
    "plant_name_scientific": "abrus tenuiflorus",
    "intro": "Abrus tenuiflorus, commonly known as the narrow-flowered maple, is a deciduous shrub or small tree native to Southeast Asia. It is characterized by its palmate leaves, which are typically 5-7 lobes, and its distinctive red, bean-like pods that contain toxic seeds. The plant produces small, inconspicuous white or greenish flowers in clusters during the spring. Its seeds contain abrin, a potent toxin that makes them dangerous if ingested. The plant is often cultivated for its ornamental value due to its attractive foliage and unique seed pods.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus tenuiflorus is primarily native to tropical and subtropical regions of Asia, including India, China, and Southeast Asia. It is commonly found in areas with warm climates and well-drained soils. This plant thrives in open woodlands, grasslands, and along riverbanks. It is also present in parts of Africa and the Pacific Islands. Its natural range extends across several countries in South and Southeast Asia.",
    "distribution_introduced_art_desc": "Abrus tenuiflorus was mainly introduced to regions with warm climates and well-drained soils, often as an ornamental plant due to its attractive, flame-like flowers. It is commonly found in tropical and subtropical areas, including parts of Southeast Asia, the Caribbean, and the southern United States. The plant thrives in full sun and requires minimal water once established, making it suitable for both garden and landscape settings. However, it can become invasive in some areas if not managed properly. Its seeds contain toxic compounds, so care must be taken when handling or planting it."
}
