{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus pulchellus f. typicus",
    "plant_slug": "abrus-pulchellus-f-typicus",
    "plant_name_scientific": "abrus pulchellus f. typicus",
    "intro": "Abrus pulchellus f. typicus, commonly known as the Indian rattlepod, is a flowering plant native to tropical and subtropical regions of Asia. It is characterized by its distinctive, red-orange pods that resemble rattles, which contain flat, kidney-shaped seeds. The plant belongs to the legume family, Fabaceae, and is known for its showy, yellow flowers that bloom in clusters. Its leaves are trifoliate, consisting of three oval-shaped leaflets. The seeds are often used in traditional medicine and as a natural dye due to their vibrant color.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus pulchellus f. typicus is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Sudan. It thrives in humid climates and is commonly found in forests and along riverbanks. This plant is also present in parts of southern Asia, including India and Southeast Asia. It prefers well-drained soils and is often cultivated for its ornamental value. The species is known for its distinctive red seed pods and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Abrus pulchellus f. typicus was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking red and black seed pods. It has since become naturalized in certain areas, spreading through both seed dispersal and human activity. The plant is commonly found in disturbed habitats such as roadsides, vacant lots, and coastal areas. Its rapid growth and adaptability have led to concerns about its potential to outcompete native species. Despite its aesthetic appeal, it is considered an invasive species in some regions of the Pacific."
}
