{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus melanospermus subsp. melanospermus",
    "plant_slug": "abrus-melanospermus-subsp-melanospermus",
    "plant_name_scientific": "abrus melanospermus subsp. melanospermus",
    "intro": "Abrus melanospermus subsp. melanospermus, commonly known as the blackseed velvet tamarind, is a member of the Fabaceae family. It is a climbing shrub characterized by its compound leaves and showy, red or orange flowers. The plant produces elongated pods containing dark, glossy seeds that are often used in traditional medicine. Its botanical features include hairy stems and stipules, which are typical of many leguminous plants. The species is native to tropical and subtropical regions of Asia and is valued for both its ornamental and medicinal properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus melanospermus"
    },
    "taxonomy_art_desc": "Abrus melanospermus subsp. melanospermus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that typically have distinct floral parts and are often associated with primitive angiosperm features. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form nitrogen-fixing symbioses with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Abrus, a group of flowering plants that includes species known for their distinctive, often colorful seed pods. Its species is Abrus melanospermus, a specific plant within the Abrus genus, noted for its dark seeds and typical Fabaceae characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is.",
        "Assam",
        "Bangladesh",
        "Borneo",
        "Cambodia",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "Hainan",
        "India",
        "Jawa",
        "Laos",
        "Malaya",
        "Myanmar",
        "Nepal",
        "New Caledonia",
        "New Guinea",
        "Philippines",
        "Sri Lanka",
        "Thailand",
        "Vietnam",
        "West Himalaya"
    ],
    "distribution_introduced": [
        "Brazil North",
        "Brazil Northeast",
        "Brazil West-Central"
    ],
    "distribution_native_art_desc": "Abrus melanospermus subsp. melanospermus is primarily native to the Andaman Is., Assam, Bangladesh, Borneo, Cambodia, China South-Central, China Southeast, East Himalaya, Hainan, India, Jawa, Laos, Malaya, Myanmar, Nepal, New Caledonia, New Guinea, Philippines, Sri Lanka, Thailand, Vietnam, and West Himalaya. This subspecies is found across a wide geographic range spanning Southeast Asia, South Asia, and parts of the Pacific. It thrives in tropical and subtropical regions, often growing in forested areas or along riverbanks. The plant is known for its distinctive seed pods and is commonly found in diverse habitats within its native range. Its distribution reflects its adaptability to various environmental conditions across these regions.",
    "distribution_introduced_art_desc": "Abrus melanospermus subsp. melanospermus was mainly introduced to Brazil North, Brazil Northeast, and Brazil West-Central. This subspecies is known for its distinctive dark seeds and is often found in tropical and subtropical regions. It has been reported growing in a variety of habitats, including forests and disturbed areas. The introduction of this plant may have ecological implications due to its potential for rapid spread. Its presence in these regions highlights the need for monitoring its impact on local biodiversity."
}
