{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus precatorius var. albospermum",
    "plant_slug": "abrus-precatorius-var-albospermum",
    "plant_name_scientific": "abrus precatorius var. albospermum",
    "intro": "Abrus precatorius var. albospermum, commonly known as the white-seed velvet tare, is a variant of the common velvet tare, characterized by its distinctive white seeds. It is a climbing legume native to tropical and subtropical regions, often found in disturbed habitats such as roadsides and waste areas. The plant produces intricate, showy red or orange flowers that are followed by inflated, papery pods containing the characteristic white seeds. Its leaves are trifoliate, with three oval-shaped leaflets, and it has a hairy stem that gives it a velvety appearance. The plant is known for its toxic properties, as the seeds contain potent alkaloids that can be harmful to humans and animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus precatorius var. albospermum is primarily native to Southeast Asia, including countries such as India, Indonesia, and Malaysia. This variant is commonly found in tropical and subtropical regions, particularly in lowland areas with warm, humid climates. It thrives in open forests, shrublands, and along roadsides where it can receive ample sunlight. The plant is often seen growing along riverbanks and in disturbed soils, showcasing its adaptability to various environmental conditions. Its native range also extends to parts of Africa and the Pacific Islands, where it has been introduced and naturalized.",
    "distribution_introduced_art_desc": "Abrus precatorius var. albospermum was mainly introduced to tropical and subtropical regions as an ornamental plant due to its striking red flowers and distinctive seed pods. It has been cultivated in parts of Southeast Asia, Africa, and the Caribbean for its aesthetic value. However, it is considered invasive in some areas where it outcompetes native flora and can form dense thickets. The plant's seeds contain toxic compounds, posing a risk to livestock and wildlife. Despite its ornamental use, its ecological impact has raised concerns among conservationists."
}
