{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus schimperi",
    "plant_slug": "abrus-schimperi",
    "plant_name_scientific": "abrus schimperi",
    "intro": "Abrus schimperi, commonly known as the African snail bean, is a climbing legume native to tropical Africa. It produces distinctive, showy red and black seed pods that contain toxic seeds, which are used in traditional practices. The plant has compound leaves with small, oval-shaped leaflets and is often found in moist, wooded areas. Its flowers are yellow with a purple or reddish tint, adding visual interest to its habitat. Due to its toxicity, it is important to handle the plant with care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus schimperi is primarily native to East Africa, including countries such as Ethiopia, Kenya, and Tanzania. It is commonly found in dry, open habitats such as savannas and rocky areas. The plant thrives in regions with a tropical or subtropical climate and is often associated with disturbed soils. It is a climbing plant that can be found in both wild and cultivated settings. Its distribution is also reported in parts of southern Arabia and the Horn of Africa.",
    "distribution_introduced_art_desc": "Abrus schimperi was mainly introduced to new habitats outside its native range, often as a result of human activity. It has been reported in various regions, including parts of Africa and Asia, where it has established itself in disturbed environments. The plant thrives in areas with well-drained soil and full sun, making it adaptable to different ecological conditions. Its introduction has raised concerns due to its potential to become invasive in certain regions. However, more research is needed to fully understand its ecological impact and distribution patterns."
}
