{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus madagascariensis var. parvifolius",
    "plant_slug": "abrus-madagascariensis-var-parvifolius",
    "plant_name_scientific": "abrus madagascariensis var. parvifolius",
    "intro": "Abrus madagascariensis var. parvifolius, commonly known as the small-leaved scarlet bean, is a flowering plant native to Madagascar. It is characterized by its slender, climbing habit and produces striking red pods that contain flat, kidney-shaped seeds. The leaves are small and palmately lobed, contributing to its ornamental appeal. The plant is part of the Fabaceae family, which includes legumes, and it has a distinctive, often toxic appearance. It is often cultivated for its ornamental value and is also used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus madagascariensis var. parvifolius is primarily native to Madagascar. This variant of the species is found in the island's tropical and subtropical regions. It thrives in humid environments, often growing in forests or along riverbanks. The plant is adapted to the unique ecological conditions of Madagascar, which support a high level of endemic flora. Its distribution is limited to specific habitats within the country.",
    "distribution_introduced_art_desc": "Abrus madagascariensis var. parvifolius was mainly introduced to New Zealand as an ornamental plant due to its attractive, colorful seed pods. It was likely brought there during the 19th or early 20th century by European settlers who admired its aesthetic value. Despite its beauty, the plant has since become invasive in some parts of New Zealand, outcompeting native species and altering local ecosystems. Its rapid growth and ability to thrive in disturbed soils have contributed to its spread. Conservation efforts are now underway to control its population and prevent further ecological damage."
}
