{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus precatorius",
    "plant_slug": "abrus-precatorius",
    "plant_name_scientific": "abrus precatorius",
    "intro": "Abrus precatorius, commonly known as the Indian rue or bead tree, is a climbing legume native to tropical regions of Asia. It is characterized by its distinctive, ornate, and often brightly colored seed pods that contain toxic, bead-like seeds. The plant produces small, yellow flowers and has compound leaves with three to five leaflets. Its seeds contain abrin, a potent lectin toxin that can be lethal if ingested. Due to its toxicity, it is important to handle the plant with care and avoid consumption of any part of it.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus precatorius"
    },
    "taxonomy_art_desc": "Abrus precatorius belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, distinguished by their diverse floral structures and evolutionary relationships. Its order is Fabales, which includes legumes and related plants, known for their ability to form nitrogen-fixing symbioses with bacteria. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and nitrogen-fixing abilities. Its genus is Abrus, a group of flowering plants that includes species known for their ornamental value and sometimes toxic properties. Its species is Abrus precatorius, commonly known as the jequirity or rosary pea, a plant recognized for its distinctive red seeds and use in traditional medicine and as a ornamental plant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Aldabra",
        "Andaman Is.",
        "Angola",
        "Assam",
        "Bangladesh",
        "Benin",
        "Botswana",
        "Burkina",
        "Burundi",
        "Cambodia",
        "Cameroon",
        "Cape Provinces",
        "Cape Verde",
        "Caprivi Strip",
        "Central African Republic",
        "Chad",
        "China South-Central",
        "China Southeast",
        "Comoros",
        "Congo",
        "DR Congo",
        "East Himalaya",
        "Equatorial Guinea",
        "Eritrea",
        "Eswatini",
        "Ethiopia",
        "Gabon",
        "Gambia",
        "Guinea",
        "Guinea-Bissau",
        "Gulf of Guinea Is.",
        "India",
        "Ivory Coast",
        "Kenya",
        "KwaZulu-Natal",
        "Laos",
        "Liberia",
        "Madagascar",
        "Malawi",
        "Malaya",
        "Mali",
        "Mauritania",
        "Mozambique",
        "Myanmar",
        "Namibia",
        "Nepal",
        "New South Wales",
        "Nicobar Is.",
        "Niger",
        "Northern Provinces",
        "Northern Territory",
        "Pakistan",
        "Queensland",
        "Rwanda",
        "Saudi Arabia",
        "Senegal",
        "Seychelles",
        "Somalia",
        "South China Sea",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Taiwan",
        "Tanzania",
        "Thailand",
        "Togo",
        "Uganda",
        "Vietnam",
        "West Himalaya",
        "Western Australia",
        "Yemen",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Bahamas",
        "Belize",
        "Bismarck Archipelago",
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Caroline Is.",
        "Cayman Is.",
        "Colombia",
        "Cook Is.",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "Fiji",
        "Florida",
        "French Guiana",
        "Galápagos",
        "Guatemala",
        "Guyana",
        "Haiti",
        "Hawaii",
        "Honduras",
        "Jamaica",
        "Jawa",
        "Leeward Is.",
        "Lesser Sunda Is.",
        "Marianas",
        "Marquesas",
        "Mauritius",
        "Netherlands Antilles",
        "New Caledonia",
        "New Guinea",
        "Nicaragua",
        "Niue",
        "Panamá",
        "Peru",
        "Philippines",
        "Pitcairn Is.",
        "Puerto Rico",
        "Rodrigues",
        "Réunion",
        "Samoa",
        "Santa Cruz Is.",
        "Society Is.",
        "Southwest Caribbean",
        "Sumatera",
        "Suriname",
        "Tonga",
        "Trinidad-Tobago",
        "Tuamotu",
        "Vanuatu",
        "Venezuela",
        "Venezuelan Antilles",
        "Wallis-Futuna Is.",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abrus precatorius is primarily native to Africa, Asia, and parts of the Pacific, including regions such as Aldabra, Andaman Is., Angola, Assam, Bangladesh, Benin, Botswana, Burkina, Burundi, Cambodia, Cameroon, Cape Provinces, Cape Verde, Caprivi Strip, Central African Republic, Chad, China South-Central, China Southeast, Comoros, Congo, DR Congo, East Himalaya, Equatorial Guinea, Eritrea, Eswatini, Ethiopia, Gabon, Gambia, Guinea, Guinea-Bissau, Gulf of Guinea Is., India, Ivory Coast, Kenya, KwaZulu-Natal, Laos, Liberia, Madagascar, Malawi, Malaya, Mali, Mauritania, Mozambique, Myanmar, Namibia, Nepal, New South Wales, Nicobar Is., Niger, Northern Provinces, Northern Territory, Pakistan, Queensland, Rwanda, Saudi Arabia, Senegal, Seychelles, Somalia, South China Sea, Sri Lanka, Sudan-South Sudan, Taiwan, Tanzania, Thailand, Togo, Uganda, Vietnam, West Himalaya, Western Australia, Yemen, Zambia, and Zimbabwe. It is commonly found in tropical and subtropical regions, often growing in disturbed habitats and along roadsides. The plant is known for its distinctive red seed pods and is sometimes referred to as the \"rosy wolf\" or \"bead tree.\" It has been introduced to various regions outside its native range, where it can become invasive. Due to its toxicity, it is important to handle the plant with care.",
    "distribution_introduced_art_desc": "Abrus precatorius was mainly introduced to tropical and subtropical regions across the Pacific, Caribbean, and Atlantic, including the Bahamas, Fiji, Hawaii, and the Philippines. It has been widely distributed in Central and South America, such as Brazil, Colombia, and Peru, as well as in the Caribbean islands like Cuba and Jamaica. The plant is also present in the Indian Ocean, including areas like the Andaman Islands, Madagascar, and the Maldives. Its introduction is likely due to its ornamental value and traditional uses. It is now considered an invasive species in many of these regions."
}
