{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus maculatus",
    "plant_slug": "abrus-maculatus",
    "plant_name_scientific": "abrus maculatus",
    "intro": "Abrus maculatus, commonly known as the spotted bengal bean, is a climbing legume native to tropical regions of Asia. It is characterized by its distinctive, ornate flowers that range from pale yellow to deep red, often with a contrasting purple or black spot. The plant produces elongated pods containing flat, kidney-shaped seeds that are typically bright red with a black spot. These seeds contain toxic compounds, making them dangerous if ingested. Despite its toxicity, the plant is sometimes cultivated for ornamental purposes due to its striking appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus maculatus is primarily native to Southeast Asia, including countries such as India, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in areas with moist, well-drained soils. This plant thrives in open woodlands, forest edges, and disturbed habitats. It is often seen growing along roadsides and in agricultural areas. Its distribution extends to parts of Africa and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abrus maculatus was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its striking red and black seeds. It was also introduced to parts of Australia and Southeast Asia for similar ornamental purposes. The plant has since become naturalized in these regions, often growing in disturbed areas and along roadsides. Its introduction has raised concerns due to its potential invasiveness and the toxicity of its seeds. Despite its beauty, careful management is needed to prevent its spread into native ecosystems."
}
