{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus abrus",
    "plant_slug": "abrus-abrus",
    "plant_name_scientific": "abrus abrus",
    "intro": "Abrus abrus, commonly known as the flame of the forest, is a deciduous shrub or small tree native to tropical and subtropical regions of Asia. It is characterized by its striking, flame-like red flowers that bloom in clusters, making it a visually striking plant. The plant produces flat, bean-like pods that contain toxic seeds, which are used in traditional medicine and as a natural poison. Its leaves are alternate, pinnate, and have a feathery appearance, contributing to its ornamental value. The plant is also notable for its ability to thrive in a variety of soil types and climates, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus abrus is primarily native to tropical and subtropical regions of Asia, including India, Southeast Asia, and parts of Africa. It is commonly found in countries such as India, Indonesia, Malaysia, and the Philippines. The plant thrives in warm climates with well-drained soils and is often grown in both wild and cultivated settings. It is also present in some regions of Africa, particularly in countries like Nigeria and Sudan. Its distribution extends to parts of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abrus abrus was mainly introduced to regions where its ornamental value and traditional uses are highly appreciated. It is commonly found in tropical and subtropical areas, including parts of Asia, Africa, and the Americas. The plant is often cultivated for its distinctive red seed pods and is used in various cultural and medicinal practices. Its introduction has sometimes led to it becoming an invasive species in non-native environments. Proper management is necessary to prevent its spread and minimize ecological impacts."
}
