{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus pulchellus var. tenuiflorus",
    "plant_slug": "abrus-pulchellus-var-tenuiflorus",
    "plant_name_scientific": "abrus pulchellus var. tenuiflorus",
    "intro": "Abrus pulchellus var. tenuiflorus, commonly known as the slender-flowered velvet bean, is a climbing legume native to tropical and subtropical regions. It features compound leaves with small, elliptical leaflets and produces intricate, ornate flowers that are typically pink or red. The plant bears pods that contain flat, kidney-shaped seeds with a distinctive red aril. These seeds are toxic and should not be ingested, although the plant is sometimes cultivated for its ornamental value. It thrives in well-drained soil and requires full sun to partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus pulchellus var. tenuiflorus is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in shaded or semi-shaded environments, often growing in forest understories or along riverbanks. It is known for its distinctive red seed pods and is sometimes cultivated for ornamental purposes. The species is also found in parts of southern China and the Philippines.",
    "distribution_introduced_art_desc": "Abrus pulchellus var. tenuiflorus was mainly introduced to the United States as an ornamental plant due to its attractive, flame-like red flowers. It is commonly found in gardens and along roadsides in the southeastern region of the country. Although it is not native to North America, it has become naturalized in certain areas, particularly in warmer climates. The plant is known for its distinctive seed pods, which are often used in traditional crafts and have cultural significance in some regions. However, its introduction has raised concerns about its potential to become invasive in local ecosystems."
}
