{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus madagascariensis var. littoralis",
    "plant_slug": "abrus-madagascariensis-var-littoralis",
    "plant_name_scientific": "abrus madagascariensis var. littoralis",
    "intro": "Abrus madagascariensis var. littoralis, commonly known as the coastal velvet bean, is a leguminous plant native to coastal regions of Madagascar. It is characterized by its striking red and black seed pods, which contain toxic seeds used in traditional practices. The plant thrives in sandy soils and is often found in maritime environments. Its leaves are compound and trifoliate, with a velvety texture. It plays a role in local ecosystems by providing habitat and contributing to soil stabilization along coastlines.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus madagascariensis var. littoralis is primarily native to the coastal regions of Madagascar. This variant is commonly found along the shores and mangrove forests of the eastern and western coasts. It thrives in sandy or muddy soils near the sea. The plant is adapted to the tropical climate and saline conditions of these areas. It plays an important role in the local ecosystem and is sometimes used in traditional practices.",
    "distribution_introduced_art_desc": "Abrus madagascariensis var. littoralis was mainly introduced to coastal and riverine areas of Madagascar due to its adaptation to wet, saline environments. It is often found growing along the shores of lakes, rivers, and coastal regions where it thrives in moist soil conditions. This variety is valued for its ornamental value, with its striking red pods and seed structures. Its introduction has also contributed to local biodiversity in these specific habitats. However, it is important to monitor its spread to ensure it does not become invasive in non-native areas."
}
