{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus fruticulosus",
    "plant_slug": "abrus-fruticulosus",
    "plant_name_scientific": "abrus fruticulosus",
    "intro": "Abrus fruticulosus, commonly known as the hairy spider plant, is a climbing legume native to tropical and subtropical regions. It features slender, woody stems that twine around supports, and its leaves are trifoliate, with three ovate to elliptical leaflets. The plant produces small, yellowish-green flowers that are followed by distinctive, inflated pods containing kidney-shaped seeds. The seeds are coated in a bright red aril, which is often used in traditional medicine. It thrives in well-drained soil and requires full sun to partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus fruticulosus"
    },
    "taxonomy_art_desc": "Abrus fruticulosus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their simple structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Abrus, a group of flowering plants that includes species with distinctive, often colorful seeds. Its species is Abrus fruticulosus, a specific type of plant within the Abrus genus, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is.",
        "Assam",
        "Benin",
        "Cameroon",
        "Central African Republic",
        "Chad",
        "China Southeast",
        "Congo",
        "Eritrea",
        "Ethiopia",
        "Gabon",
        "Guinea-Bissau",
        "India",
        "Ivory Coast",
        "Kenya",
        "Liberia",
        "Madagascar",
        "Malawi",
        "Mozambique",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Brazil North",
        "Brazil Northeast",
        "Brazil West-Central",
        "Jawa",
        "Lesser Sunda Is.",
        "Philippines",
        "Suriname"
    ],
    "distribution_native_art_desc": "Abrus fruticulosus is primarily native to the Andaman Is., Assam, Benin, Cameroon, Central African Republic, Chad, China Southeast, Congo, Eritrea, Ethiopia, Gabon, Guinea-Bissau, India, Ivory Coast, Kenya, Liberia, Madagascar, Malawi, Mozambique, Sudan-South Sudan, Tanzania, Uganda, Zambia, and Zimbabwe. This plant is commonly found in tropical and subtropical regions, often growing in open woodlands, savannas, and along riverbanks. It is well adapted to a variety of soil types and can thrive in both moist and dry conditions. The species is known for its distinctive red seeds, which are often used in traditional practices. Its wide distribution across Africa, Southeast Asia, and parts of South Asia highlights its ecological versatility.",
    "distribution_introduced_art_desc": "Abrus fruticulosus was mainly introduced to Brazil North, Brazil Northeast, Brazil West-Central, Jawa, Lesser Sunda Is., Philippines, and Suriname. It has been established in these regions, likely due to its adaptability to various tropical and subtropical climates. The plant is often found in disturbed habitats such as roadsides, waste areas, and forest edges. Its introduction may have been unintentional, possibly through seed dispersal via human activities or natural means. This distribution highlights its potential ecological impact in these newly introduced regions."
}
