{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus precatorius var. leucospermus",
    "plant_slug": "abrus-precatorius-var-leucospermus",
    "plant_name_scientific": "abrus precatorius var. leucospermus",
    "intro": "Abrus precatorius var. leucospermus, commonly known as the white-flowered jequirity, is a variant of the jequirity plant native to tropical regions. It is characterized by its striking white or pale pink flowers that contrast with its green, compound leaves. The plant produces distinctive, flat, bean-like pods that contain toxic seeds, which are used in traditional crafts and as a natural dye. Its growth habit is typically shrub-like, with a branching structure that allows it to thrive in well-drained soils. Due to its ornamental value and ecological role, it is sometimes cultivated in gardens and natural habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus precatorius var. leucospermus is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. This variant is commonly found in tropical and subtropical regions, particularly in lowland areas with warm and humid climates. It thrives in open woodland, forest edges, and disturbed habitats where sunlight is available. The plant is often associated with human-modified landscapes and can be found in gardens and along roadsides. Its distribution is closely linked to the environmental conditions that support its growth and seed dispersal.",
    "distribution_introduced_art_desc": "Abrus precatorius var. leucospermus was mainly introduced to ornamental horticulture due to its striking, bright red seed pods. It is commonly cultivated in gardens and landscapes for its visual appeal. However, it is considered invasive in some regions because of its rapid growth and ability to spread through seed dispersal. The plant's seeds contain toxic compounds, making it potentially hazardous to livestock and humans. Its introduction has led to ecological concerns in areas where it has become naturalized."
}
