{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus tunguensis",
    "plant_slug": "abrus-tunguensis",
    "plant_name_scientific": "abrus tunguensis",
    "intro": "Abrus tunguensis, commonly known as the velvet bean, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the Fabaceae family and is characterized by its distinctive, ornate pods that contain flat, kidney-shaped seeds. The plant is notable for its striking red and black seeds, which are often used in traditional crafts and as a source of pigment. Its flowers are typically pink or purple, and it thrives in warm, humid climates. However, the plant is toxic due to the presence of abrin, a potent lectin that can be harmful if ingested.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus tunguensis is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Sudan. It is commonly found in savanna and woodland areas, where it thrives in well-drained soils. The plant is also present in parts of southern Asia, including India and Sri Lanka, where it has been introduced. It grows as a climbing shrub or vine, often found along riverbanks and in disturbed habitats. Due to its ornamental value, it has been cultivated in various parts of the world beyond its native range.",
    "distribution_introduced_art_desc": "Abrus tunguensis was mainly introduced to control invasive plant species in certain regions. It is commonly used as a biological control agent due to its ability to feed on specific weeds. The plant is native to Africa but has been introduced to other parts of the world. It thrives in tropical and subtropical climates. However, its introduction requires careful monitoring to prevent it from becoming invasive itself."
}
