{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus suffruticosus",
    "plant_slug": "abrus-suffruticosus",
    "plant_name_scientific": "abrus suffruticosus",
    "intro": "Abrus suffruticosus, commonly known as the Indian bead tree or velvet bean plant, is a flowering plant native to tropical and subtropical regions of Asia. It is a deciduous shrub or small tree that can grow up to 5 meters in height, featuring compound leaves and showy, crimson or red flowers. The plant produces distinctive, bead-like seeds enclosed in a fibrous pod, which are often used in traditional crafts. It thrives in well-drained soil and requires full sun to partial shade, making it suitable for ornamental and agricultural purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus suffruticosus is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Sudan. It is also found in parts of southern Asia, including India and Sri Lanka. This plant thrives in moist, shaded environments and is commonly found in forest understories. It is often associated with humid climates and is sometimes cultivated for its ornamental value. Its natural range extends into parts of the Middle East and Southeast Asia as well.",
    "distribution_introduced_art_desc": "Abrus suffruticosus was mainly introduced to South Africa as an ornamental plant due to its attractive, bead-like pods. It has since spread beyond cultivated areas and is now considered invasive in some regions. The plant thrives in disturbed soils and can outcompete native vegetation. It is often found along roadsides, in urban areas, and in agricultural fields. Its rapid growth and seed dispersal make it a challenging species to control."
}
