{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus squamulosus",
    "plant_slug": "abrus-squamulosus",
    "plant_name_scientific": "abrus squamulosus",
    "intro": "Abrus squamulosus, commonly known as the velvet bean or horse bean, is a climbing legume native to tropical and subtropical regions. It is characterized by its hairy, spiny stems and heart-shaped, compound leaves. The plant produces striking, crimson-red seed pods that contain flat, kidney-shaped seeds with a distinctive black spot. These seeds are toxic due to the presence of abrin, a potent lectin. It is often grown as an ornamental plant but is also used in traditional medicine and as a source of protein in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus squamulosus is primarily native to tropical and subtropical regions of Africa, including countries such as Nigeria, Ghana, and Kenya. It is also found in parts of southern Asia, particularly in India and Sri Lanka. This plant thrives in moist, shaded environments, often growing in forest understories or along riverbanks. It is commonly found in lowland areas with rich, well-drained soils. Its native distribution extends to some parts of the Middle East and Southeast Asia as well.",
    "distribution_introduced_art_desc": "Abrus squamulosus was mainly introduced to South Africa as an ornamental plant due to its attractive, fluffy seed pods. It has since become naturalized in certain regions, particularly in the Eastern and Western Cape provinces. The plant thrives in disturbed habitats such as roadsides and waste areas, where it can spread rapidly. Its introduction has raised concerns due to its potential to outcompete native vegetation. Despite its ornamental value, it is considered a weed in some areas and requires management to prevent its spread."
}
