{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus parvifolius",
    "plant_slug": "abrus-parvifolius",
    "plant_name_scientific": "abrus parvifolius",
    "intro": "Abrus parvifolius, commonly known as the small-leafed maple, is a deciduous shrub or small tree native to the tropical and subtropical regions of Asia. It is characterized by its simple, alternate leaves that are typically ovate to elliptic in shape. The plant produces small, inconspicuous flowers that are clustered in umbels, followed by distinctive, winged fruits that are often used in traditional medicine. Its leaves are often used as a food source for certain insects, and the plant is known for its ability to thrive in a variety of soil types. The botanical features of Abrus parvifolius make it an important species in both ecological and horticultural contexts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus parvifolius"
    },
    "taxonomy_art_desc": "Abrus parvifolius belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing capabilities. Its genus is Abrus, a group of flowering plants that are often found in tropical and subtropical regions, known for their distinctive seed pods. Its species is Abrus parvifolius, a specific type of plant within the Abrus genus, recognized for its small leaves and characteristic seed pods.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus parvifolius is primarily native to Madagascar. It is commonly found in the island's dry and moist forests. This plant thrives in tropical and subtropical climates. It is often seen growing in shaded areas under the canopy of larger trees. Its natural habitat includes various regions across Madagascar's diverse ecosystems.",
    "distribution_introduced_art_desc": "Abrus parvifolius was mainly introduced to areas where it is cultivated for its ornamental value and traditional uses. It is commonly found in tropical and subtropical regions, often as an ornamental plant in gardens and landscapes. The plant is also used in traditional medicine for its potential health benefits. Its introduction has been documented in several countries, including parts of Southeast Asia and the Pacific Islands. Due to its attractive appearance, it has been widely spread through horticultural trade and human activity."
}
