{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus pulchellus f. latifoliolatus",
    "plant_slug": "abrus-pulchellus-f-latifoliolatus",
    "plant_name_scientific": "abrus pulchellus f. latifoliolatus",
    "intro": "Abrus pulchellus f. latifoliolatus, commonly known as the broad-leaved scarlet runner bean, is a variant of the scarlet runner bean characterized by its broader, more lobed leaves. It is a climbing legume native to South America, particularly Brazil, and is cultivated for its ornamental value and edible pods. The plant produces vibrant red flowers followed by long, bean-like pods that contain flat, kidney-shaped seeds. Its foliage is dense and lush, making it a popular choice for gardeners seeking both aesthetic appeal and edible harvests. The plant thrives in full sun and well-drained soil, requiring regular watering and support for its vining growth habit.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus pulchellus f. latifoliolatus is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. This plant thrives in tropical and subtropical regions, often found in lowland forests and along riverbanks. It is commonly associated with moist, shaded environments and is part of the Fabaceae family. The variety is known for its distinctive broad, trifoliate leaves and ornamental value. Its native range extends to parts of India and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abrus pulchellus f. latifoliolatus was mainly introduced to enhance ornamental value in gardens and landscapes due to its distinctive, showy flowers. This variant is known for its broader leaves compared to the typical form, making it a desirable choice for horticultural displays. It has been cultivated in various regions where tropical and subtropical climates prevail. The plant's introduction has also contributed to the diversity of legume species in botanical collections. However, it is important to note that it may spread aggressively and requires careful management in natural environments."
}
