{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus pulchellus",
    "plant_slug": "abrus-pulchellus",
    "plant_name_scientific": "abrus pulchellus",
    "intro": "Abrus pulchellus, commonly known as the pretty or beautiful bean, is a climbing legume native to tropical and subtropical regions. It features palmately lobed leaves and produces striking red or orange flowers with a distinctive yellow center. The plant's most notable characteristic is its dark red, bead-like seeds encased in a fibrous pod. It thrives in warm, humid climates and is often found in disturbed soils or along forest edges. Due to its ornamental value, it is cultivated in gardens and parks for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus pulchellus is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Sudan. It is also found in parts of southern Asia, including India and Sri Lanka. This plant thrives in humid climates and is commonly found in open woodland areas and along riverbanks. It is known for its distinctive red seeds encased in a fibrous pod. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Abrus pulchellus was mainly introduced to regions with tropical and subtropical climates due to its ornamental value and adaptability. It is commonly found in areas with well-drained soils and full sun exposure. The plant has been introduced to several parts of the world, including parts of the United States, Australia, and Southeast Asia. Its introduction has sometimes led to it becoming invasive in certain ecosystems. Proper management is necessary to prevent its spread in non-native environments."
}
