{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus madagascariensis var. dunensis",
    "plant_slug": "abrus-madagascariensis-var-dunensis",
    "plant_name_scientific": "abrus madagascariensis var. dunensis",
    "intro": "Abrus madagascariensis var. dunensis, commonly known as the Madagascar orchid bean, is a climbing plant native to Madagascar. It belongs to the Fabaceae family and is characterized by its striking, ornamental flowers that range from white to pink. The plant produces distinctive, red or orange seed pods that contain toxic seeds covered in a bright red aril. It thrives in tropical climates and is often cultivated for its aesthetic value in gardens. Due to its toxicity, it should be handled with care.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus madagascariensis var. dunensis is primarily native to Madagascar. It is found in the eastern and southern regions of the island. This variant thrives in tropical and subtropical climates. It is commonly associated with dry forests and coastal areas. The plant is well adapted to the unique ecological conditions of Madagascar.",
    "distribution_introduced_art_desc": "Abrus madagascariensis var. dunensis was mainly introduced to regions with tropical and subtropical climates, particularly in parts of Africa, Southeast Asia, and the Pacific Islands. It thrives in open, sunny areas with well-drained soil, making it suitable for cultivation in agricultural and ornamental settings. The plant is often used for its ornamental value due to its distinctive seed pods and bright red seeds. It has been reported in invasive plant lists in some areas due to its ability to spread rapidly in disturbed habitats. Its introduction has raised concerns about its potential impact on native ecosystems in non-native regions."
}
