{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus mollis",
    "plant_slug": "abrus-mollis",
    "plant_name_scientific": "abrus mollis",
    "intro": "Abrus mollis, commonly known as the velvet tare, is a flowering plant native to tropical and subtropical regions. It belongs to the Fabaceae family and is characterized by its distinctive, showy flowers that range from pink to purple. The plant produces flat, pod-like fruits that contain small, dark seeds. Its leaves are palmately lobed, and the stems are often covered in a fine, velvety texture. Abrus mollis is primarily cultivated for its ornamental value and has also been used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus mollis is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as India, Thailand, Malaysia, and Indonesia. It is commonly found in moist lowland forests and along riverbanks. The plant thrives in humid climates with well-drained soil. It is often associated with secondary forests and disturbed habitats. Abrus mollis is also present in parts of Africa and the Pacific Islands, though its distribution is less widespread there.",
    "distribution_introduced_art_desc": "Abrus mollis was mainly introduced to New Zealand as an ornamental plant due to its attractive, flame-colored flowers. It was also introduced to parts of Australia and the United States, where it was cultivated for its aesthetic value. Despite its beauty, it has since become invasive in some regions, outcompeting native vegetation. The plant thrives in disturbed soils and can spread rapidly through its seed pods. Its introduction has led to ecological concerns, prompting efforts to control its spread in certain areas."
}
