{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus melanospermus subsp. tenuiflorus",
    "plant_slug": "abrus-melanospermus-subsp-tenuiflorus",
    "plant_name_scientific": "abrus melanospermus subsp. tenuiflorus",
    "intro": "Abrus melanospermus subsp. tenuiflorus, commonly known as the slender-flowered poison bean, is a member of the Fabaceae family. It is characterized by its slender, elongated pods that contain toxic seeds. The plant typically grows in tropical and subtropical regions, often in disturbed or open habitats. Its flowers are small and usually white or pale in color, arranged in racemes. Due to the presence of abrin, a potent toxin, it is considered highly poisonous and requires caution during handling.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus melanospermus"
    },
    "taxonomy_art_desc": "Abrus melanospermus subsp. tenuiflorus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often associated with primitive floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Abrus, a group of flowering plants that includes species known for their toxic seeds and distinctive flower structures. Its species is Abrus melanospermus, a specific type within the genus Abrus, distinguished by its black seeds and slender flowers, with the subspecies tenuiflorus exhibiting slightly different floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Benin",
        "Burkina",
        "Cameroon",
        "Congo",
        "DR Congo",
        "Equatorial Guinea",
        "Ethiopia",
        "Ghana",
        "Guinea",
        "Guinea-Bissau",
        "Kenya",
        "Liberia",
        "Madagascar",
        "Mali",
        "Mozambique",
        "Nigeria",
        "Senegal",
        "Sierra Leone",
        "Sudan-South Sudan",
        "Tanzania",
        "Togo",
        "Uganda",
        "Zambia"
    ],
    "distribution_introduced": [
        "Bolivia",
        "Brazil North",
        "Brazil West-Central",
        "Colombia",
        "Venezuela"
    ],
    "distribution_native_art_desc": "Abrus melanospermus subsp. tenuiflorus is primarily native to Angola, Benin, Burkina, Cameroon, Congo, DR Congo, Equatorial Guinea, Ethiopia, Ghana, Guinea, Guinea-Bissau, Kenya, Liberia, Madagascar, Mali, Mozambique, Nigeria, Senegal, Sierra Leone, Sudan-South Sudan, Tanzania, Togo, Uganda, Zambia. This subspecies is commonly found in tropical and subtropical regions across these countries. It thrives in open woodlands, savannas, and along riverbanks. The plant is known for its distinctive red flowers and toxic seeds. It plays an important ecological role in its native habitats.",
    "distribution_introduced_art_desc": "Abrus melanospermus subsp. tenuiflorus was mainly introduced to Bolivia, Brazil North, Brazil West-Central, Colombia, and Venezuela. This subspecies is known for its distinctive seed pods and is often found in tropical and subtropical regions. It has been reported growing in various habitats, including disturbed areas and along roadsides. The introduction of this plant may have occurred through human activity, such as trade or accidental transport. Its presence in these regions highlights its adaptability and potential ecological impact."
}
