{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus minor",
    "plant_slug": "abrus-minor",
    "plant_name_scientific": "abrus minor",
    "intro": "Abrus minor, commonly known as the lesser maple or Indian maple, is a deciduous shrub or small tree native to the Indian subcontinent. It is characterized by its palmate leaves, which are typically five to seven lobes, and its distinctive red or orange seed pods that split open to release seeds. The plant produces small, yellowish-green flowers that bloom in spring, followed by the development of its characteristic seed pods. The seeds are encased in a hard, dark red aril, which is often used in traditional medicine. Abrus minor is also valued for its ornamental qualities and is sometimes cultivated in gardens for its attractive foliage and seasonal interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus minor is primarily native to Southeast Asia, including countries such as India, Thailand, and Malaysia. It is commonly found in tropical and subtropical regions, often growing in open woodlands, grasslands, and along roadsides. This plant thrives in well-drained soils and is often seen in disturbed habitats. It is also present in parts of Africa and the Pacific Islands. Due to its adaptability, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Abrus minor was mainly introduced to control invasive plant species through its allelopathic properties. It is commonly used in ecological restoration projects to suppress the growth of weeds and other undesirable vegetation. The plant thrives in disturbed soils and can quickly establish itself in open areas. Its seeds contain toxic compounds, which can have adverse effects on livestock and wildlife. Due to its rapid growth and potential ecological impact, it requires careful management to prevent unintended spread."
}
