{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus lusorius",
    "plant_slug": "abrus-lusorius",
    "plant_name_scientific": "abrus lusorius",
    "intro": "Abrus lusorius, commonly known as the devil's blood bean, is a climbing legume native to tropical regions of Africa. It produces striking red pods with black seeds that contain a potent toxin, abrin, which is highly poisonous to humans and animals. The plant has compound leaves with three to five leaflets and small white or pink flowers. Its rapid growth and ornamental appearance make it popular in gardens, though its toxicity requires caution. The species is also studied for its potential in biotechnology due to the unique properties of its seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus lusorius is primarily native to tropical and subtropical regions of Africa, including countries such as Nigeria, Ghana, and the Democratic Republic of the Congo. It is commonly found in woodland and savanna habitats, often growing as a climbing plant or shrub. The species is also present in parts of southern Asia, including India and Sri Lanka, where it thrives in similar climatic conditions. It prefers well-drained soils and is often associated with secondary vegetation. Due to its ornamental and medicinal uses, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Abrus lusorius was mainly introduced to regions where it is used as an ornamental plant due to its distinctive red seed pods. It has been reported in parts of Southeast Asia, including Indonesia and the Philippines, where it is cultivated for its aesthetic value. The plant is often found in gardens and along roadsides, thriving in tropical and subtropical climates. Its introduction has raised concerns about its potential invasiveness in native ecosystems. Despite its ornamental appeal, it is important to monitor its spread to prevent ecological disruption."
}
