{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus longibracteatus",
    "plant_slug": "abrus-longibracteatus",
    "plant_name_scientific": "abrus longibracteatus",
    "intro": "Abrus longibracteatus, commonly known as the long bract maple, is a deciduous shrub or small tree native to Southeast Asia. It is characterized by its simple, alternate leaves that are ovate to elliptic in shape. The plant produces small, greenish-white flowers arranged in clusters, followed by distinctive red, fluffy fruits that contain toxic seeds. The seeds are enclosed in a persistent, showy calyx that remains attached to the plant after maturity. Due to its ornamental value and toxicity, it is often cultivated in gardens but requires careful handling.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus longibracteatus"
    },
    "taxonomy_art_desc": "Abrus longibracteatus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Abrus, a group of flowering plants known for their striking seed pods and the presence of toxic compounds in their seeds. Its species is Abrus longibracteatus, a specific plant within the Abrus genus, distinguished by its long bracts and unique floral structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Laos",
        "Vietnam"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus longibracteatus is primarily native to Laos and Vietnam. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in moist, shaded environments such as forests and along riverbanks. The species is known for its distinctive red seeds enclosed in a showy pod. It plays an important role in local ecosystems and has traditional uses in various cultural practices.",
    "distribution_introduced_art_desc": "Abrus longibracteatus was mainly introduced to areas where it can thrive in tropical and subtropical climates, particularly in regions with well-drained soils. It is commonly found in disturbed habitats such as roadsides, agricultural fields, and abandoned lands. This plant has been reported in several countries in Southeast Asia, including Malaysia and Indonesia. Its introduction is often associated with human activities such as trade and transportation. However, its spread can sometimes lead to ecological concerns due to its competitive nature."
}
