{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus precatorius f. luteoseminalis",
    "plant_slug": "abrus-precatorius-f-luteoseminalis",
    "plant_name_scientific": "abrus precatorius f. luteoseminalis",
    "intro": "Abrus precatorius f. luteoseminalis, commonly known as the golden seed maple or yellow-seeded Abrus, is a variant of the common monkey bean. It is characterized by its distinctive yellow seeds, which contrast with the typical red or black seeds of the species. The plant is a climbing vine with compound leaves and produces small, yellowish flowers. It thrives in tropical and subtropical climates, often found in shaded, moist environments. Its ornamental value is largely due to its striking seed color, making it a popular choice for botanical gardens and collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus precatorius f. luteoseminalis is primarily native to Southeast Asia, including countries such as India, Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in areas with warm, humid climates. This variant is often associated with lowland forests and disturbed habitats, where it thrives in partial to full sunlight. Its native range extends to parts of Africa and the Pacific Islands as well. The plant is known for its distinctive yellow seeds and is often cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Abrus precatorius f. luteoseminalis was mainly introduced to tropical and subtropical regions due to its ornamental value and traditional uses. It is commonly found in countries such as India, Indonesia, and parts of Southeast Asia. The plant thrives in warm climates with well-drained soil and full sun exposure. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. It is important to manage its spread to prevent negative impacts on native flora."
}
