{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus precatorius var. villosula",
    "plant_slug": "abrus-precatorius-var-villosula",
    "plant_name_scientific": "abrus precatorius var. villosula",
    "intro": "Abrus precatorius var. villosula, commonly known as the hairy maple bean, is a flowering plant native to tropical regions of Asia. It is characterized by its distinctive, palmately lobed leaves and clusters of small, yellowish-white flowers. The plant produces intricate, bean-like pods that contain dark red, ornamental seeds with a prominent black spot. These seeds are toxic due to the presence of abrin, a potent lectin. It is often cultivated for its ornamental value and traditional uses in various cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus precatorius var. villosula is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This variant is also present in parts of India and the Philippines, where it thrives in humid climates. The plant is typically found in forest understories or along riverbanks. Its distribution is closely linked to areas with high rainfall and warm temperatures.",
    "distribution_introduced_art_desc": "Abrus precatorius var. villosula was mainly introduced to ornamental and traditional medicine purposes due to its striking red seed pods and historical use in herbal remedies. It is commonly found in tropical and subtropical regions where it has been cultivated for its aesthetic value. The plant has also been introduced as a decorative species in gardens and parks across various parts of the world. Its introduction has sometimes led to it becoming invasive in certain areas, outcompeting native vegetation. Despite its ornamental appeal, it contains toxic compounds and requires careful handling."
}
