{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus pulchellus f. melanospermus",
    "plant_slug": "abrus-pulchellus-f-melanospermus",
    "plant_name_scientific": "abrus pulchellus f. melanospermus",
    "intro": "Abrus pulchellus f. melanospermus, commonly known as the blackseed velvet tare, is a variant of the velvet tare plant characterized by its dark-colored seeds. It belongs to the Fabaceae family and is native to regions of southern Europe and western Asia. The plant features compound leaves with small, oval-shaped leaflets and produces small, pea-like flowers that are typically pink or purple in color. Its seeds, which are encased in a bright red aril, are notable for their contrasting black seeds and are sometimes used in traditional medicine or as ornamental plants. The plant is also valued for its ability to fix nitrogen in the soil, making it beneficial in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus pulchellus f. melanospermus is primarily native to Southeast Asia, including countries such as India, Indonesia, and Malaysia. This variant is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. It thrives in areas with high humidity and is typically associated with forest understories or along riverbanks. The plant is known for its distinctive red flowers and black seeds, which are used in traditional practices. Its distribution is largely confined to the Indian subcontinent and parts of the Pacific islands.",
    "distribution_introduced_art_desc": "Abrus pulchellus f. melanospermus was mainly introduced to regions with warm climates and well-drained soils, often as an ornamental plant due to its striking red flowers. It is commonly found in gardens and cultivated areas in parts of the United States, particularly in the southern states. The plant thrives in full sun and requires minimal maintenance, making it a popular choice for landscapers and home gardeners. However, it is important to note that it can become invasive in certain environments if not properly managed. Its introduction has raised concerns about its potential ecological impact on native plant communities."
}
