{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus baladensis",
    "plant_slug": "abrus-baladensis",
    "plant_name_scientific": "abrus baladensis",
    "intro": "Abrus baladensis, commonly known as the Balad bean, is a climbing legume native to parts of Africa and the Middle East. It produces distinctive red, ornate pods that contain toxic seeds, which are used in traditional medicine and as a source of dye. The plant has compound leaves with small, oval-shaped leaflets and thrives in warm, tropical climates. Its flowers are typically yellow or orange, adding visual interest to its appearance. Due to the toxicity of its seeds, it is important to handle the plant with care.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus baladensis"
    },
    "taxonomy_art_desc": "Abrus baladensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and are often legumes. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Abrus, a group of flowering plants known for their striking, often brightly colored seeds. Its species is Abrus baladensis, a specific type of plant within the Abrus genus, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Somalia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus baladensis is primarily native to Somalia. It is found in the arid and semi-arid regions of the country. This plant thrives in dry, sandy soils and is commonly seen in coastal and inland areas. It plays a role in the local ecosystem and is part of the flora unique to Somalia. Its distribution is limited to specific habitats within the nation.",
    "distribution_introduced_art_desc": "Abrus baladensis was mainly introduced to regions with warm, arid climates where it can thrive in sandy or rocky soils. It is commonly found in parts of the Middle East and North Africa, where it has adapted to the harsh environmental conditions. This plant is often used for ornamental purposes due to its unique seed pods and vibrant flowers. Its introduction has also been associated with traditional uses in some local communities. However, it is important to monitor its spread to prevent potential ecological impacts in non-native areas."
}
