{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus gorsei",
    "plant_slug": "abrus-gorsei",
    "plant_name_scientific": "abrus gorsei",
    "intro": "Abrus gorsei, commonly known as the golden gorse, is a flowering plant native to the Canary Islands. It belongs to the Fabaceae family, characterized by its pod-like fruits and nitrogen-fixing ability. The plant produces bright yellow flowers that bloom in spring, attracting pollinators such as bees and butterflies. Its leaves are trifoliate, consisting of three small, oval-shaped leaflets. The seeds are encased in a hard, ridged pod, which splits open to release the seeds when mature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus gorsei is primarily native to the coastal regions of southern Africa, particularly South Africa. It is commonly found along the sandy shores and dunes of the Western and Eastern Cape provinces. This plant thrives in arid and semi-arid environments, often growing in well-drained soils. It is an important component of the local flora in these regions. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abrus gorsei was mainly introduced to coastal areas and disturbed sites in the Mediterranean region. It thrives in sandy or gravelly soils and is often found along shores and dunes. The plant is considered invasive in some areas due to its rapid growth and ability to outcompete native vegetation. It has been reported in several European countries, including France, Spain, and Italy. Its introduction is likely due to human activity, such as accidental transport through shipping or gardening practices."
}
