{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus aureus subsp. aureus",
    "plant_slug": "abrus-aureus-subsp-aureus",
    "plant_name_scientific": "abrus aureus subsp. aureus",
    "intro": "Abrus aureus subsp. aureus, commonly known as the golden robin, is a flowering plant native to tropical and subtropical regions. It is characterized by its striking orange-red flowers that bloom in clusters, attracting pollinators such as bees and birds. The plant produces distinctive seed pods that are long and slender, containing seeds with a bright red aril. These seeds are often used in traditional medicine and as ornamental elements in gardens. The plant thrives in well-drained soil and requires full sun to partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus aureus"
    },
    "taxonomy_art_desc": "Abrus aureus subsp. aureus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes horsetails and includes a wide range of species with diverse morphologies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and other plants with symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Abrus, a group of flowering plants that includes species known for their ornamental value and some containing toxic compounds. Its species is Abrus aureus, a specific plant known for its striking yellow flowers and is commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus aureus subsp. aureus is primarily native to Madagascar. This species is found throughout the island, particularly in moist forested areas and along riverbanks. It thrives in tropical and subtropical climates, often growing as a climbing plant or shrub. The plant is well adapted to the diverse ecosystems of Madagascar, including both lowland and highland regions. Its native range is largely confined to the island, with no natural populations outside of Madagascar.",
    "distribution_introduced_art_desc": "Abrus aureus subsp. aureus was mainly introduced to ornamental horticulture due to its striking red flowers and distinctive seed pods. It is commonly cultivated in gardens and landscapes for its aesthetic appeal. The plant is also used in traditional medicine in some regions for its purported health benefits. However, it contains toxic compounds and requires careful handling. Its introduction has led to its presence in various parts of the world, including the United States and Europe."
}
