{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus precatorius subsp. precatorius",
    "plant_slug": "abrus-precatorius-subsp-precatorius",
    "plant_name_scientific": "abrus precatorius subsp. precatorius",
    "intro": "Abrus precatorius subsp. precatorius, commonly known as the velvet bean or jequirity, is a climbing legume native to tropical regions of Asia. It is characterized by its striking red and black seed pods, which contain flat, bean-shaped seeds covered in a silky, velvety coating. The plant produces small, yellow flowers and has compound leaves with three to five leaflets. It thrives in warm, humid climates and is often found in disturbed areas such as roadsides and waste lands. The seeds are toxic due to the presence of abrin, a potent lectin that can be lethal in high doses.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus precatorius"
    },
    "taxonomy_art_desc": "Abrus precatorius subsp. precatorius belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their primitive vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, often with showy flowers and a wide range of growth forms. Its order is Fabales, which comprises legumes and related plants, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Abrus, a group of flowering plants that includes species with showy, often colorful flowers and distinctive seed pods. Its species is Abrus precatorius, a climbing plant known for its striking red and black seeds, which are used in traditional crafts and have toxic properties.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is.",
        "Assam",
        "Bangladesh",
        "Cambodia",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "India",
        "Laos",
        "Malaya",
        "Myanmar",
        "Nepal",
        "New South Wales",
        "Nicobar Is.",
        "Northern Territory",
        "Pakistan",
        "Queensland",
        "South China Sea",
        "Sri Lanka",
        "Taiwan",
        "Thailand",
        "Vietnam",
        "West Himalaya",
        "Western Australia"
    ],
    "distribution_introduced": [
        "Bahamas",
        "Belize",
        "Bismarck Archipelago",
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Caroline Is.",
        "Cayman Is.",
        "Colombia",
        "Cook Is.",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "DR Congo",
        "Fiji",
        "Florida",
        "French Guiana",
        "Galápagos",
        "Guatemala",
        "Guyana",
        "Haiti",
        "Hawaii",
        "Honduras",
        "Jamaica",
        "Jawa",
        "Leeward Is.",
        "Lesser Sunda Is.",
        "Marianas",
        "Marquesas",
        "Mauritius",
        "Netherlands Antilles",
        "New Caledonia",
        "New Guinea",
        "Nicaragua",
        "Niue",
        "Panamá",
        "Peru",
        "Philippines",
        "Pitcairn Is.",
        "Puerto Rico",
        "Rodrigues",
        "Réunion",
        "Samoa",
        "Santa Cruz Is.",
        "Society Is.",
        "Southwest Caribbean",
        "Sumatera",
        "Suriname",
        "Tonga",
        "Trinidad-Tobago",
        "Tuamotu",
        "Vanuatu",
        "Venezuelan Antilles",
        "Wallis-Futuna Is.",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abrus precatorius subsp. precatorius is primarily native to the Andaman Is., Assam, Bangladesh, Cambodia, China South-Central, China Southeast, East Himalaya, India, Laos, Malaya, Myanmar, Nepal, New South Wales, Nicobar Is., Northern Territory, Pakistan, Queensland, South China Sea, Sri Lanka, Taiwan, Thailand, Vietnam, West Himalaya, and Western Australia. This species thrives in tropical and subtropical regions, often found in open forests, shrublands, and along riverbanks. It is commonly associated with disturbed habitats and can be found in both coastal and inland areas. The plant is well-adapted to a variety of soil types and is often used in traditional medicine. Its distribution spans across much of Southeast Asia and parts of southern and eastern Asia.",
    "distribution_introduced_art_desc": "Abrus precatorius subsp. precatorius was mainly introduced to the Caribbean, Southeast Asia, and the Pacific Islands, with significant presence in regions such as the Bahamas, Cuba, Fiji, and Hawaii. It has also been established in parts of South America, including Brazil and Colombia, as well as Central America and the Lesser Antilles. This distribution suggests a widespread introduction, likely through human activity such as trade or ornamental planting. The plant's adaptability to various climates has facilitated its spread across tropical and subtropical regions. It is commonly found in disturbed habitats, including coastal areas, roadsides, and abandoned lands."
}
