{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus gracilis",
    "plant_slug": "abrus-gracilis",
    "plant_name_scientific": "abrus gracilis",
    "intro": "Abrus gracilis, commonly known as the slender maple bean, is a flowering plant native to tropical and subtropical regions. It belongs to the Fabaceae family and is characterized by its slender, climbing stems and trifoliate leaves. The plant produces small, yellowish-white flowers that are followed by elongated, bean-like pods. The seeds are encased in a hard, red aril that contains a toxic compound called abrin. Due to its ornamental value and medicinal potential, it is cultivated in some regions for both aesthetic and research purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus gracilis is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with warm, humid climates. This plant thrives in open woodland, forest edges, and disturbed soils where it can receive ample sunlight. It is often associated with secondary growth habitats and is sometimes cultivated for its ornamental value. Its native range extends into parts of India and the Philippines as well.",
    "distribution_introduced_art_desc": "Abrus gracilis was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as forest floors and along stream banks. This plant thrives in cool, temperate climates and is often seen in gardens and naturalized settings. Its delicate, crimson flowers make it a popular ornamental species. However, it is important to note that it can spread aggressively and may become invasive in certain environments."
}
