{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus acutifolius",
    "plant_slug": "abrus-acutifolius",
    "plant_name_scientific": "abrus acutifolius",
    "intro": "Abrus acutifolius, commonly known as the narrow-leaved burr plant, is a flowering plant native to tropical and subtropical regions of Africa, Asia, and the Pacific. It is a member of the Fabaceae family, characterized by its compound leaves and pod-like fruits. The plant produces distinctive, ornamental, and sometimes toxic red seeds encased in a spiny pod. Its leaves are typically narrow and trifoliate, with a glossy surface. Abrus acutifolius is often cultivated for its ornamental value and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus acutifolius is primarily native to southern and eastern Africa, including countries such as South Africa, Zimbabwe, Mozambique, and Tanzania. It is commonly found in dry, open woodlands, savannas, and along riverbanks. The plant thrives in regions with a warm, temperate to subtropical climate. It is often seen growing on rocky soils and in disturbed habitats. Due to its adaptability, it has also been introduced to other parts of the world, including parts of Asia and the Americas.",
    "distribution_introduced_art_desc": "Abrus acutifolius was mainly introduced to regions with tropical and subtropical climates, where it thrives in warm, humid environments. It is commonly found in areas with well-drained soils, often growing as a shrub or small tree. The plant has been introduced to parts of Southeast Asia, the Pacific Islands, and some regions of the Americas. Its introduction is largely due to its ornamental value and use in traditional medicine. However, it is considered an invasive species in certain areas, outcompeting native vegetation."
}
