{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus melanospermus",
    "plant_slug": "abrus-melanospermus",
    "plant_name_scientific": "abrus melanospermus",
    "intro": "Abrus melanospermus, commonly known as the black seed bean, is a flowering plant native to tropical regions of Africa and Asia. It belongs to the Fabaceae family, characterized by its pod-like fruits and nitrogen-fixing ability. The plant produces small, yellow flowers that develop into elongated, woody pods containing dark, toxic seeds. The seeds are encased in a hard, brittle shell and are used in traditional medicine, though they contain toxic compounds. Due to its toxicity, handling and consumption of the plant require caution.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus melanospermus"
    },
    "taxonomy_art_desc": "Abrus melanospermus belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Abrus, a group of flowering plants known for their ornamental value and some species containing toxic compounds. Its species is Abrus melanospermus, a specific type of plant within the Abrus genus characterized by its unique morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Andaman Is.",
        "Angola",
        "Assam",
        "Bangladesh",
        "Benin",
        "Borneo",
        "Burkina",
        "Burundi",
        "Cambodia",
        "Cameroon",
        "Central African Republic",
        "Chad",
        "China South-Central",
        "China Southeast",
        "Congo",
        "DR Congo",
        "East Himalaya",
        "Equatorial Guinea",
        "Ethiopia",
        "Ghana",
        "Guinea",
        "Guinea-Bissau",
        "Hainan",
        "India",
        "Jawa",
        "Kenya",
        "Laos",
        "Liberia",
        "Madagascar",
        "Malawi",
        "Malaya",
        "Mali",
        "Mozambique",
        "Myanmar",
        "Nepal",
        "New Caledonia",
        "New Guinea",
        "Nigeria",
        "Philippines",
        "Senegal",
        "Sierra Leone",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Tanzania",
        "Thailand",
        "Togo",
        "Uganda",
        "Vietnam",
        "West Himalaya",
        "Zambia"
    ],
    "distribution_introduced": [
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil West-Central",
        "Colombia",
        "Venezuela"
    ],
    "distribution_native_art_desc": "Abrus melanospermus is primarily native to the Andaman Is., Angola, Assam, Bangladesh, Benin, Borneo, Burkina, Burundi, Cambodia, Cameroon, Central African Republic, Chad, China South-Central, China Southeast, Congo, DR Congo, East Himalaya, Equatorial Guinea, Ethiopia, Ghana, Guinea, Guinea-Bissau, Hainan, India, Jawa, Kenya, Laos, Liberia, Madagascar, Malawi, Malaya, Mali, Mozambique, Myanmar, Nepal, New Caledonia, New Guinea, Nigeria, Philippines, Senegal, Sierra Leone, Sri Lanka, Sudan-South Sudan, Tanzania, Thailand, Togo, Uganda, Vietnam, West Himalaya, and Zambia. This plant is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. It is particularly prevalent in areas with rich biodiversity and diverse ecosystems. The species is known for its distinctive red seeds and is often used in traditional practices. Its wide distribution spans across multiple continents, reflecting its adaptability to various climatic conditions.",
    "distribution_introduced_art_desc": "Abrus melanospermus was mainly introduced to Bolivia, Brazil North, Brazil Northeast, Brazil West-Central, Colombia, and Venezuela. It is a leguminous plant native to tropical regions of South America. The introduction of this species may be associated with human activities such as agriculture or horticulture. It is known for its distinctive seed pods and toxic properties. This distribution suggests that it has been cultivated or spread within these regions for various purposes."
}
