{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus sambiranensis",
    "plant_slug": "abrus-sambiranensis",
    "plant_name_scientific": "abrus sambiranensis",
    "intro": "Abrus sambiranensis, commonly known as the Sambiranensis Abrus, is a flowering plant belonging to the Fabaceae family. It is native to parts of Southeast Asia, particularly Indonesia and the Philippines. The plant is characterized by its distinctive, showy pods that contain toxic seeds, which are often used in traditional practices. Its leaves are trifoliate, and the plant typically grows as a shrub or small tree. Due to its ornamental value and medicinal properties, it is sometimes cultivated in tropical regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus sambiranensis"
    },
    "taxonomy_art_desc": "Abrus sambiranensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns, horsetails, and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their showy flowers and diverse growth forms. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes a wide variety of plants with distinctive pod fruits. Its genus is Abrus, a group of flowering plants that are often found in tropical regions and are known for their colorful seeds. Its species is Abrus sambiranensis, a specific plant within the Abrus genus that is native to certain regions and is recognized by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus sambiranensis is primarily native to Madagascar. It is found in the central and eastern regions of the island. This plant typically grows in forested areas and is adapted to the tropical climate of Madagascar. It is a climbing plant that thrives in humid and shaded environments. Due to its limited distribution, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Abrus sambiranensis was mainly introduced to specific regions in Southeast Asia, particularly in Indonesia and the Philippines, where it has been cultivated for its ornamental value. It is commonly found in tropical and subtropical areas with high humidity and warm temperatures. The plant is often grown in gardens and along roadsides due to its distinctive red seed pods. It has also been introduced to parts of Australia and the Pacific Islands as an ornamental species. However, its spread is limited due to its preference for specific environmental conditions."
}
