{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus kaokoensis",
    "plant_slug": "abrus-kaokoensis",
    "plant_name_scientific": "abrus kaokoensis",
    "intro": "Abrus kaokoensis, commonly known as the Kaoko velvet tamarind, is a flowering plant native to southern Africa. It belongs to the Fabaceae family, which includes legumes, and is characterized by its distinctive, showy flowers. The plant produces elongated pods that contain flat, bean-like seeds covered in a silky, reddish-brown coating. These seeds are not only ornamental but also have historical uses in traditional practices. Its growth habit is typically shrub-like, with compound leaves and a preference for well-drained soils in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus kaokoensis"
    },
    "taxonomy_art_desc": "Abrus kaokoensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, often with complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes plants known for their legume fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Abrus, a group of flowering plants known for their distinctive seed pods and often toxic properties. Its species is Abrus kaokoensis, a specific type within the Abrus genus, known for its unique botanical features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Namibia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus kaokoensis is primarily native to Namibia. It is commonly found in the arid and semi-arid regions of the country. This plant typically grows in rocky soils and is often seen in dry, open habitats. It is well adapted to the harsh environmental conditions of Namibia's interior. The species is part of the legume family and is known for its distinctive seed pods.",
    "distribution_introduced_art_desc": "Abrus kaokoensis was mainly introduced to regions with tropical and subtropical climates where it can thrive in well-drained soils. It is commonly found in areas with high humidity and sufficient sunlight, making it suitable for cultivation in parts of Africa and Southeast Asia. The plant is often grown as an ornamental due to its distinctive and colorful seed pods. However, it is important to note that it contains toxic compounds and should be handled with care. Its introduction has sometimes led to ecological concerns in non-native environments."
}
