{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abrus canescens",
    "plant_slug": "abrus-canescens",
    "plant_name_scientific": "abrus canescens",
    "intro": "Abrus canescens, commonly known as the velvet bean, is a leguminous plant native to tropical and subtropical regions. It is characterized by its distinctive yellow-orange flowers and bean-like pods that contain toxic seeds. The plant has feathery leaves and is often cultivated for its seeds, which are used in traditional medicine and as a source of protein. It thrives in warm climates and is adapted to poor soil conditions. Its botanical features make it an important species in both ecological and agricultural contexts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Abrus",
        "species": "Abrus canescens"
    },
    "taxonomy_art_desc": "Abrus canescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and vascular structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide range of morphological diversity. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Abrus, a group of flowering plants that includes species known for their ornamental value and sometimes toxic properties. Its species is Abrus canescens, a specific plant within the genus Abrus, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Benin",
        "Burkina",
        "Burundi",
        "Cameroon",
        "Central African Republic",
        "Chad",
        "DR Congo",
        "Ethiopia",
        "Gabon",
        "Gambia",
        "Ghana",
        "Guinea",
        "Guinea-Bissau",
        "Ivory Coast",
        "Kenya",
        "Liberia",
        "Mali",
        "Nigeria",
        "Senegal",
        "Sierra Leone",
        "Sudan-South Sudan",
        "Tanzania",
        "Togo",
        "Uganda",
        "Zambia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abrus canescens is primarily native to Angola, Benin, Burkina, Burundi, Cameroon, Central African Republic, Chad, DR Congo, Ethiopia, Gabon, Gambia, Ghana, Guinea, Guinea-Bissau, Ivory Coast, Kenya, Liberia, Mali, Nigeria, Senegal, Sierra Leone, Sudan-South Sudan, Tanzania, Togo, Uganda, Zambia. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in open woodlands, savannas, and along riverbanks. Abrus canescens is often used in traditional medicine and for its ornamental value. Its distribution reflects its adaptability to a wide range of ecological conditions in sub-Saharan Africa.",
    "distribution_introduced_art_desc": "Abrus canescens was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its distinctive seed pods and vibrant seed colors. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in disturbed soils and can spread rapidly through its toxic seeds. Its introduction has raised concerns among land managers due to its ecological impact."
}
