{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abryanthemum edule",
    "plant_slug": "abryanthemum-edule",
    "plant_name_scientific": "abryanthemum edule",
    "intro": "Abryanthemum edule, commonly known as the edible groundsel, is a flowering plant native to parts of Africa. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant typically grows in arid and semi-arid regions, thriving in well-drained soils. Its leaves are often used in traditional cuisine, valued for their mild, slightly peppery flavor. The plant also has medicinal properties, with some cultures using it to treat ailments like digestive issues and skin conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abryanthemum edule is primarily native to the coastal regions of southern Africa, particularly Namibia and South Africa. It thrives in sandy soils and is commonly found in dune environments along the Atlantic coast. This plant is well adapted to arid and semi-arid climates, making it a hardy species in these regions. It is often used in traditional medicine and as a source of food by local communities. Its distribution is closely linked to the specific ecological conditions of the coastal zones it inhabits.",
    "distribution_introduced_art_desc": "Abryanthemum edule was mainly introduced to New Zealand as an ornamental plant due to its attractive yellow flowers and hardy nature. It was later found to have potential as a food source for livestock, leading to its cultivation in agricultural areas. However, its rapid growth and ability to spread through seeds have made it a problematic invasive species in some regions. Despite its benefits, it is now considered a weed in parts of New Zealand where it outcompetes native vegetation. Efforts are ongoing to manage its spread while exploring sustainable uses for the plant."
}
