{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium lagocephalum",
    "plant_slug": "absinthium-lagocephalum",
    "plant_name_scientific": "absinthium lagocephalum",
    "intro": "Absinthium lagocephalum, commonly known as the blueweed, is a flowering plant native to Europe and parts of Asia. It belongs to the family Asteraceae, characterized by its composite flower heads that resemble small daisies. The plant typically grows in moist, grassy areas and has narrow, linear leaves with a bluish-green hue. Its flowers are small and yellow, appearing in clusters, and it produces a distinctive, aromatic scent. Absinthium lagocephalum is often used in traditional herbal medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium lagocephalum is primarily native to southern Europe, including countries such as Spain, Portugal, and parts of Italy. It is also found in North Africa, particularly in regions like Morocco and Algeria. This plant thrives in dry, rocky habitats and is commonly associated with Mediterranean climates. It is often seen growing in open woodlands, grasslands, and along the edges of scrublands. Its native range extends into the Canary Islands, where it has adapted to the unique environmental conditions of the archipelago.",
    "distribution_introduced_art_desc": "Absinthium lagocephalum was mainly introduced to new habitats through human activity, such as horticulture and landscaping. It is commonly found in disturbed soils and urban environments, where it thrives in sunny, well-drained areas. This plant has become naturalized in several regions outside its native range, often outcompeting native vegetation. Its rapid growth and adaptability make it a potential invasive species in some areas. Conservation efforts are ongoing to monitor its spread and manage its impact on local ecosystems."
}
