{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium rupestre",
    "plant_slug": "absinthium-rupestre",
    "plant_name_scientific": "absinthium rupestre",
    "intro": "Absinthium rupestre, commonly known as rock wormwood, is a perennial herb native to rocky and arid regions of Europe and Asia. It features slender, branched stems that often grow in dense clusters, adapted to withstand harsh environmental conditions. The plant produces small, yellowish flowers arranged in clusters, which bloom in late summer. Its leaves are narrow and covered in fine hairs, contributing to its drought-resistant characteristics. Absinthium rupestre is often found in limestone soils and is valued for its ornamental appeal and historical use in herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium rupestre is primarily native to southern Europe, including countries such as Spain, Portugal, and southern France. It is also found in parts of North Africa, particularly in Morocco and Algeria. This plant thrives in rocky and arid environments, often growing on limestone or sandstone substrates. It is commonly found in high-altitude regions and along coastal areas. Its distribution is closely associated with Mediterranean climate zones characterized by dry summers and mild, wet winters.",
    "distribution_introduced_art_desc": "Absinthium rupestre was mainly introduced to specific regions with suitable habitats such as rocky soils and arid environments. It has been documented in areas of Europe, particularly in countries like France, Spain, and Italy. This plant is often found in open woodlands and along mountain slopes where it thrives in well-drained conditions. Its introduction is likely due to natural dispersal through wind or human activity. However, its spread has been limited to areas with specific ecological requirements."
}
