{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium congestum",
    "plant_slug": "absinthium-congestum",
    "plant_name_scientific": "absinthium congestum",
    "intro": "Absinthium congestum, commonly known as clustered wormwood, is a perennial herb native to Europe and parts of Asia. It is characterized by its aromatic, silver-gray foliage and clusters of small, yellowish-green flowers. The plant contains high concentrations of thujone, a compound responsible for its distinctive and often bitter aroma. It thrives in dry, well-drained soils and is often found in rocky or gravelly habitats. Due to its chemical composition, it has been historically used in the production of absinthe and other herbal remedies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium congestum is primarily native to the mountainous regions of Central Asia, including countries such as Kazakhstan, Kyrgyzstan, and Tajikistan. It thrives in alpine and subalpine environments, often found in rocky soils at high elevations. This plant is adapted to cold climates and is commonly found in meadows and slopes above the tree line. It is part of the Asteraceae family and is known for its distinctive yellow flowers. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Absinthium congestum was mainly introduced to New Zealand. It was brought there by European settlers during the 19th century. The plant thrives in coastal environments and has become naturalized in several regions. It is now considered a potential weed in some areas due to its rapid growth. However, it is also valued for its ornamental qualities and is sometimes cultivated in gardens."
}
