{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium officinale",
    "plant_slug": "absinthium-officinale",
    "plant_name_scientific": "absinthium officinale",
    "intro": "Absinthium officinale, commonly known as wormwood, is a flowering plant native to Europe, western Asia, and northern Africa. It is characterized by its finely divided, gray-green leaves and small yellowish flowers that bloom in summer. The plant contains a variety of bioactive compounds, including thujone, which contributes to its distinctive bitter taste. Wormwood is often cultivated for its essential oils and has a long history of use in herbal medicine. It is also a key ingredient in the production of absinthe, a spirit known for its unique flavor and historical significance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium officinale is primarily native to Europe and western Asia. It is commonly found in regions such as the Mediterranean, Central Europe, and parts of the Middle East. This plant thrives in temperate climates and is often associated with rocky or dry soils. It has been historically used for its medicinal properties and as a source of absinthe. Its native range includes countries like France, Italy, Greece, and Turkey.",
    "distribution_introduced_art_desc": "Absinthium officinale was mainly introduced to regions with temperate climates where it can thrive in well-drained soils. It is commonly found in meadows, grasslands, and along roadsides. This plant is often used in traditional medicine for its purported health benefits. Its distribution has expanded due to human activity and intentional cultivation. However, it is considered invasive in some areas, posing a threat to native plant species."
}
