{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium santonicum",
    "plant_slug": "absinthium-santonicum",
    "plant_name_scientific": "absinthium santonicum",
    "intro": "Absinthium santonicum, commonly known as the sacred herb of the ancient Greeks, is a flowering plant native to the Mediterranean region. It belongs to the Asteraceae family, characterized by its composite flower heads and aromatic foliage. The plant is notable for its strong, often bitter scent, which is attributed to compounds like absinthin and santonicin. Its leaves and flowers are used in traditional medicine for their purported digestive and antiseptic properties. Absinthium santonicum thrives in well-drained soils and full sunlight, making it a hardy perennial in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium santonicum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky, and sunny habitats such as steppes and coastal areas. This plant is commonly found in countries like France, Spain, Italy, and Greece. It prefers well-drained soils and is often seen growing in open fields or along roadsides. Due to its adaptability, it has also been introduced to other regions with similar climates.",
    "distribution_introduced_art_desc": "Absinthium santonicum was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in disturbed habitats such as roadsides, fields, and along stream banks. This plant has spread across several regions in Europe and parts of North America due to its adaptability and rapid growth. It is often considered an invasive species in some areas because of its ability to outcompete native vegetation. Its distribution is also influenced by human activities such as agriculture and land development."
}
