{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium argenteum",
    "plant_slug": "absinthium-argenteum",
    "plant_name_scientific": "absinthium argenteum",
    "intro": "Absinthium argenteum, commonly known as silver wormwood, is a perennial herb native to the mountainous regions of Central Asia. It is characterized by its finely divided, silver-gray leaves that give it a striking appearance. The plant produces small, yellowish-green flowers that bloom in late summer, attracting various pollinators. It thrives in well-drained soils and full sunlight, often found in rocky or alpine environments. Due to its ornamental value and historical use in traditional medicine, it is cultivated in some botanical gardens and herbal collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium argenteum is primarily native to the mountainous regions of Central Asia, including countries such as Kazakhstan, Uzbekistan, and Tajikistan. It thrives in alpine and subalpine environments, often growing at elevations between 1,500 and 3,000 meters. This plant is commonly found in rocky soils and open slopes, where it benefits from the cool, dry climate. It is an important component of the local flora and is adapted to the harsh conditions of its native habitat. Its distribution is relatively restricted, making it a rare and specialized species in its range.",
    "distribution_introduced_art_desc": "Absinthium argenteum was mainly introduced to the United States as an ornamental plant due to its attractive silver foliage. It is commonly found in gardens and landscapes across the eastern and midwestern regions. Despite its beauty, it has become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, well-drained soils and can spread rapidly through seed dispersal. Its introduction has raised concerns among ecologists about its impact on local ecosystems."
}
