{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium candidum",
    "plant_slug": "absinthium-candidum",
    "plant_name_scientific": "absinthium candidum",
    "intro": "Absinthium candidum, commonly known as common wormwood, is a flowering plant native to Europe and parts of Asia. It is characterized by its grayish-green foliage and yellowish-green flowers that bloom in late summer. The plant contains high concentrations of essential oils, including thujone, which contributes to its distinctive aroma and historical use in absinthe. Its leaves are typically narrow and lance-shaped, with a rough texture. Absinthium candidum thrives in well-drained soils and full sun, making it a hardy perennial in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium candidum is primarily native to southern Europe and western Asia. It is commonly found in regions such as southern France, Italy, Spain, and parts of the Balkans. This plant thrives in dry, sunny habitats like grasslands, rocky slopes, and disturbed soils. It is also present in some areas of North Africa, including Morocco and Algeria. Its native range extends into eastern Turkey and the Caucasus region.",
    "distribution_introduced_art_desc": "Absinthium candidum was mainly introduced to the United States as an ornamental plant due to its attractive silver foliage and unique appearance. It was commonly found in gardens and landscapes, particularly in the western states like California and Oregon. Despite its aesthetic appeal, it has since become an invasive species in some areas, outcompeting native vegetation. Its rapid spread has led to increased management efforts by local governments and conservation groups. However, it remains a popular choice for those seeking low-maintenance, decorative plants."
}
