{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium moxa",
    "plant_slug": "absinthium-moxa",
    "plant_name_scientific": "absinthium moxa",
    "intro": "Absinthium moxa, commonly known as wormwood, is a perennial herbaceous plant belonging to the family Asteraceae. It is characterized by its aromatic, feathery leaves and small, yellowish flower heads. The plant is native to Europe, western Asia, and North Africa, often found in dry, sunny habitats. Its leaves and flowers contain compounds such as thujone, which contribute to its strong, bitter aroma. Absinthium moxa has been historically used in traditional medicine and as an ingredient in absinthe.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium moxa is primarily native to temperate regions of Europe and western Asia. It thrives in grasslands, meadows, and open woodlands where it receives ample sunlight. This plant is commonly found in countries such as France, Germany, and Russia. It prefers well-drained soils and is often part of the natural vegetation in these areas. Its distribution is closely linked to the climate and soil conditions of its native habitats.",
    "distribution_introduced_art_desc": "Absinthium moxa was mainly introduced to areas with temperate climates where it can thrive in well-drained soils. It is commonly found in regions of Europe and parts of Asia where it has been cultivated for its medicinal properties. The plant is often used in traditional medicine for its purported health benefits. Its introduction has been documented in several botanical databases and herbal compendiums. However, its spread has been limited due to its specific environmental requirements."
}
