{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium virgatum",
    "plant_slug": "absinthium-virgatum",
    "plant_name_scientific": "absinthium virgatum",
    "intro": "Absinthium virgatum, commonly known as common wormwood, is a perennial herb native to Europe and parts of Asia. It is characterized by its tall, erect stem and finely divided, feathery leaves that give it a distinctive appearance. The plant produces small, greenish-yellow flowers arranged in complex inflorescences, which bloom in late summer. It thrives in dry, sunny environments and is often found in meadows and along roadsides. Absinthium virgatum has a strong, bitter aroma due to its high concentration of essential oils and has been used historically in herbal medicine and as a flavoring agent.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium virgatum is primarily native to the mountainous regions of Central Asia, including countries such as Kazakhstan, Uzbekistan, and Tajikistan. It thrives in alpine and subalpine environments, often found in rocky soils at elevations ranging from 1,500 to 3,500 meters. This plant is commonly associated with the Pamir and Tien Shan mountain ranges, where it adapts to the harsh, cold climate. It is also found in parts of northern India and the western Himalayas. Due to its specific habitat requirements, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Absinthium virgatum was mainly introduced to the Pacific Northwest region of the United States. It was first documented in the early 20th century as an ornamental plant due to its attractive blue flowers. Over time, it has spread beyond cultivated areas into natural habitats, particularly along stream banks and moist woodlands. Its establishment has raised concerns due to its potential to outcompete native vegetation. Despite its invasive tendencies, it remains a popular choice for gardeners seeking a hardy, decorative plant."
}
