{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium glaciale",
    "plant_slug": "absinthium-glaciale",
    "plant_name_scientific": "absinthium glaciale",
    "intro": "Absinthium glaciale, commonly known as snow absinth, is a perennial plant native to the high alpine regions of Europe. It features finely divided, silver-gray leaves that are covered in a dense layer of fine hairs, which help to reduce water loss in cold, arid environments. The plant produces small, pale blue to purple flowers that bloom in late summer, attracting pollinators such as bees and butterflies. Its flowering stems are often used in herbal medicine for their purported diuretic and digestive properties. Absinthium glaciale thrives in well-drained soils and requires full sun to partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium glaciale is primarily native to the Arctic regions of Europe and North America. It thrives in cold, alpine environments where the climate is harsh and the growing season is short. This plant is commonly found in tundra and rocky areas, often growing at high altitudes. Its distribution includes parts of Scandinavia, Iceland, and the northern United States. It is well adapted to survive in extreme conditions with limited soil nutrients.",
    "distribution_introduced_art_desc": "Absinthium glaciale was mainly introduced to cold and alpine regions where it thrives in rocky and well-drained soils. It is commonly found in mountainous areas of Europe and parts of North America. This plant is often associated with high-altitude environments due to its adaptation to low temperatures and limited nutrients. Its introduction has been documented in several ecological studies focusing on alpine flora. It plays a role in stabilizing soil and providing habitat for specialized insect species."
}
