{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium splendens",
    "plant_slug": "absinthium-splendens",
    "plant_name_scientific": "absinthium splendens",
    "intro": "Absinthium splendens, commonly known as the golden wormwood, is a striking plant native to the mountainous regions of Central Asia. It is characterized by its tall, slender stems and clusters of bright yellow flowers that bloom in late summer. The plant has finely divided, feathery leaves that give it a delicate appearance. It thrives in well-drained soils and full sun, making it a popular choice for rock gardens and alpine settings. Due to its ornamental value and historical use in herbal medicine, it is often cultivated for both aesthetic and practical purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium splendens is primarily native to the mountainous regions of Central Asia, including countries such as Kazakhstan, Kyrgyzstan, and Tajikistan. It thrives in high-altitude environments with cool temperatures and well-drained soils. This plant is commonly found in alpine meadows and rocky slopes at elevations ranging from 2,000 to 4,000 meters. It is adapted to harsh climatic conditions and is often part of the local flora in these remote areas. Due to its specific habitat requirements, it is not widely distributed beyond its native range.",
    "distribution_introduced_art_desc": "Absinthium splendens was mainly introduced to new habitats through human activity, such as horticultural trade and intentional planting. It is commonly found in disturbed areas like roadsides, waste grounds, and agricultural fields. The plant has adapted well to a variety of soil types and can thrive in both sunny and partially shaded environments. Its rapid growth and ability to spread via seeds make it a successful invader in non-native regions. However, its introduction has raised concerns about its impact on local ecosystems and native plant species."
}
