{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium spathulatum",
    "plant_slug": "absinthium-spathulatum",
    "plant_name_scientific": "absinthium spathulatum",
    "intro": "Absinthium spathulatum, commonly known as narrowleaf wormwood, is a perennial herb native to the Mediterranean region. It features slender, upright stems that are often branched and covered in fine, hairy hairs. The plant produces small, yellowish-green flowers arranged in dense, spike-like clusters, which bloom in the summer months. Its leaves are lance-shaped, with a strongly aromatic, bitter scent due to the presence of essential oils. This species is valued in traditional medicine and is also used in the preparation of certain herbal beverages.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium spathulatum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in dry, rocky soils and is commonly found in grasslands, scrublands, and along the edges of forests. This plant is well adapted to temperate climates and can tolerate periods of drought. It is often seen growing in areas with mild winters and hot, dry summers. Due to its hardy nature, it is sometimes cultivated in gardens for its ornamental value.",
    "distribution_introduced_art_desc": "Absinthium spathulatum was mainly introduced to new habitats through human activity, including gardening and landscaping. It is commonly found in disturbed areas such as roadsides, fields, and waste ground. This plant has become naturalized in several regions outside its native range. Its rapid growth and adaptability contribute to its spread. However, it is considered a potential invasive species in some areas."
}
