{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium viridiflorum",
    "plant_slug": "absinthium-viridiflorum",
    "plant_name_scientific": "absinthium viridiflorum",
    "intro": "Absinthium viridiflorum, commonly known as greenflower wormwood, is a perennial herb native to the mountainous regions of Central Asia. It features slender, upright stems covered in fine hairs and produces small, greenish-yellow flowers arranged in panicles. The plant has aromatic, serrated leaves that are often used in traditional medicine. Its essential oil, derived from the flowering tops, contains high levels of thujone, contributing to its historical use in absinthe. Due to its toxicity and specific growing conditions, it is relatively rare and requires careful cultivation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium viridiflorum is primarily native to the mountainous regions of Central Asia, including countries such as Kazakhstan, Uzbekistan, and Tajikistan. It thrives in alpine and subalpine habitats, often found in rocky soils at elevations ranging from 1,500 to 3,500 meters. This plant is well adapted to the cold and arid conditions of its native environment. It is commonly found in meadows, slopes, and along riverbanks in these regions. Its distribution is closely linked to the specific ecological conditions of the Central Asian mountain ranges.",
    "distribution_introduced_art_desc": "Absinthium viridiflorum was mainly introduced to the United States as an ornamental plant due to its attractive foliage and unique flowering structure. It was first brought to North America in the early 20th century by horticultural enthusiasts who valued its aesthetic appeal. The plant has since spread beyond cultivated areas, establishing itself in moist, shaded environments across the eastern United States. Its introduction has raised concerns among ecologists due to its potential to outcompete native plant species. Despite its beauty, Absinthium viridiflorum is considered an invasive species in some regions, prompting efforts to control its spread."
}
