{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium tanacetifolium",
    "plant_slug": "absinthium-tanacetifolium",
    "plant_name_scientific": "absinthium tanacetifolium",
    "intro": "Absinthium tanacetifolium, commonly known as yarrow. This plant is a perennial herb native to Europe and parts of Asia, characterized by its finely divided, fern-like leaves and clusters of small, white or pale yellow flowers. It belongs to the Asteraceae family, which includes daisies and sunflowers, and is known for its aromatic, slightly bitter scent. The plant is often found in meadows, grasslands, and along roadsides, thriving in well-drained soils. It has a long history of use in traditional medicine and as a component in herbal remedies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium tanacetifolium is primarily native to southern Europe, particularly the Mediterranean region, including countries such as Spain, Portugal, Italy, and France. It thrives in dry, sunny environments and is commonly found in rocky soils and open woodlands. This plant is also present in parts of North Africa, including Morocco and Algeria, where it adapts well to the arid climate. It is often seen in disturbed habitats such as roadsides and waste areas. Its historical use in herbal medicine and as a component in absinthe has contributed to its recognition in traditional botanical practices.",
    "distribution_introduced_art_desc": "Absinthium tanacetifolium was mainly introduced to North America as an ornamental plant due to its showy yellow flowers and aromatic foliage. It has since spread beyond cultivated gardens into natural areas, particularly in disturbed soils and open habitats. This plant is considered invasive in some regions because of its rapid growth and ability to outcompete native vegetation. Its introduction has led to concerns about ecological impact and habitat alteration. Proper management is necessary to control its spread and mitigate its effects on local ecosystems."
}
