{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium sieversianum var. absinthioides",
    "plant_slug": "absinthium-sieversianum-var-absinthioides",
    "plant_name_scientific": "absinthium sieversianum var. absinthioides",
    "intro": "Absinthium sieversianum var. absinthioides, commonly known as the narrowleaf wormwood, is a perennial herb native to the mountainous regions of Central Asia. It features slender, aromatic stems and narrow, lance-shaped leaves with a distinctive silvery-white underside. The plant produces small, greenish-yellow flowers arranged in dense, spike-like clusters. It is often found in rocky or gravelly soils at high altitudes. Its chemical composition includes compounds such as thujone and absinthin, which contribute to its historical use in herbal medicine and distillation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium sieversianum var. absinthioides is primarily native to the eastern and southeastern regions of Europe, including parts of the Czech Republic, Slovakia, Poland, Ukraine, and Russia. It is also found in some areas of western and central Asia, such as Turkey and the Caucasus. This plant typically grows in moist, calcareous soils in meadows, grasslands, and along riverbanks. It thrives in temperate climates and is often associated with disturbed or open habitats. Its distribution is relatively limited, with scattered populations across its native range.",
    "distribution_introduced_art_desc": "Absinthium sieversianum var. absinthioides was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in temperate regions. It thrives in disturbed habitats such as roadsides, fields, and along streambanks. This plant is often found in regions with a climate that supports its growth during the spring and summer months. Its introduction has been documented in several European countries, where it has established itself in natural and semi-natural environments. Due to its adaptability, it has become a common weed in agricultural and urban settings."
}
