{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium frigidum var. willdenowianum",
    "plant_slug": "absinthium-frigidum-var-willdenowianum",
    "plant_name_scientific": "absinthium frigidum var. willdenowianum",
    "intro": "Absinthium frigidum var. willdenowianum, commonly known as the frost absinth. It is a perennial herb native to the alpine regions of Europe and Asia. The plant features slender, hairy stems and narrow, lance-shaped leaves that are often covered in fine pubescence. Its flowers are small, blue to purple in color, and it produces a distinctive, aromatic compound known as absinthin. This variety is valued for its medicinal properties and historical use in herbal remedies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium frigidum var. willdenowianum is primarily native to Central Asia, including regions such as Kazakhstan, Uzbekistan, and southern Russia. It thrives in dry, mountainous environments and is commonly found in steppes and rocky slopes. This variety is adapted to cold climates and can tolerate harsh environmental conditions. It is often associated with arid and semi-arid regions where it plays a role in local ecosystems. The plant is also occasionally found in parts of northern China and Mongolia.",
    "distribution_introduced_art_desc": "Absinthium frigidum var. willdenowianum was mainly introduced to new habitats through human activity, particularly in regions with temperate climates. It has been documented in various locations across Europe and parts of North America. This plant is often found in disturbed soils, such as along roadsides and in agricultural fields. Its introduction has raised concerns due to its potential to outcompete native species. Despite its invasive tendencies, it is sometimes used in ecological restoration projects due to its hardy nature."
}
