{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium saxatile",
    "plant_slug": "absinthium-saxatile",
    "plant_name_scientific": "absinthium saxatile",
    "intro": "Absinthium saxatile, commonly known as mountain wormwood, is a flowering plant native to the mountainous regions of Europe and western Asia. It is a member of the Asteraceae family, characterized by its composite flower heads that resemble small clusters of tiny flowers. The plant typically grows in rocky or sandy soils and thrives in alpine or subalpine environments. Its leaves are narrow and grayish-green, with a strongly aromatic scent, and it produces small, yellowish flowers in the summer. Absinthium saxatile is often used in traditional medicine for its purported digestive and antiseptic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium saxatile is primarily native to the mountainous regions of Central and Southern Europe, including parts of the Alps and the Carpathian Mountains. It thrives in rocky and gravelly soils, often found in alpine meadows and dry slopes. This plant is commonly associated with high-altitude environments where it tolerates cold and poor soil conditions. Its distribution extends into some areas of Western Asia, particularly in Turkey and the Caucasus. It is a hardy species that plays an important role in the biodiversity of these mountain ecosystems.",
    "distribution_introduced_art_desc": "Absinthium saxatile was mainly introduced to areas with rocky or gravelly soils, particularly in mountainous regions. It thrives in well-drained environments and is commonly found in alpine and subalpine zones. This plant is often associated with disturbed habitats such as roadsides and open meadows. Its introduction has been documented in several European countries, including France and Switzerland. It plays a role in stabilizing soil and providing habitat for various invertebrates."
}
