{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium rupestre var. oelandicum",
    "plant_slug": "absinthium-rupestre-var-oelandicum",
    "plant_name_scientific": "absinthium rupestre var. oelandicum",
    "intro": "Absinthium rupestre var. oelandicum, commonly known as Oeland wormwood, is a perennial herb native to the northern regions of Europe. It is characterized by its aromatic, silver-gray foliage and small, yellowish-green flowers that bloom in early summer. The plant thrives in dry, rocky soils and is often found in alpine or subalpine habitats. Its leaves contain high concentrations of volatile oils, contributing to its distinctive bitter taste. This variety is valued for its ornamental appeal and historical use in herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium rupestre var. oelandicum is primarily native to northern Europe, particularly Scandinavia and the British Isles. It thrives in rocky and calcareous soils, often found in alpine and subalpine regions. This variety is commonly associated with mountainous areas in countries such as Norway, Sweden, and Iceland. It is well adapted to cool, moist climates and can be found in open grasslands and heathlands. Its distribution is limited to specific habitats where it can receive adequate sunlight and drainage.",
    "distribution_introduced_art_desc": "Absinthium rupestre var. oelandicum was mainly introduced to specific regions of northern Europe, particularly in the Scandinavian countries and parts of Germany. It was introduced primarily for its ornamental value due to its striking blue flowers and hardy nature. This variety is often found in disturbed soils and rocky habitats, making it a common sight in alpine and subalpine areas. Its introduction has been largely unintentional, as it spreads through seed dispersal by wind and animals. Despite its beauty, it is considered invasive in some areas where it outcompetes native plant species."
}
