{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium arborescens",
    "plant_slug": "absinthium-arborescens",
    "plant_name_scientific": "absinthium arborescens",
    "intro": "Absinthium arborescens, commonly known as the tree absinth, is a perennial herbaceous plant native to the mountainous regions of Central Asia. It features a robust, branching stem that can grow up to two meters in height, with lance-shaped leaves that are covered in fine hairs. The plant produces small, yellowish-green flowers arranged in panicle clusters, which bloom in late summer. Its root system is fibrous and deep, allowing it to thrive in well-drained, rocky soils. Absinthium arborescens is valued for its aromatic properties and has been used in traditional medicine for its purported digestive and antispasmodic effects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium arborescens is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in rocky and arid environments, often found in mountainous areas and along coastal regions. This plant is commonly associated with dry, sunny habitats such as cliffs, slopes, and disturbed soils. It has a long history of use in traditional medicine and as a source of aromatic compounds. Its distribution is closely linked to the climatic conditions of its native range, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Absinthium arborescens was mainly introduced to North America as an ornamental plant due to its attractive foliage and unique appearance. It has since spread beyond cultivated areas, becoming naturalized in various habitats across the continent. The plant is often found in moist, disturbed soils near streams, wetlands, and along roadsides. Its rapid growth and ability to thrive in diverse conditions have led to its classification as an invasive species in some regions. Conservation efforts are ongoing to manage its spread and protect native plant communities."
}
