{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium campestre",
    "plant_slug": "absinthium-campestre",
    "plant_name_scientific": "absinthium campestre",
    "intro": "Absinthium campestre, commonly known as field wormwood, is a flowering plant native to Europe and parts of Asia. It belongs to the family Asteraceae and is characterized by its slender stems and small, yellowish-green flowers. The plant typically grows in meadows and along roadsides, preferring well-drained soils. Its leaves are finely divided and have a strong, bitter aroma due to the presence of sesquiterpene lactones. Absinthium campestre is often used in traditional herbal medicine for its purported digestive and antiseptic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium campestre is primarily native to southern and eastern Europe, including parts of the Mediterranean region. It is commonly found in grasslands, meadows, and disturbed soils across these areas. The plant thrives in temperate climates and is often associated with open, sunny habitats. It is also present in some regions of western Asia. Its distribution spans several countries, including France, Italy, Spain, and Turkey.",
    "distribution_introduced_art_desc": "Absinthium campestre was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and along riverbanks. It thrives in sunny environments with well-drained soil, making it common in agricultural landscapes. This plant is often found in regions with temperate climates, particularly in Europe and parts of North America. Its introduction has been largely unintentional, often through human activity or seed dispersal. Due to its adaptability, it has become a common weed in many regions where it has been introduced."
}
