{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium chinense",
    "plant_slug": "absinthium-chinense",
    "plant_name_scientific": "absinthium chinense",
    "intro": "Absinthium chinense, commonly known as Chinese wormwood, is a perennial herb native to East Asia. It belongs to the Asteraceae family and is characterized by its finely divided, feathery leaves and small, yellowish flowers. The plant is known for its aromatic properties and has been used in traditional medicine for its purported health benefits. It thrives in moist, well-drained soils and prefers partial to full sunlight. Its historical use in herbal remedies and its ecological role in supporting pollinators make it an important plant in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium chinense is primarily native to eastern Asia, including China, Korea, and Japan. It is commonly found in mountainous regions and forested areas with moist, temperate climates. This plant thrives in well-drained soils and is often associated with shaded or semi-shaded environments. It is an important species in traditional herbal medicine in these regions. Its native range reflects its adaptation to the diverse ecosystems of eastern Asia.",
    "distribution_introduced_art_desc": "Absinthium chinense was mainly introduced to regions with temperate climates where it can thrive in well-drained soils. It is commonly found in areas with mild winters and warm summers, making it suitable for cultivation in parts of Asia, Europe, and North America. This plant is often used in traditional medicine for its purported health benefits. Its introduction has been primarily driven by its medicinal properties and ornamental value. However, it requires careful management to prevent it from becoming invasive in new environments."
}
