{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium alpinum",
    "plant_slug": "absinthium-alpinum",
    "plant_name_scientific": "absinthium alpinum",
    "intro": "Absinthium alpinum, commonly known as alpine wormwood, is a flowering plant native to the mountainous regions of Europe and Asia. It is characterized by its tall, slender stems and narrow, gray-green leaves. The plant produces small, yellowish-green flowers that bloom in late summer. It thrives in well-drained soils and full sunlight, often growing at high altitudes. Absinthium alpinum is valued for its aromatic properties and has been used in traditional herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium alpinum is primarily native to the mountainous regions of Europe, particularly the Alps. It thrives in rocky and alpine environments, often found at elevations between 1,500 and 3,000 meters. This plant is also present in parts of Asia, including the Carpathian Mountains and the Caucasus. It prefers well-drained soils and full sun exposure. Its distribution is closely linked to high-altitude ecosystems where it plays a role in local biodiversity.",
    "distribution_introduced_art_desc": "Absinthium alpinum was mainly introduced to North America through the horticultural trade in the 19th century. It was initially cultivated for its ornamental value due to its striking silver-gray foliage and delicate blue flowers. The plant has since naturalized in several regions, particularly in the Pacific Northwest and along the eastern seaboard. Its introduction has raised concerns due to its potential invasiveness in certain ecosystems. Despite its beauty, it is now monitored to prevent its spread into native habitats."
}
