{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium corymbosum",
    "plant_slug": "absinthium-corymbosum",
    "plant_name_scientific": "absinthium corymbosum",
    "intro": "Absinthium corymbosum, commonly known as common wormseed, is a flowering plant native to Europe and parts of Asia. It belongs to the Apiaceae family, which includes carrots and parsley, and is characterized by its finely divided leaves and small, yellowish flowers. The plant produces small, dry fruits called schizocarps, which are dispersed by wind. It thrives in disturbed soils and is often found in fields and along roadsides. Due to its historical use in herbal medicine, it has been studied for its potential pharmacological properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium corymbosum is primarily native to eastern North America, including the United States and Canada. It is commonly found in moist, open habitats such as meadows, woodlands, and along stream banks. This plant thrives in regions with temperate climates and well-drained soils. It is particularly prevalent in the eastern and central parts of the United States. Its native range extends from New England down to the southeastern states and westward into the Great Lakes region.",
    "distribution_introduced_art_desc": "Absinthium corymbosum was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It is commonly found in disturbed sites such as roadsides, fields, and along stream banks. This plant has become naturalized in several regions outside its native range. Its rapid growth and ability to thrive in various conditions contribute to its spread. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
