{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium mutellina",
    "plant_slug": "absinthium-mutellina",
    "plant_name_scientific": "absinthium mutellina",
    "intro": "Absinthium mutellina, commonly known as the slender wormwood, is a flowering plant native to southern Europe and western Asia. It belongs to the Asteraceae family, which includes daisies and ragworts, and is characterized by its composite flower heads. The plant typically grows in dry, rocky soils and thrives in temperate climates. Its leaves are narrow and aromatic, often used in traditional herbal medicine. The flowers, which bloom in late summer, are yellow and attract various pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium mutellina is primarily native to southern Europe, particularly the Mediterranean region. It is found in countries such as Spain, Italy, France, and Greece. This plant thrives in rocky and coastal areas, often growing in dry, sunny environments. It is commonly associated with limestone soils and is a characteristic species of Mediterranean maquis vegetation. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Absinthium mutellina was mainly introduced to new habitats through human activities such as gardening and landscaping. It has established itself in various regions with suitable climates and soil conditions. The plant is commonly found in disturbed areas, including roadsides and abandoned fields. Its introduction has led to concerns about its potential invasiveness in certain ecosystems. However, further research is needed to fully understand its ecological impact."
}
