{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium bipedale",
    "plant_slug": "absinthium-bipedale",
    "plant_name_scientific": "absinthium bipedale",
    "intro": "Absinthium bipedale, commonly known as the two-footed wormwood, is a perennial herb native to the mountainous regions of Central Asia. It features tall, slender stems that can reach up to two meters in height, covered in fine, silver-white hairs. The plant produces small, greenish-yellow flowers arranged in complex panicles, which bloom in the summer months. Its leaves are lance-shaped, aromatic, and covered in a dense layer of fine, glandular hairs. Absinthium bipedale is often cultivated for its ornamental value and has historical uses in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium bipedale is primarily native to the mountainous regions of southern Europe, particularly the Pyrenees and the Alps. It thrives in rocky and well-drained soils at elevations ranging from 1,000 to 2,500 meters. This plant is commonly found in open habitats such as meadows, grasslands, and forest edges. It is also occasionally reported in parts of northern Africa and the Middle East. Its distribution is closely linked to temperate climates with cool, moist summers and cold winters.",
    "distribution_introduced_art_desc": "Absinthium bipedale was mainly introduced to North America as an ornamental plant due to its striking silver foliage and unique flowering structure. It was first documented in the United States during the early 20th century, likely through horticultural trade. The plant has since spread along roadsides and in disturbed soils, becoming naturalized in several states. Its rapid growth and ability to thrive in poor soil conditions have contributed to its establishment in new habitats. However, it is considered a potential invasive species in some regions due to its competitive nature."
}
