{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium sieversianum",
    "plant_slug": "absinthium-sieversianum",
    "plant_name_scientific": "absinthium sieversianum",
    "intro": "Absinthium sieversianum, commonly known as Sievers' wormwood, is a flowering plant native to Central Asia. It belongs to the Asteraceae family and is characterized by its slender, branched stems and small, yellowish flowers. The plant typically grows in rocky or arid environments, showcasing its adaptability to harsh conditions. Its leaves are aromatic and contain compounds that have historically been used in herbal medicine. Absinthium sieversianum is also valued for its ecological role in supporting pollinators and stabilizing soil in its native habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium sieversianum is primarily native to the Caucasus region, including parts of Russia, Georgia, and Azerbaijan. It is commonly found in mountainous areas with well-drained soils. This plant thrives in temperate climates and is often associated with rocky or alpine habitats. It is also present in some regions of Turkey and northern Iran. Due to its specific habitat requirements, it is not widely distributed beyond these areas.",
    "distribution_introduced_art_desc": "Absinthium sieversianum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, fields, and waste grounds. It thrives in temperate climates and is commonly found in regions with moderate rainfall. The plant is known for its rapid growth and ability to colonize new areas quickly. Its introduction has led to concerns about its potential invasiveness in certain ecosystems. It is often spread through seeds carried by wind, water, or human activity."
}
