{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium sieversianum var. acutangulum",
    "plant_slug": "absinthium-sieversianum-var-acutangulum",
    "plant_name_scientific": "absinthium sieversianum var. acutangulum",
    "intro": "Absinthium sieversianum var. acutangulum, commonly known as the acute-leaved wormwood, is a perennial herb native to Central Asia. It belongs to the Asteraceae family and is characterized by its slender, branched stems and finely divided, feather-like leaves. The plant produces small, yellowish-green flowers arranged in composite heads, typical of the daisy family. It thrives in arid and semi-arid environments, often found in rocky or sandy soils. Due to its medicinal properties, it has been used in traditional herbal remedies for its antiseptic and digestive benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium sieversianum var. acutangulum is primarily native to the mountainous regions of Central Asia, including countries such as Kazakhstan, Uzbekistan, and Tajikistan. It thrives in alpine and subalpine habitats, often found in rocky soils at elevations ranging from 1,500 to 3,500 meters. This variant is adapted to the cold and harsh climate of these high-altitude environments. It is commonly found in meadows, slopes, and along the edges of glaciers. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Absinthium sieversianum var. acutangulum was mainly introduced to areas with moist, well-drained soils and partial to full sunlight, typically in temperate regions. It is often found in disturbed habitats such as roadsides, fields, and along streambanks. This plant is known for its aromatic leaves and is sometimes cultivated for ornamental purposes. Its distribution has expanded due to human activity and climate change. It is considered an invasive species in some regions where it outcompetes native vegetation."
}
