{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium frigidum var. gmelinianum",
    "plant_slug": "absinthium-frigidum-var-gmelinianum",
    "plant_name_scientific": "absinthium frigidum var. gmelinianum",
    "intro": "Absinthium frigidum var. gmelinianum, commonly known as the Arctic wormwood, is a perennial herb native to the Arctic and subarctic regions. It is characterized by its finely divided, silver-gray leaves and small, yellowish flowers that bloom in late summer. The plant thrives in nutrient-poor, well-drained soils and is adapted to cold climates. It is often found growing in tundra and alpine environments. Due to its hardy nature, it plays a role in stabilizing soil in harsh, polar ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium frigidum var. gmelinianum is primarily native to the Arctic and subarctic regions of Europe and Asia. It is found in countries such as Norway, Sweden, Finland, Russia, and parts of northern Siberia. This plant thrives in cold, moist environments, often growing in tundra or along the edges of lakes and rivers. It is commonly associated with rocky or gravelly soils in these high-latitude areas. Its distribution is limited to the northernmost parts of the Northern Hemisphere where the climate remains cool and frost persists for much of the year.",
    "distribution_introduced_art_desc": "Absinthium frigidum var. gmelinianum was mainly introduced to areas with cold, alpine or subalpine climates where it can thrive in well-drained soils. It is commonly found in regions such as the European Alps, the Carpathians, and parts of Siberia. This plant is often associated with rocky or gravelly habitats and is adapted to withstand harsh environmental conditions. Its introduction to these regions is largely due to its natural range and historical distribution. It is considered a valuable species for ecological studies due to its resilience and specific habitat requirements."
}
