{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium boreale",
    "plant_slug": "absinthium-boreale",
    "plant_name_scientific": "absinthium boreale",
    "intro": "Absinthium boreale, commonly known as northern wormwood, is a herbaceous plant native to the Arctic and alpine regions of the Northern Hemisphere. It is characterized by its slender, upright stems and small, narrow leaves that are covered in fine white hairs. The plant produces tiny, yellowish-green flowers that bloom in late summer, attracting pollinators such as bees and flies. Absinthium boreale is adapted to cold climates and is often found growing in rocky or sandy soils. Its chemical composition includes various volatile oils and flavonoids, which contribute to its medicinal and ecological significance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium boreale is primarily native to northern Europe and western Siberia. It thrives in cold, temperate climates and is commonly found in alpine and subalpine regions. This plant is adapted to rocky and well-drained soils, often growing in mountainous areas. Its distribution includes countries such as Norway, Sweden, Finland, and parts of Russia. It is also found in some regions of northern Germany and Denmark.",
    "distribution_introduced_art_desc": "Absinthium boreale was mainly introduced to North America through human activity, particularly during the 19th and early 20th centuries. It was brought as an ornamental plant due to its attractive silver foliage and unique appearance. Despite its initial popularity, it has since become invasive in some regions, outcompeting native vegetation. The plant thrives in disturbed soils and can spread rapidly in open areas. Its introduction has raised concerns among ecologists due to its potential to alter local ecosystems."
}
