{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absinthium frigidum var. fischerianum",
    "plant_slug": "absinthium-frigidum-var-fischerianum",
    "plant_name_scientific": "absinthium frigidum var. fischerianum",
    "intro": "Absinthium frigidum var. fischerianum, commonly known as the Siberian wormwood, is a perennial herb native to the cold regions of Siberia and northern Russia. It belongs to the Asteraceae family and is characterized by its tall, slender stems and small, greenish-yellow flowers. The plant thrives in well-drained, sandy soils and is adapted to harsh, alpine environments. It is often found growing in open tundra and rocky areas, where it withstands low temperatures and strong winds. Due to its medicinal properties, it has been historically used in traditional medicine for its antiseptic and tonic effects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absinthium frigidum var. fischerianum is primarily native to the mountainous regions of Central Asia, including parts of Kazakhstan, Kyrgyzstan, and Tajikistan. This variant thrives in high-altitude environments with cold climates and well-drained soils. It is commonly found in alpine meadows and rocky slopes at elevations ranging from 2,000 to 4,500 meters. The plant is adapted to harsh conditions and is often part of the local flora in these regions. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Absinthium frigidum var. fischerianum was mainly introduced to areas with cold, moist climates, typically found in alpine or subalpine regions. It thrives in well-drained soils and is often found in mountainous areas across Europe and parts of Asia. This plant is commonly associated with rocky or grassy slopes where it can receive ample sunlight. Its introduction has been documented in several regions where similar ecological conditions exist. However, it is considered a rare and localized species, often requiring specific environmental conditions to flourish."
}
