{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absolmsia spartioides",
    "plant_slug": "absolmsia-spartioides",
    "plant_name_scientific": "absolmsia spartioides",
    "intro": "Absolmsia spartioides, commonly known as the silver leaf tree, is a member of the Euphorbiaceae family. It is native to the arid regions of southern Africa, particularly South Africa. The plant is characterized by its silvery-white, velvety leaves that help reduce water loss in hot, dry climates. It produces small, inconspicuous greenish-yellow flowers arranged in clusters. The tree is often used in xeriscaping due to its drought tolerance and ornamental foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absolmsia spartioides is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in rocky outcrops, sandy soils, and along riverbanks in these areas. This species thrives in environments with low rainfall and high sunlight exposure. It is well adapted to survive in harsh, dry conditions. Its distribution is largely restricted to specific ecological niches within the Kalahari and surrounding desert regions.",
    "distribution_introduced_art_desc": "Absolmsia spartioides was mainly introduced to control soil erosion and as an ornamental plant in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its adaptability to harsh environments. The plant has a deep root system that helps stabilize the soil, making it useful in land rehabilitation projects. However, its rapid growth and ability to spread through seeds can lead to invasive behavior in certain areas. Despite its benefits, it is important to monitor its distribution to prevent ecological imbalances."
}
