{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Absolmsia oligophylla",
    "plant_slug": "absolmsia-oligophylla",
    "plant_name_scientific": "absolmsia oligophylla",
    "intro": "Absolmsia oligophylla, commonly known as the narrow-leafed absolmsia, is a species of flowering plant native to South Africa. It belongs to the family Asteraceae, which includes daisies and sunflowers, and is characterized by its composite flower heads. The plant typically grows in rocky, well-drained soils and thrives in full sun, making it well adapted to arid environments. Its narrow leaves and small yellow flowers are distinctive features, and it is often found in coastal and mountainous regions. Due to its unique morphology and limited distribution, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Absolmsia oligophylla is primarily native to the south-western region of Western Australia. It is found in the area known as the Geraldton - Wongan Hills region. This plant typically grows in sandy soils and is adapted to the arid and semi-arid climates of its native habitat. It is commonly found in open woodlands and shrublands. Absolmsia oligophylla is a rare and endangered species, with a limited distribution range.",
    "distribution_introduced_art_desc": "Absolmsia oligophylla was mainly introduced to New Zealand. It is believed to have been brought there accidentally through human activities, such as the transport of contaminated soil or plant material. This plant is now considered an invasive species in certain regions of New Zealand. It has spread in areas with suitable climate and soil conditions, often outcompeting native vegetation. Efforts are being made to control its spread to protect local ecosystems."
}
