{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abumon africanum",
    "plant_slug": "abumon-africanum",
    "plant_name_scientific": "abumon africanum",
    "intro": "Abumon africanum, commonly known as the African velvetleaf, is a tropical plant native to sub-Saharan Africa. It is characterized by its broad, heart-shaped leaves that are covered in fine, velvety hairs. The plant produces small, pale yellow flowers that are clustered in spikes, followed by capsule fruits containing numerous tiny seeds. It thrives in moist, fertile soils and is often found in disturbed areas such as agricultural fields and along riverbanks. Due to its rapid growth and ability to spread through seeds, it is considered a potential weed in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abumon africanum is primarily native to the tropical and subtropical regions of Africa. It is commonly found in countries such as Kenya, Tanzania, and Uganda. This plant thrives in areas with high humidity and well-drained soils. It is often associated with forested or semi-deciduous woodland habitats. Its distribution is closely linked to the availability of water and suitable microclimates.",
    "distribution_introduced_art_desc": "Abumon africanum was mainly introduced to new habitats in southern Africa to support traditional medicine practices. It is commonly found in regions with moderate climates and well-drained soils. The plant has been cultivated in gardens and along roadsides due to its ornamental value. Its introduction has also contributed to local biodiversity in some areas. However, it is not considered invasive and maintains a stable presence in its introduced range."
}
