{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon malacum",
    "plant_slug": "abutilon-malacum",
    "plant_name_scientific": "abutilon malacum",
    "intro": "Abutilon malacum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its broad, heart-shaped leaves and showy, lantern-shaped flowers. The plant produces clusters of small, yellowish-green flowers that bloom in the summer months. Its leaves are covered in fine, soft hairs, giving the plant a velvety texture. Abutilon malacum is often cultivated for its ornamental value and is also used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon malacum"
    },
    "taxonomy_art_desc": "Abutilon malacum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and some with specialized structures like hairs or glands. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their ornamental and sometimes medicinal uses. Its species is Abutilon malacum, a specific type of plant within the genus Abutilon, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Mexico Northeast",
        "Mexico Northwest",
        "New Mexico",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon malacum is primarily native to Arizona, Mexico Northeast, Mexico Northwest, New Mexico, and Texas. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in environments with well-drained soils and full sun exposure. Abutilon malacum is often seen in desert scrub and grassland habitats. Its native distribution reflects its adaptation to the unique ecological conditions of the southwestern United States and northern Mexico.",
    "distribution_introduced_art_desc": "Abutilon malacum was mainly introduced to areas where it can thrive in warm, humid climates with well-drained soil. It is commonly found in tropical and subtropical regions, particularly in parts of Southeast Asia, the Pacific Islands, and northern Australia. The plant is often cultivated for its ornamental value due to its showy, lantern-shaped flowers. It has been introduced to various regions as an ornamental plant, sometimes escaping cultivation and becoming naturalized. However, its distribution is primarily limited to regions with suitable environmental conditions."
}
