{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon avicennae f. tiliifolium",
    "plant_slug": "abutilon-avicennae-f-tiliifolium",
    "plant_name_scientific": "abutilon avicennae f. tiliifolium",
    "intro": "Abutilon avicennae f. tiliifolium, commonly known as the broadleaf abutilon, is a variant of the abutilon species native to tropical regions. It is a shrub or small tree characterized by its broad, heart-shaped leaves that are often hairy on the underside. The plant produces small, pale yellow flowers that are clustered in racemes, and it is known for its ornamental value due to its attractive foliage. It thrives in well-drained soil and requires full sun to partial shade for optimal growth. The species is also valued for its ability to withstand coastal conditions and is sometimes used in horticultural landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon avicennae f. tiliifolium is primarily native to the coastal regions of southern California and northern Baja California, Mexico. This plant thrives in sandy or gravelly soils along the shoreline, often found in dunes or scrub habitats. It is commonly associated with maritime climates characterized by mild, wet winters and warm, dry summers. The species is well adapted to salt spray and wind exposure typical of coastal environments. Its native range is limited to these specific regions, making it a rare and localized plant.",
    "distribution_introduced_art_desc": "Abutilon avicennae f. tiliifolium was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this plant has been primarily confined to cultivation in gardens and urban areas. Despite its introduction, it has not become naturalized in the wild in New Zealand. This plant is considered non-invasive and poses no significant threat to native ecosystems."
}
