{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon auritum",
    "plant_slug": "abutilon-auritum",
    "plant_name_scientific": "abutilon auritum",
    "intro": "Abutilon auritum, commonly known as the velvetleaf abutilon, is a tropical shrub native to Central and South America. It is characterized by its soft, hairy foliage and showy, lantern-shaped flowers that range in color from yellow to orange. The plant thrives in warm, humid climates and is often found in disturbed soils or along riverbanks. Its leaves are typically heart-shaped and have a velvety texture, while its capsules produce numerous small, wind-dispersed seeds. Abutilon auritum is sometimes cultivated as an ornamental plant due to its unique appearance and adaptability.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon auritum"
    },
    "taxonomy_art_desc": "Abutilon auritum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and diverse ecological roles. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as velvetleaf, which includes species with heart-shaped leaves and showy flowers. Its species is Abutilon auritum, a specific plant within the genus Abutilon, characterized by its ear-shaped leaves and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Christmas I.",
        "Jawa",
        "Lesser Sunda Is.",
        "New Caledonia",
        "New Guinea",
        "Peru",
        "Philippines",
        "Queensland",
        "Sulawesi",
        "Vanuatu"
    ],
    "distribution_introduced": [
        "Hawaii",
        "India",
        "Jamaica",
        "Laos",
        "Leeward Is.",
        "Réunion",
        "Sierra Leone",
        "Society Is.",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abutilon auritum is primarily native to Christmas Island, Java, Lesser Sunda Islands, New Caledonia, New Guinea, Peru, the Philippines, Queensland, Sulawesi, and Vanuatu. This species is found across a wide range of tropical and subtropical regions, spanning multiple continents. It thrives in diverse habitats, including coastal areas, forests, and disturbed sites. The plant is known for its distinctive ear-shaped leaves and is often used in traditional medicine. Its native distribution highlights its adaptability to various environmental conditions.",
    "distribution_introduced_art_desc": "Abutilon auritum was mainly introduced to Hawaii, India, Jamaica, Laos, Leeward Is., Réunion, Sierra Leone, Society Is., and Windward Is. It is commonly found in tropical and subtropical regions, often as an ornamental or invasive species. The plant thrives in warm climates with well-drained soil and full sunlight. Its introduction to these areas is largely due to human activity, including horticultural trade and accidental spread. It has become naturalized in many of these locations, sometimes posing ecological challenges."
}
