{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon otocarpum",
    "plant_slug": "abutilon-otocarpum",
    "plant_name_scientific": "abutilon otocarpum",
    "intro": "Abutilon otocarpum, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to tropical regions of the Americas. It is characterized by its soft, hairy foliage and showy, lantern-shaped yellow flowers that bloom in clusters. The plant produces small, spiny capsules that contain numerous seeds, aiding in its dispersal. It thrives in moist, shady environments and is often found in disturbed habitats. Its botanical features make it an important species in ecological studies and traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon otocarpum"
    },
    "taxonomy_art_desc": "Abutilon otocarpum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse flower structures. Its order is Malvales, which comprises flowering plants with showy flowers, often with five petals, and includes families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with cotton-like seeds and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and lantern-shaped fruits. Its species is Abutilon otocarpum, a specific type within the genus Abutilon, known for its distinctive fruiting structures and used in traditional medicine.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon otocarpum is primarily native to New South Wales, Northern Territory, Queensland, South Australia, Victoria, and Western Australia. This species is commonly found in arid and semi-arid regions across these Australian states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Abutilon otocarpum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was brought there during the 19th century by horticulturists and plant collectors who sought to introduce exotic species for landscaping purposes. Despite its aesthetic value, it has since become an invasive species in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through seeds and vegetative propagation have made it a challenge for land managers. Efforts are ongoing to control its spread while balancing ecological and aesthetic concerns."
}
