{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon speciosum",
    "plant_slug": "abutilon-speciosum",
    "plant_name_scientific": "abutilon speciosum",
    "intro": "Abutilon speciosum, commonly known as the Chinese lantern plant, is a flowering shrub native to Southeast Asia. It is characterized by its velvety, hairy stems and heart-shaped leaves that are often reddish or purple in color. The plant produces showy, lantern-shaped bracts that enclose small yellow flowers, which bloom in late spring to early summer. It thrives in full sun to partial shade and requires well-drained soil, making it a popular choice for ornamental gardens. Abutilon speciosum is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon speciosum is primarily native to Central America, including countries such as Mexico, Guatemala, and Belize. It is also found in parts of South America, particularly in regions of Colombia and Ecuador. This plant thrives in tropical and subtropical climates, often growing in moist, well-drained soils. It is commonly found in lowland areas, near rivers and in humid forests. Its natural range extends into the Caribbean, where it is sometimes cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Abutilon speciosum was mainly introduced to coastal and disturbed areas in southern California, particularly in regions with sandy or gravelly soils. It is commonly found along roadsides, dunes, and other open, sunny habitats. This plant is considered an invasive species in some areas due to its rapid growth and ability to spread through seeds. It has been reported in several counties along the Pacific coast, including San Diego and Orange. Its introduction is often associated with human activities such as landscaping and construction."
}
