{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon appendiculatum",
    "plant_slug": "abutilon-appendiculatum",
    "plant_name_scientific": "abutilon appendiculatum",
    "intro": "Abutilon appendiculatum, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its soft, hairy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an annual or perennial herb, often reaching heights of up to 2 meters. Its hairy foliage and distinctive blooms make it a notable species in the Malvaceae family. It is often found in disturbed soils and can be invasive in certain regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon appendiculatum"
    },
    "taxonomy_art_desc": "Abutilon appendiculatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malvales, which consists of flowering plants with showy flowers and includes families such as Malvaceae, Theaceae, and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and showy flowers, such as cotton and hibiscus. Its genus is Abutilon, a group of flowering plants commonly known as the velvetleaf or Chinese lantern, characterized by their woolly leaves and showy flowers. Its species is Abutilon appendiculatum, a specific type of plant within the genus Abutilon, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil South",
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon appendiculatum is primarily native to Brazil South and Brazil Southeast. This plant is commonly found in the coastal regions and lowland areas of these regions. It thrives in tropical and subtropical climates with high humidity. The species is often associated with sandy soils and open habitats. Its native range includes parts of the Atlantic Forest biome.",
    "distribution_introduced_art_desc": "Abutilon appendiculatum was mainly introduced to the United States as an ornamental plant due to its attractive, lantern-shaped flowers and its ability to thrive in various climates. It has been widely cultivated in gardens and landscapes, particularly in the southern and western regions where it adapts well to warm, sunny conditions. Despite its ornamental value, it has also become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant's rapid growth and prolific seed production contribute to its spread beyond cultivated areas. As a result, it is now considered a potential weed in certain parts of the country, requiring careful management to prevent ecological disruption."
}
