{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon foetidum",
    "plant_slug": "abutilon-foetidum",
    "plant_name_scientific": "abutilon foetidum",
    "intro": "Abutilon foetidum, commonly known as the stinkweed or stinkbush, is a flowering plant native to tropical and subtropical regions of the Americas. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its rough, hairy stems and heart-shaped leaves. The plant produces clusters of small, yellowish-green flowers that bloom in the spring and summer. It is known for its strong, unpleasant odor, which is more noticeable when the flowers are in full bloom. Abutilon foetidum is often found in disturbed soils and is sometimes considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon foetidum is primarily native to tropical and subtropical regions of the Americas. It is found in countries such as Mexico, Central America, and parts of South America. This plant typically grows in moist, shaded areas near rivers, streams, and in forest understories. It is commonly found in regions with high humidity and warm climates. Its natural range extends from southern Mexico down to northern Argentina.",
    "distribution_introduced_art_desc": "Abutilon foetidum was mainly introduced to areas with disturbed soils and wet environments, often as an ornamental or weed. It is commonly found in wetlands, riverbanks, and other moist habitats where it can thrive. The plant spreads rapidly through its extensive root system and seed dispersal. It is considered an invasive species in many regions due to its ability to outcompete native vegetation. Its presence can alter local ecosystems by changing soil composition and reducing biodiversity."
}
