{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon tiubae var. parviflorum",
    "plant_slug": "abutilon-tiubae-var-parviflorum",
    "plant_name_scientific": "abutilon tiubae var. parviflorum",
    "intro": "Abutilon tiubae var. parviflorum, commonly known as the small-flowered velvetleaf, is a variant of the Abutilon genus native to tropical regions. It is characterized by its fuzzy, velvety leaves that give it a distinctive texture. The plant produces small, pale yellow flowers that bloom in clusters, often during the warmer months. It thrives in well-drained soil and requires full sun to partial shade for optimal growth. This variant is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon tiubae var. parviflorum is primarily native to the Andean region of South America, specifically in parts of Peru and Bolivia. This plant is commonly found in dry to semi-arid environments, often growing in rocky or disturbed soils. It is adapted to the high-altitude conditions of the Andes, where it thrives in full sun exposure. The species is known for its distinctive, fuzzy leaves and showy yellow flowers. Due to its limited geographic range, it is considered a rare and endemic plant within its native habitat.",
    "distribution_introduced_art_desc": "Abutilon tiubae var. parviflorum was mainly introduced to the Hawaiian Islands. It is commonly found in coastal areas and disturbed sites throughout the region. This plant is often cultivated as an ornamental due to its attractive foliage and flowers. However, it has been identified as a potential invasive species in some areas. Its distribution is primarily limited to the Pacific Islands where it has been intentionally planted."
}
