{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta toxifera",
    "plant_slug": "abuta-toxifera",
    "plant_name_scientific": "abuta toxifera",
    "intro": "Abuta toxifera, commonly known as the African butterbean, is a flowering plant native to tropical Africa. It belongs to the family Euphorbiaceae and is characterized by its striking yellow-orange flowers that bloom in clusters. The plant produces capsule fruits containing several seeds, which are often used in traditional medicine. Its leaves are palmately lobed and can be used as a vegetable in some regions. The plant is also valued for its ornamental appeal and has been studied for its potential medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta toxifera is primarily native to the tropical regions of South America, specifically the Amazon Basin and surrounding areas. It is found in countries such as Brazil, Colombia, Ecuador, Peru, and Venezuela. This plant thrives in humid, lowland forests with rich soil and high rainfall. It is commonly found in the understory of tropical rainforests, where it forms part of the complex ecosystem. Due to its restricted habitat, it is considered a rare and endangered species in many parts of its range.",
    "distribution_introduced_art_desc": "Abuta toxifera was mainly introduced to regions with tropical and subtropical climates due to its preference for warm, humid environments. It thrives in areas with well-drained soil and partial to full sunlight, making it suitable for cultivation in parts of Southeast Asia, Africa, and the Caribbean. The plant is often grown for its ornamental value and medicinal properties, which have been traditionally used in local remedies. Its introduction has also been driven by horticultural interest and the demand for unique plant species in botanical gardens. However, its spread in non-native areas requires careful management to prevent ecological disruption."
}
