{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon petiolare",
    "plant_slug": "abutilon-petiolare",
    "plant_name_scientific": "abutilon petiolare",
    "intro": "Abutilon petiolare, commonly known as the Chinese lantern plant, is a flowering shrub native to tropical and subtropical regions. It is characterized by its velvety, heart-shaped leaves and distinctive, inflated seed pods that resemble small lanterns. The plant produces clusters of yellow flowers that bloom in late spring to early summer. It thrives in well-drained soil and full sun to partial shade, making it a popular choice for ornamental gardening. Its unique appearance and relatively easy care requirements make it a favored plant in both indoor and outdoor settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon petiolare is primarily native to tropical and subtropical regions of the Americas, including parts of Central and South America. It is commonly found in countries such as Brazil, Colombia, and Peru. This plant thrives in warm, humid climates and is often associated with coastal and lowland areas. It is typically found in moist, well-drained soils along riverbanks and in open woodlands. Its native distribution includes regions with a rich biodiversity, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon petiolare was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-shaped flowers. It was likely brought there during the 19th or early 20th century by horticulturalists and gardeners seeking to cultivate exotic species. The plant has since become naturalized in some areas, thriving in coastal and disturbed habitats. Its introduction has raised concerns due to its potential to invade native ecosystems. Despite its beauty, it is considered a weed in certain regions of the Pacific."
}
