{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon anglosomaliae",
    "plant_slug": "abutilon-anglosomaliae",
    "plant_name_scientific": "abutilon anglosomaliae",
    "intro": "Abutilon anglosomaliae, commonly known as the African velvetleaf, is a shrub native to tropical Africa. It belongs to the Malvaceae family, which includes hibiscus and cotton plants. The plant is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in warm, humid climates and is often found in disturbed soils or along riverbanks. The plant is also valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon anglosomaliae"
    },
    "taxonomy_art_desc": "Abutilon anglosomaliae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex vascular system and the ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species with a wide range of morphological features. Its order is Malvales, which comprises flowering plants with showy flowers and often includes plants with specialized structures such as hirsute surfaces or mucilage. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy foliage and showy, lantern-shaped flowers. Its species is Abutilon anglosomaliae, a specific type within the genus Abutilon, distinguished by its unique morphological traits and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ethiopia",
        "Kenya",
        "Somalia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon anglosomaliae is primarily native to Ethiopia, Kenya, and Somalia. This species is found in the arid and semi-arid regions of these countries. It typically grows in rocky or sandy soils, often in coastal or mountainous areas. The plant is adapted to the dry climate and can thrive in regions with limited rainfall. It is an important part of the local flora and ecosystem in these areas.",
    "distribution_introduced_art_desc": "Abutilon anglosomaliae was mainly introduced to areas with warm, humid climates where it can thrive in well-drained soils. It is commonly found in regions of Southeast Asia, including parts of Indonesia and the Philippines. This plant is often cultivated for its ornamental value due to its attractive, velvety leaves and showy flowers. However, it has also been reported as an invasive species in some regions, outcompeting native vegetation. Its introduction has raised concerns about its ecological impact in non-native habitats."
}
