{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon tulla",
    "plant_slug": "abutilon-tulla",
    "plant_name_scientific": "abutilon tulla",
    "intro": "Abutilon tulla, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its velvety, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to red. The plant typically grows as an annual or perennial shrub, reaching heights of up to 2 meters. Its leaves are heart-shaped with a waxy texture, and it produces capsules that contain numerous seeds. Abutilon tulla is often found in disturbed soils and is sometimes considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon tulla is primarily native to the southeastern United States, including parts of Florida, Georgia, and South Carolina. It is commonly found in wetlands, swamps, and along the edges of streams and rivers. This species thrives in moist, sandy soils and is often associated with coastal areas. It is also found in some regions of the Caribbean, such as the Bahamas and Cuba. Abutilon tulla is an important plant in wetland ecosystems, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Abutilon tulla was mainly introduced to ornamental horticulture and landscaping due to its attractive, lantern-shaped flowers and ornamental foliage. It is commonly used in gardens and as a decorative plant in tropical and subtropical regions. The plant thrives in warm climates with well-drained soil and full sun exposure. It is often cultivated in USDA hardiness zones 9 through 11. However, it has also been reported as an invasive species in some areas where it can outcompete native vegetation."
}
