{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon ibarrense",
    "plant_slug": "abutilon-ibarrense",
    "plant_name_scientific": "abutilon ibarrense",
    "intro": "Abutilon ibarrense, commonly known as the Ibarren's Abutilon, is a flowering plant native to Mexico. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its broad, heart-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It typically grows in dry, rocky habitats and is often found in coastal areas. Abutilon ibarrense is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon ibarrense"
    },
    "taxonomy_art_desc": "Abutilon ibarrense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their relatives, known for their unique vascular systems and often spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malvales, a group of flowering plants that includes families such as Malvaceae, characterized by their showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants like cotton and okra, known for their distinctive flowers and capsule fruits. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy, lantern-shaped flowers. Its species is Abutilon ibarrense, a specific type of Abutilon native to certain regions of Mexico, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Ecuador"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon ibarrense is primarily native to Colombia and Ecuador. This species is found in the tropical and subtropical regions of these countries. It typically grows in humid, lowland areas with well-drained soils. The plant is commonly associated with secondary forests and disturbed habitats. Its native distribution is limited to these specific geographic regions in South America.",
    "distribution_introduced_art_desc": "Abutilon ibarrense was mainly introduced to areas with disturbed soils and human-altered landscapes. It thrives in environments with moderate to high light exposure and well-drained soils. This plant is often found in urban settings, along roadsides, and in abandoned fields. Its rapid growth and adaptability make it a common invasive species in many regions. It can outcompete native vegetation, leading to ecological imbalances in local ecosystems."
}
