{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon karachianum",
    "plant_slug": "abutilon-karachianum",
    "plant_name_scientific": "abutilon karachianum",
    "intro": "Abutilon karachianum, commonly known as the Karachianum velvetleaf, is a shrub native to southern Asia. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant is characterized by its fuzzy, ovate leaves and showy, yellow-centered flowers that bloom in clusters. It thrives in tropical and subtropical climates, often found in moist, well-drained soils. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon karachianum"
    },
    "taxonomy_art_desc": "Abutilon karachianum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinctive evolutionary history, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers with five petals. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon karachianum, a specific type of plant within the genus Abutilon, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon karachianum is primarily native to Pakistan. It is commonly found in the arid and semi-arid regions of the country. This plant thrives in dry, rocky, and sandy soils. It is often seen growing along riverbanks and in open woodlands. Its natural distribution is largely restricted to specific ecological zones within Pakistan.",
    "distribution_introduced_art_desc": "Abutilon karachianum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed soils along roadsides, streambanks, and forest edges. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states including Oregon, Washington, and California. Its spread is often facilitated by human activities and seed dispersal through wind and water."
}
