{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon crassifolium var. tomentosum",
    "plant_slug": "abutilon-crassifolium-var-tomentosum",
    "plant_name_scientific": "abutilon crassifolium var. tomentosum",
    "intro": "Abutilon crassifolium var. tomentosum, commonly known as the woolly abutilon, is a species native to Mexico. It is a shrub characterized by its broad, velvety leaves that are covered in fine, soft hairs. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often blooming in late spring to early summer. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Its unique appearance and relatively low maintenance make it a desirable addition to drought-tolerant landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon crassifolium var. tomentosum is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as California, Arizona, and parts of Sonora. This plant typically grows in arid and semi-arid environments, including rocky soils and dry slopes. It is commonly associated with desert scrub and chaparral habitats. Its distribution is limited to specific ecological zones where it can thrive in the available climate and soil conditions.",
    "distribution_introduced_art_desc": "Abutilon crassifolium var. tomentosum was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, fields, and along streambanks. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It thrives in a variety of soil types and can tolerate both full sun and partial shade. Its hairy leaves and showy flowers make it a distinctive, though often problematic, plant in local ecosystems."
}
