{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon polyandrum",
    "plant_slug": "abutilon-polyandrum",
    "plant_name_scientific": "abutilon polyandrum",
    "intro": "Abutilon polyandrum, commonly known as the velvetleaf abutilon, is a shrub native to tropical and subtropical regions. It is characterized by its hairy, heart-shaped leaves and clusters of yellow flowers that bloom in the spring. The plant is part of the Malvaceae family, which includes hibiscus and cotton. It thrives in well-drained soil and full sun, making it suitable for gardens in warm climates. Its ornamental value comes from its soft foliage and long-lasting blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon polyandrum is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with warm and humid climates. This plant thrives in forest understories and along riverbanks, where it receives partial to full sunlight. It is also occasionally found in the Indian subcontinent, particularly in parts of India and Sri Lanka. Due to its adaptability, it has been introduced to other tropical regions around the world.",
    "distribution_introduced_art_desc": "Abutilon polyandrum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become naturalized and is now considered a potential weed in certain areas. The plant's rapid growth and ability to spread through seeds have raised concerns about its impact on native ecosystems. Despite its ornamental value, its invasive potential has led to increased monitoring and management efforts."
}
