{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon parvifolium",
    "plant_slug": "abutilon-parvifolium",
    "plant_name_scientific": "abutilon parvifolium",
    "intro": "Abutilon parvifolium, commonly known as the woolly abutilon, is a herbaceous perennial shrub native to South America. It is characterized by its soft, fuzzy leaves that are typically heart-shaped and covered in fine hairs. The plant produces small, yellowish-green flowers that bloom in clusters, often in the summer months. Its growth habit is bushy, with multiple stems that can reach heights of up to 2 meters. Abutilon parvifolium is often cultivated for its ornamental value and is relatively easy to grow in well-drained soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon parvifolium is primarily native to eastern North America, specifically the southeastern United States. It is found in states such as Florida, Georgia, South Carolina, and parts of Alabama. This plant thrives in moist, wooded areas and along stream banks. It is commonly associated with wetlands and is often found in swampy or marshy habitats. Abutilon parvifolium is a flowering plant in the mallow family, known for its showy, lantern-shaped flowers.",
    "distribution_introduced_art_desc": "Abutilon parvifolium was mainly introduced to the Pacific Northwest of the United States. It was brought there as an ornamental plant due to its attractive, fuzzy leaves and showy flowers. The distribution of this species has expanded beyond its original range, often thriving in disturbed soils and along roadsides. It is now considered invasive in some areas, outcompeting native vegetation. Its rapid spread has raised concerns among land managers and conservationists."
}
