{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon schinzii",
    "plant_slug": "abutilon-schinzii",
    "plant_name_scientific": "abutilon schinzii",
    "intro": "Abutilon schinzii, commonly known as the silverleaf abutilon, is a flowering plant native to South America. It is a shrub that typically grows to a height of about 1 to 2 meters, featuring soft, silvery-gray foliage that gives it its common name. The plant produces showy, lantern-shaped flowers in shades of yellow, orange, or red, which bloom in the spring and summer. Its leaves are opposite, ovate, and covered in fine, soft hairs, contributing to its distinctive appearance. Abutilon schinzii is often cultivated as an ornamental plant for its attractive foliage and vibrant flowers.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon schinzii"
    },
    "taxonomy_art_desc": "Abutilon schinzii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some primitive seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological features. Its order is Malvales, a group of flowering plants that includes economically important families such as Malvaceae, Theaceae, and Tiliaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as Chinese lanterns or velvetleafs, characterized by their distinctive, lantern-like flowers. Its species is Abutilon schinzii, a specific type of Abutilon native to certain regions of South America, known for its unique floral structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Namibia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon schinzii is primarily native to Namibia. It is found in the arid and semi-arid regions of the country. This plant typically grows in rocky soils and is adapted to the harsh environmental conditions of the Namibian landscape. It is commonly seen in the northwestern and central parts of Namibia. Abutilon schinzii plays a role in the local ecosystem and is part of the natural flora of the region.",
    "distribution_introduced_art_desc": "Abutilon schinzii was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as forest floors and along stream banks. This plant has become established in riparian zones and is often seen in disturbed soils. Its presence has raised concerns due to its potential to outcompete native vegetation. It is considered an invasive species in several areas where it has spread beyond its original introduction."
}
