{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon goldmanii",
    "plant_slug": "abutilon-goldmanii",
    "plant_name_scientific": "abutilon goldmanii",
    "intro": "Abutilon goldmanii, commonly known as the velvetleaf abutilon, is a species of flowering plant in the mallow family. It is native to tropical regions of the Americas and is characterized by its soft, velvety leaves and showy, lantern-shaped flowers. The plant typically grows as an upright shrub or small tree, reaching heights of up to 6 feet. Its flowers, which range in color from yellow to orange, are borne on peduncles and bloom during the summer months. Abutilon goldmanii is often cultivated as an ornamental plant due to its attractive foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon goldmanii is primarily native to Central America, including countries such as Costa Rica, Nicaragua, and Panama. It is also found in parts of South America, particularly in northern regions of Colombia and Ecuador. This plant thrives in tropical and subtropical climates, often growing in humid lowland areas. It is commonly associated with rainforests and secondary growth habitats. Its native range extends into the Caribbean as well, where it is sometimes cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Abutilon goldmanii was mainly introduced to the United States, particularly in the southern regions, as an ornamental plant due to its attractive, lantern-shaped flowers. It has been cultivated in gardens and landscapes for its showy blooms and unique appearance. Despite its ornamental value, it has become invasive in some areas, outcompeting native vegetation. The plant thrives in warm, humid climates and is often found in disturbed soils. Its introduction has led to ecological concerns in certain regions where it spreads rapidly."
}
