{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sidoides",
    "plant_slug": "abutilon-sidoides",
    "plant_name_scientific": "abutilon sidoides",
    "intro": "Abutilon sidoides, commonly known as the desert hibiscus, is a flowering plant native to arid regions of the southwestern United States and northern Mexico. It is a shrub or small tree that typically grows to a height of 1 to 3 meters, characterized by its rough, hairy stems and broad, heart-shaped leaves. The plant produces showy, five-petaled flowers in shades of yellow, orange, and red, which bloom in late spring to early summer. Its fibrous bark and woody structure make it well adapted to harsh, dry environments. Abutilon sidoides is often used in xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sidoides is primarily native to South America, specifically ranging from northern Argentina to southern Brazil. It is commonly found in the subtropical and tropical regions of these countries. This plant thrives in areas with warm, humid climates and is often associated with disturbed soils and open habitats. It is also present in parts of Uruguay and Paraguay. Abutilon sidoides is typically found in lowland areas and is adapted to a variety of soil types.",
    "distribution_introduced_art_desc": "Abutilon sidoides was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant has been introduced to several countries in the Americas, including parts of Brazil, Argentina, and Mexico. Its rapid growth and ability to thrive in poor soil conditions have contributed to its spread in these regions. However, it is considered a potential invasive species in some areas due to its competitive nature."
}
