{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pulchrum",
    "plant_slug": "abutilon-pulchrum",
    "plant_name_scientific": "abutilon pulchrum",
    "intro": "Abutilon pulchrum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, hairy foliage and showy, lantern-shaped flowers that range in color from yellow to red. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Abutilon pulchrum thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pulchrum is primarily native to the eastern and southern regions of South America, including countries such as Brazil, Paraguay, and Argentina. It is commonly found in tropical and subtropical areas, particularly in regions with moist, well-drained soils. This plant thrives in open woodlands, savannas, and along riverbanks. It is often associated with disturbed habitats and can be found in both natural and cultivated environments. Its native range extends into parts of Central America as well.",
    "distribution_introduced_art_desc": "Abutilon pulchrum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowers. The plant has since become naturalized in certain regions, particularly in coastal areas. It is commonly found in gardens and along the edges of forests. However, it is considered a potential weed in some environments due to its rapid growth and ability to spread."
}
