{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon procerum",
    "plant_slug": "abutilon-procerum",
    "plant_name_scientific": "abutilon procerum",
    "intro": "Abutilon procerum, commonly known as the woolly abutilon, is a flowering plant native to South America. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that bloom in shades of yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. It thrives in warm, humid climates and is often cultivated for its ornamental value. Abutilon procerum is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon procerum"
    },
    "taxonomy_art_desc": "Abutilon procerum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and is part of the broader angiosperm group. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their diverse floral structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a variety of ecological roles. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their soft, fuzzy leaves and showy flowers. Its species is Abutilon procerum, a specific type within the genus Abutilon, distinguished by its unique morphological features and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon procerum is primarily native to Mexico Northeast. It is found in the northeastern regions of Mexico, specifically in the states of Tamaulipas, Nuevo León, and parts of Coahuila. This plant thrives in tropical and subtropical climates, often growing in disturbed soils and along riverbanks. It is commonly associated with humid environments and is often found in secondary forests and open areas. Its natural range is limited to this specific geographic region in Mexico.",
    "distribution_introduced_art_desc": "Abutilon procerum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, ditches, and along streambanks. This plant thrives in moist, well-drained soils and is often considered an invasive species in certain areas. Its rapid growth and ability to spread through seeds make it a challenge for native plant communities. It is also sometimes cultivated as an ornamental plant due to its attractive foliage and flowers."
}
