{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta antioquiana",
    "plant_slug": "abuta-antioquiana",
    "plant_name_scientific": "abuta antioquiana",
    "intro": "Abuta antioquiana, commonly known as the Antioquian abuta, is a flowering plant native to the Andean regions of Colombia. It belongs to the family Euphorbiaceae and is characterized by its striking, showy inflorescences. The plant typically grows in moist, shaded environments and has thick, fleshy leaves that help it retain water. Its flowers are usually yellow or orange, with a unique structure that attracts pollinators like bees and butterflies. Due to its ornamental value and potential medicinal properties, it is sometimes cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta antioquiana"
    },
    "taxonomy_art_desc": "Abuta antioquiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and often possessing jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Ranunculales, which comprises flowering plants with diverse forms, often including showy flowers and a wide range of habitats. Its family is Menispermaceae, a family of flowering plants commonly known as the pipevines, characterized by their climbing habit and often toxic compounds. Its genus is Abuta, a group of flowering plants native to tropical regions, known for their medicinal properties and distinctive fruit structures. Its species is Abuta antioquiana, a specific plant within the genus Abuta, found in the Antioquia region of Colombia, and recognized for its unique ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta antioquiana is primarily native to Bolivia and Colombia. It is found in the Andean regions of these countries, particularly in the foothills and lower mountain slopes. This plant thrives in tropical and subtropical climates with well-drained soils. It is commonly found in forested areas and along riverbanks. Its native distribution is limited to specific ecological zones within these South American nations.",
    "distribution_introduced_art_desc": "Abuta antioquiana was mainly introduced to regions with tropical and subtropical climates, particularly in South America. It thrives in areas with high humidity and well-drained soil. This plant is often cultivated for its ornamental value due to its attractive foliage and unique flowers. It is also valued for its potential medicinal properties. However, its introduction has raised concerns about its impact on local ecosystems."
}
