{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon amplexifolium",
    "plant_slug": "abutilon-amplexifolium",
    "plant_name_scientific": "abutilon amplexifolium",
    "intro": "Abutilon amplexifolium, commonly known as the woolly abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 6 feet. Its leaves are often heart-shaped and clasping, giving it a distinctive appearance. Abutilon amplexifolium thrives in well-drained soils and is often found in arid or semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon amplexifolium is primarily native to the southwestern United States and northwestern Mexico. It is found in areas such as Arizona, New Mexico, and parts of California. This plant typically grows in arid and semi-arid environments, including rocky slopes and dry plains. It thrives in regions with well-drained soils and full sun exposure. Its native range includes parts of the Sonoran and Chihuahuan Deserts.",
    "distribution_introduced_art_desc": "Abutilon amplexifolium was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant thrives in full sun to partial shade and prefers well-drained soils. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded beyond its native range, raising concerns about its ecological impact."
}
