{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon floribundum",
    "plant_slug": "abutilon-floribundum",
    "plant_name_scientific": "abutilon floribundum",
    "intro": "Abutilon floribundum, commonly known as the velvetleaf abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its soft, hairy leaves and showy, lantern-shaped flowers. The plant produces clusters of yellow or orange flowers that bloom in late spring to early summer. It thrives in warm, humid climates and is often found in tropical and subtropical regions. Its botanical features make it a popular choice for ornamental gardening due to its attractive foliage and vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon floribundum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in coastal areas and is commonly found in regions with a temperate climate. This plant is particularly associated with the Iberian Peninsula, where it grows in sandy or rocky soils. It is also present in parts of southern France and northern Italy. Due to its adaptability, it can sometimes be found in cultivated gardens outside its native range.",
    "distribution_introduced_art_desc": "Abutilon floribundum was mainly introduced to New Zealand as an ornamental plant due to its showy flowers and adaptability to various soil types. It has since spread into native forests and shrublands, often outcompeting indigenous species for resources. The plant's rapid growth and ability to form dense thickets make it a significant invasive species in certain regions. It thrives in disturbed areas and can colonize both coastal and inland habitats. Management efforts focus on controlling its spread through mechanical removal and herbicide application."
}
