{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon graveolens var. queenslandicum",
    "plant_slug": "abutilon-graveolens-var-queenslandicum",
    "plant_name_scientific": "abutilon graveolens var. queenslandicum",
    "intro": "Abutilon graveolens var. queenslandicum, commonly known as the Queensland velvetleaf, is a perennial shrub native to Australia. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces small, pale yellow flowers that bloom in clusters, often in late spring to early summer. It thrives in warm, humid climates and is often found in coastal areas and disturbed soils. The species is valued for its ornamental qualities and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon graveolens var. queenslandicum is primarily native to eastern Australia, specifically Queensland and New South Wales. It is commonly found in coastal and inland regions, including sandy soils and open woodlands. This plant thrives in a range of habitats, including heathlands and coastal dunes. It is often associated with the coastal areas of northern and eastern Australia. The species is well adapted to the temperate to subtropical climates of its native range.",
    "distribution_introduced_art_desc": "Abutilon graveolens var. queenslandicum was mainly introduced to Australia as an ornamental plant due to its attractive foliage and showy flowers. It has since become naturalized in certain regions, particularly in the eastern and northern parts of the country. The plant is commonly found in gardens and along roadsides, where it thrives in warm, sunny conditions. Its spread has raised concerns due to its potential to invade native habitats and compete with local flora. Despite its ornamental value, efforts are being made to monitor and manage its distribution to prevent ecological disruption."
}
