{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon affine",
    "plant_slug": "abutilon-affine",
    "plant_name_scientific": "abutilon affine",
    "intro": "Abutilon affine, commonly known as velvetleaf or Indian mallow, is a flowering plant native to the Americas. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its broad, heart-shaped leaves and showy, lantern-shaped flowers. The plant produces capsules that contain numerous small, flat seeds, which are dispersed by wind. Its hairy stems and leaves give it a distinctive, velvety appearance. Abutilon affine is often found in disturbed soils and is adapted to a variety of environmental conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon affine"
    },
    "taxonomy_art_desc": "Abutilon affine belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their spore-based reproduction and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and a wide range of ecological and economic importance. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon affine, a specific type within the genus Abutilon, distinguished by its morphological traits and genetic makeup.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Brazil South",
        "Paraguay",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon affine is primarily native to Argentina Northeast, Brazil South, Paraguay, and Uruguay. This plant is commonly found in regions with tropical and subtropical climates within these areas. It thrives in open habitats such as grasslands, savannas, and along riverbanks. The species is well adapted to the warm and humid conditions of its native range. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Abutilon affine was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, streambanks, and abandoned fields. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It thrives in moist, well-drained soils and can tolerate a variety of environmental conditions. Its presence has led to concerns among local conservationists due to its impact on native plant communities."
}
