{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon somalense",
    "plant_slug": "abutilon-somalense",
    "plant_name_scientific": "abutilon somalense",
    "intro": "Abutilon somalense, commonly known as the Somali velvetleaf, is a shrub native to the arid regions of Somalia. It belongs to the Malvaceae family, which includes hibiscus and cotton plants. The plant is characterized by its hairy, lobed leaves and showy, yellow-orange flowers that bloom in clusters. It thrives in hot, dry climates and is often found in rocky or sandy soils. Due to its adaptability, it is sometimes used in traditional medicine and as a source of fiber.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon somalense"
    },
    "taxonomy_art_desc": "Abutilon somalense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as the velvetleaf, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon somalense, a specific type of velvetleaf native to Somalia, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ethiopia",
        "Somalia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon somalense is primarily native to Ethiopia and Somalia. This plant is found in the arid and semi-arid regions of these countries. It thrives in dry, tropical climates with well-drained soils. Abutilon somalense is commonly found in savannas and along rocky outcrops. Its native distribution is limited to these specific geographic areas in East Africa.",
    "distribution_introduced_art_desc": "Abutilon somalense was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and adaptability to various climates. It has been reported in several provinces, including KwaZulu-Natal and the Western Cape, where it thrives in both urban and rural environments. The plant is often found growing along roadsides, in gardens, and in disturbed soils, which contributes to its spread. Its introduction has raised concerns about its potential invasiveness in local ecosystems. Despite its aesthetic appeal, further studies are needed to assess its ecological impact."
}
