{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pannosum var. scabrum",
    "plant_slug": "abutilon-pannosum-var-scabrum",
    "plant_name_scientific": "abutilon pannosum var. scabrum",
    "intro": "Abutilon pannosum var. scabrum, commonly known as the rough abutilon, is a flowering plant native to parts of South America. It is characterized by its hairy, glandular stems and leaves that are often rough to the touch. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It thrives in warm, humid climates and is often found in disturbed soils or along riverbanks. Its botanical features make it a distinctive and ornamental species within the Malvaceae family.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pannosum"
    },
    "taxonomy_art_desc": "Abutilon pannosum var. scabrum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and specialized reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a well-developed vascular system. Its order is Malvales, a group of flowering plants that includes economically important species such as cotton and hibiscus, characterized by their sympetalous flowers. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and a variety of ecological and economic significance. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon pannosum, a specific type within the genus Abutilon, known for its distinctive morphology and often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kenya",
        "Sudan-South Sudan",
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pannosum var. scabrum is primarily native to Kenya, Sudan-South Sudan, and Tanzania. This species is commonly found in dry and semi-arid regions within these countries. It thrives in open habitats such as grasslands and shrublands. The plant is well adapted to the local climate and soil conditions of its native range. It plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Abutilon pannosum var. scabrum was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage. It is commonly found in tropical and subtropical regions, including parts of Southeast Asia, the Pacific Islands, and northern Australia. The plant thrives in full sun to partial shade and is known for its rapid growth and ability to spread through both seeds and vegetative means. It has been reported as an invasive species in some regions where it outcompetes native vegetation. Due to its adaptability, it is sometimes cultivated in gardens but requires careful management to prevent ecological impact."
}
