{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon crispum",
    "plant_slug": "abutilon-crispum",
    "plant_name_scientific": "abutilon crispum",
    "intro": "Abutilon crispum, commonly known as velvetleaf or Indian mallow, is a flowering plant native to the Americas. It is characterized by its fuzzy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to red. The plant is often found in moist, disturbed soils and can thrive in a variety of climates. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. Abutilon crispum is sometimes cultivated as an ornamental plant due to its attractive foliage and flowers.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon crispum is primarily native to Central America, Mexico, and parts of the Caribbean. It is commonly found in tropical and subtropical regions, particularly in areas with warm, humid climates. This plant thrives in open woodlands, disturbed soils, and along riverbanks. It is also known to grow in coastal areas and is often seen in lowland habitats. Its natural range extends from southern Mexico through Central America to northern South America.",
    "distribution_introduced_art_desc": "Abutilon crispum was mainly introduced to coastal and sandy areas, where it thrives in well-drained soils. It is often found in disturbed habitats such as roadsides, dunes, and open woodlands. This plant is known for its hairy, lobed leaves and showy yellow flowers that bloom in the spring. It has been reported in several states along the southeastern and southwestern United States. Due to its adaptability, it has become naturalized in many regions outside its native range."
}
