{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilaea cryptantha",
    "plant_slug": "abutilaea-cryptantha",
    "plant_name_scientific": "abutilaea cryptantha",
    "intro": "Abutilaea cryptantha, commonly known as the desert mallow, is a flowering plant native to arid and semi-arid regions of the southwestern United States and northern Mexico. It is a shrub or small tree that typically grows to a height of 1 to 3 meters. The plant produces showy, saucer-shaped flowers that range in color from white to pink, often appearing in late spring to early summer. Its leaves are alternate, ovate, and have a fuzzy texture, while its stems are woody and often branched. Abutilaea cryptantha is adapted to withstand drought and poor soil conditions, making it a resilient plant in harsh environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilaea cryptantha is primarily native to the western United States, specifically California and parts of Nevada. It is commonly found in rocky habitats and chaparral ecosystems. This plant thrives in dry, sunny conditions and is adapted to the Mediterranean climate of its native range. It is often seen growing on cliffs, slopes, and along stream banks. Due to its limited distribution, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abutilaea cryptantha was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, open woodlands, and dry slopes. This plant thrives in well-drained soils and full sun, making it adaptable to various habitats. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded beyond its native range, raising concerns about its ecological impact."
}
