{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon indicum var. albidum",
    "plant_slug": "abutilon-indicum-var-albidum",
    "plant_name_scientific": "abutilon indicum var. albidum",
    "intro": "Abutilon indicum var. albidum, commonly known as the white velvet bush, is a flowering plant native to tropical regions of Asia. It is characterized by its soft, velvety leaves and clusters of small, white, lantern-shaped flowers. The plant produces capsule fruits that contain numerous seeds, which are dispersed by wind. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Its botanical features make it a popular choice for gardeners seeking a visually striking yet low-maintenance plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon indicum var. albidum is primarily native to Southeast Asia, including countries such as India, Thailand, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in areas with warm, humid climates. This plant thrives in open, sunny habitats such as grasslands, forest edges, and disturbed soils. It is often seen growing along roadsides and in coastal areas. Its native range extends to parts of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abutilon indicum var. albidum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-like flowers. It was brought there during the late 19th and early 20th centuries by horticulturalists and gardeners seeking to introduce exotic plant species. The plant thrives in tropical and subtropical climates, making it well-suited to the environmental conditions of these regions. However, it has since become naturalized in some areas, raising concerns about its potential impact on native ecosystems. Its introduction highlights the historical trend of introducing non-native species for aesthetic purposes."
}
