{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon reventum",
    "plant_slug": "abutilon-reventum",
    "plant_name_scientific": "abutilon reventum",
    "intro": "Abutilon reventum, commonly known as the velvetleaf abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 6 meters in height, characterized by its hairy, velvety stems and leaves. The plant produces showy, lantern-shaped yellow or orange flowers that bloom in clusters. Its leaves are typically heart-shaped with a rough texture, and it has a fibrous root system. Abutilon reventum is often found in tropical and subtropical regions, thriving in well-drained soils and full sun.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon reventum"
    },
    "taxonomy_art_desc": "Abutilon reventum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and cotton-like fibers in some species. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon reventum, a specific type of velvetleaf native to certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon reventum is primarily native to Arizona, Mexico Central, Mexico Northeast, Mexico Northwest, Mexico Southeast, and Mexico Southwest. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in disturbed soils and can often be seen along roadsides and in dry landscapes. The species is well adapted to the harsh environmental conditions of its native range. Its distribution highlights its ecological significance in the southwestern United States and northern Mexico.",
    "distribution_introduced_art_desc": "Abutilon reventum was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, lantern-shaped flowers and fuzzy foliage. The plant has since spread beyond its original planting sites, becoming naturalized in wetlands and disturbed areas. It is considered invasive in some areas because of its rapid growth and ability to outcompete native vegetation. Despite its beauty, its spread has raised concerns among land managers and conservationists."
}
