{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon × aurantiacum",
    "plant_slug": "abutilon-×-aurantiacum",
    "plant_name_scientific": "abutilon × aurantiacum",
    "intro": "Abutilon × aurantiacum, commonly known as the Chinese lantern plant, is a hybrid species within the Malvaceae family. It is characterized by its striking, papery, orange-red bracts that resemble small lanterns, which are often mistaken for flowers. The plant is native to China and is widely cultivated as an ornamental due to its vibrant foliage and unique appearance. It thrives in warm climates and prefers well-drained soil, making it suitable for both indoor and outdoor cultivation. The bracts are not true flowers but modified leaves, and they persist for several weeks, adding visual interest to gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon × aurantiacum is primarily native to Mexico and parts of Central America. It is commonly found in regions with warm, humid climates. This plant thrives in tropical and subtropical environments. It is often seen growing in open woodlands and along stream banks. Its native range includes countries such as Guatemala, Belize, and parts of southern Mexico.",
    "distribution_introduced_art_desc": "Abutilon × aurantiacum was mainly introduced to ornamental horticulture due to its vibrant, lantern-shaped flowers and attractive, fuzzy foliage. It is commonly cultivated in gardens and as a houseplant because of its adaptability to various growing conditions. The plant is native to South America but has been widely distributed across temperate regions worldwide. It thrives in well-drained soil and partial to full sunlight, making it a popular choice for landscapers and gardeners. However, it is considered an invasive species in some areas, where it can outcompete native vegetation."
}
