{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon eufigarii",
    "plant_slug": "abutilon-eufigarii",
    "plant_name_scientific": "abutilon eufigarii",
    "intro": "Abutilon eufigarii, commonly known as the silky abutilon, is a flowering plant native to South America. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped yellow flowers. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. It thrives in warm, humid climates and is often cultivated for its ornamental value. Its botanical features make it a popular choice for tropical gardens and indoor plant displays.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon eufigarii"
    },
    "taxonomy_art_desc": "Abutilon eufigarii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malvales, which consists of flowering plants with showy flowers and includes families such as Malvaceae, Theaceae, and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with velvety leaves and showy flowers, such as cotton and hibiscus. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their glandular leaves and showy, often colorful flowers. Its species is Abutilon eufigarii, a specific type within the genus Abutilon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Sudan-South Sudan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon eufigarii is primarily native to Sudan and South Sudan. This species is found in the tropical and subtropical regions of these countries. It typically grows in areas with high humidity and well-drained soils. The plant is commonly found in savannas and along riverbanks. Its native distribution is limited to specific ecological zones within Sudan and South Sudan.",
    "distribution_introduced_art_desc": "Abutilon eufigarii was mainly introduced to ornamental horticulture due to its unique, lantern-shaped flowers and attractive foliage. It is commonly cultivated in gardens and landscapes for its aesthetic value. The plant thrives in warm, humid climates and is often used in tropical and subtropical regions. Its introduction has led to its establishment in some non-native areas, raising concerns about its potential invasiveness. Despite its ornamental appeal, careful management is recommended to prevent unintended spread."
}
