{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon reflexum",
    "plant_slug": "abutilon-reflexum",
    "plant_name_scientific": "abutilon reflexum",
    "intro": "Abutilon reflexum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its fuzzy, velvety leaves and clusters of yellow flowers that bloom throughout the growing season. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are heart-shaped and have a distinctive velvety texture, while its flowers are borne in terminal panicles. Abutilon reflexum is often cultivated for its ornamental value and is also used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon reflexum"
    },
    "taxonomy_art_desc": "Abutilon reflexum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malvales, a group of flowering plants that includes families like Malvaceae, which are known for their showy flowers and cotton-like seeds. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive sympetalous flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon reflexum, a specific type of plant within the genus Abutilon, known for its hairy stems and reflexed bracts, often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon reflexum is primarily native to Ecuador and Peru. It is commonly found in the Andean regions of these countries. The plant thrives in moist, shaded environments within montane forests. It is often encountered in the understory of cloud forests at elevations ranging from 1,000 to 2,500 meters. Its native distribution is limited to these specific geographic areas in South America.",
    "distribution_introduced_art_desc": "Abutilon reflexum was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and flowering habits. It is commonly found in gardens and along roadsides, where it thrives in a variety of soil types. Despite its aesthetic appeal, it has become an invasive species in some regions, outcompeting native vegetation. The plant spreads through seeds dispersed by wind, water, and human activity. Its rapid growth and adaptability have led to concerns about its impact on local ecosystems."
}
