{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon elatum",
    "plant_slug": "abutilon-elatum",
    "plant_name_scientific": "abutilon elatum",
    "intro": "Abutilon elatum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its velvety, hairy leaves. The plant produces clusters of showy, bell-shaped flowers in shades of yellow, orange, or red, which bloom throughout the growing season. Its fibrous roots and soft, fuzzy foliage make it adaptable to various soil types and climates. Abutilon elatum is often cultivated for ornamental purposes due to its attractive appearance and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon elatum is primarily native to Central and South America. It is found in countries such as Mexico, Guatemala, Belize, Honduras, and parts of Colombia. This plant thrives in tropical and subtropical regions, often growing in disturbed habitats like roadsides and open woodlands. It is also present in some Caribbean islands. Its natural range extends into parts of northern South America, including Ecuador and Peru.",
    "distribution_introduced_art_desc": "Abutilon elatum was mainly introduced to Hawaii, where it has become an invasive species. It was originally native to South America but was brought to Hawaii for its ornamental value due to its attractive, maple-like leaves. The plant thrives in tropical climates and has spread rapidly in disturbed areas such as roadsides and forests. It competes with native plants for resources, posing a threat to local ecosystems. Efforts are being made to control its spread through manual removal and herbicide application."
}
