{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon grandiflorum var. grandiflorum",
    "plant_slug": "abutilon-grandiflorum-var-grandiflorum",
    "plant_name_scientific": "abutilon grandiflorum var. grandiflorum",
    "intro": "Abutilon grandiflorum var. grandiflorum, commonly known as the Chinese lantern plant, is a species native to China and Southeast Asia. It is a deciduous shrub characterized by its soft, hairy leaves and showy, lantern-shaped flowers that range in color from orange to red. The plant thrives in warm, humid climates and is often cultivated for its ornamental value. It produces small, round fruits that are edible but not commonly consumed by humans. The plant is also valued in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon grandiflorum"
    },
    "taxonomy_art_desc": "Abutilon grandiflorum var. grandiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female reproductive structures. Its order is Malvales, which includes plants with showy flowers and often hairy leaves, such as hibiscus and cotton. Its family is Malvaceae, commonly known as the mallow family, characterized by their capsule fruits and often hairy stems. Its genus is Abutilon, a group of flowering plants that typically have velvety leaves and showy flowers, often referred to as \"Chinese lanterns.\" Its species is Abutilon grandiflorum, a specific plant within the genus Abutilon known for its large, showy flowers and is often cultivated for ornamental purposes.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "DR Congo",
        "Eswatini",
        "Gulf of Guinea Is.",
        "Kenya",
        "KwaZulu-Natal",
        "Madagascar",
        "Malawi",
        "Mozambique",
        "Northern Provinces",
        "Tanzania",
        "Uganda",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Florida",
        "Norfolk Is.",
        "Spain"
    ],
    "distribution_native_art_desc": "Abutilon grandiflorum var. grandiflorum is primarily native to Angola, DR Congo, Eswatini, Gulf of Guinea Is., Kenya, KwaZulu-Natal, Madagascar, Malawi, Mozambique, Northern Provinces, Tanzania, Uganda, and Zimbabwe. It is commonly found in tropical and subtropical regions within these areas. The plant thrives in moist, well-drained soils and is often seen in forest understories or along riverbanks. It is a shrub or small tree that can reach heights of up to 3 meters. This species is valued for its ornamental flowers and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Abutilon grandiflorum var. grandiflorum was mainly introduced to Florida, Norfolk Island, and Spain. It is a variant of the species known for its ornamental value, particularly its showy, lantern-shaped flowers. The plant is commonly found in coastal and disturbed areas, thriving in warm, humid climates. Its introduction to these regions is likely due to its aesthetic appeal and adaptability to various soil types. However, it is important to monitor its spread to prevent potential ecological impacts."
}
