{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon picardae",
    "plant_slug": "abutilon-picardae",
    "plant_name_scientific": "abutilon picardae",
    "intro": "Abutilon picardae, commonly known as the velvetleaf abutilon, is a flowering plant native to South America. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant is a shrub or small tree, often reaching heights of up to 5 meters. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sunlight. Its unique foliage and ornamental flowers make it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon picardae"
    },
    "taxonomy_art_desc": "Abutilon picardae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Malvales, which includes plants with distinctive flowers and often includes species with specialized structures like hairs or glands. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a variety of economic uses. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon picardae, a specific type of Abutilon native to certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Haiti"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon picardae is primarily native to Haiti. This species is found in the tropical regions of the country, particularly in the southern and western parts. It thrives in humid, coastal environments and is commonly found in disturbed habitats such as roadsides and clearings. The plant is adapted to the warm and rainy climate typical of Haiti's lowland areas. It plays a role in local ecosystems and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Abutilon picardae was mainly introduced to the Hawaiian Islands. It was brought there likely as an ornamental plant due to its attractive foliage and flowers. The plant has since become naturalized in certain areas, particularly in disturbed habitats and along roadsides. It is considered an invasive species in some regions of Hawaii, where it can outcompete native vegetation. Its spread is facilitated by its ability to thrive in a variety of soil types and its prolific seed production."
}
