{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hirtum var. hirtum",
    "plant_slug": "abutilon-hirtum-var-hirtum",
    "plant_name_scientific": "abutilon hirtum var. hirtum",
    "intro": "Abutilon hirtum var. hirtum, commonly known as velvetleaf, is a perennial shrub native to tropical and subtropical regions. It features heart-shaped leaves that are densely covered in soft, velvety hairs, giving it a distinctive appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in late summer. It thrives in well-drained soil and requires full sun to partial shade. Its fibrous roots and hairy foliage make it adaptable to various environmental conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon hirtum"
    },
    "taxonomy_art_desc": "Abutilon hirtum var. hirtum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a wide range of ecological and economic importance. Its genus is Abutilon, a group of flowering plants commonly known as the velvetleaf genus, characterized by their hairy leaves and showy flowers. Its species is Abutilon hirtum, a specific type of velvetleaf plant known for its hairy stems and leaves, and its ability to thrive in various environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Bangladesh",
        "Botswana",
        "Burundi",
        "Cameroon",
        "Caprivi Strip",
        "Chad",
        "China South-Central",
        "Djibouti",
        "DR Congo",
        "Eritrea",
        "Ethiopia",
        "India",
        "Iran",
        "Kenya",
        "Mozambique",
        "Namibia",
        "Niger",
        "Nigeria",
        "Northern Provinces",
        "Oman",
        "Pakistan",
        "Palestine",
        "Rwanda",
        "Saudi Arabia",
        "Somalia",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Tanzania",
        "Thailand",
        "Uganda",
        "Vietnam",
        "Yemen",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Aruba",
        "Bahamas",
        "Belize",
        "Colombia",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "El Salvador",
        "Florida",
        "Guatemala",
        "Haiti",
        "Honduras",
        "Jamaica",
        "Leeward Is.",
        "Marquesas",
        "Mauritius",
        "Netherlands Antilles",
        "New Caledonia",
        "Nicaragua",
        "Panamá",
        "Peru",
        "Puerto Rico",
        "Rodrigues",
        "Réunion",
        "Taiwan",
        "Trinidad-Tobago",
        "Turks-Caicos Is.",
        "Venezuela",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abutilon hirtum var. hirtum is primarily native to Angola, Bangladesh, Botswana, Burundi, Cameroon, Caprivi Strip, Chad, China South-Central, Djibouti, DR Congo, Eritrea, Ethiopia, India, Iran, Kenya, Mozambique, Namibia, Niger, Nigeria, Northern Provinces, Oman, Pakistan, Palestine, Rwanda, Saudi Arabia, Somalia, Sri Lanka, Sudan-South Sudan, Tanzania, Thailand, Uganda, Vietnam, Yemen, and Zimbabwe. This plant is commonly found in tropical and subtropical regions, often growing in open woodlands, along riverbanks, and in disturbed soils. It is known for its hairy foliage and showy flowers, which contribute to its ornamental value. The species exhibits a wide geographic range, spanning across multiple continents. Its adaptability to various environmental conditions has allowed it to thrive in diverse habitats within its native distribution.",
    "distribution_introduced_art_desc": "Abutilon hirtum var. hirtum was mainly introduced to the Caribbean and parts of Central and South America, as well as the Pacific and Indian Ocean islands. It is found in countries such as Aruba, Bahamas, Belize, Colombia, Costa Rica, Cuba, and many others listed. This distribution suggests that it has been widely cultivated or naturalized in tropical and subtropical regions. The plant is likely introduced for ornamental purposes due to its attractive foliage and flowers. Its presence across such a wide range indicates successful adaptation to various environmental conditions."
}
