{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cymosum",
    "plant_slug": "abutilon-cymosum",
    "plant_name_scientific": "abutilon cymosum",
    "intro": "Abutilon cymosum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is a shrub or small tree that typically grows to a height of 1–3 meters. The plant produces clusters of yellow flowers that bloom in the summer months. Its leaves are heart-shaped and covered in fine, soft hairs, giving it a velvety texture. Abutilon cymosum is often cultivated for its ornamental value and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Pseudabutilon",
        "species": "Pseudabutilon cymosum"
    },
    "taxonomy_art_desc": "Abutilon cymosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with capsules as fruits and often hairy leaves. Its genus is Pseudabutilon, a group of flowering plants closely related to the genus Abutilon, characterized by their similar morphological traits. Its species is Pseudabutilon cymosum, a specific plant within the genus Pseudabutilon, distinguished by its unique floral and vegetative characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Panamá"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cymosum is primarily native to Colombia and Panama. This species is commonly found in tropical and subtropical regions of these countries. It thrives in areas with warm climates and well-drained soils. The plant is often associated with disturbed habitats and can be found in open woodlands or near human settlements. Its native distribution reflects its adaptability to diverse environmental conditions in Central America.",
    "distribution_introduced_art_desc": "Abutilon cymosum was mainly introduced to New Zealand, where it has become an invasive species. It was originally from South America, specifically Argentina and Chile. The plant was likely introduced through human activities, such as accidental transport in agricultural or horticultural contexts. It thrives in disturbed habitats and can spread rapidly, outcompeting native vegetation. Due to its invasive nature, it is now considered a weed in many parts of New Zealand."
}
