{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon benadirense",
    "plant_slug": "abutilon-benadirense",
    "plant_name_scientific": "abutilon benadirense",
    "intro": "Abutilon benadirense, commonly known as the Brazilian velvetleaf, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its hairy, velvety leaves. The plant produces yellow flowers that are clustered in spherical inflorescences, adding to its ornamental value. Its leaves are alternate, ovate to elliptic in shape, and often have a waxy texture. Abutilon benadirense thrives in tropical and subtropical climates, preferring well-drained soil and full sun exposure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon benadirense is primarily native to the Atlantic Forest region of Brazil. This species is found in the states of Paraná, Santa Catarina, and Rio Grande do Sul. It thrives in humid, tropical, and subtropical climates with well-drained soils. The plant is commonly found in coastal areas and riverine forests. It is an important component of the local flora and plays a role in supporting biodiversity in its native habitat.",
    "distribution_introduced_art_desc": "Abutilon benadirense was mainly introduced to the Americas through human activity, particularly as an ornamental plant. It has been reported in several countries including Brazil, Argentina, and Paraguay. The plant is often found in disturbed areas such as roadsides and abandoned fields. Its spread is facilitated by its ability to produce a large number of seeds and its adaptability to various soil types. Due to its invasive potential, it is considered a weed in some regions."
}
