{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon greveanum",
    "plant_slug": "abutilon-greveanum",
    "plant_name_scientific": "abutilon greveanum",
    "intro": "Abutilon greveanum, commonly known as the velvetleaf abutilon, is a species of flowering plant in the mallow family, Malvaceae. It is native to tropical regions of the Americas and is characterized by its fuzzy, velvety leaves that give it its common name. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It is often grown as an ornamental plant due to its attractive foliage and blooms. Abutilon greveanum prefers well-drained soil and full sun to partial shade, making it suitable for gardens in warm climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon greveanum"
    },
    "taxonomy_art_desc": "Abutilon greveanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their complex vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, which consists of flowering plants that often have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and a variety of ecological and economic importance. Its genus is Abutilon, a group of flowering plants known for their ornamental value and often referred to as \"velvetleaf\" due to their soft, fuzzy leaves. Its species is Abutilon greveanum, a specific type within the genus Abutilon, characterized by its unique morphological features and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon greveanum is primarily native to Madagascar. This species is found in the diverse ecosystems of the island, including dry forests and coastal areas. It thrives in regions with a tropical climate and is adapted to the unique environmental conditions of Madagascar. The plant is part of the Malagasy flora, which is known for its high level of endemism. Due to its restricted range, it is considered a rare and valuable component of Madagascar's natural heritage.",
    "distribution_introduced_art_desc": "Abutilon greveanum was mainly introduced to areas with warm, temperate climates that provide adequate sunlight and well-draining soil. It is commonly found in regions where it has been cultivated for ornamental purposes due to its attractive, lantern-shaped flowers. The plant thrives in USDA hardiness zones 7 through 10, making it suitable for gardens in the southern United States and parts of the Mediterranean. Its introduction has sometimes led to it becoming naturalized in certain environments, though it is not considered invasive in most regions. Proper care, including regular watering and pruning, is essential to maintain its health and appearance."
}
