{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon regnellii",
    "plant_slug": "abutilon-regnellii",
    "plant_name_scientific": "abutilon regnellii",
    "intro": "Abutilon regnellii, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its fuzzy, velvety leaves that give it its common name. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange. It is often found in moist, tropical or subtropical environments. Abutilon regnellii is valued in horticulture for its ornamental appeal and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon regnellii is primarily native to South America, particularly in regions of Brazil, Paraguay, and Argentina. It is commonly found in tropical and subtropical areas, often growing in moist, shaded environments such as forests and riverbanks. This plant thrives in humid climates with well-drained soil, making it a common species in the understory of tropical rainforests. It is also found in parts of Central America, including countries like Costa Rica and Panama. Due to its adaptability, it can sometimes be seen in cultivated gardens in warmer regions outside its native range.",
    "distribution_introduced_art_desc": "Abutilon regnellii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought there during the 19th or early 20th century by horticulturists or botanical enthusiasts seeking to cultivate exotic species. The plant has since become naturalized in certain areas, spreading through seed dispersal by birds and other means. It is now considered invasive in some regions, outcompeting native vegetation and altering local ecosystems. Its introduction highlights the ecological impacts of non-native plant species in island environments."
}
