{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon seineri",
    "plant_slug": "abutilon-seineri",
    "plant_name_scientific": "abutilon seineri",
    "intro": "Abutilon seineri, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of Africa and Asia. It is characterized by its heart-shaped leaves and fluffy, lantern-like seed pods that turn from green to brown as they mature. The plant produces showy yellow flowers that bloom in clusters, adding ornamental value to gardens. It thrives in warm, humid climates and is often cultivated for its aesthetic appeal. Abutilon seineri is also used in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon seineri is primarily native to Southeast Asia, specifically regions such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical areas, particularly in lowland forests and along riverbanks. This species thrives in humid climates with well-drained soil, often growing as an understorey plant. It is also present in parts of New Guinea and the Indian subcontinent. Due to its adaptability, it can be found in a variety of habitats within its native range.",
    "distribution_introduced_art_desc": "Abutilon seineri was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in disturbed soils and sunny environments. The plant is known for its attractive, lantern-shaped flowers that bloom in shades of yellow and orange. It is often used in ornamental gardening due to its aesthetic appeal and hardy nature. However, it is also considered a potential weed in some areas due to its ability to spread rapidly."
}
