{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon tubulosum var. tubulosum",
    "plant_slug": "abutilon-tubulosum-var-tubulosum",
    "plant_name_scientific": "abutilon tubulosum var. tubulosum",
    "intro": "Abutilon tubulosum var. tubulosum, commonly known as velvetleaf, is a tropical shrub native to the Americas. It is characterized by its heart-shaped leaves that are covered in a dense, velvety pubescence. The plant produces yellow flowers that are clustered in terminal panicles, followed by capsule fruits containing numerous seeds. It thrives in warm, humid climates and is often found in disturbed soils. Due to its rapid growth and invasive potential, it is considered a weed in many regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon tubulosum"
    },
    "taxonomy_art_desc": "Abutilon tubulosum var. tubulosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of morphological features. Its order is Malvales, which consists of flowering plants that are often characterized by their showy flowers and specialized structures such as hirsute leaves. Its family is Malvaceae, commonly known as the mallows, which includes plants with a variety of growth forms and is known for its showy flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon tubulosum, a specific type within the genus Abutilon, known for its distinctive tubular flowers and is often cultivated for ornamental purposes.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon tubulosum var. tubulosum is primarily native to New South Wales and Queensland in Australia. This plant is commonly found in coastal and inland regions of these states. It thrives in a variety of habitats, including rocky outcrops, sand dunes, and open woodlands. The species is well adapted to the temperate to subtropical climates of the region. Its native distribution highlights its ecological significance in the Australian landscape.",
    "distribution_introduced_art_desc": "Abutilon tubulosum var. tubulosum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-like flowers. It was brought there during the 19th century by European settlers and gardeners who admired its unique appearance. The plant has since become naturalized in many areas, often growing in disturbed habitats such as roadsides and coastal areas. It is considered an invasive species in some regions because of its rapid growth and ability to spread through seeds. Despite its ornamental value, it can outcompete native plants and alter local ecosystems."
}
