{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pauciflorum f. longicorniculatum",
    "plant_slug": "abutilon-pauciflorum-f-longicorniculatum",
    "plant_name_scientific": "abutilon pauciflorum f. longicorniculatum",
    "intro": "Abutilon pauciflorum f. longicorniculatum, commonly known as the longhorned abutilon, is a variant of the abutilon plant characterized by its distinctive, elongated floral bracts. It is a shrub native to tropical and subtropical regions, typically featuring hairy, glandular stems and broad, heart-shaped leaves. The plant produces showy, lantern-shaped flowers in shades of yellow to orange, which are often clustered in inflorescences. Its botanical features make it a popular ornamental plant in gardens and greenhouses. The f. longicorniculatum form is distinguished by its longer, more pronounced bracts compared to the typical species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pauciflorum f. longicorniculatum is primarily native to Southeast Asia, particularly Indonesia and Malaysia. This plant is commonly found in tropical rainforests and coastal areas within its native range. It thrives in humid, warm climates with well-drained soil. The species is often associated with disturbed habitats and secondary growth forests. Its natural distribution includes regions such as Sumatra, Borneo, and the western part of the Malay Peninsula.",
    "distribution_introduced_art_desc": "Abutilon pauciflorum f. longicorniculatum was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It is often cultivated as an ornamental plant due to its attractive, showy flowers and unique leaf shapes. This variety is commonly found in botanical gardens and private collections in countries such as Australia, the United States, and parts of Southeast Asia. Its introduction has been largely for horticultural purposes rather than for agricultural use. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
