{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon longicuspe var. cecilii",
    "plant_slug": "abutilon-longicuspe-var-cecilii",
    "plant_name_scientific": "abutilon longicuspe var. cecilii",
    "intro": "Abutilon longicuspe var. cecilii, commonly known as Cecil's Chinese lantern, is a variant of the Abutilon longicuspe species, which is native to China. It is characterized by its distinctive, inflated, orange to red bracts that resemble small lanterns, giving it its common name. The plant is a shrub or small tree with palmate leaves that are typically lobed and have a velvety texture. It produces small, yellow flowers that are clustered in panicles, followed by the showy bracts. This species is often cultivated for its ornamental value in gardens and is adapted to a variety of soil types.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon longicuspe"
    },
    "taxonomy_art_desc": "Abutilon longicuspe var. cecilii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some modern ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with a distinctive calyx and a variety of fruit types. Its genus is Abutilon, a group of flowering plants commonly known as the velvetleaf or Chinese lantern, characterized by their woolly leaves and showy flowers. Its species is Abutilon longicuspe, a specific variety known for its long, pointed leaves and is part of the Abutilon genus within the Malvaceae family.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ethiopia",
        "Kenya",
        "Tanzania",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon longicuspe var. cecilii is primarily native to Ethiopia, Kenya, Tanzania, and Zimbabwe. This plant is commonly found in the savannas and grasslands of these regions. It thrives in areas with moderate to high rainfall and well-drained soils. The species is often associated with open woodlands and rocky outcrops. Its native distribution reflects its adaptation to the diverse ecological conditions of eastern and southern Africa.",
    "distribution_introduced_art_desc": "Abutilon longicuspe var. cecilii was mainly introduced to the coastal regions of southern California, particularly in areas with sandy soils and mild climates. It is commonly found in disturbed habitats such as roadsides, dunes, and coastal bluffs. This variety is known for its distinctive elongated leaves and showy yellow flowers that bloom in the spring. It has been documented in several protected natural areas due to its ecological significance. However, its spread is closely monitored due to potential impacts on native plant communities."
}
