{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon trichodum",
    "plant_slug": "abutilon-trichodum",
    "plant_name_scientific": "abutilon trichodum",
    "intro": "Abutilon trichodum, commonly known as the woolly abutilon, is a flowering plant native to tropical and subtropical regions. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its hairy, fuzzy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. Its leaves are typically ovate to elliptical in shape, with a smooth or slightly hairy surface, and it thrives in well-drained soil with full sun to partial shade. Abutilon trichodum is often cultivated as an ornamental plant due to its attractive appearance and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon trichodum is primarily native to tropical and subtropical regions of the Americas. It is found in countries such as Mexico, Central America, and parts of South America. This plant typically grows in humid, shaded environments, often in forests or along stream banks. It thrives in areas with high rainfall and well-drained soils. Its natural range extends from southern Mexico through the Caribbean islands to northern South America.",
    "distribution_introduced_art_desc": "Abutilon trichodum was mainly introduced to the United States, particularly in the southern states. It is commonly found in disturbed areas such as roadsides, fields, and along riverbanks. This plant thrives in warm and humid climates, making it well-suited for tropical and subtropical regions. Its rapid growth and ability to spread through seeds have contributed to its establishment in new environments. However, it is considered an invasive species in some areas, posing a threat to native plant communities."
}
