{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon elongatum",
    "plant_slug": "abutilon-elongatum",
    "plant_name_scientific": "abutilon elongatum",
    "intro": "Abutilon elongatum, commonly known as the Chinese lantern plant, is a species of flowering plant in the mallow family. It is native to eastern Asia, including China, Japan, and Korea. The plant is characterized by its hairy, elongated stems and palmate leaves that are often lobed. It produces vibrant orange to red bracts that resemble lanterns, which are not flowers but modified leaves. Abutilon elongatum is often cultivated for its ornamental value and can thrive in a variety of soil types with adequate sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon elongatum is primarily native to Central and South America, including regions such as Mexico, Brazil, and parts of the Caribbean. It is commonly found in tropical and subtropical areas, often growing in disturbed soils and along roadsides. This plant thrives in warm climates with moderate to high humidity. It is also known to occur in some parts of southern North America, particularly in the southern United States. Its natural range extends into regions with a variety of soil types, making it adaptable to different environments.",
    "distribution_introduced_art_desc": "Abutilon elongatum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowers. The plant has since become naturalized in certain regions, particularly in coastal and disturbed areas. It is considered a potential weed in some parts of the country. Its spread is often associated with human activities such as gardening and land clearing."
}
