{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon galpinii",
    "plant_slug": "abutilon-galpinii",
    "plant_name_scientific": "abutilon galpinii",
    "intro": "Abutilon galpinii, commonly known as the Galpin's Abutilon, is a flowering plant native to South Africa. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its showy, lantern-shaped flowers that range in color from yellow to orange. It typically grows as a shrub or small tree, reaching heights of up to 5 meters. The leaves are ovate and covered in fine hairs, contributing to its distinctive appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon galpinii"
    },
    "taxonomy_art_desc": "Abutilon galpinii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers that often have five petals. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" due to their fuzzy appearance and often cultivated for ornamental purposes. Its species is Abutilon galpinii, a specific type of velvetleaf native to certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Eswatini",
        "Free State",
        "KwaZulu-Natal",
        "Mozambique",
        "Northern Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon galpinii is primarily native to Eswatini, Free State, KwaZulu-Natal, Mozambique, and Northern Provinces. This plant is commonly found in regions with a subtropical climate. It thrives in areas with well-drained soils and partial to full sunlight. Abutilon galpinii is often seen in savanna and woodland habitats. Its distribution is largely restricted to these specific geographic regions in southern Africa.",
    "distribution_introduced_art_desc": "Abutilon galpinii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape, particularly in fynbos vegetation types. The plant is often associated with disturbed habitats such as roadsides and agricultural areas. It is considered an invasive species in some parts of its range due to its rapid growth and ability to spread aggressively. Its introduction has raised concerns about its impact on native flora and ecosystem balance."
}
