{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pleniflorum",
    "plant_slug": "abutilon-pleniflorum",
    "plant_name_scientific": "abutilon pleniflorum",
    "intro": "Abutilon pleniflorum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its large, heart-shaped leaves that are covered in soft, velvety hairs. The plant produces clusters of showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in warm, humid climates and is often found in disturbed habitats such as roadsides and waste areas. Abutilon pleniflorum is valued for its ornamental appeal and is sometimes cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pleniflorum is primarily native to Southeast Asia, including countries such as Thailand, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often associated with coastal or riverine environments. It is also known to grow in disturbed habitats such as roadsides and abandoned fields. Its native range extends to parts of Australia and the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abutilon pleniflorum was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was brought there for its ornamental value, especially its showy, lantern-shaped flowers. The plant thrives in warm, humid climates and is often found in disturbed areas such as roadsides and wetlands. Due to its rapid growth and ability to spread through seeds, it has become invasive in some regions. Its introduction has led to ecological concerns as it competes with native plant species."
}
