{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon rufinerve",
    "plant_slug": "abutilon-rufinerve",
    "plant_name_scientific": "abutilon rufinerve",
    "intro": "Abutilon rufinerve, commonly known as the red-veined abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its hairy stems and broad, heart-shaped leaves. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often with a red or purple throat. Its fibrous bark and soft, fuzzy texture make it a popular ornamental plant in gardens. Abutilon rufinerve thrives in warm, humid climates and requires well-drained soil for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon rufinerve is primarily native to tropical and subtropical regions of the Americas, including Central and South America. It is commonly found in countries such as Brazil, Colombia, and Peru. This species thrives in humid environments and is often associated with forest understories or disturbed habitats. It is also present in parts of the Caribbean, including the islands of Cuba and Hispaniola. The plant is well adapted to warm climates and is sometimes cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Abutilon rufinerve was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become a weed in some regions, particularly in agricultural areas. The plant spreads through seeds that are dispersed by wind, water, and human activity. Its introduction has led to concerns about its impact on native ecosystems and crop lands."
}
