{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon taiwanense",
    "plant_slug": "abutilon-taiwanense",
    "plant_name_scientific": "abutilon taiwanense",
    "intro": "Abutilon taiwanense, commonly known as the Taiwan Abutilon, is a flowering plant native to Taiwan. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its fuzzy, ovate leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in warm, humid climates and is often found in coastal areas and lowland forests. Abutilon taiwanense is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon taiwanense is primarily native to Taiwan, where it grows in various habitats such as forests, shrubs, and along roadsides. It is commonly found in the island's mountainous regions and is adapted to the humid subtropical climate. This species is also occasionally reported in southern China, particularly in provinces like Guangdong and Guangxi. It thrives in well-drained soil and partial to full sunlight. Due to its ornamental value, it has been cultivated in some regions outside its native range.",
    "distribution_introduced_art_desc": "Abutilon taiwanense was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It has been documented in various locations across the Hawaiian archipelago, where it thrives in tropical and subtropical climates. The plant is often found growing in disturbed areas, along roadsides, and in coastal habitats, indicating its adaptability to different environments. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, careful management is recommended to prevent its spread beyond cultivated areas."
}
