{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hirsutissimum",
    "plant_slug": "abutilon-hirsutissimum",
    "plant_name_scientific": "abutilon hirsutissimum",
    "intro": "Abutilon hirsutissimum, commonly known as the velvetleaf abutilon, is a shrub native to the Americas. It is characterized by its velvety, hairy leaves that give it a distinctive texture. The plant produces showy, lantern-shaped yellow flowers that bloom in late spring to early summer. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Its rapid growth and adaptability make it both a useful ornamental plant and a potential weed in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hirsutissimum is primarily native to South America, specifically countries such as Brazil, Paraguay, and Argentina. It is commonly found in tropical and subtropical regions, particularly in areas with moist, well-drained soils. This plant thrives in open habitats like grasslands, savannas, and along riverbanks. It is also known to grow in disturbed areas and is often found in secondary forests. Its native range extends into parts of Central America as well.",
    "distribution_introduced_art_desc": "Abutilon hirsutissimum was mainly introduced to control erosion and for ornamental purposes in tropical and subtropical regions. It is commonly found in disturbed soils, along roadsides, and in agricultural areas. The plant thrives in warm climates with well-drained soil and full sun exposure. Its rapid growth and ability to spread through seeds and vegetative means contribute to its invasive potential. However, it is sometimes cultivated for its unique foliage and tolerance to poor soil conditions."
}
