{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sordidum",
    "plant_slug": "abutilon-sordidum",
    "plant_name_scientific": "abutilon sordidum",
    "intro": "Abutilon sordidum, commonly known as the dirty abutilon, is a species of flowering plant in the mallow family, Malvaceae. It is native to Central and South America, particularly regions with tropical and subtropical climates. The plant is characterized by its rough, hairy stems and broad, heart-shaped leaves that are often dark green with a waxy texture. It produces small, inconspicuous flowers that are typically greenish-yellow in color, and it is known for its ability to thrive in poor soil conditions. Abutilon sordidum is sometimes cultivated as an ornamental plant due to its distinctive foliage and adaptability to various growing environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sordidum is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and KwaZulu-Natal. This plant typically grows in coastal areas and sandy soils. It is commonly found in fynbos vegetation, which is characteristic of the region. Abutilon sordidum is well adapted to the Mediterranean climate of South Africa, with dry summers and wet winters.",
    "distribution_introduced_art_desc": "Abutilon sordidum was mainly introduced to the Pacific Northwest region of the United States. It was primarily introduced as an ornamental plant due to its unique, fuzzy foliage and showy yellow flowers. Despite its aesthetic appeal, it has since become a problematic invasive species in several areas. The plant spreads rapidly through seeds dispersed by wind, water, and animals. Its aggressive growth can outcompete native vegetation, leading to ecological imbalances in local ecosystems."
}
