{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon orientale",
    "plant_slug": "abutilon-orientale",
    "plant_name_scientific": "abutilon orientale",
    "intro": "Abutilon orientale, commonly known as the Chinese lantern plant, is a flowering shrub native to southern China and Southeast Asia. It is characterized by its vibrant, papery bracts that resemble small lanterns, which are often mistaken for flowers. The plant produces small, inconspicuous yellow flowers that are followed by capsule fruits containing numerous seeds. It thrives in warm, humid climates and is often cultivated for its ornamental value. Abutilon orientale is also valued in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Pseudabutilon",
        "species": "Pseudabutilon orientale"
    },
    "taxonomy_art_desc": "Abutilon orientale belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails and some modern ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malvales, a group of flowering plants that includes families such as Malvaceae, which are known for their showy flowers and cotton-like fibers. Its family is Malvaceae, commonly known as the mallow family, which includes plants like cotton, hibiscus, and okra. Its genus is Pseudabutilon, a group of flowering plants within the Malvaceae family, often characterized by their ornamental value and specific morphological features. Its species is Pseudabutilon orientale, a specific plant within the genus Pseudabutilon, known for its unique botanical characteristics and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon orientale is primarily native to Guatemala, Mexico Northwest, Mexico Southeast, and Mexico Southwest. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in humid climates with well-drained soils. Abutilon orientale is often associated with disturbed habitats and can be found in open woodlands and along roadsides. Its native range reflects its adaptability to diverse environmental conditions within these regions.",
    "distribution_introduced_art_desc": "Abutilon orientale was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-like flowers. It was also introduced to parts of Florida and other tropical regions in the United States. The plant's rapid growth and ability to thrive in disturbed habitats have led to its establishment in natural areas. However, it is considered a potential invasive species in some regions because of its competitive nature. Despite its ornamental value, its spread requires careful management to prevent ecological impact."
}
