{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon andrieuxii",
    "plant_slug": "abutilon-andrieuxii",
    "plant_name_scientific": "abutilon andrieuxii",
    "intro": "Abutilon andrieuxii, commonly known as the velvetleaf abutilon, is a flowering plant native to Madagascar. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its fuzzy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in warm, humid climates and is often found in tropical and subtropical regions. Its unique appearance makes it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon andrieuxii"
    },
    "taxonomy_art_desc": "Abutilon andrieuxii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Malvales, which consists of flowering plants with diverse morphological features, including many species with showy flowers. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and okra, characterized by their sympetalous flowers and stipulate leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"Chinese lanterns\" or \"velvetleaf,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon andrieuxii, a specific plant within the genus Abutilon, known for its unique characteristics and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Costa Rica",
        "El Salvador",
        "Guatemala",
        "Honduras",
        "Mexico Central",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon andrieuxii is primarily native to Costa Rica, El Salvador, Guatemala, Honduras, Mexico Central, Mexico Southeast, Mexico Southwest, and Nicaragua. This species is found in the tropical and subtropical regions of Central America. It typically grows in moist, well-drained soils in lowland areas. The plant is commonly associated with humid forests and shaded undergrowth. Its native distribution spans across several countries in Central America.",
    "distribution_introduced_art_desc": "Abutilon andrieuxii was mainly introduced to tropical and subtropical regions for ornamental purposes due to its attractive, maple-like leaves and showy flowers. It has been widely cultivated in gardens and landscapes across Southeast Asia, the Pacific Islands, and parts of the Americas. The plant thrives in warm, humid climates with well-drained soil and full sunlight. However, it has also become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through seeds and vegetative reproduction make it a concern in certain regions."
}
