{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sepalum",
    "plant_slug": "abutilon-sepalum",
    "plant_name_scientific": "abutilon sepalum",
    "intro": "Abutilon sepalum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its velvety, hairy leaves that give it a distinctive texture. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in warm climates and is often cultivated for its ornamental value. Abutilon sepalum is also known for its adaptability to various soil types and its ability to tolerate moderate drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon sepalum"
    },
    "taxonomy_art_desc": "Abutilon sepalum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their unique vascular structures and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malvales, which consists of flowering plants with a wide range of morphological diversity, including many species with showy flowers. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and hibiscus, characterized by their capsule fruits and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon sepalum, a specific plant within the genus Abutilon, distinguished by its unique sepal structure and other morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sepalum is primarily native to Pakistan. It is commonly found in the southern regions of the country, particularly in the Punjab and Sindh provinces. This plant thrives in tropical and subtropical climates, often growing in open fields and along riverbanks. It is well adapted to the local environmental conditions and is sometimes used for ornamental purposes. Its native distribution is largely confined to the Indian subcontinent, with Pakistan being one of its key regions.",
    "distribution_introduced_art_desc": "Abutilon sepalum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain regions, particularly in coastal and disturbed areas. It is often found growing in gardens and along roadsides. However, its spread is limited compared to other invasive species in the region."
}
