{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pubescens",
    "plant_slug": "abutilon-pubescens",
    "plant_name_scientific": "abutilon pubescens",
    "intro": "Abutilon pubescens, commonly known as velvetleaf or woolly abutilon, is a flowering plant native to tropical and subtropical regions. It is a deciduous shrub or small tree that can grow up to 3 meters in height. The plant is characterized by its hairy, velvety leaves that are typically heart-shaped or ovate. Its flowers are usually yellow or orange, with five petals and a distinctive central column. Abutilon pubescens is often cultivated for its ornamental value and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pubescens is primarily native to Central and South America. It is found in countries such as Mexico, Guatemala, and parts of Brazil. This plant typically grows in tropical and subtropical regions, often in humid, shaded environments. It is commonly found in forest understories and along riverbanks. Its native range includes areas with rich soil and high moisture levels.",
    "distribution_introduced_art_desc": "Abutilon pubescens was mainly introduced to urban and disturbed areas due to its ability to thrive in poor soil conditions. It is commonly found along roadsides, construction sites, and abandoned lots where human activity has altered the natural landscape. This plant is considered an invasive species in some regions because of its rapid growth and competitive nature. It spreads through seeds that are easily dispersed by wind, water, and animals. Its introduction has led to concerns about its impact on native plant communities and ecosystem balance."
}
