{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fraseri subsp. fraseri",
    "plant_slug": "abutilon-fraseri-subsp-fraseri",
    "plant_name_scientific": "abutilon fraseri subsp. fraseri",
    "intro": "Abutilon fraseri subsp. fraseri, commonly known as Fraser's abutilon, is a shrub native to Australia. It is characterized by its hairy stems and heart-shaped leaves that are typically green with a slightly pubescent surface. The plant produces small, yellow flowers that bloom in clusters, often during the spring and summer seasons. It thrives in well-drained soils and full sun, making it suitable for cultivation in arid and semi-arid regions. Its ornamental value is enhanced by its attractive foliage and seasonal flowering.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon fraseri"
    },
    "taxonomy_art_desc": "Abutilon fraseri subsp. fraseri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female reproductive organs and are often characterized by showy flowers. Its order is Malvales, which includes plants with five-petaled flowers and often has specialized structures like hirsute leaves and stipules. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and hibiscus, characterized by their showy flowers and capsule fruits. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants, known for their fuzzy leaves and showy flowers. Its species is Abutilon fraseri, a specific plant within the genus Abutilon, distinguished by its unique morphological features and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon fraseri subsp. fraseri is primarily native to New South Wales, Northern Territory, Queensland, South Australia, Victoria, and Western Australia. This species is commonly found in arid and semi-arid regions across these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the dry climate of its native range. It is a valuable component of the local flora and plays a role in supporting native wildlife.",
    "distribution_introduced_art_desc": "Abutilon fraseri subsp. fraseri was mainly introduced to the Pacific Northwest of the United States. It is commonly found in moist, disturbed habitats such as roadsides, stream banks, and forest edges. This subspecies has become naturalized in several regions, often outcompeting native vegetation. Its rapid growth and adaptability contribute to its success in introduced areas. However, it is considered a potential invasive species in some regions due to its aggressive spread."
}
