{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon parviflorum var. luteum",
    "plant_slug": "abutilon-parviflorum-var-luteum",
    "plant_name_scientific": "abutilon parviflorum var. luteum",
    "intro": "Abutilon parviflorum var. luteum, commonly known as the yellow velvetleaf, is a perennial shrub native to the southeastern United States. It features heart-shaped leaves with a soft, velvety texture and produces small, yellow flowers that bloom in clusters. The plant has a fibrous root system and thrives in moist, well-drained soils. Its growth habit is bushy, with a tendency to spread through both seeds and runners. It is often found in wetlands and along the edges of swamps, where it plays a role in stabilizing soil and providing habitat for wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon parviflorum var. luteum is primarily native to the southern United States, particularly Texas, New Mexico, and Arizona. It thrives in arid and semi-arid environments, often found in rocky soils and along dry streambeds. This variety is known for its yellow flowers and is commonly referred to as the yellow Chinese lantern. It is well adapted to drought conditions and can tolerate high temperatures. The plant is often used in xeriscaping due to its low water requirements and ornamental value.",
    "distribution_introduced_art_desc": "Abutilon parviflorum var. luteum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive yellow flowers and bushy growth habit. The introduction occurred in the 19th century during the colonial expansion period. It has since naturalized in certain regions, particularly in the North Island. However, it is not considered invasive and is generally managed as a garden plant."
}
