{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon julianae",
    "plant_slug": "abutilon-julianae",
    "plant_name_scientific": "abutilon julianae",
    "intro": "Abutilon julianae, commonly known as the Julian's abutilon, is a flowering plant native to the island of Socotra. It is a shrub characterized by its hairy stems and large, heart-shaped leaves. The plant produces clusters of yellow flowers that bloom during the summer months. It thrives in arid and semi-arid environments, adapting well to rocky soils. Due to its unique appearance and limited distribution, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon julianae"
    },
    "taxonomy_art_desc": "Abutilon julianae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Malvales, which comprises plants with showy flowers and often includes species with specialized seed structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants like cotton and hibiscus. Its genus is Abutilon, a group of flowering plants known for their distinctive, lantern-like flowers and often used in ornamental gardening. Its species is Abutilon julianae, a specific type of plant within the Abutilon genus, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Norfolk Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon julianae is primarily native to Norfolk Island. This species is found in the unique ecosystems of the island, which is part of the Australian territory of Norfolk Island. It thrives in the subtropical climate and is adapted to the specific environmental conditions of the region. The plant is commonly found in coastal areas and open habitats. Due to its restricted range, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Abutilon julianae was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive foliage and flowers. However, it has since spread rapidly, outcompeting native plants and altering local ecosystems. The plant thrives in disturbed areas and can establish dense stands, making it difficult to control. Efforts are ongoing to manage its spread and protect native biodiversity."
}
