{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon crispum var. svensonii",
    "plant_slug": "abutilon-crispum-var-svensonii",
    "plant_name_scientific": "abutilon crispum var. svensonii",
    "intro": "Abutilon crispum var. svensonii, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its soft, hairy foliage and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are ovate to elliptical in shape, with a velvety texture, and the flowers are often clustered in terminal panicles. This species is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon crispum var. svensonii is primarily native to the eastern Andes of Peru and adjacent regions of Bolivia. This plant is found in the high-altitude grasslands and shrublands of these areas. It thrives in temperate to cold climates with well-drained soils. The species is known for its hairy, woolly leaves and showy flowers. It is a rare and localized plant within its native range.",
    "distribution_introduced_art_desc": "Abutilon crispum var. svensonii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, fuzzy leaves and showy flowers. It was brought there during the 19th century by early settlers and gardeners who admired its unique appearance. Despite its aesthetic value, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in tropical and subtropical climates, making it well-suited to the warm, humid conditions of the Pacific Islands. Its spread has raised concerns among conservationists due to its potential to disrupt native plant communities."
}
