{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon avicennae var. cordatum",
    "plant_slug": "abutilon-avicennae-var-cordatum",
    "plant_name_scientific": "abutilon avicennae var. cordatum",
    "intro": "Abutilon avicennae var. cordatum, commonly known as the heartleaf abutilon, is a species of flowering plant in the mallow family. It is native to tropical regions of South America and is characterized by its heart-shaped leaves. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It is often cultivated as an ornamental plant due to its attractive foliage and blooms. The leaves are usually hairy and can vary in size, adding to its visual appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon avicennae var. cordatum is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This species thrives in coastal and mangrove environments, often growing along riverbanks and estuaries. It is an important plant in local ecosystems, providing habitat and food for various wildlife species. Its distribution is largely restricted to the Indo-Malayan region, where it plays a significant ecological role.",
    "distribution_introduced_art_desc": "Abutilon avicennae var. cordatum was mainly introduced to areas with warm, humid climates and well-drained soils, often found in coastal regions. It thrives in environments with moderate to high sunlight exposure and is commonly cultivated as an ornamental plant. This variety is particularly adapted to tropical and subtropical regions, making it popular in horticultural settings. Its introduction has been noted in several countries, including parts of Southeast Asia and the Pacific Islands. However, it is considered an invasive species in some regions, where it can outcompete native flora."
}
