{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon rehmannii",
    "plant_slug": "abutilon-rehmannii",
    "plant_name_scientific": "abutilon rehmannii",
    "intro": "Abutilon rehmannii, commonly known as velvetleaf or Chinese lantern plant, is a flowering plant native to Southeast Asia. It is a shrub or small tree that can grow up to 3 meters tall, featuring heart-shaped leaves with a velvety texture. The plant produces clusters of small, yellowish-green flowers that are followed by spiny, lantern-shaped fruits. It thrives in warm, humid climates and is often found in tropical and subtropical regions. Its ornamental value comes from its unique foliage and distinctive fruiting structures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon rehmannii"
    },
    "taxonomy_art_desc": "Abutilon rehmannii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malvales, a group of flowering plants that includes families such as Malvaceae, known for their showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants like cotton and hibiscus, characterized by their capsule fruits and often showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as the velvetleaf genus, which includes species with hairy leaves and showy flowers. Its species is Abutilon rehmannii, a specific type of plant within the genus Abutilon, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Botswana",
        "Cape Provinces",
        "Kenya",
        "Namibia",
        "Northern Provinces",
        "Tanzania",
        "Uganda",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon rehmannii is primarily native to Botswana, Cape Provinces, Kenya, Namibia, Northern Provinces, Tanzania, Uganda, and Zimbabwe. This plant is commonly found in arid and semi-arid regions across these countries. It thrives in open habitats such as grasslands, savannas, and along riverbanks. The species is well adapted to the dry climate and can tolerate poor soil conditions. Its native range reflects its ecological preference for regions with distinct dry and wet seasons.",
    "distribution_introduced_art_desc": "Abutilon rehmannii was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, streambanks, and forest edges. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It thrives in moist, well-drained soils and can tolerate a range of light conditions. Its spread has raised concerns among land managers and conservationists."
}
