{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon asiaticum var. supraviride",
    "plant_slug": "abutilon-asiaticum-var-supraviride",
    "plant_name_scientific": "abutilon asiaticum var. supraviride",
    "intro": "Abutilon asiaticum var. supraviride, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its velvety, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an annual or perennial herb, often reaching heights of up to 2 meters. It thrives in well-drained soils and full sun, making it a common weed in agricultural fields. Its rapid growth and adaptability contribute to its success in various environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon asiaticum var. supraviride is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. This variant is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. It thrives in moist, well-drained soils and is often associated with disturbed habitats like roadsides and forest edges. The plant is known for its ornamental value due to its colorful bracts and is sometimes cultivated for horticultural purposes. Its native range extends into parts of the Indian subcontinent as well.",
    "distribution_introduced_art_desc": "Abutilon asiaticum var. supraviride was mainly introduced to ornamental horticulture due to its attractive, velvety foliage and showy flowers. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The variety is favored for its ability to thrive in shaded environments, making it suitable for indoor and outdoor gardens. Its introduction has led to its establishment in several non-native areas, sometimes becoming invasive. This plant is often used in landscaping and as a potted plant because of its adaptability and aesthetic appeal."
}
