{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon periplocifolium var. caribaeum",
    "plant_slug": "abutilon-periplocifolium-var-caribaeum",
    "plant_name_scientific": "abutilon periplocifolium var. caribaeum",
    "intro": "Abutilon periplocifolium var. caribaeum, commonly known as the Caribaeum abutilon, is a shrub native to the Caribbean region. It features heart-shaped, velvety leaves that are typically gray-green in color. The plant produces showy, lantern-shaped yellow flowers that bloom in the summer months. It thrives in warm, humid climates and is often found in coastal areas and disturbed soils. Its ornamental value makes it a popular choice for gardeners in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon periplocifolium var. caribaeum is primarily native to the Caribbean islands, particularly the Lesser Antilles. This species is commonly found in coastal areas and moist lowland forests. It thrives in tropical and subtropical climates with high humidity and well-drained soils. The plant is often seen growing along riverbanks and in disturbed habitats. Its native range includes countries such as Saint Lucia, Martinique, and Grenada.",
    "distribution_introduced_art_desc": "Abutilon periplocifolium var. caribaeum was mainly introduced to the coastal areas of the Caribbean and parts of southern Florida. It is commonly found in disturbed habitats such as roadsides, dunes, and sandy soils. This plant thrives in tropical and subtropical climates with high humidity and moderate rainfall. It is often considered an invasive species due to its rapid growth and ability to spread through seeds carried by wind and water. Its distribution has expanded beyond its native range, posing ecological challenges in invaded areas."
}
