{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta verruculosa",
    "plant_slug": "abuta-verruculosa",
    "plant_name_scientific": "abuta verruculosa",
    "intro": "Abuta verruculosa, commonly known as the rough abuta, is a flowering plant native to the Andean regions of South America. It is a member of the Cucurbitaceae family, which includes cucumbers and gourds, and is characterized by its trailing growth habit. The plant produces small, yellow flowers that are followed by orange or red, fleshy fruits. Its leaves are palmately lobed and covered in fine, velvety hairs, giving it a distinctive appearance. Abuta verruculosa is often cultivated for its ornamental value and has traditional uses in herbal medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta verruculosa is primarily native to the tropical regions of Central and South America. It is commonly found in countries such as Brazil, Colombia, Ecuador, Peru, and Venezuela. This plant thrives in humid, lowland areas with dense vegetation. It is often associated with rainforests and secondary growth habitats. Its distribution is largely restricted to these specific ecological zones within the Neotropical region.",
    "distribution_introduced_art_desc": "Abuta verruculosa was mainly introduced to the Southeastern United States, particularly in states like Georgia, Florida, and Texas. It was brought there for its ornamental value due to its attractive, waxy leaves and showy yellow flowers. The plant thrives in humid, subtropical climates and is often cultivated in gardens and landscapes. However, it has also become naturalized in some areas, raising concerns about its potential invasive tendencies. Despite its beauty, its distribution remains limited compared to its native range in Central and South America."
}
