{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon leschenaultianum",
    "plant_slug": "abutilon-leschenaultianum",
    "plant_name_scientific": "abutilon leschenaultianum",
    "intro": "Abutilon leschenaultianum, commonly known as the velvetleaf abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its hairy, velvety leaves. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often appearing in clusters. It thrives in warm, humid climates and is often found in tropical and subtropical regions. The leaves are typically alternate and have a distinctive, heart-shaped base.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon leschenaultianum is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, and the Philippines. It is also found in parts of India, particularly in the southern and eastern regions. This plant thrives in tropical and subtropical climates, often growing in coastal areas and disturbed sites. It is commonly associated with mangrove ecosystems and can be found along the shores of estuaries and tidal flats. Its natural range extends to some islands in the Pacific Ocean as well.",
    "distribution_introduced_art_desc": "Abutilon leschenaultianum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain regions, particularly in coastal areas. It is now considered a potential weed in some parts of the country. Its introduction highlights the importance of monitoring non-native species for ecological impact."
}
