{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon oxycarpum",
    "plant_slug": "abutilon-oxycarpum",
    "plant_name_scientific": "abutilon oxycarpum",
    "intro": "Abutilon oxycarpum, commonly known as the velvetleaf abutilon, is a shrub native to tropical regions of the Americas. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to red, often appearing in clusters. Its fruit is a capsule that splits open to release seeds, aiding in its dispersal. Abutilon oxycarpum is often cultivated for ornamental purposes due to its attractive foliage and flowers.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon oxycarpum"
    },
    "taxonomy_art_desc": "Abutilon oxycarpum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and fibrous tissues. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as Chinese lanterns or velvetleaf, characterized by their glandular hairs and showy flowers. Its species is Abutilon oxycarpum, a specific type within the genus Abutilon, known for its unique fruit structure and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [
        "New Caledonia"
    ],
    "distribution_native_art_desc": "Abutilon oxycarpum is primarily native to New South Wales, Northern Territory, Queensland, South Australia, Victoria, and Western Australia. This species is commonly found in arid and semi-arid regions across these Australian states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in supporting local wildlife and maintaining biodiversity in its habitat.",
    "distribution_introduced_art_desc": "Abutilon oxycarpum was mainly introduced to New Caledonia. It is a species of flowering plant native to South America. The introduction of this plant to New Caledonia likely occurred through human activity, such as horticultural trade or accidental transport. It has since become established in the region, possibly thriving in the tropical climate. However, its ecological impact and distribution within New Caledonia require further study."
}
