{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon californicum",
    "plant_slug": "abutilon-californicum",
    "plant_name_scientific": "abutilon californicum",
    "intro": "Abutilon californicum, commonly known as the California Abutilon, is a deciduous shrub native to the western United States. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant features soft, fuzzy leaves and produces showy, lantern-shaped flowers in shades of yellow, orange, and red. It thrives in well-drained soils and full sun, often found in coastal and inland habitats. Due to its ornamental value and ecological importance, it is a notable species in local flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon californicum"
    },
    "taxonomy_art_desc": "Abutilon californicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malvales, which consists of flowering plants with a variety of morphological features and includes families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and is characterized by a specific type of fruit called a capsule. Its genus is Abutilon, a group of flowering plants known for their ornamental value and unique leaf shapes, often resembling those of the genus Abutilon. Its species is Abutilon californicum, a specific type of plant native to California, characterized by its hairy leaves and showy, lantern-shaped flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexican Pacific Is.",
        "Mexico Northeast",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon californicum is primarily native to the Mexican Pacific Is., Mexico Northeast, and Mexico Northwest. This plant is commonly found in coastal areas and lowland regions within these regions. It thrives in sandy or rocky soils and is often seen along the coastline. The species is well adapted to the mild, Mediterranean climate of its native habitat. It is an important part of the local flora and is sometimes used in traditional landscaping.",
    "distribution_introduced_art_desc": "Abutilon californicum was mainly introduced to areas with Mediterranean climates, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and full sun, making it a common sight in coastal regions. This plant is often found in disturbed habitats such as roadsides, fields, and along creek banks. Its ability to spread through seeds and vegetative reproduction has contributed to its widespread distribution. However, it is considered a non-native species in many regions where it has become naturalized."
}
