{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon peraffine",
    "plant_slug": "abutilon-peraffine",
    "plant_name_scientific": "abutilon peraffine",
    "intro": "Abutilon peraffine, commonly known as velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its velvety, soft leaves that give it a distinctive tactile quality. The plant produces clusters of small, yellowish-green flowers that bloom in the summer months. Its蒴果 (capsules) contain numerous seeds, which are dispersed by wind. Abutilon peraffine is often cultivated for ornamental purposes due to its attractive foliage and unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon peraffine is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It thrives in tropical and subtropical regions with high humidity and warm temperatures. This plant is commonly found in lowland areas, often near water sources like rivers and wetlands. It prefers well-drained soils and is often seen growing in disturbed habitats or along forest edges. Abutilon peraffine is a valuable species for both ecological and ornamental purposes in its native range.",
    "distribution_introduced_art_desc": "Abutilon peraffine was mainly introduced to areas with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in regions with well-drained soil and moderate to high rainfall. This plant is often cultivated as an ornamental due to its attractive foliage and showy flowers. It has been reported in several tropical and subtropical countries, including parts of Southeast Asia and the Caribbean. Its introduction has sometimes led to it becoming an invasive species in certain environments."
}
