{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon malachroides",
    "plant_slug": "abutilon-malachroides",
    "plant_name_scientific": "abutilon malachroides",
    "intro": "Abutilon malachroides, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, fuzzy leaves and clusters of small, pale yellow flowers. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It thrives in warm, humid climates and is often found in disturbed soils. Its ornamental value comes from its unique foliage and showy blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon malachroides"
    },
    "taxonomy_art_desc": "Abutilon malachroides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and fibrous fruits. Its family is Malvaceae, commonly known as the mallow family, which includes plants with velvety leaves and capsule fruits. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their showy, lantern-shaped flowers. Its species is Abutilon malachroides, a specific type of Abutilon known for its distinctive foliage and ornamental value, often cultivated for its aesthetic appeal.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Brazil South",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon malachroides is primarily native to Argentina Northeast, Brazil South, and Uruguay. This species is commonly found in the temperate regions of these countries. It thrives in moist, well-drained soils along riverbanks and in open woodlands. The plant is known for its ornamental value due to its hairy leaves and showy flowers. Its native distribution reflects its adaptation to the humid and subtropical climates of these regions.",
    "distribution_introduced_art_desc": "Abutilon malachroides was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-shaped flowers. It was likely brought there by early European settlers or through botanical exchanges in the 19th century. Despite its aesthetic value, it has since become an invasive species in some areas, outcompeting native vegetation. Its rapid growth and ability to thrive in disturbed soils have contributed to its spread across tropical and subtropical regions. Conservation efforts are now focused on controlling its population to protect local ecosystems."
}
