{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon arnottianum",
    "plant_slug": "abutilon-arnottianum",
    "plant_name_scientific": "abutilon arnottianum",
    "intro": "Abutilon arnottianum, commonly known as the silky abutilon, is a flowering plant native to Australia. It is a shrub that typically grows to a height of about 1 to 2 meters, featuring soft, hairy leaves that are often lobed or serrated. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often with a red or purple throat. It thrives in well-drained soils and is adapted to full sun, making it a popular choice for coastal gardens. The plant is also valued for its ornamental appeal and is sometimes used in horticulture for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon arnottianum is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, and South Africa. It is commonly found in savanna and woodland habitats, often growing along riverbanks and in open grasslands. This species thrives in areas with moderate to high rainfall and well-drained soils. It is known for its hairy, heart-shaped leaves and showy yellow flowers that bloom throughout the growing season. Abutilon arnottianum is an important plant in local ecosystems and has traditional uses in some indigenous communities.",
    "distribution_introduced_art_desc": "Abutilon arnottianum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, lantern-shaped flowers. The species has since become naturalized in certain regions, particularly in the North Island. It is commonly found growing in disturbed habitats such as roadsides and riverbanks. However, its spread is limited compared to other invasive species in the area."
}
