{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon dubium",
    "plant_slug": "abutilon-dubium",
    "plant_name_scientific": "abutilon dubium",
    "intro": "Abutilon dubium, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to red. It thrives in warm climates and is often found in disturbed soils or along roadsides. Abutilon dubium is sometimes cultivated for ornamental purposes due to its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon dubium is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It is also found in parts of southern Arabia and the Indian subcontinent, including India and Sri Lanka. This plant thrives in warm, humid climates and is commonly found in coastal areas and disturbed habitats. It is often associated with sandy or rocky soils and can be seen growing in open woodlands or along roadsides. Its natural range extends into parts of Southeast Asia, where it is sometimes cultivated for its ornamental value.",
    "distribution_introduced_art_desc": "Abutilon dubium was mainly introduced to areas with warm climates and well-drained soils, often as an ornamental plant due to its attractive foliage. It has been reported in several regions of the Americas, including parts of the United States, Mexico, and Central America. The plant thrives in full sun to partial shade and is commonly found in disturbed habitats such as roadsides and abandoned fields. Its introduction has led to its establishment in some regions, where it may compete with native vegetation. Due to its adaptability, it has become a potential invasive species in certain areas."
}
