{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mourae",
    "plant_slug": "abutilon-mourae",
    "plant_name_scientific": "abutilon mourae",
    "intro": "Abutilon mourae, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant produces yellow to orange flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. Its leaves are alternate, heart-shaped, and covered in fine hairs, giving it a distinctive, velvety texture. Abutilon mourae is often cultivated for ornamental purposes due to its striking appearance and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon mourae is primarily native to the tropical and subtropical regions of South America, particularly Brazil, Colombia, and Ecuador. It is commonly found in lowland areas with high humidity and well-drained soil. This plant thrives in forest understories and along riverbanks, where it receives partial to full shade. It is also occasionally found in parts of Central America, including Panama and Costa Rica. Due to its adaptability, it can sometimes be seen in cultivated settings in regions with a similar climate.",
    "distribution_introduced_art_desc": "Abutilon mourae was mainly introduced to regions with a warm and humid climate, particularly in tropical and subtropical areas. It is commonly found in parts of Southeast Asia, the Pacific Islands, and some regions of the Americas. This plant is often cultivated for its ornamental value due to its attractive, maple-like leaves and showy flowers. It thrives in well-drained soil and requires moderate to high levels of sunlight. However, it can become invasive in certain environments if not properly managed."
}
