{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mauritianum subsp. zanzibaricum",
    "plant_slug": "abutilon-mauritianum-subsp-zanzibaricum",
    "plant_name_scientific": "abutilon mauritianum subsp. zanzibaricum",
    "intro": "Abutilon mauritianum subsp. zanzibaricum, commonly known as the Zanzibar flame tree, is a flowering plant native to the coastal regions of East Africa. It is characterized by its showy, flame-colored bracts that resemble petals, which are actually modified leaves. The plant produces small, inconspicuous flowers that are followed by woody, capsule-like fruits. It thrives in tropical and subtropical climates, often growing along coastal areas and in disturbed soils. Its ornamental value makes it a popular choice for landscaping in warm regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon mauritianum"
    },
    "taxonomy_art_desc": "Abutilon mauritianum subsp. zanzibaricum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their primitive features and vascular systems. Its subclass is Magnoliidae, which encompasses a diverse group of flowering plants with a wide range of morphological adaptations. Its order is Malvales, a group of flowering plants that includes many economically important species such as cotton and okra. Its family is Malvaceae, commonly known as the mallow family, which is characterized by their showy flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants that typically have hairy stems and showy, lantern-shaped flowers. Its species is Abutilon mauritianum, a specific plant within the genus Abutilon, which has a subspecies known as zanzibaricum, native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Comoros",
        "Kenya",
        "Malawi",
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon mauritianum subsp. zanzibaricum is primarily native to Comoros, Kenya, Malawi, and Tanzania. This plant is commonly found in coastal and lowland areas within these regions. It thrives in tropical and subtropical climates with well-drained soils. The species is often associated with disturbed habitats and can be found near human settlements. Its distribution reflects its adaptability to various environmental conditions in eastern Africa.",
    "distribution_introduced_art_desc": "Abutilon mauritianum subsp. zanzibaricum was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive, showy flowers. However, it has since become invasive, outcompeting native species in coastal habitats. The plant thrives in disturbed areas and can form dense thickets. Its rapid growth and ability to spread through seeds make it a significant ecological concern."
}
