{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon venosum var. brevicalyx",
    "plant_slug": "abutilon-venosum-var-brevicalyx",
    "plant_name_scientific": "abutilon venosum var. brevicalyx",
    "intro": "Abutilon venosum var. brevicalyx, commonly known as the narrow-leaved abutilon, is a shrub native to Southeast Asia. It features soft, hairy stems and heart-shaped leaves with a serrated margin. The plant produces fluffy, pale green to yellowish flowers that bloom in late spring to early summer. Its leaves are typically smaller and more compact compared to other varieties of Abutilon. It is often cultivated for its ornamental value and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon venosum var. brevicalyx is primarily native to Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. It thrives in tropical and subtropical regions with warm, humid climates. This variant is commonly found in lowland areas, often near rivers or in secondary forests. It is well adapted to moist, well-drained soils and can tolerate partial shade. Its natural range extends to some islands in the Pacific, such as New Guinea.",
    "distribution_introduced_art_desc": "Abutilon venosum var. brevicalyx was mainly introduced to regions with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in tropical and subtropical areas, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in full sun to partial shade and requires regular watering during the growing season. Its introduction has sometimes led to its establishment in natural habitats, raising concerns about its potential invasiveness. It is often cultivated for its unique, maple-like leaves and showy yellow flowers."
}
