{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon bastardioides",
    "plant_slug": "abutilon-bastardioides",
    "plant_name_scientific": "abutilon bastardioides",
    "intro": "Abutilon bastardioides, commonly known as the woolly abutilon, is a shrub native to South America. It is characterized by its soft, fuzzy leaves that give it a distinctive, velvety appearance. The plant produces small, yellow flowers that bloom in the spring and summer. It thrives in well-drained soil and full sun, making it suitable for cultivation in warm climates. Its unique foliage and ornamental value make it a popular choice for gardeners seeking an eye-catching plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon bastardioides"
    },
    "taxonomy_art_desc": "Abutilon bastardioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which consists of flowering plants that often have showy flowers and include families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fibrous stems and showy flowers. Its species is Abutilon bastardioides, a specific type of plant within the genus Abutilon, known for its unique botanical features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon bastardioides is primarily native to Mexico Southwest. This species is found in the arid and semi-arid regions of the Mexican states of Chihuahua, Coahuila, Durango, and Nuevo León. It thrives in rocky soils and is commonly found in desert scrub and grassland habitats. The plant is well adapted to the harsh climate of the region with its drought-resistant characteristics. It plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native range.",
    "distribution_introduced_art_desc": "Abutilon bastardioides was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly found in roadsides, wastelands, and along riverbanks due to its rapid growth and adaptability. This plant thrives in full sun to partial shade and is tolerant of a wide range of soil types. Its ability to establish quickly makes it a popular choice for land reclamation projects. However, it can become invasive in certain environments if not managed properly."
}
