{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon oxycarpum f. acutatum",
    "plant_slug": "abutilon-oxycarpum-f-acutatum",
    "plant_name_scientific": "abutilon oxycarpum f. acutatum",
    "intro": "Abutilon oxycarpum f. acutatum, commonly known as the sharp-leaved velvetleaf, is a variant of the velvetleaf plant native to tropical and subtropical regions. It is a shrub or small tree characterized by its hairy, ovate leaves with serrated edges. The plant produces clusters of yellow flowers that bloom in the summer months. Its fruit is a capsule that contains small, round seeds. This species is often found in disturbed soils and is used in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon oxycarpum"
    },
    "taxonomy_art_desc": "Abutilon oxycarpum f. acutatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants that often have showy flowers and include families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with cotton-like fibers and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and lantern-shaped flowers. Its species is Abutilon oxycarpum, a specific type within the genus Abutilon, and the 'f. acutatum' refers to a form or cultivar with acute or sharp leaf tips.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon oxycarpum f. acutatum is primarily native to Queensland. It is found in the tropical and subtropical regions of this state. This plant typically grows in coastal areas and sandy soils. It is commonly seen in open woodlands and along the coastline. Its distribution is limited to specific habitats within Queensland.",
    "distribution_introduced_art_desc": "Abutilon oxycarpum f. acutatum was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It thrives in environments with moderate to high light exposure and is often cultivated as an ornamental plant due to its attractive foliage and unique flowers. This distribution is largely a result of human activity, including horticultural trade and intentional planting for landscape purposes. It is commonly found in gardens, parks, and along roadsides in regions such as Southeast Asia, the Pacific Islands, and parts of the Americas. The plant's adaptability to various soil types and its ability to tolerate mild drought conditions contribute to its successful establishment in introduced habitats."
}
