{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hirtum var. heterotrichum",
    "plant_slug": "abutilon-hirtum-var-heterotrichum",
    "plant_name_scientific": "abutilon hirtum var. heterotrichum",
    "intro": "Abutilon hirtum var. heterotrichum, commonly known as velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its fuzzy, velvety leaves and showy, lantern-shaped bracts that enclose the small flowers. The plant typically grows as an annual or perennial herb, reaching heights of up to 2 meters. Its flowers are usually yellow or orange, and it produces capsule fruits containing numerous seeds. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hirtum var. heterotrichum is primarily native to the tropical regions of South America, particularly Brazil, Colombia, and Peru. This variant is commonly found in humid lowland areas with rich soils and high rainfall. It thrives in warm, moist environments and is often associated with secondary forests and disturbed habitats. The plant is known for its hairy stems and showy flowers, which attract various pollinators. Its distribution is closely linked to the Amazon basin and adjacent regions where the climate supports its growth.",
    "distribution_introduced_art_desc": "Abutilon hirtum var. heterotrichum was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, fuzzy leaves and showy flowers. This variety is often cultivated in gardens and landscapes for its aesthetic value. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact in local ecosystems."
}
