{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon spicatum",
    "plant_slug": "abutilon-spicatum",
    "plant_name_scientific": "abutilon spicatum",
    "intro": "Abutilon spicatum, commonly known as the spiked abutilon, is a flowering plant native to South America. It is a shrub that typically grows to a height of 1 to 3 meters, featuring hairy stems and broad, heart-shaped leaves. The plant produces clusters of small, yellow flowers that bloom in late summer to early autumn. Its scientific name refers to the spiky appearance of its flower clusters, which are often arranged in dense inflorescences. Abutilon spicatum is valued for its ornamental qualities and is sometimes cultivated in gardens for its visual appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon spicatum is primarily native to the southwestern United States and northern Mexico. It is commonly found in regions such as Arizona, New Mexico, and parts of Texas. This plant thrives in arid and semi-arid environments, often growing in rocky soils and along dry streambeds. It is well adapted to the harsh conditions of its native habitat, including high temperatures and low rainfall. Abutilon spicatum is a shrub or small tree that plays an important role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon spicatum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This species is considered an invasive plant due to its rapid growth and ability to outcompete native vegetation. It has spread to several states including Oregon, Washington, and California. Its introduction has raised concerns among land managers and conservationists."
}
