{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon longifolium",
    "plant_slug": "abutilon-longifolium",
    "plant_name_scientific": "abutilon longifolium",
    "intro": "Abutilon longifolium, commonly known as the woolly abutilon, is a flowering plant native to South America. It is characterized by its fuzzy, gray-green leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. It thrives in well-drained soils and full sun, making it a popular choice for ornamental gardening. Its unique appearance and adaptability contribute to its appeal in both natural and cultivated settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon longifolium is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in regions such as California, Arizona, and Baja California. This plant thrives in dry, rocky habitats and is often associated with chaparral and scrub environments. It is well adapted to arid conditions and can tolerate poor soil quality. Its native range includes areas with Mediterranean climates characterized by hot, dry summers and mild, wet winters.",
    "distribution_introduced_art_desc": "Abutilon longifolium was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, streambanks, and open woodlands. The plant thrives in full sun to partial shade and is adapted to a variety of soil types. It is often considered an invasive species in some regions due to its rapid growth and ability to spread easily. Its distribution has been influenced by human activity and climate conditions."
}
