{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon menziesii",
    "plant_slug": "abutilon-menziesii",
    "plant_name_scientific": "abutilon menziesii",
    "intro": "Abutilon menziesii, commonly known as the velvetleaf abutilon, is a flowering plant native to the western United States. It is a shrub or small tree that can grow up to 6 meters tall, characterized by its large, heart-shaped leaves and showy, lantern-shaped flowers. The plant produces yellow to orange flowers that bloom in the summer months, attracting pollinators such as bees and butterflies. Its fibrous bark and hairy foliage give it a distinctive, rugged appearance, making it a notable species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon menziesii"
    },
    "taxonomy_art_desc": "Abutilon menziesii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often having a distinct morphology. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and cotton-like fibers. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a wide range of ecological and economic significance. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon menziesii, a specific type of Abutilon native to North America, known for its distinctive appearance and ecological role in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Hawaii"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon menziesii is primarily native to Hawaii. This plant is found throughout the Hawaiian archipelago, particularly in coastal and lowland areas. It thrives in sunny, well-drained soils and is commonly seen in dry forests and along rocky shores. Abutilon menziesii is an important part of Hawaii's native flora and is often used in traditional Hawaiian practices. Its distribution is limited to the islands of Hawaii, making it a unique and endemic species.",
    "distribution_introduced_art_desc": "Abutilon menziesii was mainly introduced to the western United States, particularly in California and Oregon. It was brought there for its ornamental value due to its attractive, lantern-shaped flowers and fuzzy leaves. The plant thrives in coastal and riparian habitats, often growing along streams and in moist soils. It has become naturalized in some areas, sometimes competing with native vegetation. Despite its beauty, it is considered an invasive species in certain regions where it spreads aggressively."
}
