{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hirtum var. yuanmouense",
    "plant_slug": "abutilon-hirtum-var-yuanmouense",
    "plant_name_scientific": "abutilon hirtum var. yuanmouense",
    "intro": "Abutilon hirtum var. yuanmouense, commonly known as Yuanmou velvetleaf, is a variant of the velvetleaf plant native to China. It is characterized by its hairy, ovate leaves and showy, lantern-shaped flowers that range from yellow to orange in color. The plant typically grows as an annual herb, often found in disturbed soils and along roadsides. Its fibrous stems and broad leaves contribute to its adaptability in various environmental conditions. This variant is of interest in botanical studies due to its unique morphological traits and ecological significance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon hirtum"
    },
    "taxonomy_art_desc": "Abutilon hirtum var. yuanmouense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle and includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a diverse range of floral structures. Its order is Malvales, which includes flowering plants with showy flowers and includes families such as Malvaceae and Theaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with capsule fruits and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as Chinese lanterns or velvetleaf, characterized by their showy, lantern-shaped flowers. Its species is Abutilon hirtum, a specific type within the genus Abutilon, which is further distinguished by its varietal form yuanmouense, found in specific geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hirtum var. yuanmouense is primarily native to China South-Central. This variety of the species is found in specific regions within this area. It thrives in the local climate and soil conditions of China South-Central. The plant is adapted to the environmental characteristics of this region. Its native distribution highlights its ecological significance in the area.",
    "distribution_introduced_art_desc": "Abutilon hirtum var. yuanmouense was mainly introduced to regions with a warm and humid climate, particularly in tropical and subtropical areas. It thrives in well-drained soil and requires ample sunlight for optimal growth. This variant is often cultivated in botanical gardens and as an ornamental plant due to its attractive foliage and flowers. It has been introduced to parts of Southeast Asia, the Pacific Islands, and some regions of the Americas. Its introduction has contributed to the diversification of plant collections in these areas."
}
