{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon halophilum",
    "plant_slug": "abutilon-halophilum",
    "plant_name_scientific": "abutilon halophilum",
    "intro": "Abutilon halophilum, commonly known as saltbush, is a shrub native to arid and saline environments. It is characterized by its hairy, often glandular leaves that help reduce water loss in dry conditions. The plant produces small, yellowish-green flowers that are typically clustered in racemes. Its fibrous roots enable it to thrive in poor, salty soils. Abutilon halophilum is adapted to withstand high salinity and drought, making it an important species in coastal and desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon halophilum"
    },
    "taxonomy_art_desc": "Abutilon halophilum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malvales, which consists of flowering plants with a wide range of morphological diversity. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and okra. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants. Its species is Abutilon halophilum, a specific type of plant adapted to salty environments, often found in coastal areas.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon halophilum is primarily native to New South Wales, Northern Territory, Queensland, and South Australia. This species is commonly found in arid and semi-arid regions within these states. It thrives in saline and coastal environments, often growing along dunes and in salt-affected soils. The plant is well adapted to harsh climatic conditions, making it a resilient component of local ecosystems. Its native distribution reflects its ability to survive in challenging, dry, and saline habitats.",
    "distribution_introduced_art_desc": "Abutilon halophilum was mainly introduced to coastal and saline environments due to its high salt tolerance. It is commonly found in areas with high salinity, such as salt marshes and coastal dunes. This plant thrives in arid and semi-arid regions where other vegetation struggles to survive. Its introduction has been noted in several regions with similar ecological conditions. It is often used for stabilizing soil and preventing erosion in such environments."
}
