{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pseudocleistogamum f. bathiei",
    "plant_slug": "abutilon-pseudocleistogamum-f-bathiei",
    "plant_name_scientific": "abutilon pseudocleistogamum f. bathiei",
    "intro": "Abutilon pseudocleistogamum f. bathiei, commonly known as the Bathie's velvetleaf, is a variant of the velvetleaf plant native to tropical regions. It is characterized by its fuzzy, ovate leaves and showy, lantern-shaped flowers that bloom in clusters. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its flowers are usually yellow or orange, and it produces small, three-lobed fruits. This plant is often found in disturbed habitats and is valued for its ornamental qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pseudocleistogamum f. bathiei is primarily native to the coastal regions of southern Africa, particularly South Africa. It is found in the Western Cape Province, where it thrives in sandy or rocky coastal habitats. This plant is adapted to the warm, dry climate typical of the region's Mediterranean climate. It is often seen growing in dunes or along the edges of coastal forests. Its distribution is limited to specific microhabitats that provide the right balance of sunlight, moisture, and soil conditions.",
    "distribution_introduced_art_desc": "Abutilon pseudocleistogamum f. bathiei was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It thrives in environments with ample sunlight and moderate to high rainfall. This plant is often found in disturbed habitats such as roadsides, waste areas, and along riverbanks. Its introduction has been associated with ornamental horticulture and ecological restoration projects. Due to its adaptability, it has spread to various regions beyond its native range."
}
