{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sessilifolium",
    "plant_slug": "abutilon-sessilifolium",
    "plant_name_scientific": "abutilon sessilifolium",
    "intro": "Abutilon sessilifolium, commonly known as the velvetleaf abutilon, is a shrub native to the southeastern United States. It is characterized by its soft, velvety leaves that are sessile, meaning they are attached directly to the stem without a stalk. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often blooming in late summer. Its fibrous stems and leaves have been used in traditional herbal medicine for their potential therapeutic properties. It thrives in moist, well-drained soils and is often found in wetlands or along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sessilifolium is primarily native to Central America, including countries such as Mexico, Guatemala, and Belize. It is also found in parts of northern South America, including Colombia and Venezuela. This plant typically grows in tropical and subtropical regions, often in disturbed or open habitats. It is commonly seen in lowland areas with well-drained soil. Its native range extends into the Caribbean islands as well.",
    "distribution_introduced_art_desc": "Abutilon sessilifolium was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-like flowers. It was brought there during the 19th century by European settlers and gardeners who admired its unique appearance. Despite its ornamental value, it has since become an invasive species in some areas, outcompeting native vegetation. The plant thrives in disturbed soils and can spread rapidly through seed dispersal by wind and water. Its introduction has led to ecological concerns, prompting efforts to control its spread in natural habitats."
}
