{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon newberryi",
    "plant_slug": "abutilon-newberryi",
    "plant_name_scientific": "abutilon newberryi",
    "intro": "Abutilon newberryi, commonly known as the desert hibiscus, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its hairy, glandular stems and broad, heart-shaped leaves that are often covered in fine hairs. The plant produces showy, five-petaled flowers in shades of yellow, orange, and red, which bloom in late summer to early fall. It thrives in arid and semi-arid environments, preferring well-drained soils and full sun exposure. Abutilon newberryi is drought-tolerant and often used in xeriscaping due to its low water requirements and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon newberryi is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Sonora and Baja California. This plant typically grows in dry, rocky, or sandy soils in desert and scrubland environments. It is commonly associated with areas that have a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Abutilon newberryi is well adapted to arid conditions and is often seen along canyon walls and in washes.",
    "distribution_introduced_art_desc": "Abutilon newberryi was mainly introduced to the western United States, particularly in California and Nevada. It is commonly found in disturbed areas such as roadsides, open woodlands, and along stream banks. This plant thrives in dry to mesic conditions and is often associated with sandy or gravelly soils. It has become a common weed in agricultural and urban landscapes due to its rapid growth and adaptability. Its introduction has led to its widespread distribution across several states in the western region of the country."
}
