{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon rotundifolium",
    "plant_slug": "abutilon-rotundifolium",
    "plant_name_scientific": "abutilon rotundifolium",
    "intro": "Abutilon rotundifolium, commonly known as the woolly abutilon, is a shrub native to South America. It is characterized by its soft, fuzzy leaves that are rounded or heart-shaped. The plant produces small, yellow flowers that bloom in clusters during the summer months. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Its unique appearance and ease of cultivation contribute to its appeal among gardeners.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon rotundifolium"
    },
    "taxonomy_art_desc": "Abutilon rotundifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and cotton-like fibers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon rotundifolium, a specific type of Abutilon known for its round leaves and is often cultivated for ornamental purposes.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kenya",
        "Somalia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon rotundifolium is primarily native to Kenya and Somalia. It is commonly found in the arid and semi-arid regions of these countries. This plant thrives in dry, open habitats such as grasslands and rocky areas. It is well adapted to the local climate and soil conditions. Its native distribution is limited to these specific regions in East Africa.",
    "distribution_introduced_art_desc": "Abutilon rotundifolium was mainly introduced to the Pacific Northwest region of the United States. It was brought in during the 19th century as an ornamental plant due to its attractive, lantern-shaped flowers. The plant has since become naturalized in moist, disturbed areas such as streambanks and forest edges. Its rapid growth and ability to thrive in wet conditions have led to concerns about its potential invasiveness. However, it is currently considered a minor weed with limited impact on native ecosystems."
}
