{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon chachapoyense",
    "plant_slug": "abutilon-chachapoyense",
    "plant_name_scientific": "abutilon chachapoyense",
    "intro": "Abutilon chachapoyense, commonly known as the Chachapoyan abutilon, is a species of flowering plant native to the Andean region of Peru. It belongs to the Malvaceae family and is characterized by its hairy, ovate leaves and showy, lantern-shaped flowers. The plant typically grows in moist, shaded environments at high altitudes. It produces capsule fruits that contain numerous small, flat seeds. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon chachapoyense is primarily native to the Andean region of South America, specifically in the northern highlands of Peru and parts of Ecuador. It is commonly found in cloud forests and humid montane environments at elevations ranging from 1,500 to 3,000 meters above sea level. This plant thrives in areas with high rainfall and well-drained soils, often growing along stream banks and in rocky crevices. It is an important species in the local flora, contributing to the biodiversity of its native habitat. Due to its restricted distribution, it is considered a rare and endemic plant in the region.",
    "distribution_introduced_art_desc": "Abutilon chachapoyense was mainly introduced to regions with a temperate climate and well-drained soils, where it can thrive in full sun to partial shade. It is commonly found in areas with moderate rainfall and mild temperatures, making it suitable for cultivation in gardens and landscapes. This plant is often used as an ornamental due to its attractive foliage and unique flowering patterns. It has been introduced to several countries in South America and parts of the United States. Its distribution is primarily limited by its specific environmental requirements and the availability of suitable habitats."
}
