{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon intermedium var. greveanum",
    "plant_slug": "abutilon-intermedium-var-greveanum",
    "plant_name_scientific": "abutilon intermedium var. greveanum",
    "intro": "Abutilon intermedium var. greveanum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its fuzzy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an annual or perennial herb, often reaching heights of up to 2 meters. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Its botanical features make it both ornamental and ecologically significant in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon intermedium var. greveanum is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and parts of the Free State. This plant typically grows in coastal areas, riverine forests, and sandy soils. It is often associated with moist environments and is commonly found in coastal dunes and rocky outcrops. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Abutilon intermedium var. greveanum was mainly introduced to the Pacific Northwest of the United States. It was brought there for its ornamental value due to its attractive foliage and unique flower structure. The plant thrives in moist, well-drained soils and partial to full sun conditions. It has become naturalized in some areas, particularly near streams and wetlands. However, it is considered a potential invasive species in certain regions due to its rapid growth and ability to spread easily."
}
