{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon messinicum",
    "plant_slug": "abutilon-messinicum",
    "plant_name_scientific": "abutilon messinicum",
    "intro": "Abutilon messinicum, commonly known as the Messinian abutilon, is a flowering plant native to the Mediterranean region. It is a shrub or small tree that typically grows to a height of 1–3 meters. The plant features heart-shaped leaves with a velvety texture and produces clusters of yellow flowers that bloom in the summer. It thrives in well-drained soils and is often found in coastal areas or rocky habitats. The species is valued for its ornamental qualities and is sometimes cultivated in gardens for its attractive foliage and blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon messinicum is primarily native to the Mediterranean region, particularly the island of Sicily. It is also found in parts of southern Italy and the surrounding areas of the Mediterranean Basin. This plant thrives in coastal and semi-arid environments, often growing in rocky or sandy soils. It is commonly associated with coastal dunes and scrublands, where it adapts well to salty and windy conditions. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abutilon messinicum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowers. The plant has since become naturalized in certain regions, particularly in the North Island. It is commonly found in disturbed areas such as roadsides and riverbanks. However, it is not considered a major invasive species in New Zealand."
}
