{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon malvifolium",
    "plant_slug": "abutilon-malvifolium",
    "plant_name_scientific": "abutilon malvifolium",
    "intro": "Abutilon malvifolium, commonly known as the velvetleaf abutilon, is a deciduous shrub native to South America. It is characterized by its palmate leaves, which are often covered in fine, silky hairs, giving it a velvety texture. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It thrives in warm, humid climates and is often found in disturbed soils or along riverbanks. Abutilon malvifolium is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon malvifolium"
    },
    "taxonomy_art_desc": "Abutilon malvifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants with cotton-like fibers and showy flowers. Its genus is Abutilon, a group of flowering plants known for their hairy leaves and showy, often yellow or orange flowers. Its species is Abutilon malvifolium, a specific type of plant within the genus Abutilon, characterized by its large, heart-shaped leaves and distinctive floral structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon malvifolium is primarily native to New South Wales, Northern Territory, Queensland, South Australia, and Western Australia. This plant is commonly found in arid and semi-arid regions across these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The species is well adapted to the climatic conditions of the Australian interior. Its distribution reflects its ability to survive in harsh, dry environments.",
    "distribution_introduced_art_desc": "Abutilon malvifolium was mainly introduced to areas with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in coastal regions and disturbed soils, often spreading through seeds dispersed by wind or water. This plant is known for its ornamental value due to its hairy stems and showy flowers. It has been introduced to several parts of the world, including the Pacific Islands and parts of Southeast Asia. However, it is considered invasive in some regions, outcompeting native vegetation."
}
