{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon striatum",
    "plant_slug": "abutilon-striatum",
    "plant_name_scientific": "abutilon striatum",
    "intro": "Abutilon striatum, commonly known as velvetleaf, is a flowering plant native to the Americas. It is characterized by its hairy, velvety leaves that give it its common name. The plant produces clusters of small, yellowish-green flowers that bloom in the summer. Its capsule fruits contain numerous seeds, which are dispersed by wind. Abutilon striatum is often found in disturbed areas and can be an invasive species in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon striatum is primarily native to Central America, northern South America, and the Caribbean. It is commonly found in tropical and subtropical regions, including parts of Mexico, Brazil, and the islands of the Caribbean. This plant thrives in humid environments and is often associated with coastal areas and disturbed soils. It is also present in some regions of the southern United States, such as Florida. Its native range extends into parts of the Pacific Islands as well.",
    "distribution_introduced_art_desc": "Abutilon striatum was mainly introduced to the southern United States, particularly in Texas and California, as an ornamental plant due to its attractive, maple-like leaves and showy flowers. It has also been introduced to parts of Florida and the Caribbean, where it has become naturalized in certain habitats. The plant thrives in warm, humid climates and is often found in disturbed areas such as roadsides and abandoned fields. Its rapid growth and ability to spread through seed dispersal have led to its classification as an invasive species in some regions. Despite its ornamental value, its introduction has raised concerns about its impact on native plant communities."
}
