{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fruticosum var. saidae",
    "plant_slug": "abutilon-fruticosum-var-saidae",
    "plant_name_scientific": "abutilon fruticosum var. saidae",
    "intro": "Abutilon fruticosum var. saidae, commonly known as the Sierra Madre Abutilon, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped yellow flowers that bloom in late summer. The plant thrives in well-drained soils and full sun, making it adaptable to arid and semi-arid environments. Its structure is often sprawling or upright, with branches that can be woody or herbaceous depending on the climate. This species is valued for its ornamental appeal and ecological role in supporting local pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon fruticosum var. saidae is primarily native to the western coast of South America, specifically in regions of Ecuador and Peru. This plant is commonly found in coastal areas, particularly in the valleys and lowland regions along the Pacific coast. It thrives in sandy or gravelly soils and is often associated with dry to semi-arid environments. The species is also occasionally found in nearby islands such as the Galápagos Islands. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abutilon fruticosum var. saidae was mainly introduced to specific regions in the Mediterranean Basin, particularly in southern Europe and parts of North Africa. It was introduced for its ornamental value due to its attractive, woolly foliage and showy flowers. The plant has since become naturalized in some areas, spreading through both seed dispersal and vegetative propagation. It thrives in disturbed soils and can colonize rocky or dry habitats. However, its introduction has raised concerns about its potential impact on native plant communities in invaded areas."
}
