{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon tubulosum",
    "plant_slug": "abutilon-tubulosum",
    "plant_name_scientific": "abutilon tubulosum",
    "intro": "Abutilon tubulosum, commonly known as the velvetleaf or Chinese lantern plant, is a flowering plant native to tropical regions of the Americas. It is characterized by its heart-shaped, velvety leaves and clusters of lantern-shaped, orange to red bracts that resemble small lanterns. The plant produces small, yellowish flowers that are often overlooked due to the showy bracts. It thrives in warm, humid climates and is often cultivated as an ornamental plant. The species is also known for its adaptability to various soil types and its ability to grow in both full sun and partial shade.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon tubulosum"
    },
    "taxonomy_art_desc": "Abutilon tubulosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which comprises flowering plants with a distinctive structure of flowers and includes families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, characterized by their showy flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their ornamental value and hairy leaves. Its species is Abutilon tubulosum, a specific plant within the genus Abutilon, recognized for its tubular flowers and is often cultivated for its aesthetic appeal.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon tubulosum is primarily native to New South Wales and Queensland in Australia. It is commonly found in coastal and sandy areas, particularly in the northern and eastern regions of these states. The plant thrives in well-drained soils and is often seen in open habitats such as dunes, coastal heaths, and along roadsides. It is an important component of the local flora and has adapted to the semi-arid and sub-tropical climates of its native range. Its distribution is closely linked to the specific environmental conditions of these regions.",
    "distribution_introduced_art_desc": "Abutilon tubulosum was mainly introduced to the United States, particularly in the southern regions, as an ornamental plant due to its attractive, lantern-shaped flowers. It has also been introduced to other parts of the world, including Australia and parts of Europe, where it is cultivated for its aesthetic value. Despite its ornamental use, it has shown invasive tendencies in some areas, outcompeting native vegetation. The plant thrives in warm climates and is often found in disturbed soils, such as along roadsides and in abandoned fields. Its rapid growth and ability to spread through seeds make it a challenging species to control in non-native environments."
}
