{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon albidum",
    "plant_slug": "abutilon-albidum",
    "plant_name_scientific": "abutilon albidum",
    "intro": "Abutilon albidum, commonly known as the white abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 3 meters in height. The plant has soft, hairy leaves that are typically heart-shaped or ovate. Its flowers are pale yellow to white, with five petals and stamens that are often longer than the petals. It produces capsule fruits that contain numerous seeds, which are dispersed by wind.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon albidum"
    },
    "taxonomy_art_desc": "Abutilon albidum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include economically significant plants like cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with capsule fruits and often hairy leaves. Its genus is Abutilon, a group of flowering plants known for their woolly leaves and showy flowers, often referred to as \"Chinese lanterns.\" Its species is Abutilon albidum, a specific type within the genus Abutilon, characterized by its white flowers and is commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Algeria",
        "Canary Is.",
        "Morocco"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon albidum is primarily native to Algeria, Canary Is., and Morocco. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in coastal and inland environments, often growing in sandy or rocky soils. Abutilon albidum is well adapted to the climate and ecological conditions of its native range. It is a characteristic species of the Mediterranean and North African flora.",
    "distribution_introduced_art_desc": "Abutilon albidum was mainly introduced to areas with warm, temperate climates where it can thrive in well-drained soils. It is commonly found in regions with mild winters and abundant sunlight, making it suitable for cultivation in gardens and landscapes. The plant is often used as an ornamental due to its attractive, lantern-shaped flowers and fuzzy foliage. It has been introduced to several parts of the world, including North America and Europe, where it is sometimes considered an invasive species. Its distribution is largely influenced by human activity and its adaptability to different environmental conditions."
}
