{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon bidentatum var. forrestii",
    "plant_slug": "abutilon-bidentatum-var-forrestii",
    "plant_name_scientific": "abutilon bidentatum var. forrestii",
    "intro": "Abutilon bidentatum var. forrestii, commonly known as the Forrester's velvetleaf, is a variant of the velvetleaf plant native to tropical regions of South America. It is a deciduous shrub characterized by its heart-shaped leaves and soft, fuzzy texture. The plant produces small, pale yellow flowers that bloom in clusters, typically during the warmer months. Its fibrous stems and leaves have been used in traditional medicine for their purported healing properties. The species is also valued in horticulture for its ornamental appeal and adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon bidentatum var. forrestii is primarily native to the mountainous regions of Central America, specifically in countries such as Guatemala and Honduras. This variant is commonly found in cloud forests and humid montane environments at elevations ranging from 1,000 to 2,500 meters. It thrives in areas with high rainfall and well-drained soils, often growing along stream banks or in shaded undergrowth. The plant is known for its distinctive orange flowers and is an important component of the local flora. Its distribution is limited to these specific ecological niches, making it a rare and specialized species.",
    "distribution_introduced_art_desc": "Abutilon bidentatum var. forrestii was mainly introduced to New Zealand. It was brought there during the 19th century as part of the broader introduction of ornamental plants. The plant is now considered an environmental weed in certain areas due to its aggressive growth habit. It thrives in disturbed soils and can outcompete native vegetation. Its spread has led to management efforts to control its impact on local ecosystems."
}
