{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta obovata",
    "plant_slug": "abuta-obovata",
    "plant_name_scientific": "abuta obovata",
    "intro": "Abuta obovata, commonly known as the African buttercup, is a flowering plant native to parts of Africa. It belongs to the family Euphorbiaceae and is characterized by its distinctive yellow flowers with a striking red center. The plant has heart-shaped, glossy leaves and produces small, fleshy fruits that contain seeds. It is often found in moist, shaded areas and is valued for its ornamental appeal. Abuta obovata is also known for its medicinal properties in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta obovata"
    },
    "taxonomy_art_desc": "Abuta obovata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Ranunculales, which consists of flowering plants known for their showy flowers and often containing toxic compounds. Its family is Menispermaceae, a group of flowering plants commonly known as the Menispermaceae or \"dutchman's pipe\" family, characterized by their climbing habit and distinctive floral structures. Its genus is Abuta, a group of flowering plants native to tropical regions of Africa and Asia, known for their medicinal properties. Its species is Abuta obovata, a specific plant within the genus Abuta, distinguished by its obovate leaves and is used in traditional medicine for its various health benefits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Colombia",
        "French Guiana",
        "Guyana",
        "Peru",
        "Suriname",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta obovata is primarily native to Brazil North, Colombia, French Guiana, Guyana, Peru, Suriname, and Venezuela. This plant is commonly found in the tropical regions of South America, particularly in the Amazon Basin. It thrives in moist, shaded environments within dense rainforests. Abuta obovata is known for its medicinal properties and is often used in traditional medicine by local communities. Its native distribution reflects its adaptation to the rich biodiversity of the region.",
    "distribution_introduced_art_desc": "Abuta obovata was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded environments such as forests and streamside areas. This plant is often associated with disturbed sites and has been observed spreading along trails and roadsides. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. It is important to monitor its distribution to prevent ecological disruption."
}
