{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hastatum",
    "plant_slug": "abutilon-hastatum",
    "plant_name_scientific": "abutilon hastatum",
    "intro": "Abutilon hastatum, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its fuzzy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an annual or perennial shrub, reaching heights of up to 3 meters. It thrives in full sun to partial shade and prefers well-drained soil. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hastatum is primarily native to South America, particularly in regions of Brazil, Paraguay, and Argentina. It thrives in tropical and subtropical climates, often found in moist, shaded areas such as forests and along stream banks. This plant is commonly associated with the Atlantic Forest biome, where it plays a role in local ecosystems. Its natural habitat includes humid lowlands and mountainous regions with well-drained soil. Abutilon hastatum is also occasionally found in parts of Central America, extending its native range slightly into that region.",
    "distribution_introduced_art_desc": "Abutilon hastatum was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was brought there for its ornamental value due to its attractive, maple-like leaves and showy yellow flowers. The plant thrives in warm, humid climates and is often found in disturbed areas such as roadsides and abandoned fields. It has become naturalized in some regions, spreading through both seeds and vegetative reproduction. However, it is considered invasive in certain areas, outcompeting native vegetation and altering local ecosystems."
}
