{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon xanti",
    "plant_slug": "abutilon-xanti",
    "plant_name_scientific": "abutilon xanti",
    "intro": "Abutilon xanti, commonly known as the Chinese lantern plant, is a deciduous shrub native to China. It is characterized by its heart-shaped, velvety leaves and its distinctive, lantern-like seed pods that turn red as they mature. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It thrives in full sun to partial shade and prefers well-drained soil. Abutilon xanti is often cultivated for its ornamental value and is popular in gardens for its vibrant autumn foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon xanti"
    },
    "taxonomy_art_desc": "Abutilon xanti belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Malvales, which consists of flowering plants with typically showy flowers and includes families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers that often have five petals. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon xanti, a specific type of Abutilon native to certain regions, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon xanti is primarily native to Mexico Northwest and Mexico Southwest. This species is found in the arid and semi-arid regions of these areas. It thrives in rocky and sandy soils, often growing in scrublands and along riverbanks. The plant is well adapted to the dry climate and can tolerate periods of drought. Its natural range is limited to these specific regions within Mexico.",
    "distribution_introduced_art_desc": "Abutilon xanti was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-shaped flowers. It was first brought there in the late 19th century by European settlers who admired its unique appearance. Despite its ornamental value, it has since become an invasive species, outcompeting native plants and altering local ecosystems. Its rapid growth and ability to spread through seeds have made it a significant ecological concern. Efforts to control its spread have been ongoing, but it remains a challenging weed in many areas."
}
