{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon otocarpum var. broomense",
    "plant_slug": "abutilon-otocarpum-var-broomense",
    "plant_name_scientific": "abutilon otocarpum var. broomense",
    "intro": "Abutilon otocarpum var. broomense, commonly known as broom hibiscus, is a flowering plant native to tropical regions of the Americas. It is characterized by its hairy stems and heart-shaped leaves that are often lobed. The plant produces showy, hibiscus-like flowers in shades of yellow, orange, and red, which bloom throughout the growing season. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Its fibrous bark has also been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon otocarpum var. broomense is primarily native to Southeast Asia, particularly countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in open areas, along roadsides, and in disturbed soils. This variant is known for its hairy stems and heart-shaped leaves, which are characteristic of the Abutilon genus. It thrives in humid climates with well-drained soil and is often used in traditional medicine. The plant's natural distribution reflects its adaptability to diverse environmental conditions in its native range.",
    "distribution_introduced_art_desc": "Abutilon otocarpum var. broomense was mainly introduced to Hawaii. It was introduced as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain areas of the island. It is considered an invasive species in some regions, outcompeting native vegetation. Its spread has raised concerns among conservationists due to its potential ecological impact."
}
