{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon oxyphyllum",
    "plant_slug": "abutilon-oxyphyllum",
    "plant_name_scientific": "abutilon oxyphyllum",
    "intro": "Abutilon oxyphyllum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its fuzzy, velvety leaves that give it its common name. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Abutilon oxyphyllum is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon oxyphyllum is primarily native to tropical and subtropical regions of Southeast Asia, including countries such as India, Thailand, and Indonesia. It thrives in humid climates and is commonly found in coastal areas and lowland forests. This plant is also present in parts of the Pacific Islands, where it grows in moist, shaded environments. It is often associated with riverine and mangrove ecosystems due to its preference for well-drained, nutrient-rich soils. Abutilon oxyphyllum is an important species in its native habitat, contributing to local biodiversity and ecological stability.",
    "distribution_introduced_art_desc": "Abutilon oxyphyllum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought there by early settlers or horticultural enthusiasts who appreciated its aesthetic value. Despite its beauty, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in tropical and subtropical climates, making it well-suited to the environmental conditions of the Pacific Islands. Its introduction highlights the dual role of ornamental plants in both enhancing landscapes and posing ecological risks."
}
