{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon diplotrichum",
    "plant_slug": "abutilon-diplotrichum",
    "plant_name_scientific": "abutilon diplotrichum",
    "intro": "Abutilon diplotrichum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that typically range in color from yellow to orange. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and fields. Its ornamental value makes it a popular choice for gardeners seeking a unique and textured plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon diplotrichum is primarily native to tropical and subtropical regions of South America, particularly Brazil, Paraguay, and Argentina. It is commonly found in lowland areas with humid climates, often growing in disturbed habitats such as roadsides, riverbanks, and open woodlands. This plant thrives in well-drained soils and is often associated with secondary vegetation. It is also present in parts of Central America, including Panama and Costa Rica. Due to its adaptability, it can sometimes be found in cultivated areas near its native range.",
    "distribution_introduced_art_desc": "Abutilon diplotrichum was mainly introduced to new environments as an ornamental plant due to its attractive foliage and flowering habits. It has been reported in several regions outside its native range, including parts of the United States and Australia. The plant spreads primarily through seed dispersal, often aided by wind and water. Its rapid growth and adaptability have led to concerns about its potential to become invasive in certain ecosystems. Proper management is recommended to prevent its spread in non-native areas."
}
