{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mollissimum",
    "plant_slug": "abutilon-mollissimum",
    "plant_name_scientific": "abutilon mollissimum",
    "intro": "Abutilon mollissimum, commonly known as velvetleaf or woolly abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its soft, velvety leaves that are often covered in fine hairs, giving it a distinctive texture. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in summer. It thrives in warm, humid climates and is often found in disturbed soils or along riverbanks. Abutilon mollissimum is also valued for its ornamental appeal and is sometimes cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon mollissimum"
    },
    "taxonomy_art_desc": "Abutilon mollissimum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, known for their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Malvales, which comprises plants with showy flowers and includes families such as Malvaceae, Theaceae, and Tropaeolaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with cotton-like fibers and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as velvetleaf or Chinese lantern, characterized by their hairy leaves and showy flowers. Its species is Abutilon mollissimum, a specific type of Abutilon known for its soft, hairy leaves and distinctive orange or red flowers, often cultivated as an ornamental plant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Colombia",
        "Ecuador",
        "Peru",
        "Venezuela"
    ],
    "distribution_introduced": [
        "Cuba",
        "Puerto Rico",
        "Queensland"
    ],
    "distribution_native_art_desc": "Abutilon mollissimum is primarily native to Bolivia, Colombia, Ecuador, Peru, and Venezuela. This species is commonly found in tropical and subtropical regions within these countries. It thrives in areas with warm climates and well-drained soils. The plant is often encountered in forested areas or along riverbanks. Its native distribution reflects its adaptation to the diverse ecosystems of South America.",
    "distribution_introduced_art_desc": "Abutilon mollissimum was mainly introduced to Cuba, Puerto Rico, and Queensland. It is a species that has been intentionally or accidentally brought to these regions, likely for ornamental or horticultural purposes. The plant is known for its hairy leaves and showy flowers, making it a desirable addition to gardens. Its introduction has led to its establishment in these areas, sometimes becoming invasive. The distribution highlights its adaptability to different climates and environments."
}
