{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon chiriquinum",
    "plant_slug": "abutilon-chiriquinum",
    "plant_name_scientific": "abutilon chiriquinum",
    "intro": "Abutilon chiriquinum, commonly known as the \"velvetleaf abutilon,\" is a flowering plant native to Central America. It is characterized by its hairy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an annual or perennial shrub, reaching heights of up to 2 meters. Its fibrous roots and robust stems make it adaptable to various soil types, though it prefers well-drained conditions. Abutilon chiriquinum is often cultivated for ornamental purposes due to its vibrant blooms and unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon chiriquinum is primarily native to Central America, specifically found in countries such as Costa Rica, Panama, and parts of Nicaragua. It thrives in tropical and subtropical regions, often growing in humid lowland areas. This plant is commonly found in secondary forests, along stream banks, and in disturbed habitats. It is well adapted to the warm and moist climate of its native range. Due to its ornamental value, it has also been introduced to other parts of the world.",
    "distribution_introduced_art_desc": "Abutilon chiriquinum was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was brought there during the late 19th or early 20th century by horticulturists and gardeners seeking to diversify local plant collections. The plant has since become naturalized in certain areas, spreading through both seed dispersal and vegetative propagation. It is often found growing in disturbed soils and along roadsides, where it can form dense stands. Despite its ornamental value, it is considered a potential weed in some regions due to its rapid growth and ability to colonize new areas."
}
