{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon australiense",
    "plant_slug": "abutilon-australiense",
    "plant_name_scientific": "abutilon australiense",
    "intro": "Abutilon australiense, commonly known as the Australian velvetleaf, is a flowering plant native to Australia. It is characterized by its broad, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an annual or perennial herb, reaching heights of up to 2 meters. It thrives in warm, temperate climates and is often found in disturbed soils or along roadsides. The flowers attract pollinators such as bees and butterflies, contributing to its ecological significance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon australiense"
    },
    "taxonomy_art_desc": "Abutilon australiense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some ferns, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Malvales, which includes plants such as cotton and okra, known for their showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants with a distinctive calyx that often persists after flowering. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy, lantern-shaped flowers. Its species is Abutilon australiense, a specific type of velvetleaf native to Australia, known for its ornamental value and ability to thrive in various environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India",
        "Lesser Sunda Is.",
        "New Caledonia",
        "Northern Territory",
        "Queensland",
        "Sulawesi",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon australiense is primarily native to India, the Lesser Sunda Islands, New Caledonia, the Northern Territory, Queensland, Sulawesi, and Western Australia. This plant is found in a variety of habitats across these regions, including coastal areas and tropical climates. It is commonly associated with sandy soils and open vegetation. The species exhibits a wide geographic range within its native distribution. Its presence in these regions highlights its adaptability to different environmental conditions.",
    "distribution_introduced_art_desc": "Abutilon australiense was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since become naturalized in certain regions, particularly in coastal and riverine areas where it thrives in moist, temperate climates. The plant's rapid growth and ability to spread through both seeds and vegetative reproduction have contributed to its establishment in native ecosystems. While it is not considered invasive in all areas, it can outcompete native vegetation in disturbed sites. Its distribution is primarily limited by climate conditions and human activity, though it continues to expand in suitable habitats."
}
