{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hirsutum",
    "plant_slug": "abutilon-hirsutum",
    "plant_name_scientific": "abutilon hirsutum",
    "intro": "Abutilon hirsutum, commonly known as the velvetleaf or Indian mallow, is a perennial shrub native to the Americas. It is characterized by its fuzzy, velvety leaves that give it its common name, and it produces showy, lantern-shaped flowers in shades of yellow, orange, or red. The plant thrives in warm climates and is often found in tropical and subtropical regions. It belongs to the Malvaceae family, which includes other plants like cotton and hibiscus. Its hairy stems and broad leaves make it a distinctive and ornamental plant in botanical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Corynabutilon",
        "species": "Corynabutilon hirsutum"
    },
    "taxonomy_art_desc": "Abutilon hirsutum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and cotton-like fibers. Its genus is Corynabutilon, a group of flowering plants that are closely related to the genus Abutilon, often characterized by their ornamental value and hairy foliage. Its species is Corynabutilon hirsutum, a specific type of plant known for its hairy appearance and is often cultivated for its ornamental qualities.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Chile Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hirsutum is primarily native to Chile Central. It is commonly found in the central regions of Chile, including the Valparaiso and Maule regions. This plant typically grows in coastal areas and along the edges of forests. It thrives in temperate climates with moderate rainfall. Its native distribution is closely associated with the natural vegetation of central Chile.",
    "distribution_introduced_art_desc": "Abutilon hirsutum was mainly introduced to the United States as an ornamental plant due to its attractive, maple-like leaves and showy flowers. It is commonly found in gardens and along roadsides in regions with warm climates. The plant has also been introduced to parts of Australia and South Africa, where it has become naturalized in some areas. Its rapid growth and adaptability have led to concerns about its potential invasiveness in certain environments. Despite its beauty, proper management is recommended to prevent it from becoming a weed in non-target areas."
}
