{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon micropetalum",
    "plant_slug": "abutilon-micropetalum",
    "plant_name_scientific": "abutilon micropetalum",
    "intro": "Abutilon micropetalum, commonly known as the small-petalled abutilon, is a flowering plant native to South America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its hairy stems and palmate leaves, which are often lobed and have a velvety texture. Its flowers are typically yellow or orange, with five petals that are smaller than those of other abutilon species. It is often cultivated as an ornamental plant due to its attractive foliage and showy blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon micropetalum"
    },
    "taxonomy_art_desc": "Abutilon micropetalum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their showy, lantern-shaped flowers. Its species is Abutilon micropetalum, a specific type of Abutilon known for its small, petal-like structures and is native to certain regions of South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon micropetalum is primarily native to Queensland. It is found in the tropical and subtropical regions of this state. The plant typically grows in coastal areas and lowland rainforests. It is well adapted to the humid and warm climate of Queensland. Its distribution is limited to specific habitats within the region.",
    "distribution_introduced_art_desc": "Abutilon micropetalum was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It has been reported in parts of Southeast Asia, including Indonesia and the Philippines, where it thrives in tropical and subtropical environments. The plant is commonly found in disturbed habitats such as roadsides, abandoned fields, and forest edges. Its rapid growth and ability to spread through both seeds and vegetative reproduction contribute to its invasive potential in new regions. However, its distribution remains limited compared to other introduced species in the same region."
}
