{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon striatum f. palmatifidum",
    "plant_slug": "abutilon-striatum-f-palmatifidum",
    "plant_name_scientific": "abutilon striatum f. palmatifidum",
    "intro": "Abutilon striatum f. palmatifidum, commonly known as the palmate abutilon, is a cultivar of the velvetleaf plant. It is a deciduous shrub characterized by its broad, palmately lobed leaves that give it a distinctive, maple-like appearance. The plant produces showy, bell-shaped flowers in shades of yellow to orange, typically appearing in late spring to early summer. It thrives in full sun to partial shade and is often cultivated for its ornamental value in gardens. The species is native to tropical and subtropical regions and is known for its adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon striatum f. palmatifidum is primarily native to Central America, Mexico, and parts of the Caribbean. This plant is commonly found in tropical and subtropical regions, particularly in areas with warm, humid climates. It thrives in coastal areas and along riverbanks, where it can receive ample sunlight and moisture. The species is well adapted to sandy or loamy soils and is often seen in disturbed habitats. Its native range includes countries such as Belize, Guatemala, and Honduras.",
    "distribution_introduced_art_desc": "Abutilon striatum f. palmatifidum was mainly introduced to the United States, particularly in the southern regions. It is commonly found in Florida, Texas, and parts of California. This plant is often cultivated as an ornamental due to its attractive foliage and flowers. It has been reported in disturbed areas such as roadsides and vacant lots. However, it is not considered invasive in most regions where it is introduced."
}
