{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon rugosulum",
    "plant_slug": "abutilon-rugosulum",
    "plant_name_scientific": "abutilon rugosulum",
    "intro": "Abutilon rugosulum, commonly known as the rough abutilon, is a flowering plant native to the southern United States and parts of Mexico. It is a shrub or small tree that typically grows to a height of 1 to 3 meters. The plant features hairy, ovate leaves with a rough texture, and it produces showy, lantern-shaped yellow flowers. Its fruits are capsules that split open to release small, hairy seeds. Abutilon rugosulum is often cultivated for its ornamental value and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon rugosulum is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, and Mozambique. It is commonly found in savanna and woodland habitats, often growing along riverbanks and in open grasslands. This plant thrives in regions with a tropical or subtropical climate and is adapted to seasonal rainfall patterns. It is also known to occur in parts of the Arabian Peninsula and the Horn of Africa. Its native range extends into some areas of Madagascar as well.",
    "distribution_introduced_art_desc": "Abutilon rugosulum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, disturbed habitats such as stream banks and forest edges. This species has been reported in Washington, Oregon, and northern California. It is considered an invasive plant in some areas due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded in recent decades, raising concerns among land managers and conservationists."
}
