{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta grisebachii",
    "plant_slug": "abuta-grisebachii",
    "plant_name_scientific": "abuta grisebachii",
    "intro": "Abuta grisebachii, commonly known as the gray abuta, is a flowering plant native to the Andes region of South America. It belongs to the family Euphorbiaceae and is characterized by its striking, showy inflorescences. The plant typically grows in mountainous areas with cool, moist climates, often at elevations between 2,000 and 4,000 meters. Its leaves are alternate, simple, and often have a waxy texture, while its stems are usually hairy. The species is valued for its ornamental appeal and has been studied for potential medicinal properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta grisebachii"
    },
    "taxonomy_art_desc": "Abuta grisebachii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Ranunculales, a group of flowering plants that includes many herbs and shrubs, often with showy flowers and a wide range of habitats. Its family is Menispermaceae, commonly known as the pipevine family, which includes climbing plants with distinctive leaves and toxic compounds. Its genus is Abuta, a group of flowering plants native to tropical regions, characterized by their woody stems and medicinal properties. Its species is Abuta grisebachii, a specific plant within the genus Abuta, known for its unique morphological traits and potential medicinal uses.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Brazil West-Central",
        "Colombia",
        "Peru",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta grisebachii is primarily native to Brazil North, Brazil West-Central, Colombia, Peru, and Venezuela. This plant is found in the tropical regions of these countries, typically in humid and forested areas. It thrives in environments with high rainfall and warm temperatures. The species is commonly associated with understory vegetation in primary and secondary forests. Its distribution reflects its adaptation to the diverse ecosystems of the Amazon and Andean regions.",
    "distribution_introduced_art_desc": "Abuta grisebachii was mainly introduced to regions with warm, humid climates where it can thrive in well-drained soils. It is commonly found in areas with moderate to high rainfall, making it suitable for tropical and subtropical environments. This plant is often cultivated for its ornamental value due to its attractive foliage and unique flowers. It has been introduced to several parts of the world, including Southeast Asia and parts of the Pacific Islands. However, its spread is limited by its specific ecological requirements and climate preferences."
}
