{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sachetianum",
    "plant_slug": "abutilon-sachetianum",
    "plant_name_scientific": "abutilon sachetianum",
    "intro": "Abutilon sachetianum, commonly known as the velvetleaf abutilon, is a shrub native to tropical and subtropical regions. It is characterized by its hairy, velvety leaves that give it a distinctive texture. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in well-drained soil and requires full sun to partial shade. Abutilon sachetianum is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon sachetianum"
    },
    "taxonomy_art_desc": "Abutilon sachetianum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants known for their showy, lantern-shaped flowers and are often cultivated as ornamental plants. Its species is Abutilon sachetianum, a specific type of plant within the genus Abutilon, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Marquesas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sachetianum is primarily native to the Marquesas. This plant is found in the tropical regions of the South Pacific, specifically within the Marquesas Islands. It thrives in humid, coastal environments with well-drained soil. The species is commonly associated with secondary forests and disturbed habitats. Its native distribution is limited to this remote archipelago, making it a unique component of the local flora.",
    "distribution_introduced_art_desc": "Abutilon sachetianum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It was likely brought there during the 19th or early 20th century by horticulturalists and gardeners seeking to introduce exotic plant species. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. The plant thrives in tropical and subtropical climates, making it well-suited to the environmental conditions of the Pacific Islands. Its introduction highlights the dual role of ornamental plants in both beautifying landscapes and posing ecological risks."
}
