{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta panurensis",
    "plant_slug": "abuta-panurensis",
    "plant_name_scientific": "abuta panurensis",
    "intro": "Abuta panurensis, commonly known as the Peruvian buttercup, is a flowering plant native to the Andean regions of South America. It belongs to the family Euphorbiaceae and is characterized by its distinctive yellow flowers and milky sap. The plant typically grows in mountainous areas with cool, moist climates. Its leaves are alternate, simple, and often have a waxy texture. Abuta panurensis is valued for its ornamental appeal and has been used in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta panurensis"
    },
    "taxonomy_art_desc": "Abuta panurensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often having jointed stems. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often associated with primitive floral structures. Its order is Ranunculales, which includes plants with showy flowers and often contains species that are toxic or have medicinal properties. Its family is Menispermaceae, a group of woody plants commonly found in tropical and subtropical regions, known for their climbing habits and complex chemical compounds. Its genus is Abuta, a group of flowering plants native to tropical regions, typically characterized by their climbing growth and the presence of certain alkaloids. Its species is Abuta panurensis, a specific plant within the genus Abuta, known for its unique morphological features and potential ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Brazil West-Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta panurensis is primarily native to Brazil North and Brazil West-Central. This plant is found in the tropical rainforests of these regions. It thrives in humid, shaded environments within the Amazon Basin. The species is commonly associated with secondary growth areas and forest edges. Its distribution is limited to specific ecological niches within these geographic areas.",
    "distribution_introduced_art_desc": "Abuta panurensis was mainly introduced to the Andean regions of South America, particularly in countries such as Peru, Bolivia, and Ecuador. It is commonly found in high-altitude grasslands and rocky slopes, where it thrives in cool and temperate climates. This plant is valued for its medicinal properties and has been used by local communities for centuries. Its introduction to these areas is largely due to traditional knowledge and ecological adaptation. However, its distribution remains limited to specific altitudinal zones due to environmental constraints."
}
