{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pseudogiganteum",
    "plant_slug": "abutilon-pseudogiganteum",
    "plant_name_scientific": "abutilon pseudogiganteum",
    "intro": "Abutilon pseudogiganteum, commonly known as the giant velvetleaf, is a herbaceous plant native to tropical regions of South America. It is characterized by its large, heart-shaped leaves that are velvety to the touch, giving it its common name. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often appearing in clusters. It thrives in warm, humid climates and is often found in moist, disturbed habitats such as along riverbanks. Due to its rapid growth and invasive potential, it is sometimes considered a weed in agricultural areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pseudogiganteum is primarily native to the tropical regions of South America, particularly Brazil, Colombia, and Peru. It thrives in humid, warm climates and is commonly found in lowland forests and along riverbanks. This species is also present in parts of Central America, including Panama and Costa Rica. It prefers well-drained soils and full sun to partial shade. Due to its ornamental value, it has been introduced to other tropical regions around the world.",
    "distribution_introduced_art_desc": "Abutilon pseudogiganteum was mainly introduced to regions with warm climates and well-drained soils, often as an ornamental plant due to its showy flowers and distinctive foliage. It is commonly found in gardens and landscaped areas in tropical and subtropical regions such as parts of Florida, Hawaii, and the Caribbean. The plant thrives in full sun to partial shade and requires moderate water, making it adaptable to various garden settings. Its rapid growth and ability to spread through seeds and vegetative propagation have led to its establishment in some natural areas. However, it is considered a potential invasive species in certain regions where it can outcompete native vegetation."
}
