{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon bidentatum",
    "plant_slug": "abutilon-bidentatum",
    "plant_name_scientific": "abutilon bidentatum",
    "intro": "Abutilon bidentatum, commonly known as the two-toothed abutilon, is a flowering plant native to South America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its hairy stems and heart-shaped leaves with distinctive double-toothed margins. It produces showy, lantern-shaped flowers that range in color from yellow to orange. Abutilon bidentatum is often grown as an ornamental plant due to its unique foliage and attractive blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon bidentatum"
    },
    "taxonomy_art_desc": "Abutilon bidentatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Malvales, which includes plants with flowers that have five petals and often produce capsules as fruits. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and okra, characterized by their hairy stems and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" often found in tropical and subtropical regions. Its species is Abutilon bidentatum, a specific type of plant within the genus Abutilon, distinguished by its unique leaf shape and floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Bangladesh",
        "Botswana",
        "Burundi",
        "Caprivi Strip",
        "Chad",
        "Djibouti",
        "DR Congo",
        "Egypt",
        "Eritrea",
        "Ethiopia",
        "India",
        "Kenya",
        "Mozambique",
        "Myanmar",
        "Namibia",
        "Niger",
        "Oman",
        "Pakistan",
        "Rwanda",
        "Saudi Arabia",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "West Himalaya",
        "Yemen",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon bidentatum is primarily native to Angola, Bangladesh, Botswana, Burundi, Caprivi Strip, Chad, Djibouti, DR Congo, Egypt, Eritrea, Ethiopia, India, Kenya, Mozambique, Myanmar, Namibia, Niger, Oman, Pakistan, Rwanda, Saudi Arabia, Somalia, Sudan-South Sudan, Tanzania, Uganda, West Himalaya, Yemen, Zambia, and Zimbabwe. This plant is commonly found in arid and semi-arid regions across these countries. It thrives in sandy or rocky soils and is often associated with dry savannas and shrublands. Abutilon bidentatum is a shrub or small tree that can reach heights of up to 3 meters. It is known for its ornamental value and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Abutilon bidentatum was mainly introduced to coastal and disturbed areas in the southeastern United States, particularly in Florida and along the Gulf Coast. It thrives in sandy soils and is often found in dunes, roadsides, and other open habitats. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to ecological concerns as it can alter local ecosystems and reduce biodiversity. Efforts are ongoing to control its spread and manage its impact on native plant communities."
}
