{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon indicum subsp. indicum",
    "plant_slug": "abutilon-indicum-subsp-indicum",
    "plant_name_scientific": "abutilon indicum subsp. indicum",
    "intro": "Abutilon indicum subsp. indicum, commonly known as the velvetleaf or Indian abutilon, is a shrub native to tropical and subtropical regions. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces showy, bell-shaped flowers that range in color from yellow to orange. It thrives in well-drained soil and requires full sun to partial shade. This species is often used in ornamental horticulture due to its attractive foliage and seasonal blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon indicum"
    },
    "taxonomy_art_desc": "Abutilon indicum subsp. indicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Malvales, which comprises plants with showy flowers, often with five petals, and includes economically significant families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with cotton-like fibers and showy flowers. Its genus is Abutilon, a group of flowering plants known for their distinctive, lantern-shaped flowers and hairy leaves. Its species is Abutilon indicum, a specific plant within the genus Abutilon that is native to parts of Asia and is characterized by its hairy stems and vibrant yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Andaman Is.",
        "Assam",
        "Bangladesh",
        "Borneo",
        "Cambodia",
        "Caroline Is.",
        "China South-Central",
        "China Southeast",
        "East Himalaya",
        "Gilbert Is.",
        "Hainan",
        "Howland-Baker Is.",
        "India",
        "Jawa",
        "Kazan-retto",
        "Laccadive Is.",
        "Laos",
        "Lesser Sunda Is.",
        "Malaya",
        "Maldives",
        "Maluku",
        "Marianas",
        "Mauritius",
        "Myanmar",
        "Nansei-shoto",
        "Nauru",
        "Nepal",
        "Nicobar Is.",
        "Ogasawara-shoto",
        "Oman",
        "Pakistan",
        "Palestine",
        "Philippines",
        "Rodrigues",
        "Réunion",
        "South China Sea",
        "Sri Lanka",
        "Sulawesi",
        "Taiwan",
        "Thailand",
        "Vanuatu",
        "Vietnam"
    ],
    "distribution_introduced": [
        "Brazil North",
        "Chagos Archipelago",
        "Colombia",
        "Comoros",
        "Cuba",
        "Fiji",
        "Haiti",
        "Hawaii",
        "Iraq",
        "Jamaica",
        "Leeward Is.",
        "Madeira",
        "Niue",
        "Norfolk Is.",
        "Peru",
        "Puerto Rico",
        "Rwanda",
        "Seychelles",
        "Society Is.",
        "Trinidad-Tobago",
        "Tubuai Is.",
        "Turks-Caicos Is.",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abutilon indicum subsp. indicum is primarily native to Afghanistan, Andaman Is., Assam, Bangladesh, Borneo, Cambodia, Caroline Is., China South-Central, China Southeast, East Himalaya, Gilbert Is., Hainan, Howland-Baker Is., India, Jawa, Kazan-retto, Laccadive Is., Laos, Lesser Sunda Is., Malaya, Maldives, Maluku, Marianas, Mauritius, Myanmar, Nansei-shoto, Nauru, Nepal, Nicobar Is., Ogasawara-shoto, Oman, Pakistan, Palestine, Philippines, Rodrigues, Réunion, South China Sea, Sri Lanka, Sulawesi, Taiwan, Thailand, Vanuatu, and Vietnam. This species is widely distributed across South and Southeast Asia, as well as parts of the Indian Ocean and Pacific regions. It thrives in tropical and subtropical climates, often found in coastal areas, forests, and disturbed habitats. The plant is commonly associated with human-modified landscapes and is sometimes cultivated for ornamental purposes. Its broad native range reflects its adaptability to diverse ecological conditions.",
    "distribution_introduced_art_desc": "Abutilon indicum subsp. indicum was mainly introduced to Brazil North, Chagos Archipelago, Colombia, Comoros, Cuba, Fiji, Haiti, Hawaii, Iraq, Jamaica, Leeward Is., Madeira, Niue, Norfolk Is., Peru, Puerto Rico, Rwanda, Seychelles, Society Is., Trinidad-Tobago, Tubuai Is., Turks-Caicos Is., and Windward Is. It is primarily found in tropical and subtropical regions, often growing in coastal areas or disturbed habitats. This species has been reported as an invasive plant in several of these locations, potentially outcompeting native vegetation. Its introduction is likely due to human activities such as horticulture, accidental seed dispersal, or shipping. The distribution highlights its adaptability to diverse environments across the globe."
}
