{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon arenarium",
    "plant_slug": "abutilon-arenarium",
    "plant_name_scientific": "abutilon arenarium",
    "intro": "Abutilon arenarium, commonly known as sand verbena, is a flowering plant native to arid and semi-arid regions of the Americas. It is characterized by its hairy, glandular leaves and clusters of small, yellowish flowers that bloom in summer. The plant typically grows as a shrub or subshrub, often forming dense mats in sandy or rocky soils. Its fibrous roots help stabilize soil, making it useful for erosion control in degraded landscapes. Abutilon arenarium is adapted to withstand drought and high temperatures, thriving in environments with minimal water availability.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon arenarium"
    },
    "taxonomy_art_desc": "Abutilon arenarium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological features. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and hibiscus. Its genus is Abutilon, a group of flowering plants often referred to as \"Chinese lanterns\" due to their distinctive seed pods. Its species is Abutilon arenarium, a specific type of plant known for its hairy stems and showy flowers, typically found in arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon arenarium is primarily native to Queensland. It is found in the arid and semi-arid regions of the state, particularly in the central and western parts. This plant thrives in sandy soils and is commonly found in coastal and inland dunes. It is well adapted to the harsh environmental conditions of the region. Its distribution is limited to specific habitats within Queensland due to its specialized ecological requirements.",
    "distribution_introduced_art_desc": "Abutilon arenarium was mainly introduced to South Africa, where it has become an invasive species. It is commonly found in coastal areas and sandy soils, often outcompeting native vegetation. The plant spreads through seeds dispersed by wind, water, and human activity. It is particularly problematic in agricultural and natural habitats due to its rapid growth and ability to form dense stands. Control measures include mechanical removal and the use of herbicides, though it remains a persistent challenge in invaded areas."
}
