{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon umbellatum subsp. occidentalis",
    "plant_slug": "abutilon-umbellatum-subsp-occidentalis",
    "plant_name_scientific": "abutilon umbellatum subsp. occidentalis",
    "intro": "Abutilon umbellatum subsp. occidentalis, commonly known as the western Chinese lantern plant, is a deciduous shrub native to western North America. It is characterized by its showy, lantern-shaped bracts that range in color from yellow to orange, which are not actually flowers but modified leaves. The plant produces small, inconspicuous green flowers that are followed by the distinctive bracts. It thrives in full sun to partial shade and prefers well-drained soil, making it a popular choice for ornamental gardens. The species is also valued for its adaptability to various climate conditions and its ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon umbellatum subsp. occidentalis is primarily native to the western United States, particularly California. It is commonly found in coastal areas and canyons along the Pacific coast. This subspecies thrives in moist, temperate climates and is often associated with coastal scrub and chaparral habitats. It is also present in parts of Oregon and Baja California, Mexico. The plant is well adapted to the mild, foggy conditions typical of its native range.",
    "distribution_introduced_art_desc": "Abutilon umbellatum subsp. occidentalis was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, fields, and along riverbanks. This subspecies is often cultivated as an ornamental plant due to its attractive, lantern-shaped flowers. It thrives in well-drained soils and full sun, making it adaptable to various environmental conditions. However, it can become invasive in certain regions if not managed properly."
}
