{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon anderssonianum",
    "plant_slug": "abutilon-anderssonianum",
    "plant_name_scientific": "abutilon anderssonianum",
    "intro": "Abutilon anderssonianum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its broad, heart-shaped leaves that are often covered in a fine, velvety texture. The plant produces clusters of small, yellowish-green flowers that bloom in the summer months. It is often cultivated as an ornamental plant due to its attractive foliage and unique appearance. Abutilon anderssonianum prefers well-drained soil and full to partial sunlight, making it suitable for warm climate gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon anderssonianum is primarily native to the island of Madagascar. It is found in various habitats across the island, including dry forests and rocky areas. This plant is adapted to the unique climate and soil conditions of Madagascar. It is part of the Malvaceae family, which includes other economically important plants. Its native distribution is restricted to Madagascar, where it grows in specific ecological niches.",
    "distribution_introduced_art_desc": "Abutilon anderssonianum was mainly introduced to ornamental horticulture and landscaping due to its attractive, lantern-shaped flowers and its ability to thrive in a variety of environmental conditions. It is commonly used in garden settings for its aesthetic value and its relatively low maintenance requirements. This plant is often cultivated in tropical and subtropical regions where it can grow as a shrub or small tree. Its introduction has led to its establishment in some non-native areas, where it may pose ecological risks if not managed properly. Despite its ornamental appeal, it is important to monitor its spread to prevent potential invasiveness."
}
