{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon thompsonii",
    "plant_slug": "abutilon-thompsonii",
    "plant_name_scientific": "abutilon thompsonii",
    "intro": "Abutilon thompsonii, commonly known as the velvetleaf abutilon, is a deciduous shrub native to the southwestern United States and northern Mexico. It is characterized by its soft, hairy leaves that give it a velvety texture, and its showy, lantern-shaped flowers that range in color from yellow to orange. The plant thrives in well-drained soils and full sun, making it suitable for arid and semi-arid climates. It is often used in xeriscaping due to its drought tolerance and ornamental value. Abutilon thompsonii is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon thompsonii is primarily native to the southwestern United States and northwestern Mexico. It is found in areas such as Arizona, New Mexico, and parts of California. This plant typically grows in desert scrub and rocky habitats. It is commonly associated with the Sonoran and Chihuahuan Deserts. Its distribution is limited to specific arid and semi-arid regions within these areas.",
    "distribution_introduced_art_desc": "Abutilon thompsonii was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, stream banks, and forest edges. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It thrives in moist, well-drained soils and can tolerate a range of light conditions. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
