{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon ramosissimum",
    "plant_slug": "abutilon-ramosissimum",
    "plant_name_scientific": "abutilon ramosissimum",
    "intro": "Abutilon ramosissimum, commonly known as the velvetleaf abutilon, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant thrives in well-drained soils and full sun, making it suitable for xeriscaping in arid regions. Its rapid growth habit and ability to tolerate drought conditions make it a popular choice for ornamental landscaping. The plant also produces small, green, capsule-like fruits that contain numerous seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon ramosissimum is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Texas. This plant thrives in arid and semi-arid environments, often growing in rocky soils and along dry streambeds. It is commonly associated with desert and chaparral habitats. Its native range includes areas with mild winters and hot, dry summers.",
    "distribution_introduced_art_desc": "Abutilon ramosissimum was mainly introduced to areas with warm, dry climates where it can thrive in well-drained soils. It is commonly found in regions such as southern California, Arizona, and parts of the southwestern United States. This plant is often used in landscaping due to its ornamental value and ability to withstand drought conditions. It has been introduced to various parts of the world, including Mediterranean climates and tropical regions. However, it is considered an invasive species in some areas, posing a threat to native plant communities."
}
