{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sandwicense",
    "plant_slug": "abutilon-sandwicense",
    "plant_name_scientific": "abutilon sandwicense",
    "intro": "Abutilon sandwicense, commonly known as the Kona abutilon, is a flowering plant native to the Hawaiian Islands. It is a shrub or small tree that typically grows in coastal areas, characterized by its hairy stems and broad, heart-shaped leaves. The plant produces clusters of small, yellowish-green flowers that bloom in late summer to early fall. It is adapted to the dry, sunny conditions of its native habitat and is often found in coastal dunes and rocky slopes. Due to habitat loss and invasive species, it is considered endangered and is protected in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon sandwicense"
    },
    "taxonomy_art_desc": "Abutilon sandwicense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a variety of floral structures. Its order is Malvales, which consists of flowering plants with distinctive flowers and includes families such as Malvaceae, Theaceae, and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants known for their hairy leaves and showy, lantern-shaped flowers, often referred to as \"Chinese lanterns.\" Its species is Abutilon sandwicense, a specific type of Abutilon native to Hawaii, characterized by its unique morphology and ecological adaptation to the island's environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Hawaii"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sandwicense is primarily native to Hawaii. This species is found exclusively on the island of Maui, where it grows in coastal areas and rocky habitats. It is a member of the Malvaceae family and is adapted to the unique environmental conditions of the Hawaiian archipelago. Due to its restricted range and habitat specificity, it is considered a rare and endemic plant. Conservation efforts are ongoing to protect this native species from threats such as habitat loss and invasive species.",
    "distribution_introduced_art_desc": "Abutilon sandwicense was mainly introduced to Hawaii. It is a flowering plant native to the Hawaiian Islands. The plant is commonly found in coastal areas and disturbed habitats. It has become a common weed in agricultural fields and along roadsides. Its introduction has had a significant impact on local ecosystems."
}
