{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon dinteri",
    "plant_slug": "abutilon-dinteri",
    "plant_name_scientific": "abutilon dinteri",
    "intro": "Abutilon dinteri, commonly known as the Dinter's velvetleaf, is a flowering plant native to southern Africa. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its heart-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in arid and semi-arid environments, often growing in rocky soils. Due to its unique appearance and ecological significance, it is sometimes cultivated in botanical gardens for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon dinteri"
    },
    "taxonomy_art_desc": "Abutilon dinteri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and diverse ecological roles. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and is widely distributed across various habitats. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon dinteri, a specific type of plant within the genus Abutilon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces",
        "Namibia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon dinteri is primarily native to the Cape Provinces and Namibia. This species is found in the arid and semi-arid regions of these areas. It thrives in rocky and sandy soils, often growing in shrubland or along riverbanks. The plant is well adapted to the dry climate and can tolerate periods of drought. Its natural habitat includes parts of southern Africa where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon dinteri was mainly introduced to South Africa, particularly in the Western Cape region. It is commonly found in coastal areas and fynbos vegetation. This plant has been introduced to various parts of the country as a ornamental species due to its attractive foliage. It thrives in well-drained soils and requires full sun to partial shade. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
