{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sundaicum",
    "plant_slug": "abutilon-sundaicum",
    "plant_name_scientific": "abutilon sundaicum",
    "intro": "Abutilon sundaicum, commonly known as the Java cotton or velvetleaf, is a flowering plant native to Southeast Asia. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It is often cultivated as an ornamental plant due to its attractive foliage and blooms. Abutilon sundaicum is typically found in tropical and subtropical regions, growing in moist, well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sundaicum is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in coastal areas and lowland forests. This plant thrives in humid climates with well-drained soil, making it well-suited for coastal environments. It is often seen growing along beaches, dunes, and in disturbed habitats. Its native range extends to parts of Oceania as well, where it is adapted to similar environmental conditions.",
    "distribution_introduced_art_desc": "Abutilon sundaicum was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage and flowers. It is commonly found in areas with warm climates, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant is often cultivated in gardens and as a decorative plant in urban landscapes. Its introduction has led to its establishment in some regions where it can become invasive. However, it is generally not considered a major ecological threat in most areas where it is grown."
}
