{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon indicum var. macrophyllum",
    "plant_slug": "abutilon-indicum-var-macrophyllum",
    "plant_name_scientific": "abutilon indicum var. macrophyllum",
    "intro": "Abutilon indicum var. macrophyllum, commonly known as the Indian velvet tree, is a deciduous shrub or small tree native to the Indian subcontinent. It is characterized by its large, heart-shaped leaves that can grow up to 20 centimeters in length. The plant produces showy, lantern-shaped flowers in shades of yellow to orange, which bloom in late summer. Its fruit is a three-lobed capsule that splits open to release seeds. The plant is often cultivated for its ornamental value and is adapted to a variety of soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon indicum var. macrophyllum is primarily native to Southeast Asia, including countries such as India, Thailand, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in humid climates and is often associated with disturbed habitats like roadsides and forest edges. It is also present in parts of Indonesia and the Philippines. Its native range extends into some regions of Africa and the Pacific Islands.",
    "distribution_introduced_art_desc": "Abutilon indicum var. macrophyllum was mainly introduced to the coastal regions of southern California and Baja California. It was brought there for its ornamental value due to its showy, lantern-shaped flowers and its ability to thrive in coastal conditions. The plant is often found growing along dunes and in disturbed soils near the shoreline. It has become naturalized in these areas, forming dense stands that can impact native vegetation. Its introduction has raised concerns about its potential to invade and alter local ecosystems."
}
