{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon angulatum var. macrophyllum",
    "plant_slug": "abutilon-angulatum-var-macrophyllum",
    "plant_name_scientific": "abutilon angulatum var. macrophyllum",
    "intro": "Abutilon angulatum var. macrophyllum, commonly known as the large-leaf velvetleaf, is a flowering plant native to South America. It is characterized by its large, heart-shaped leaves that are soft and fuzzy to the touch. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often appearing in clusters. It thrives in tropical and subtropical climates and is often cultivated as an ornamental plant. The species is part of the Malvaceae family, which includes hibiscus and cotton.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon angulatum"
    },
    "taxonomy_art_desc": "Abutilon angulatum var. macrophyllum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants that often have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with palmate leaves and hairy stems. Its genus is Abutilon, a group of flowering plants that typically have soft, hairy stems and showy, lantern-shaped flowers. Its species is Abutilon angulatum, a plant known for its distinctive leaf shape and is a species within the genus Abutilon.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Aldabra",
        "KwaZulu-Natal",
        "Madagascar",
        "Malawi",
        "Mozambique",
        "Namibia",
        "Northern Provinces",
        "Tanzania",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon angulatum var. macrophyllum is primarily native to Aldabra, KwaZulu-Natal, Madagascar, Malawi, Mozambique, Namibia, Northern Provinces, Tanzania, and Zimbabwe. This plant is commonly found in coastal and inland regions across these areas. It thrives in sandy soils and often grows near the shoreline or in dry, open habitats. The species is well adapted to the arid and semi-arid conditions prevalent in many of its native regions. Its distribution reflects its preference for tropical and subtropical climates with adequate sunlight.",
    "distribution_introduced_art_desc": "Abutilon angulatum var. macrophyllum was mainly introduced to ornamental horticulture due to its attractive, lantern-shaped leaves and showy flowers. It is commonly cultivated in gardens and landscapes for its aesthetic value. The plant thrives in warm, humid climates and is often used as a decorative shrub or small tree. Its introduction has led to its presence in various regions outside its native range. However, it is important to monitor its spread to prevent potential ecological impacts."
}
