{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon muelleri-friderici",
    "plant_slug": "abutilon-muelleri-friderici",
    "plant_name_scientific": "abutilon muelleri-friderici",
    "intro": "Abutilon muelleri-friderici, commonly known as the woolly abutilon, is a flowering plant native to Australia. It is characterized by its hairy, glandular leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. It thrives in well-drained soils and is often found in coastal areas and rocky habitats. The flowers are pollinated primarily by insects, and the plant produces capsule fruits containing numerous seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon muelleri-friderici is primarily native to eastern Australia, specifically the eastern coast of New South Wales and southeastern Queensland. It is commonly found in coastal areas, including sand dunes, rocky outcrops, and open woodlands. This species thrives in well-drained soils and is often associated with dry, sunny environments. It is a shrub or small tree that can grow up to several meters in height. The plant is well adapted to the climatic conditions of its native range, including periods of drought and salt exposure.",
    "distribution_introduced_art_desc": "Abutilon muelleri-friderici was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this species is primarily limited to the northern and central regions of the country. It has been reported in several regions, including the North Island and parts of the South Island. Despite its introduction, it is not considered invasive and is often cultivated in gardens and botanical collections."
}
