{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon oxycarpum var. subsagittatum",
    "plant_slug": "abutilon-oxycarpum-var-subsagittatum",
    "plant_name_scientific": "abutilon oxycarpum var. subsagittatum",
    "intro": "Abutilon oxycarpum var. subsagittatum, commonly known as the arrowleaf abutilon, is a flowering plant native to South America. It is characterized by its heart-shaped leaves that are often lobed, giving it a distinctive appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, attracting pollinators such as bees and butterflies. It thrives in warm, humid climates and is often cultivated as an ornamental plant. The species is part of the Malvaceae family, which includes other plants like hibiscus and cotton.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon oxycarpum"
    },
    "taxonomy_art_desc": "Abutilon oxycarpum var. subsagittatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissue and true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their primitive features and often having a distinct life cycle with spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malvales, which comprises flowering plants with showy flowers and includes families such as Malvaceae, Theaceae, and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves, such as cotton and hibiscus. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon oxycarpum, a specific type within the genus Abutilon, which is further divided into varieties, such as var. subsagittatum, and is known for its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon oxycarpum var. subsagittatum is primarily native to Queensland. This variant of the species is found in the tropical and subtropical regions of the state. It typically grows in coastal areas and lowland forests. The plant is well adapted to the humid and warm climate of Queensland. It is often seen in sandy soils along the coastline.",
    "distribution_introduced_art_desc": "Abutilon oxycarpum var. subsagittatum was mainly introduced to the southeastern United States, particularly in Florida and Georgia. It is commonly found in disturbed habitats such as roadsides, pastures, and along utility lines. This plant is considered an invasive species in many areas due to its rapid growth and ability to spread through seed production. It thrives in sunny, well-drained soils and can often outcompete native vegetation. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
