{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon paranthemoides",
    "plant_slug": "abutilon-paranthemoides",
    "plant_name_scientific": "abutilon paranthemoides",
    "intro": "Abutilon paranthemoides, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Its botanical features make it a valuable species for both ecological and horticultural purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon paranthemoides is primarily native to tropical and subtropical regions of South America, particularly Brazil, Paraguay, and Argentina. It thrives in warm, humid climates and is commonly found in lowland areas with well-drained soils. This plant is often associated with disturbed habitats such as roadsides, pastures, and forest edges. It is also cultivated in some regions for its ornamental value due to its attractive foliage and flowers. Its natural range extends into parts of Central America as well.",
    "distribution_introduced_art_desc": "Abutilon paranthemoides was mainly introduced to areas with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in disturbed soils, along roadsides, and in urban environments due to its adaptability. This plant is often considered an invasive species in some regions because of its rapid growth and ability to spread through seeds. Its distribution has been expanding in parts of Southeast Asia and the Pacific Islands. However, it is less common in temperate regions where it may not establish itself successfully."
}
