{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pubistamineum",
    "plant_slug": "abutilon-pubistamineum",
    "plant_name_scientific": "abutilon pubistamineum",
    "intro": "Abutilon pubistamineum, commonly known as the woolly abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in clusters, typically during the spring and summer seasons. Its leaves are broadly ovate with a velvety texture, and it has a fibrous root system that helps it thrive in well-drained soils. Abutilon pubistamineum is often cultivated for its ornamental value and is relatively easy to grow in warm climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pubistamineum"
    },
    "taxonomy_art_desc": "Abutilon pubistamineum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malvales, which consists of flowering plants known for their showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and okra. Its genus is Abutilon, a group of flowering plants commonly known as the \"Chinese lantern\" plants, characterized by their velvety leaves and showy flowers. Its species is Abutilon pubistamineum, a specific plant within the genus Abutilon, distinguished by its hairy stamens and is native to certain regions of South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Ecuador",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pubistamineum is primarily native to Colombia, Ecuador, and Venezuela. This species is commonly found in the tropical and subtropical regions of these countries. It thrives in areas with high humidity and well-drained soils. The plant is often seen growing in forest understories or along riverbanks. Its native distribution is closely linked to the diverse ecosystems of South America's Andean and Amazonian regions.",
    "distribution_introduced_art_desc": "Abutilon pubistamineum was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activity, such as accidental transport via shipping or intentional planting for ornamental purposes. The plant thrives in disturbed areas and can outcompete native vegetation, leading to ecological imbalances. It is often found in coastal regions and disturbed habitats across the Hawaiian Islands. Efforts to control its spread include manual removal and herbicide application."
}
