{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon subprostratum",
    "plant_slug": "abutilon-subprostratum",
    "plant_name_scientific": "abutilon subprostratum",
    "intro": "Abutilon subprostratum, commonly known as the prostrate abutilon, is a flowering plant native to South America. It is a low-growing shrub characterized by its soft, hairy stems and heart-shaped leaves. The plant produces clusters of small, pale yellow flowers that bloom in the summer months. It thrives in well-drained soil and full sun, making it suitable for rock gardens or as a ground cover. Its unique appearance and adaptability make it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon subprostratum"
    },
    "taxonomy_art_desc": "Abutilon subprostratum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and capsule fruits. Its family is Malvaceae, commonly known as the mallow family, which includes plants with velvety leaves and showy flowers, often found in tropical and temperate regions. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and lantern-shaped fruits. Its species is Abutilon subprostratum, a specific type of Abutilon known for its prostrate growth habit and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kenya"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon subprostratum is primarily native to Kenya. It is commonly found in the arid and semi-arid regions of the country. This species thrives in sandy or rocky soils and is often seen in open habitats. It is an important plant in local ecosystems, providing food and shelter for various wildlife. Its distribution is largely restricted to specific areas within Kenya due to its ecological preferences.",
    "distribution_introduced_art_desc": "Abutilon subprostratum was mainly introduced to the United States, particularly in the southern regions. It is commonly found in disturbed areas such as roadsides, fields, and along irrigation ditches. This plant is considered an invasive species in some areas due to its rapid growth and ability to spread aggressively. It thrives in warm climates and can tolerate a variety of soil types. Its introduction has led to concerns about its impact on native plant communities and ecosystem balance."
}
