{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon viride",
    "plant_slug": "abutilon-viride",
    "plant_name_scientific": "abutilon viride",
    "intro": "Abutilon viride, commonly known as velvetleaf, is a flowering plant native to the Americas. It is a shrub or small tree that can grow up to 5 meters tall, characterized by its smooth, velvety leaves that are typically heart-shaped. The plant produces small, greenish-yellow flowers that are clustered in spikes, and it is often found in tropical and subtropical regions. It thrives in moist, well-drained soils and is sometimes considered a weed in agricultural settings. The plant's rapid growth and adaptability make it an important species in ecological and horticultural contexts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Corynabutilon",
        "species": "Corynabutilon viride"
    },
    "taxonomy_art_desc": "Abutilon viride belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and economically significant species. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and is widely distributed around the world. Its genus is Corynabutilon, a group of flowering plants within the Malvaceae family, characterized by their unique morphological features and ecological adaptations. Its species is Corynabutilon viride, a specific type of plant within this genus, known for its green coloration and specific habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Chile Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon viride is primarily native to Chile Central. It is found in the central regions of Chile, including the Andean foothills and coastal areas. This plant thrives in temperate climates with moderate rainfall. It is commonly found in disturbed habitats such as roadsides and forest edges. Its distribution is limited to specific ecological zones within Chile Central.",
    "distribution_introduced_art_desc": "Abutilon viride was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and ability to thrive in tropical climates. It was likely brought there by early settlers or horticulturalists who sought to introduce exotic plant species for landscaping purposes. Despite its aesthetic appeal, it has since become a potential invasive species in some areas, outcompeting native vegetation. The plant's rapid growth and ability to spread through seeds and vegetative reproduction have raised concerns among conservationists. Efforts are ongoing to monitor and manage its spread to protect local ecosystems."
}
