{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cabrae",
    "plant_slug": "abutilon-cabrae",
    "plant_name_scientific": "abutilon cabrae",
    "intro": "Abutilon cabrae, commonly known as the silky abutilon, is a shrub native to the Canary Islands. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant thrives in well-drained soil and full sun, making it suitable for coastal and rocky environments. Its unique appearance and drought tolerance make it a popular choice for ornamental gardening. Abutilon cabrae is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cabrae is primarily native to South America, specifically the countries of Argentina, Bolivia, and Paraguay. It is commonly found in the temperate and subtropical regions of these areas. This plant typically grows in open grasslands, shrublands, and along riverbanks. It is well adapted to the varied climates and soils of its native habitat. Abutilon cabrae is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Abutilon cabrae was mainly introduced to areas with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in regions such as Southeast Asia, the Pacific Islands, and parts of Australia. This plant is often cultivated for its ornamental value due to its attractive, lantern-shaped flowers. It prefers well-drained soil and can tolerate a variety of soil types. However, it is considered an invasive species in some regions, where it can outcompete native vegetation."
}
