{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta solimoesensis",
    "plant_slug": "abuta-solimoesensis",
    "plant_name_scientific": "abuta solimoesensis",
    "intro": "Abuta solimoesensis, commonly known as the Solimões abuta, is a climbing shrub native to the Amazon rainforest. It belongs to the family Euphorbiaceae and is characterized by its woody stems and compound leaves. The plant produces small, yellowish flowers that are clustered in umbels, followed by orange or red berries. Its roots and leaves are used in traditional medicine for their purported anti-inflammatory and analgesic properties. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta solimoesensis"
    },
    "taxonomy_art_desc": "Abuta solimoesensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often having rhizomes. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Ranunculales, a group of flowering plants that includes families such as Ranunculaceae, often featuring showy flowers and sometimes toxic compounds. Its family is Menispermaceae, commonly known as the birthwort family, which includes tropical and temperate plants with distinctive leaf and fruit structures. Its genus is Abuta, a group of flowering plants native to tropical regions, often characterized by their medicinal properties and unique fruit morphology. Its species is Abuta solimoesensis, a specific plant species found in the Amazon basin, known for its potential pharmacological uses and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Colombia",
        "Ecuador",
        "French Guiana",
        "Peru",
        "Suriname"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta solimoesensis is primarily native to Brazil North, Colombia, Ecuador, French Guiana, Peru, and Suriname. This plant is found in the tropical regions of these countries, typically in humid lowland areas. It thrives in dense rainforests where it can receive ample sunlight and moisture. The species is part of the family Euphorbiaceae, which includes many plants with medicinal properties. Its native distribution reflects its adaptation to the rich biodiversity of the Amazon and adjacent regions.",
    "distribution_introduced_art_desc": "Abuta solimoesensis was mainly introduced to the Amazon rainforest region of South America, particularly in the western part of Brazil. It is commonly found in areas with moist, well-drained soils and partial to full sunlight. This plant is often associated with secondary forests and disturbed habitats due to its adaptability. Its introduction has been linked to both natural dispersal and human activities such as deforestation and land clearing. It plays a role in local ecosystems by providing habitat and food for various wildlife species."
}
