{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon asiaticum var. australiense",
    "plant_slug": "abutilon-asiaticum-var-australiense",
    "plant_name_scientific": "abutilon asiaticum var. australiense",
    "intro": "Abutilon asiaticum var. australiense, commonly known as the Australian velvetleaf, is a flowering plant native to Australia. It is characterized by its soft, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an upright shrub, reaching heights of up to 2 meters. It thrives in well-drained soils and is often found in coastal and sandy habitats. Due to its ornamental value, it is sometimes cultivated in gardens, though it can become invasive in certain regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon asiaticum var. australiense is primarily native to Australia. It is found in the southern regions of the country, particularly in Western Australia. This plant thrives in coastal and sandy soils along the southern coastline. It is commonly found in areas with a Mediterranean climate, characterized by dry summers and wet winters. Its native distribution includes parts of South Australia and Tasmania as well.",
    "distribution_introduced_art_desc": "Abutilon asiaticum var. australiense was mainly introduced to Australia as an ornamental plant due to its attractive foliage and unique appearance. It has been widely cultivated in gardens and landscapes across the country, particularly in regions with a warm climate. Despite its ornamental value, it has shown potential to establish itself in natural environments, raising concerns about its invasive tendencies. The plant's ability to thrive in disturbed soils and its rapid growth rate contribute to its spread in non-native habitats. As a result, it is now considered a weed in some areas, prompting efforts to manage its distribution."
}
