{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fruticosum var. microphyllum",
    "plant_slug": "abutilon-fruticosum-var-microphyllum",
    "plant_name_scientific": "abutilon fruticosum var. microphyllum",
    "intro": "Abutilon fruticosum var. microphyllum, commonly known as the narrow-leaved abutilon, is a flowering plant native to South America. It is characterized by its small, elliptical leaves that are typically covered in fine hairs. The plant produces clusters of yellow to orange flowers that bloom in the summer months. It thrives in well-drained soils and full sun, making it suitable for cultivation in warm climates. Its ornamental value comes from its attractive foliage and showy blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon fruticosum var. microphyllum is primarily native to the Caribbean islands, including Cuba, Hispaniola, and the Bahamas. This plant is commonly found in coastal areas and dry forests, where it thrives in well-drained soils. It is often seen growing along sandy shores and in disturbed habitats such as roadsides and abandoned fields. The species is adapted to a tropical climate with warm temperatures and seasonal dry periods. Its native range is limited to these specific regions in the Caribbean.",
    "distribution_introduced_art_desc": "Abutilon fruticosum var. microphyllum was mainly introduced to control erosion and stabilize soil in coastal and disturbed areas. It is commonly found in sandy or gravelly soils along shorelines and in dunes. This plant is often used in restoration projects due to its rapid growth and ability to thrive in harsh conditions. However, it can become invasive in some regions, outcompeting native vegetation. Its introduction has had both beneficial and problematic ecological impacts depending on the environment."
}
