{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta steyermarkii",
    "plant_slug": "abuta-steyermarkii",
    "plant_name_scientific": "abuta steyermarkii",
    "intro": "Abuta steyermarkii, commonly known as the Congo abuta, is a flowering plant native to Central and Southern Africa. It belongs to the family Euphorbiaceae and is characterized by its palmate leaves and showy, yellowish-green flowers. The plant typically grows in moist, forested areas and can reach heights of up to 3 meters. Its latex contains various chemical compounds, some of which have been studied for potential medicinal properties. Abuta steyermarkii is also valued for its ornamental appeal and is sometimes cultivated in botanical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta steyermarkii"
    },
    "taxonomy_art_desc": "Abuta steyermarkii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often possessing jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Ranunculales, which consists of flowering plants with diverse forms, including some with showy flowers and others with simple structures. Its family is Menispermaceae, commonly known as the birthwort family, which includes tropical and temperate plants with often distinctive leaf shapes and medicinal properties. Its genus is Abuta, a group of flowering plants native to tropical regions, known for their medicinal uses and unique chemical compounds. Its species is Abuta steyermarkii, a specific plant within the genus Abuta, distinguished by its particular morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Costa Rica",
        "Guatemala",
        "Honduras",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta steyermarkii is primarily native to Belize, Costa Rica, Guatemala, Honduras, Mexico Southeast, Mexico Southwest, and Nicaragua. This plant is found in the tropical regions of Central America. It thrives in humid, lowland areas with rich soil. The species is commonly associated with secondary forests and disturbed habitats. Its distribution reflects its adaptation to the diverse ecosystems of these countries.",
    "distribution_introduced_art_desc": "Abuta steyermarkii was mainly introduced to the Americas through human activity, particularly during the 19th and 20th centuries. It is now found in parts of the United States, Mexico, and Central America, where it has been cultivated for ornamental purposes. The plant thrives in tropical and subtropical climates, often in shaded or semi-shaded environments. Its introduction has led to its establishment in naturalized populations in some regions. However, it is not considered invasive and is primarily grown in controlled settings."
}
