{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon triquetrum",
    "plant_slug": "abutilon-triquetrum",
    "plant_name_scientific": "abutilon triquetrum",
    "intro": "Abutilon triquetrum, commonly known as the three-angled abutilon, is a species of flowering plant in the Malvaceae family. It is native to the eastern United States, particularly in regions with moist, well-drained soils. The plant is characterized by its triangular stems and palmate leaves with three to five lobes. It produces showy, lantern-shaped yellow flowers that bloom in the summer months. This plant is often grown as an ornamental due to its attractive foliage and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon triquetrum is primarily native to South America, particularly in regions of Brazil, Argentina, and Paraguay. It thrives in tropical and subtropical climates, often found in forested areas and along riverbanks. This plant is commonly associated with humid environments and is often seen growing in shaded or semi-shaded locations. It is also found in parts of Central America and the Caribbean. Its native range includes a variety of ecosystems, from lowland forests to higher elevations in the Andes.",
    "distribution_introduced_art_desc": "Abutilon triquetrum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed habitats such as roadsides, stream banks, and forest edges. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It spreads primarily through seeds dispersed by wind, water, and human activity. Its presence has led to ecological concerns in areas where it has established itself."
}
