{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon monteiroi",
    "plant_slug": "abutilon-monteiroi",
    "plant_name_scientific": "abutilon monteiroi",
    "intro": "Abutilon monteiroi, commonly known as the Monteiro's Abutilon, is a flowering plant native to Brazil. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its hairy stems and heart-shaped leaves. It produces showy, lantern-shaped flowers that range in color from yellow to orange. Abutilon monteiroi is often cultivated for its ornamental value in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon monteiroi is primarily native to Brazil. It is found in the northeastern regions of the country, particularly in the states of Pernambuco, Paraíba, and Ceará. This species thrives in tropical and subtropical climates, often growing in coastal areas and dry forests. It is commonly associated with sandy soils and is often found in disturbed habitats such as roadsides and open woodlands. The plant is known for its distinctive, lantern-shaped flowers and is valued for its ornamental qualities.",
    "distribution_introduced_art_desc": "Abutilon monteiroi was mainly introduced to Brazil, particularly in the states of Bahia and Pernambuco, as part of ecological restoration projects. It is commonly found in degraded areas and is used for soil stabilization due to its rapid growth and ability to thrive in poor soils. The plant is often cultivated in reforestation programs because of its adaptability to various environmental conditions. It has also been introduced to other regions in South America for similar ecological purposes. However, its spread is sometimes considered invasive in certain local ecosystems."
}
