{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon multiflorum",
    "plant_slug": "abutilon-multiflorum",
    "plant_name_scientific": "abutilon multiflorum",
    "intro": "Abutilon multiflorum, commonly known as the Chinese lantern plant, is a deciduous shrub native to China and Southeast Asia. It features heart-shaped leaves that are often hairy and have a velvety texture. The plant produces clusters of showy, lantern-shaped orange or red bracts that resemble small lanterns, which are not actually flowers but modified leaves. These bracts are often mistaken for flowers and are the main ornamental feature of the plant. It thrives in full sun to partial shade and is commonly cultivated for its vibrant, long-lasting display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon multiflorum"
    },
    "taxonomy_art_desc": "Abutilon multiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include many plants with cotton-like fibers. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon multiflorum, a specific type of Abutilon known for its multiple flowers and is often cultivated for its ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon multiflorum is primarily native to Ecuador and Peru. This species is commonly found in the Andean regions of these countries. It thrives in humid, tropical climates with well-drained soils. The plant is often seen growing in forests and along stream banks. Its native distribution is limited to these specific areas in South America.",
    "distribution_introduced_art_desc": "Abutilon multiflorum was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in tropical and subtropical regions, including parts of the United States, Australia, and Southeast Asia. The plant thrives in full sun to partial shade and requires regular watering, making it suitable for gardens and landscaped areas. Its rapid growth and ability to spread through both seeds and rhizomes have led to its establishment in some regions outside its native range. However, it is considered invasive in certain areas, where it can outcompete native vegetation."
}
