{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon esculentum",
    "plant_slug": "abutilon-esculentum",
    "plant_name_scientific": "abutilon esculentum",
    "intro": "Abutilon esculentum, commonly known as velvetleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its heart-shaped leaves and fluffy, pale green to yellowish flowers. The plant is an annual or perennial herb that thrives in warm climates with ample sunlight. Its stems are often covered in a soft, velvety pubescence, giving it its common name. Velvetleaf is known for its rapid growth and is often considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon esculentum is primarily native to tropical and subtropical regions of the Americas, including Central and South America. It is commonly found in countries such as Mexico, Brazil, and parts of the Caribbean. This plant thrives in warm, humid climates and is often associated with disturbed soils and human-modified landscapes. It is also known as the velvetleaf or Indian mallow. Its native range extends into some parts of Southeast Asia, though its primary distribution remains in the Americas.",
    "distribution_introduced_art_desc": "Abutilon esculentum was mainly introduced to tropical and subtropical regions for its ornamental value and potential as a vegetable crop. It is commonly found in parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in warm climates with well-drained soil and ample sunlight. It is often cultivated in home gardens and small-scale farms due to its adaptability and aesthetic appeal. However, it is considered an invasive species in some areas where it can outcompete native vegetation."
}
