{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon laxiflorum var. paritioides",
    "plant_slug": "abutilon-laxiflorum-var-paritioides",
    "plant_name_scientific": "abutilon laxiflorum var. paritioides",
    "intro": "Abutilon laxiflorum var. paritioides, commonly known as the silky abutilon, is a flowering plant native to South America. It is a shrub that typically grows to a height of 1 to 3 meters, characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant produces yellow to orange flowers that bloom in the summer months, attracting pollinators such as bees and butterflies. Its leaves are opposite, ovate, and covered in fine, silky hairs, giving the plant a distinctive appearance. The species is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon laxiflorum var. paritioides is primarily native to the tropical and subtropical regions of Central and South America. It is commonly found in countries such as Mexico, Guatemala, and parts of Brazil. This plant thrives in humid, warm climates and is often associated with lowland forests and disturbed areas. It is known for its ornamental value due to its hairy stems and showy flowers. Its natural range extends into some Caribbean islands as well.",
    "distribution_introduced_art_desc": "Abutilon laxiflorum var. paritioides was mainly introduced to the United States as an ornamental plant due to its attractive foliage and unique flower structure. It is commonly found in gardens and cultivated areas in California and other western states. This variety is often used in landscaping for its ability to thrive in a variety of soil conditions. However, it has also been reported as an invasive species in some regions, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
