{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon texense",
    "plant_slug": "abutilon-texense",
    "plant_name_scientific": "abutilon texense",
    "intro": "Abutilon texense, commonly known as velvetleaf or Texas abutilon, is a flowering plant native to the southern United States. It is a shrub or small tree that can grow up to 6 meters tall, characterized by its fuzzy, velvety leaves. The plant produces showy, lantern-shaped yellow flowers that bloom in late spring to early summer. Its leaves are alternate, heart-shaped, and often have a waxy texture. Abutilon texense is adapted to thrive in full sun and well-drained soils, making it a common sight in dry, open habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon texense is primarily native to the southern United States, specifically Texas and northeastern Mexico. It is commonly found in arid and semi-arid regions, including desert and rocky habitats. This plant thrives in well-drained soils and is often seen along roadsides and in disturbed areas. It is a shrub or small tree that can grow up to several meters in height. Due to its adaptability, it is also sometimes cultivated in gardens in similar climates.",
    "distribution_introduced_art_desc": "Abutilon texense was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in disturbed areas such as roadsides, fields, and urban landscapes. This plant thrives in full sun and well-drained soils, making it adaptable to various environments. It is often considered an invasive species in some regions due to its rapid growth and ability to spread easily. Its distribution has expanded beyond its native range, leading to ecological concerns in certain areas."
}
