{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta mycetandra",
    "plant_slug": "abuta-mycetandra",
    "plant_name_scientific": "abuta mycetandra",
    "intro": "Abuta mycetandra, commonly known as the purple abuta, is a flowering plant native to the tropical regions of South America. It belongs to the family Euphorbiaceae and is characterized by its striking purple flowers and succulent leaves. The plant is often found growing in moist, shaded environments such as forest understories. Its botanical features include a thick, branched stem and alternate, fleshy leaves that are typically heart-shaped. The flowers are clustered in cyathia, which are specialized structures typical of the Euphorbiaceae family.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta mycetandra"
    },
    "taxonomy_art_desc": "Abuta mycetandra belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and modern species with diverse morphological features. Its order is Ranunculales, which includes plants like buttercups and is known for its showy flowers and often toxic compounds. Its family is Menispermaceae, a family of flowering plants commonly known as the pipevines, characterized by their distinctive leaves and often poisonous compounds. Its genus is Abuta, a group of flowering plants native to tropical regions, known for their ornamental value and medicinal properties. Its species is Abuta mycetandra, a specific plant within the genus Abuta, distinguished by its unique characteristics and ecological niche.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Peru",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta mycetandra is primarily native to Bolivia, Peru, and Venezuela. This plant is found in the Andean regions of these countries, where it thrives in high-altitude environments. It is commonly associated with cloud forests and rocky slopes in the Andes. The species is known for its medicinal properties and has been used by local communities for various traditional purposes. Its native distribution is limited to these specific geographic areas within South America.",
    "distribution_introduced_art_desc": "Abuta mycetandra was mainly introduced to North America through human activity, particularly as part of horticultural and ornamental plant trade. It has been observed in several regions of the United States, including California, Oregon, and Washington. The plant thrives in moist, shady environments, often found in forested areas or along stream banks. Its introduction has raised concerns due to its potential to become invasive in native ecosystems. Despite its ornamental value, efforts are being made to monitor and manage its spread to prevent ecological disruption."
}
