{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon × tonelianum",
    "plant_slug": "abutilon-×-tonelianum",
    "plant_name_scientific": "abutilon × tonelianum",
    "intro": "Abutilon × tonelianum, commonly known as the Chinese lantern plant, is a hybrid species belonging to the Malvaceae family. It is characterized by its distinctive, velvety, lantern-shaped seed pods that range in color from orange to red. The plant is native to China and has been widely cultivated for its ornamental value. It thrives in warm climates and prefers full sun to partial shade. Its hairy leaves and showy seed pods make it a popular choice for gardeners seeking vibrant, eye-catching foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon × tonelianum is primarily native to Southeast Asia, including countries such as India, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, often growing in coastal areas and disturbed soils. This plant thrives in warm climates with high humidity and is often seen in mangrove ecosystems. It is also cultivated in some parts of the world for its ornamental value due to its attractive foliage. Its native range includes parts of the Indian subcontinent and the Pacific islands.",
    "distribution_introduced_art_desc": "Abutilon × tonelianum was mainly introduced to New Zealand. It is commonly found in coastal and urban areas, where it thrives in disturbed soils and sunny environments. This plant is often cultivated as an ornamental due to its attractive foliage and showy flowers. However, it has also become invasive in some regions, outcompeting native species. Its distribution is primarily limited by its preference for temperate climates and availability of suitable habitats."
}
