{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon anodoides",
    "plant_slug": "abutilon-anodoides",
    "plant_name_scientific": "abutilon anodoides",
    "intro": "Abutilon anodoides, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is a deciduous shrub or small tree that can grow up to 3 meters in height. The plant features heart-shaped leaves with a velvety texture and is known for its showy, lantern-shaped yellow flowers. It thrives in warm, humid climates and is often found in disturbed soils. Botanically, it belongs to the Malvaceae family, which includes cotton and hibiscus.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon anodoides"
    },
    "taxonomy_art_desc": "Abutilon anodoides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Malvales, which consists of flowering plants that often have showy flowers and include economically important species like cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a variety of growth forms. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"cottonweed,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon anodoides, a specific plant within the genus Abutilon, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon anodoides is primarily native to Brazil Southeast. This species is commonly found in the southeastern region of Brazil, including states such as São Paulo and Minas Gerais. It thrives in tropical and subtropical climates, often growing in moist, well-drained soils. The plant is typically found in forested areas and along riverbanks. Its native distribution is closely associated with the diverse ecosystems of the Brazilian Southeast.",
    "distribution_introduced_art_desc": "Abutilon anodoides was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in tropical and subtropical regions, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in full sun to partial shade and is often cultivated in gardens and landscapes for its aesthetic value. Its introduction has sometimes led to it becoming an invasive species in certain regions, outcompeting native vegetation. Proper management is necessary to prevent its spread in non-native environments."
}
