{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon rufinerve var. subglabrum",
    "plant_slug": "abutilon-rufinerve-var-subglabrum",
    "plant_name_scientific": "abutilon rufinerve var. subglabrum",
    "intro": "Abutilon rufinerve var. subglabrum, commonly known as the woolly abutilon, is a deciduous shrub native to the southern United States. It features hairy, ovate leaves that are typically green with a slightly rough texture. The plant produces showy, lantern-shaped flowers in shades of yellow to orange, which bloom in the summer months. Its stems are woody and can be branched, with a tendency to exude a milky sap when broken. This variety is noted for its ornamental value and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon rufinerve var. subglabrum is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and KwaZulu-Natal. This plant typically grows in coastal areas and along the edges of forests. It thrives in well-drained soils and is often found in moist, sunny habitats. Its native range is limited to these specific regions within South Africa.",
    "distribution_introduced_art_desc": "Abutilon rufinerve var. subglabrum was mainly introduced to areas with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in disturbed sites such as roadsides, abandoned fields, and along stream banks. This plant has become naturalized in several regions outside its native range, often spreading through seed dispersal by wind and water. Its rapid growth and adaptability make it a potential invasive species in some environments. However, it is also valued for its ornamental qualities and is cultivated in gardens for its attractive foliage and flowers."
}
