{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon giganteum var. detonsum",
    "plant_slug": "abutilon-giganteum-var-detonsum",
    "plant_name_scientific": "abutilon giganteum var. detonsum",
    "intro": "Abutilon giganteum var. detonsum, commonly known as the giant velvetleaf, is a tropical plant characterized by its large, velvety leaves that are typically heart-shaped or ovate. It produces showy, lantern-shaped flowers that range in color from yellow to orange, often appearing in clusters. The plant is native to Central and South America and thrives in warm, humid climates. It is often cultivated as an ornamental plant due to its striking foliage and floral display. The leaves are also used in traditional medicine in some regions for their purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon giganteum var. detonsum is primarily native to the Caribbean islands, including Cuba, Hispaniola, and Jamaica. It is commonly found in tropical and subtropical regions with warm, humid climates. This plant thrives in coastal areas and is often associated with mangrove forests or saltwater environments. It is also present in parts of Central America, such as the northern regions of Costa Rica and Panama. Its natural habitat includes sandy soils and brackish water zones near the coast.",
    "distribution_introduced_art_desc": "Abutilon giganteum var. detonsum was mainly introduced to ornamental horticulture and landscaping due to its striking, lantern-like flowers and attractive foliage. It is commonly used in tropical and subtropical regions for decorative purposes in gardens and public spaces. The plant thrives in warm climates with well-drained soil and ample sunlight. Its introduction has led to its cultivation in various parts of the world, including the Caribbean, South America, and Southeast Asia. However, it has also been reported as an invasive species in some regions, raising concerns about its ecological impact."
}
