{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon avicennae f. genuina",
    "plant_slug": "abutilon-avicennae-f-genuina",
    "plant_name_scientific": "abutilon avicennae f. genuina",
    "intro": "Abutilon avicennae f. genuina, commonly known as the narrow-leaf abutilon, is a flowering plant native to Southeast Asia. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its narrow, lance-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in warm, humid climates and is often cultivated as an ornamental plant. The species is notable for its adaptability to various soil types and its ability to grow in both full sun and partial shade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon avicennae f. genuina is primarily native to the coastal regions of southern Africa, particularly Namibia and South Africa. This plant thrives in sandy or gravelly soils along the shoreline. It is commonly found in dune environments and is adapted to the harsh, saline conditions of the coastal areas. The species is well-suited to the arid and semi-arid climates of its native range. Its distribution is limited to specific coastal habitats where it plays a role in stabilizing dunes and supporting local biodiversity.",
    "distribution_introduced_art_desc": "Abutilon avicennae f. genuina was mainly introduced to coastal and sandy habitats, particularly in regions with warm, temperate climates. It thrives in well-drained soils and is often found growing along shores, dunes, and rocky outcrops. This plant is commonly associated with disturbed areas and can establish itself in both natural and human-altered environments. Its introduction has been documented in several coastal regions of the southeastern United States. It is valued for its ornamental qualities and ability to stabilize sand dunes."
}
