{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon intermedium var. macrophyllum",
    "plant_slug": "abutilon-intermedium-var-macrophyllum",
    "plant_name_scientific": "abutilon intermedium var. macrophyllum",
    "intro": "Abutilon intermedium var. macrophyllum, commonly known as the Chinese lantern plant, is a deciduous shrub native to China. It is characterized by its large, heart-shaped leaves that are typically velvety in texture. The plant produces showy, papery bracts that resemble lanterns, which are often more prominent than the small, inconspicuous flowers. It thrives in full sun to partial shade and prefers well-drained soil. This species is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon intermedium var. macrophyllum is primarily native to the southeastern United States, particularly Florida and parts of Georgia. This variant is commonly found in wetlands, swamps, and along the edges of water bodies in these regions. It thrives in moist, sandy soils and is often associated with coastal and riverine habitats. The plant is well adapted to the humid climate and can tolerate periodic flooding. Its native range is limited to specific areas within the southeastern U.S., where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon intermedium var. macrophyllum was mainly introduced to enhance ornamental value in gardens and landscapes due to its attractive, lantern-shaped flowers and fuzzy, velvety foliage. It is commonly cultivated in tropical and subtropical regions for its aesthetic appeal and ability to thrive in a variety of soil conditions. The plant is often used as a decorative shrub or small tree in public spaces and private gardens. Its introduction has been associated with both ecological benefits and potential invasiveness in certain environments. Careful management is recommended to prevent unintended spread in natural areas."
}
