{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon umtaliense",
    "plant_slug": "abutilon-umtaliense",
    "plant_name_scientific": "abutilon umtaliense",
    "intro": "Abutilon umtaliense, commonly known as the Natal abutilon, is a flowering plant native to southern Africa. It is a shrub or small tree that can grow up to 5 meters in height, characterized by its rough, hairy stems and alternate leaves. The plant produces clusters of small, yellow flowers that bloom in the summer months. Its fruits are capsules that split open to release seeds, and it is often found in coastal and sandy soils. Abutilon umtaliense is valued for its ornamental appeal and is sometimes cultivated for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon umtaliense is primarily native to eastern and southern Africa, including countries such as South Africa, Mozambique, Tanzania, and Zimbabwe. It is commonly found in woodland areas, along riverbanks, and in moist, well-drained soils. This plant thrives in tropical and subtropical climates, often growing in partial shade to full sun. It is known for its ornamental value, particularly due to its hairy leaves and showy flowers. Abutilon umtaliense is an important species in local ecosystems and has been used in traditional medicine by indigenous communities.",
    "distribution_introduced_art_desc": "Abutilon umtaliense was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in disturbed habitats. The plant is often considered an invasive species due to its rapid growth and ability to spread vegetatively. It is used locally for its fibrous bark, which has traditional applications. However, its introduction has raised concerns about its impact on native plant communities."
}
