{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon amoenum",
    "plant_slug": "abutilon-amoenum",
    "plant_name_scientific": "abutilon amoenum",
    "intro": "Abutilon amoenum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often appearing in clusters. It thrives in warm, humid climates and is often found in disturbed habitats such as roadsides and open woodlands. Abutilon amoenum is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon amoenum is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in humid, lowland areas. This plant thrives in coastal and riverine environments, where it can be seen along the edges of forests and in open grasslands. It is also occasionally found in the Indian subcontinent, particularly in parts of India and Sri Lanka. Due to its adaptability, it can sometimes be found in cultivated areas as well.",
    "distribution_introduced_art_desc": "Abutilon amoenum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, disturbed areas such as roadsides and forest edges. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states including Oregon and Washington. Its spread is often facilitated by human activities and seed dispersal through wind and water."
}
