{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pannosum",
    "plant_slug": "abutilon-pannosum",
    "plant_name_scientific": "abutilon pannosum",
    "intro": "Abutilon pannosum, commonly known as velvetleaf, is a flowering plant native to the Americas. It is characterized by its broad, heart-shaped leaves that are covered in fine, soft hairs, giving it a velvety texture. The plant produces yellow flowers that bloom in clusters, typically during the warmer months. Its fruit is a capsule that splits open to release small, smooth seeds. Abutilon pannosum is often found in disturbed soils and can thrive in a variety of light conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pannosum"
    },
    "taxonomy_art_desc": "Abutilon pannosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and ferns, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families like Malvaceae, Theaceae, and Tiliaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with palmate leaves and showy flowers, such as cotton and hibiscus. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and lantern-shaped flowers. Its species is Abutilon pannosum, a specific type of velvetleaf plant native to South America, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Afghanistan",
        "Algeria",
        "Angola",
        "Burkina",
        "Cameroon",
        "Cape Verde",
        "Chad",
        "Djibouti",
        "Egypt",
        "Eritrea",
        "Ethiopia",
        "Gulf States",
        "India",
        "Iran",
        "Iraq",
        "Kenya",
        "Lebanon-Syria",
        "Mali",
        "Mauritania",
        "Niger",
        "Nigeria",
        "Oman",
        "Pakistan",
        "Palestine",
        "Saudi Arabia",
        "Senegal",
        "Sinai",
        "Socotra",
        "Somalia",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "Yemen"
    ],
    "distribution_introduced": [
        "Aldabra",
        "Mauritius",
        "Rodrigues"
    ],
    "distribution_native_art_desc": "Abutilon pannosum is primarily native to Afghanistan, Algeria, Angola, Burkina, Cameroon, Cape Verde, Chad, Djibouti, Egypt, Eritrea, Ethiopia, Gulf States, India, Iran, Iraq, Kenya, Lebanon-Syria, Mali, Mauritania, Niger, Nigeria, Oman, Pakistan, Palestine, Saudi Arabia, Senegal, Sinai, Socotra, Somalia, Sri Lanka, Sudan-South Sudan, Tanzania, Uganda, and Yemen. It is widely distributed across these regions, often growing in arid and semi-arid environments. The plant is commonly found in coastal and inland areas, adapting to a variety of soil types. It plays a role in local ecosystems and has been used traditionally in some regions for its fibrous bark. Its native range spans across parts of Africa, the Middle East, and South and Southwestern Asia.",
    "distribution_introduced_art_desc": "Abutilon pannosum was mainly introduced to Aldabra, Mauritius, and Rodrigues. It is considered an invasive species in these regions due to its rapid growth and ability to outcompete native vegetation. The plant thrives in coastal areas and disturbed habitats, leading to ecological impacts on local flora and fauna. Its introduction is likely associated with human activities such as shipping or landscaping. Efforts are being made to monitor and control its spread to protect native ecosystems."
}
