{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon carterae",
    "plant_slug": "abutilon-carterae",
    "plant_name_scientific": "abutilon carterae",
    "intro": "Abutilon carterae, commonly known as the Carter's Abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is a shrub or small tree that typically grows in arid and semi-arid environments. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often appearing in late spring to early summer. Its leaves are alternate, ovate, and often have a velvety texture. The plant is adapted to withstand drought conditions and is sometimes used in xeriscaping due to its low water requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon carterae is primarily native to the southern United States, particularly Texas, and extends into parts of Mexico. It is commonly found in dry, rocky, and sandy soils in arid and semi-arid regions. This plant thrives in open habitats such as plains, grasslands, and disturbed areas. It is often seen along roadsides and in desert scrub environments. Its distribution is largely confined to the southwestern regions of North America.",
    "distribution_introduced_art_desc": "Abutilon carterae was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. The plant thrives in a variety of soil types but prefers well-drained soils. It is often considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded over time, leading to concerns about its impact on local ecosystems."
}
