{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sonneratianum",
    "plant_slug": "abutilon-sonneratianum",
    "plant_name_scientific": "abutilon sonneratianum",
    "intro": "Abutilon sonneratianum, commonly known as the Chinese lantern plant, is a flowering shrub native to Southeast Asia. It is characterized by its velvety, ovate leaves and showy, lantern-shaped bracts that come in shades of red, orange, and yellow. The plant produces small, inconspicuous flowers that are followed by the distinctive papery bracts, which are often used in ornamental gardening. It thrives in warm, humid climates and prefers well-drained soil. Abutilon sonneratianum is often cultivated for its ornamental value and is relatively easy to care for in suitable conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon sonneratianum"
    },
    "taxonomy_art_desc": "Abutilon sonneratianum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malvales, which consists of flowering plants with a distinctive floral structure and includes families like Malvaceae and Theaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants commonly known as velvetleaf or Chinese lantern, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon sonneratianum, a specific type of velvetleaf native to Asia, known for its ornamental value and ability to thrive in various environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cape Provinces",
        "Eswatini",
        "Free State",
        "KwaZulu-Natal",
        "Lesotho",
        "Mozambique",
        "Northern Provinces",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Madeira"
    ],
    "distribution_native_art_desc": "Abutilon sonneratianum is primarily native to the Cape Provinces, Eswatini, Free State, KwaZulu-Natal, Lesotho, Mozambique, Northern Provinces, and Zimbabwe. It is commonly found in regions with a subtropical or tropical climate, often growing in open woodlands, grasslands, and along riverbanks. This plant thrives in well-drained soils and is adapted to both full sun and partial shade. It is a shrub or small tree that can reach heights of up to 5 meters. Due to its hardy nature, it is sometimes cultivated for ornamental purposes in southern Africa.",
    "distribution_introduced_art_desc": "Abutilon sonneratianum was mainly introduced to Madeira for its ornamental value, particularly due to its attractive, lantern-shaped flowers. It has been cultivated in gardens and greenhouses, where it thrives in warm, humid climates. The plant is often used in horticulture for its ability to add visual interest to landscapes. However, it has also been reported to naturalize in some areas, raising concerns about its potential invasive impact. Its introduction to Madeira highlights the role of human activity in the spread of non-native species."
}
