{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon macdougalii",
    "plant_slug": "abutilon-macdougalii",
    "plant_name_scientific": "abutilon macdougalii",
    "intro": "Abutilon macdougalii, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its fuzzy, woolly leaves and showy, lantern-shaped flowers that bloom in shades of yellow to orange. The plant typically grows as an erect shrub or small tree, reaching heights of up to 3 meters. Its fibrous bark and hairy foliage are distinctive botanical features. It thrives in warm, humid climates and is often found in disturbed soils or along riverbanks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon macdougalii is primarily native to the Caribbean, including parts of Cuba, Hispaniola, and Jamaica. It is commonly found in tropical and subtropical regions, particularly in coastal areas and disturbed habitats. This species thrives in well-drained soils and is often associated with open woodlands or scrublands. It is also occasionally found in southern Florida, United States, where it has been introduced. The plant is known for its hairy stems and showy, lantern-shaped flowers that bloom in the summer months.",
    "distribution_introduced_art_desc": "Abutilon macdougalii was mainly introduced to the United States, particularly in the southern regions, as an ornamental plant due to its attractive foliage and flowering habits. It has been cultivated in gardens and landscapes for its unique appearance, which includes heart-shaped leaves and showy yellow flowers. Despite its aesthetic value, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness in certain ecosystems. The plant is often found in disturbed soils and can thrive in a variety of environmental conditions. Its introduction has led to discussions about its ecological impact and management in natural habitats."
}
