{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon andrewsianum",
    "plant_slug": "abutilon-andrewsianum",
    "plant_name_scientific": "abutilon andrewsianum",
    "intro": "Abutilon andrewsianum, commonly known as the velvetleaf abutilon, is a species of flowering plant in the mallow family. It is native to tropical and subtropical regions of the Americas. The plant is characterized by its fuzzy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to red. It thrives in warm, humid climates and prefers well-drained soil. Abutilon andrewsianum is often cultivated as an ornamental plant due to its attractive foliage and blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon andrewsianum"
    },
    "taxonomy_art_desc": "Abutilon andrewsianum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct root system and the ability to perform photosynthesis. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, often featuring jointed stems and a lack of true leaves. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their showy flowers and a variety of growth forms. Its order is Malvales, which includes plants with showy flowers and often hairy stems, such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a variety of economic importance. Its genus is Abutilon, a group of flowering plants that are often shrubs or trees with distinctive, often fuzzy leaves and showy flowers. Its species is Abutilon andrewsianum, a specific type of plant within the genus Abutilon, known for its ornamental value and unique characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon andrewsianum is primarily native to Northern Territory, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen along coastal and inland regions. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Abutilon andrewsianum was mainly introduced to South America, particularly in countries like Brazil, Argentina, and Chile. It was brought there for its ornamental value due to its attractive foliage and unique flower shapes. The plant thrives in tropical and subtropical climates, making it well-suited for the regions where it has been introduced. It is often cultivated in gardens and as a houseplant because of its adaptability and aesthetic appeal. However, in some areas, it has become invasive, posing a threat to native ecosystems."
}
