{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon umbelliflorum subsp. occidentale",
    "plant_slug": "abutilon-umbelliflorum-subsp-occidentale",
    "plant_name_scientific": "abutilon umbelliflorum subsp. occidentale",
    "intro": "Abutilon umbelliflorum subsp. occidentale, commonly known as the western velvetleaf, is a flowering plant native to western North America. It is a shrub or small tree with palmate leaves that are often covered in soft, fuzzy hairs. The plant produces clusters of yellow flowers that bloom in late spring to early summer. It thrives in moist, well-drained soils and is often found in riparian areas. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon umbelliflorum subsp. occidentale is primarily native to western North America, particularly the southwestern United States and northern Mexico. It is commonly found in regions with a Mediterranean climate, including parts of California, Arizona, and Baja California. This subspecies thrives in rocky soils and open habitats such as chaparral, woodlands, and coastal areas. It is often associated with disturbed sites and can be found in both coastal and inland locations. Its distribution is limited to specific ecological zones where it can receive adequate sunlight and well-drained soil.",
    "distribution_introduced_art_desc": "Abutilon umbelliflorum subsp. occidentale was mainly introduced to areas with a Mediterranean climate, characterized by mild, wet winters and dry summers. It thrives in well-drained soils and is often found in coastal regions and disturbed habitats. This subspecies is commonly cultivated as an ornamental plant due to its showy yellow flowers and attractive foliage. It has been introduced to parts of California and other regions with similar climatic conditions. However, it is not considered invasive in these areas."
}
