{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon aureum",
    "plant_slug": "abutilon-aureum",
    "plant_name_scientific": "abutilon aureum",
    "intro": "Abutilon aureum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon aureum is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in tropical and subtropical regions, often found in open woodlands, grasslands, and along riverbanks. This plant is commonly associated with disturbed soils and can be found in both natural and cultivated environments. It is also known to occur in parts of the Arabian Peninsula and the Indian subcontinent. Its native range extends into some areas of Madagascar as well.",
    "distribution_introduced_art_desc": "Abutilon aureum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-shaped leaves and showy yellow flowers. It was first brought to the islands in the 19th century by European settlers and has since become naturalized in various coastal and disturbed habitats. The plant thrives in warm, tropical climates and is often found growing along roadsides, in open woodlands, and near streams. Its rapid growth and ability to spread through seeds and vegetative reproduction have led to its establishment in multiple areas across the region. However, it is considered a non-native species and has not been officially classified as invasive in Hawaii."
}
