{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon stenopetalum",
    "plant_slug": "abutilon-stenopetalum",
    "plant_name_scientific": "abutilon stenopetalum",
    "intro": "Abutilon stenopetalum, commonly known as the narrow-petaled abutilon, is a species of flowering plant in the mallow family, Malvaceae. It is native to tropical regions of Africa, particularly South Africa, and is characterized by its hairy, glandular stems and lobed leaves. The plant produces showy, yellow flowers that are typically clustered in racemes, often with five petals that are narrow and pointed. It is often cultivated as an ornamental plant due to its attractive foliage and flowering habit. Abutilon stenopetalum prefers well-drained soil and full sun to partial shade, making it suitable for warm climate gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon stenopetalum"
    },
    "taxonomy_art_desc": "Abutilon stenopetalum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Malvales, a group of flowering plants that includes families such as Malvaceae, known for their showy flowers and cotton-like seeds. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers with five petals. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon stenopetalum, a specific type of plant within the genus Abutilon, distinguished by its narrow petals and specific growth characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon stenopetalum is primarily native to Colombia and Venezuela. This species is found in the tropical regions of these countries. It typically grows in areas with warm, humid climates. The plant is commonly associated with lowland rainforests and secondary vegetation. Its native distribution is limited to specific regions within these South American countries.",
    "distribution_introduced_art_desc": "Abutilon stenopetalum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowers. The distribution of this species has been limited to specific regions within New Zealand, primarily in the North Island. It is not considered invasive and is often cultivated in gardens. The plant's introduction has had minimal impact on native ecosystems."
}
