{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon nelsonii",
    "plant_slug": "abutilon-nelsonii",
    "plant_name_scientific": "abutilon nelsonii",
    "intro": "Abutilon nelsonii, commonly known as the Nelson's abutilon, is a flowering plant native to South America, particularly Brazil. It is a shrub or small tree that can grow up to 5 meters tall, characterized by its soft, hairy stems and broad, heart-shaped leaves. The plant produces clusters of pale yellow flowers that bloom in the summer months, attracting pollinators such as bees and butterflies. Its fibrous bark and hairy foliage are notable botanical features, and it is often cultivated for its ornamental value in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon nelsonii is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Sonora and Baja California. This plant typically grows in rocky soils and can be found in desert scrub and chaparral habitats. It thrives in areas with mild, dry winters and warm, sunny summers. Abutilon nelsonii is well adapted to arid and semi-arid environments.",
    "distribution_introduced_art_desc": "Abutilon nelsonii was mainly introduced to the United States, particularly in the southern states, as an ornamental plant due to its attractive foliage and unique appearance. It has been widely cultivated in gardens and landscapes for its decorative value. However, it has also escaped cultivation and established itself in natural areas, raising concerns about its potential invasiveness. The plant thrives in warm climates and can spread through seeds dispersed by wind or water. Despite its ornamental appeal, its introduction has led to ecological impacts in some regions."
}
