{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon macrophyllum",
    "plant_slug": "abutilon-macrophyllum",
    "plant_name_scientific": "abutilon macrophyllum",
    "intro": "Abutilon macrophyllum, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its large, heart-shaped leaves that are covered in a soft, velvety texture. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often blooming in the spring and summer. It thrives in warm, humid climates and is often found in moist woodlands or along stream banks. Abutilon macrophyllum is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and vibrant blossoms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon macrophyllum is primarily native to the southeastern United States, particularly Florida and parts of Georgia. It thrives in wetland habitats such as swamps, marshes, and along the edges of water bodies. This plant is commonly found in the Florida Panhandle and the coastal regions of the southeastern U.S. It prefers moist, sunny to partially shaded environments with rich, organic soil. Abutilon macrophyllum is an important component of the wetland ecosystems in its native range.",
    "distribution_introduced_art_desc": "Abutilon macrophyllum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in wetland areas and along the edges of streams and rivers. This plant is often used in restoration projects due to its ability to stabilize soil and filter water. It has also been introduced to parts of California and Oregon. However, it is considered a non-native species in these regions and can sometimes outcompete native vegetation."
}
