{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fruticosum",
    "plant_slug": "abutilon-fruticosum",
    "plant_name_scientific": "abutilon fruticosum",
    "intro": "Abutilon fruticosum, commonly known as the velvetleaf abutilon, is a shrub native to tropical and subtropical regions. It is characterized by its hairy, glandular leaves that give it a velvety texture. The plant produces showy, lantern-shaped flowers in shades of yellow to orange, which bloom in clusters. Its fruit is a capsule that splits open to release small, winged seeds. Abutilon fruticosum is often found in disturbed soils and can thrive in a variety of light conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon fruticosum"
    },
    "taxonomy_art_desc": "Abutilon fruticosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and fruit types. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a variety of fruit types such as capsules. Its genus is Abutilon, a group of flowering plants commonly known as \"Chinese lanterns\" due to their distinctive, inflated seed pods. Its species is Abutilon fruticosum, a specific type of plant within the genus Abutilon, characterized by its shrub-like growth and unique fruit structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Algeria",
        "Angola",
        "Arkansas",
        "Botswana",
        "Burkina",
        "Chad",
        "Djibouti",
        "Egypt",
        "Eritrea",
        "Ethiopia",
        "Gulf States",
        "India",
        "Iran",
        "Kenya",
        "Mali",
        "Mauritania",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southwest",
        "Morocco",
        "Namibia",
        "New Mexico",
        "Niger",
        "Northern Provinces",
        "Oklahoma",
        "Oman",
        "Pakistan",
        "Palestine",
        "Saudi Arabia",
        "Senegal",
        "Sinai",
        "Socotra",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Texas",
        "Yemen",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Aldabra"
    ],
    "distribution_native_art_desc": "Abutilon fruticosum is primarily native to Algeria, Angola, Arkansas, Botswana, Burkina, Chad, Djibouti, Egypt, Eritrea, Ethiopia, Gulf States, India, Iran, Kenya, Mali, Mauritania, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Southwest, Morocco, Namibia, New Mexico, Niger, Northern Provinces, Oklahoma, Oman, Pakistan, Palestine, Saudi Arabia, Senegal, Sinai, Socotra, Somalia, Sudan-South Sudan, Tanzania, Texas, Yemen, and Zimbabwe. This plant is commonly found in arid and semi-arid regions, often growing in rocky or sandy soils. It is well adapted to dry climates and can thrive in areas with limited rainfall. The species is also known for its hairy leaves and showy flowers, which make it a notable plant in its native habitats. Its wide distribution across multiple continents highlights its ecological versatility and resilience.",
    "distribution_introduced_art_desc": "Abutilon fruticosum was mainly introduced to Aldabra. It is a shrub native to tropical regions of Africa and the Americas. The plant was likely introduced for its ornamental value or for erosion control. It has adapted well to the island's arid climate and sparse vegetation. However, its spread has raised concerns about potential ecological impacts on native species."
}
