{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon umbelliferum",
    "plant_slug": "abutilon-umbelliferum",
    "plant_name_scientific": "abutilon umbelliferum",
    "intro": "Abutilon umbelliferum, commonly known as the common velvetleaf, is a flowering plant native to the Americas. It is characterized by its broad, heart-shaped leaves that are often covered in soft, fuzzy hairs. The plant produces clusters of small, yellowish-green flowers that bloom in late summer. It is a member of the Malvaceae family, which includes hibiscus and cotton. Abutilon umbelliferum is often found in disturbed soils and can be invasive in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon umbelliferum is primarily native to the southern United States, including Texas, New Mexico, and parts of Arizona. It is also found in northern Mexico, particularly in the states of Chihuahua and Sonora. This species thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is commonly associated with disturbed areas, such as roadsides and dry fields. Its distribution is largely limited to the southwestern regions of North America.",
    "distribution_introduced_art_desc": "Abutilon umbelliferum was mainly introduced to control erosion and for ornamental purposes in disturbed soils. It is commonly found in areas with disturbed ground such as roadsides, railways, and construction sites. The plant has a rapid growth rate and can form dense stands, which can lead to the displacement of native vegetation. Its ability to thrive in poor soil conditions makes it a common weed in agricultural and urban environments. However, it is considered invasive in some regions due to its competitive nature and potential to alter local ecosystems."
}
