{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon marshii",
    "plant_slug": "abutilon-marshii",
    "plant_name_scientific": "abutilon marshii",
    "intro": "Abutilon marshii, commonly known as the marsh abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is a shrub or small tree that typically grows in moist, often saline soils near water sources. The plant features heart-shaped leaves and produces showy, lantern-shaped yellow or orange flowers. It is part of the Malvaceae family, which includes hibiscus and cotton. Abutilon marshii is adapted to arid and semi-arid environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon marshii is primarily native to the southeastern United States, specifically Florida and parts of Georgia. It thrives in moist, sandy soils along coastal areas and wetlands. This species is commonly found in marshy habitats, including tidal flats and freshwater wetlands. It is adapted to high salinity and fluctuating water levels, making it a characteristic plant of coastal ecosystems. Due to its limited distribution, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abutilon marshii was mainly introduced to coastal areas and disturbed sites in California, USA. It is commonly found in sandy soils along the Pacific coast. This plant thrives in sunny, open habitats and is often associated with dunes and maritime scrub. It has been reported as an invasive species in some regions due to its rapid growth and ability to spread vegetatively. Its introduction has raised concerns among local conservationists due to its potential impact on native plant communities."
}
