{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon galeottii",
    "plant_slug": "abutilon-galeottii",
    "plant_name_scientific": "abutilon galeottii",
    "intro": "Abutilon galeottii, commonly known as the Mexican bellflower, is a flowering plant native to Mexico and parts of Central America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its showy, bell-shaped flowers that range in color from white to pink and purple. Its leaves are palmately lobed, and the plant often grows as a shrub or small tree. Abutilon galeottii is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon galeottii is primarily native to the Caribbean islands, including Cuba, Hispaniola, Jamaica, and the Bahamas. It is also found in parts of Central America, such as southern Mexico, Belize, and northern Colombia. This plant typically grows in coastal areas, disturbed soils, and along roadsides. It thrives in tropical and subtropical climates with high humidity and moderate rainfall. Due to its adaptability, it can sometimes be found in cultivated areas as well.",
    "distribution_introduced_art_desc": "Abutilon galeottii was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, lantern-shaped flowers and fuzzy leaves. The introduction occurred during the 19th century as part of the broader trend of introducing exotic plants for horticultural purposes. Despite its ornamental value, it has since become naturalized in some areas, raising concerns about its potential impact on local ecosystems. Its distribution is now limited to specific regions where it thrives in moist, temperate climates."
}
