{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon asiaticum var. albescens",
    "plant_slug": "abutilon-asiaticum-var-albescens",
    "plant_name_scientific": "abutilon asiaticum var. albescens",
    "intro": "Abutilon asiaticum var. albescens, commonly known as the white Chinese lantern, is a deciduous shrub native to China. It is characterized by its fuzzy, ovate leaves and showy, lantern-shaped flowers that range from yellow to orange in color. The plant produces capsules that contain numerous small, wind-dispersed seeds. It thrives in full sun to partial shade and well-drained soil, making it a popular choice for ornamental gardening. Its unique appearance and seasonal blooming make it a distinctive addition to gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon asiaticum var. albescens is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with secondary forests and disturbed habitats. It is also occasionally found in parts of southern China and the Philippines. Its distribution is largely restricted to these geographic regions, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon asiaticum var. albescens was mainly introduced to areas with a warm, humid climate and well-drained soil, typically found in tropical and subtropical regions. It is commonly cultivated as an ornamental plant due to its attractive, velvety leaves and showy flowers. The plant thrives in full sun to partial shade and requires regular watering to maintain its lush appearance. It is often used in landscaping for its aesthetic value and ability to thrive in a variety of garden settings. However, it may become invasive in some regions if not properly managed."
}
