{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon furfurellum",
    "plant_slug": "abutilon-furfurellum",
    "plant_name_scientific": "abutilon furfurellum",
    "intro": "Abutilon furfurellum, commonly known as the velvetleaf or velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its hairy, velvety foliage and showy, lantern-shaped flowers that range in color from yellow to orange. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It typically grows as a shrub or small tree, reaching heights of up to 3 meters. Abutilon furfurellum thrives in well-drained soil and requires full sun to partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon furfurellum is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in areas with arid to semi-arid climates, including parts of Arizona, New Mexico, and Texas. This plant thrives in rocky soils and can often be seen growing in desert scrub and chaparral habitats. It is well adapted to dry conditions and can survive with minimal water. Its native range includes regions such as Baja California and the Sonoran Desert.",
    "distribution_introduced_art_desc": "Abutilon furfurellum was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, maple-like leaves and showy flowers. Despite its aesthetic appeal, it has since become an invasive species in some areas, outcompeting native vegetation. The plant thrives in moist, disturbed soils and can spread rapidly through seed dispersal. Its introduction has led to concerns about ecological impact and management efforts in affected regions."
}
