{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pinkavae",
    "plant_slug": "abutilon-pinkavae",
    "plant_name_scientific": "abutilon pinkavae",
    "intro": "Abutilon pinkavae, commonly known as the pink velvet abutilon, is a shrub native to the tropical regions of South America. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces clusters of small, pale pink to red flowers that bloom throughout the growing season. It thrives in warm, humid climates and requires well-draining soil. Abutilon pinkavae is often cultivated as an ornamental plant due to its unique foliage and attractive flowers.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pinkavae"
    },
    "taxonomy_art_desc": "Abutilon pinkavae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their showy flowers and a wide range of morphological diversity. Its order is Malvales, which includes plants with a variety of flower types and includes economically important species such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon pinkavae, a specific type of plant within the Abutilon genus, known for its unique floral structures and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pinkavae is primarily native to Mexico Northeast. This species is found in the northeastern regions of Mexico, where it thrives in its natural habitat. It is commonly associated with specific ecosystems in that area, such as dry forests or shrublands. The plant's distribution is limited to this region, making it a localized species. Conservation efforts are important to protect its natural environment.",
    "distribution_introduced_art_desc": "Abutilon pinkavae was mainly introduced to tropical and subtropical regions of the Americas, particularly in countries like Mexico, Central America, and parts of South America. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant has been reported in Florida and other southern U.S. states as an invasive species in some areas. Its introduction is likely due to human activities such as trade, landscaping, and accidental seed dispersal. It thrives in warm, humid climates and can outcompete native vegetation if left unchecked."
}
