{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon leonardii",
    "plant_slug": "abutilon-leonardii",
    "plant_name_scientific": "abutilon leonardii",
    "intro": "Abutilon leonardii, commonly known as the velvetleaf abutilon, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces showy, lantern-shaped yellow flowers that bloom in summer. It thrives in well-drained soils and is often found in arid or semi-arid environments. Abutilon leonardii is valued for its ornamental qualities and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon leonardii"
    },
    "taxonomy_art_desc": "Abutilon leonardii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, which comprises plants with showy flowers and includes families such as Malvaceae, Theaceae, and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a diverse range of habitats. Its genus is Abutilon, a group of flowering plants commonly known as Chinese lanterns or velvetleaf, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon leonardii, a specific type within the genus Abutilon, distinguished by its unique morphological features and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bahamas",
        "Dominican Republic",
        "Haiti"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon leonardii is primarily native to the Bahamas, Dominican Republic, and Haiti. This species is commonly found in the tropical and subtropical regions of these islands. It thrives in coastal areas and dry forests, often growing along the shoreline. The plant is well adapted to the warm, humid climate of its native range. It plays an important ecological role in the local flora of these regions.",
    "distribution_introduced_art_desc": "Abutilon leonardii was mainly introduced to the southwestern United States, particularly in Arizona and California. It is commonly found in disturbed areas such as roadsides, fields, and along creek banks. This plant thrives in dry, sunny environments and is often considered a weed in agricultural and natural settings. Its introduction has led to its establishment in various habitats, sometimes outcompeting native vegetation. Due to its adaptability, it has become a common sight in arid and semi-arid regions of the western United States."
}
