{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon indicum var. asiaticum",
    "plant_slug": "abutilon-indicum-var-asiaticum",
    "plant_name_scientific": "abutilon indicum var. asiaticum",
    "intro": "Abutilon indicum var. asiaticum, commonly known as the Indian velvet tree or velvetleaf, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, velvety leaves that give it its common name, and it produces lantern-shaped flowers that range in color from yellow to red. The plant is often cultivated for its ornamental value due to its attractive foliage and showy blooms. It thrives in warm climates and requires well-drained soil and full sun to partial shade. Its botanical features make it a popular choice for gardens and as a decorative plant in warmer regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon indicum var. asiaticum is primarily native to Southeast Asia, including countries such as India, Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in areas with warm, humid climates. This plant thrives in open woodlands, shrublands, and along riverbanks. It is often cultivated for its ornamental value due to its hairy leaves and showy flowers. Its native range extends into parts of southern China and the Philippines as well.",
    "distribution_introduced_art_desc": "Abutilon indicum var. asiaticum was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive, lantern-shaped flowers and fuzzy leaves. It is commonly cultivated in gardens and as a houseplant because of its ability to thrive in warm climates with moderate sunlight. The plant is also valued for its potential use in traditional medicine and as a source of fiber. However, in some areas, it has become invasive, outcompeting native species and altering local ecosystems. Its rapid growth and adaptability make it both a desirable ornamental and a potential ecological concern."
}
