{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cuspidatum",
    "plant_slug": "abutilon-cuspidatum",
    "plant_name_scientific": "abutilon cuspidatum",
    "intro": "Abutilon cuspidatum, commonly known as the Chinese lantern plant, is a deciduous shrub native to China and Southeast Asia. It is characterized by its heart-shaped, velvety leaves and clusters of lantern-like, orange-red bracts that resemble small lanterns. The plant produces small, inconspicuous yellow flowers followed by fuzzy, spiny capsules. It thrives in full sun to partial shade and is often grown for its ornamental value. Abutilon cuspidatum is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon cuspidatum"
    },
    "taxonomy_art_desc": "Abutilon cuspidatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some seed plants, known for their primitive features and diverse morphological adaptations. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures and diverse habitats. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae, which are known for their cotton and hibiscus relatives. Its family is Malvaceae, commonly known as the mallow family, which includes a wide range of plants with distinctive flowers and some with economically important fibers or ornamental value. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"cotton bush,\" which are typically shrubs or trees with hairy leaves and showy flowers. Its species is Abutilon cuspidatum, a specific type of Abutilon native to the Americas, characterized by its narrow leaves and distinctive floral structures, often found in moist environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cuspidatum is primarily native to Venezuela. It is found in various regions of the country, particularly in the northern and central areas. This plant thrives in tropical and subtropical climates, often growing in open woodlands and disturbed soils. It is known for its hairy stems and showy yellow flowers. Its native range in Venezuela reflects its adaptation to the region's diverse ecosystems.",
    "distribution_introduced_art_desc": "Abutilon cuspidatum was mainly introduced to the United States as an ornamental plant due to its attractive, lantern-shaped flowers and its ability to thrive in various climates. It was widely cultivated in the southern regions, particularly in Florida and Texas, where it is often used in landscaping and garden design. Despite its aesthetic appeal, it has become an invasive species in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and seed dispersal through wind and water have contributed to its spread beyond cultivated areas. As a result, it is now considered a noxious weed in several states, requiring management efforts to control its proliferation."
}
