{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sellowianum var. marmoratum",
    "plant_slug": "abutilon-sellowianum-var-marmoratum",
    "plant_name_scientific": "abutilon sellowianum var. marmoratum",
    "intro": "Abutilon sellowianum var. marmoratum, commonly known as the variegated abutilon, is a flowering plant native to Brazil. It is characterized by its striking variegated leaves that display patterns of white, yellow, and green. The plant produces lantern-shaped, hairy flowers that range in color from yellow to orange. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Its foliage and unique flower structure make it a popular choice for gardeners seeking visual interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sellowianum var. marmoratum is primarily native to Brazil, specifically the states of Bahia, Pernambuco, and Piauí. This plant is commonly found in the Atlantic Forest biome, where it thrives in humid, tropical conditions. It is often associated with secondary forests and disturbed areas, growing as a shrub or small tree. The varietal form, marmoratum, is distinguished by its striking, mottled leaves with a marbled pattern. Due to habitat loss, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abutilon sellowianum var. marmoratum was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its unique mottled leaves and showy flowers. The introduction occurred primarily in the late 20th century through horticultural trade and gardening practices. It has since become established in some areas, though its spread is limited compared to other invasive species. This plant is considered a non-native species in the region, with potential ecological impacts on local flora."
}
