{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon subsagittatum",
    "plant_slug": "abutilon-subsagittatum",
    "plant_name_scientific": "abutilon subsagittatum",
    "intro": "Abutilon subsagittatum, commonly known as the arrowleaf abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its heart-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 6 feet. It thrives in well-drained soils and full sun, making it a popular choice for ornamental gardening. Its botanical features make it a valuable addition to xeriscapes and native plant gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon subsagittatum is primarily native to the southern United States, particularly Texas, and parts of northern Mexico. It thrives in arid and semi-arid environments, often found in rocky soils and along dry streambeds. This species is commonly associated with desert and scrubland habitats, where it adapts to low moisture conditions. It is also found in areas with limestone substrates, which contribute to its unique growth patterns. Due to its hardy nature, it is sometimes cultivated in gardens in regions with similar climates.",
    "distribution_introduced_art_desc": "Abutilon subsagittatum was mainly introduced to ornamental horticulture due to its attractive, maple-like leaves and showy yellow flowers. It is commonly cultivated in warm climates as a decorative plant for gardens and landscapes. The species has been spread through both intentional planting and accidental seed dispersal by wind or animals. It thrives in well-drained soil and full sun, making it suitable for coastal and tropical regions. However, it is considered an invasive species in some areas where it outcompetes native vegetation."
}
