{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon reticulatum",
    "plant_slug": "abutilon-reticulatum",
    "plant_name_scientific": "abutilon reticulatum",
    "intro": "Abutilon reticulatum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped bracts that resemble small flowers. The plant produces small, inconspicuous flowers that are typically green or yellow in color. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Abutilon reticulatum is valued for its ornamental appeal and is sometimes cultivated as a decorative plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon reticulatum is primarily native to Southeast Asia, including countries such as India, Sri Lanka, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in areas with warm, humid climates. This plant thrives in coastal and lowland areas, often growing in sandy or loamy soils. It is also present in parts of Australia and the Pacific Islands. Its natural range extends across various parts of the Indian Ocean and the South Pacific.",
    "distribution_introduced_art_desc": "Abutilon reticulatum was mainly introduced to the Pacific Northwest of the United States. It was brought there as an ornamental plant due to its attractive, lantern-shaped flowers. The plant has since become naturalized in wetland and riparian areas, spreading along riverbanks and disturbed sites. Its rapid growth and ability to thrive in moist conditions have led to its classification as an invasive species in some regions. However, it is also valued for its ecological benefits, providing habitat and food for native wildlife."
}
