{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon oxypetalum",
    "plant_slug": "abutilon-oxypetalum",
    "plant_name_scientific": "abutilon oxypetalum",
    "intro": "Abutilon oxypetalum, commonly known as the velvetleaf abutilon, is a flowering plant native to Central and South America. It is a shrub or small tree that can grow up to 5 meters tall, characterized by its rough, hairy stems and heart-shaped leaves. The plant produces yellow flowers with five petals, which bloom in clusters during the summer months. It thrives in tropical and subtropical climates, preferring well-drained soil and full sunlight. Its botanical features make it a popular ornamental plant in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon oxypetalum is primarily native to South America, specifically Brazil. It is found in the Atlantic Forest region, which spans the eastern coast of the country. This plant thrives in tropical and subtropical climates, often growing in moist, shaded areas within the forest canopy. It is also known to occur in parts of Paraguay and Argentina. Due to habitat loss, it is considered vulnerable and requires conservation efforts to protect its natural range.",
    "distribution_introduced_art_desc": "Abutilon oxypetalum was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was brought in for its ornamental value due to its attractive, lantern-shaped flowers and fuzzy, maple-like leaves. The plant thrives in warm, humid climates and is often found in disturbed areas such as roadsides and vacant lots. It has become naturalized in some regions, spreading through both seeds and vegetative reproduction. Due to its invasive potential, it is sometimes considered a weed in areas where it establishes itself aggressively."
}
