{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon itatiaiae var. hirsuta",
    "plant_slug": "abutilon-itatiaiae-var-hirsuta",
    "plant_name_scientific": "abutilon itatiaiae var. hirsuta",
    "intro": "Abutilon itatiaiae var. hirsuta, commonly known as the hairy abutilon, is a flowering plant native to South America. It is characterized by its soft, hairy foliage and clusters of yellow flowers that bloom in the summer. The plant typically grows as an upright shrub, reaching heights of up to 2 meters. Its leaves are ovate with a serrated edge, and the stems are often covered in fine, white hairs. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon itatiaiae var. hirsuta is primarily native to Brazil, specifically the state of São Paulo. It is found in the Atlantic Forest biome, which is one of the most biodiverse regions in South America. This plant typically grows in humid, tropical environments with well-drained soil. It is commonly found in secondary forests and along riverbanks. Its native range is limited to this specific region within Brazil.",
    "distribution_introduced_art_desc": "Abutilon itatiaiae var. hirsuta was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its attractive fuzzy leaves and showy flowers. It has since spread to other regions, including parts of Africa and Southeast Asia, where it has become naturalized in certain environments. The plant thrives in warm, humid climates and is often found in disturbed areas such as roadsides and abandoned fields. Its rapid growth and ability to reproduce both vegetatively and through seeds contribute to its successful establishment in new regions. However, it is considered a potential invasive species in some areas, raising concerns about its ecological impact."
}
