{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon orbiculatum",
    "plant_slug": "abutilon-orbiculatum",
    "plant_name_scientific": "abutilon orbiculatum",
    "intro": "Abutilon orbiculatum, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to tropical and subtropical regions. It is characterized by its heart-shaped leaves and showy, lantern-like flowers that range in color from yellow to orange. The plant typically grows as an herbaceous annual or a shrub, depending on the climate. It thrives in well-drained soil and full sunlight, often found in disturbed areas such as roadsides and fields. Its fibrous stems and hairy foliage contribute to its distinctive appearance and ecological role.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon orbiculatum"
    },
    "taxonomy_art_desc": "Abutilon orbiculatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and some with specialized structures like hirsute stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and okra, characterized by their capsule fruits and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their ornamental value and unique leaf shapes. Its species is Abutilon orbiculatum, a specific type of plant within the genus Abutilon, characterized by its round leaves and showy flowers, often cultivated for its aesthetic appeal.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon orbiculatum is primarily native to China Southeast. This species is commonly found in the southern regions of China, particularly in provinces such as Guangdong, Guangxi, and Yunnan. It thrives in tropical and subtropical climates, often growing in coastal areas and lowland forests. The plant is well adapted to humid environments and is often seen along riverbanks and in dense vegetation. Its native distribution in Southeast China reflects its preference for warm, moist conditions.",
    "distribution_introduced_art_desc": "Abutilon orbiculatum was mainly introduced to the Pacific Islands, where it has become an invasive species. It was likely introduced through human activities such as shipping or gardening. The plant thrives in coastal areas and disturbed habitats, leading to its rapid spread. It competes with native vegetation, threatening local ecosystems. Efforts are being made to control its spread and prevent further ecological damage."
}
