{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fluviatile",
    "plant_slug": "abutilon-fluviatile",
    "plant_name_scientific": "abutilon fluviatile",
    "intro": "Abutilon fluviatile, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to tropical and subtropical regions. It is characterized by its broad, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant thrives in moist, fertile soils and is often found near water bodies. It belongs to the Malvaceae family, which includes cotton and hibiscus. Abutilon fluviatile is also known for its rapid growth and ability to spread through both seeds and vegetative means.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon fluviatile is primarily native to South America, particularly in regions such as Argentina, Bolivia, Brazil, Paraguay, and Uruguay. It is commonly found in riparian habitats, growing along rivers and streams in tropical and subtropical areas. This plant thrives in moist, well-drained soils and is often associated with floodplain environments. It is also known to occur in parts of Central America and the Caribbean. Its distribution is closely linked to water bodies, making it an important species in aquatic and semi-aquatic ecosystems.",
    "distribution_introduced_art_desc": "Abutilon fluviatile was mainly introduced to the southern United States, particularly in Texas and Louisiana, as an ornamental plant due to its attractive foliage and flowers. It has since spread to other regions, including parts of California and Florida, where it thrives in moist, sunny environments. This plant is considered an invasive species in some areas because of its rapid growth and ability to outcompete native vegetation. It is often found along riverbanks, wetlands, and disturbed soils, where it can form dense stands. Its introduction has led to ecological concerns, prompting management efforts to control its spread."
}
