{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pitcairnense",
    "plant_slug": "abutilon-pitcairnense",
    "plant_name_scientific": "abutilon pitcairnense",
    "intro": "Abutilon pitcairnense, commonly known as the Pitcairn abutilon, is a flowering plant native to the island of Pitcairn in the South Pacific. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its hairy stems and heart-shaped leaves, and it produces showy, bell-shaped flowers in shades of yellow and orange. It thrives in coastal environments and is adapted to the region's humid climate. Due to its limited distribution, it is considered a rare and endemic species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pitcairnense"
    },
    "taxonomy_art_desc": "Abutilon pitcairnense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and hibiscus, characterized by their sympetalous flowers. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern,\" known for their hairy leaves and showy flowers. Its species is Abutilon pitcairnense, a specific type of Abutilon native to the island of Pitcairn, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Pitcairn Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pitcairnense is primarily native to the Pitcairn Islands. This plant is endemic to this remote island group in the South Pacific Ocean. It grows in the limited habitat of the islands, typically in coastal areas or rocky terrain. Due to its restricted range, it is considered a rare and unique species. Conservation efforts are important to protect this native flora from threats such as habitat loss and invasive species.",
    "distribution_introduced_art_desc": "Abutilon pitcairnense was mainly introduced to New Zealand. It is considered an invasive species in the region, spreading rapidly in coastal and disturbed habitats. The plant was likely introduced through human activity, possibly as a decorative or ornamental species. Its growth can outcompete native plants, leading to ecological concerns. Efforts are being made to control its spread and mitigate its impact on local ecosystems."
}
