{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon persicum var. narasimhanii",
    "plant_slug": "abutilon-persicum-var-narasimhanii",
    "plant_name_scientific": "abutilon persicum var. narasimhanii",
    "intro": "Abutilon persicum var. narasimhanii, commonly known as the Narasimhan's Abutilon, is a flowering plant native to the Indian subcontinent. It belongs to the Malvaceae family and is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant typically grows as an upright shrub, reaching heights of up to 2 meters. Its flowers, which can be pink, red, or yellow, bloom in late spring to early summer. It prefers well-drained soil and full sun, making it a suitable ornamental plant for gardens in warm climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon persicum"
    },
    "taxonomy_art_desc": "Abutilon persicum var. narasimhanii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for its primitive vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms, often with primitive floral structures. Its order is Malvales, a group of flowering plants that includes economically important families such as Malvaceae, known for their showy flowers and cotton production. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hirsute stems, showy flowers, and a wide range of ecological and economic importance. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and capsule fruits. Its species is Abutilon persicum, a specific type within the genus Abutilon, which is known for its ornamental value and is native to certain regions of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India",
        "Myanmar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon persicum var. narasimhanii is primarily native to India and Myanmar. This variant of the species is found in specific regions within these countries. It is typically associated with tropical and subtropical environments. The plant thrives in areas with warm climates and well-drained soils. Its native distribution is limited to these geographic regions.",
    "distribution_introduced_art_desc": "Abutilon persicum var. narasimhanii was mainly introduced to regions with warm, humid climates and well-drained soil, where it can thrive as an ornamental plant. It is often cultivated in gardens and greenhouses for its attractive, lantern-shaped flowers and fuzzy leaves. This variety is particularly suited to tropical and subtropical areas, making it a popular choice in horticultural settings. Due to its aesthetic appeal, it has been introduced to several countries outside its native range. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
