{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon glaucum var. cavanillesii",
    "plant_slug": "abutilon-glaucum-var-cavanillesii",
    "plant_name_scientific": "abutilon glaucum var. cavanillesii",
    "intro": "Abutilon glaucum var. cavanillesii, commonly known as the silverleaf abutilon, is a flowering plant native to South America. It is characterized by its broad, velvety leaves that are covered in a fine, whitish bloom, giving it a silvery appearance. The plant produces clusters of small, yellowish flowers that bloom in the spring and summer. It is often grown as an ornamental plant due to its attractive foliage and ease of care. Abutilon glaucum var. cavanillesii prefers well-drained soil and full sun to partial shade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon glaucum var. cavanillesii is primarily native to the Caribbean region, including parts of Cuba, Hispaniola, Jamaica, and the Greater Antilles. This plant thrives in tropical and subtropical climates, often found in coastal areas and disturbed habitats. It is commonly associated with sandy soils and can be found in open woodlands or along roadsides. The species is also present in some parts of southern Florida and the Bahamas. Its distribution is closely linked to the natural vegetation of the Caribbean islands.",
    "distribution_introduced_art_desc": "Abutilon glaucum var. cavanillesii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, maple-like leaves and showy flowers. The plant has since become naturalized in certain regions, particularly in coastal and disturbed areas. It is often found growing along roadsides and in urban environments. Despite its ornamental value, it has raised concerns due to its potential to invade native habitats."
}
