{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon glechomifolium",
    "plant_slug": "abutilon-glechomifolium",
    "plant_name_scientific": "abutilon glechomifolium",
    "intro": "Abutilon glechomifolium, commonly known as the heartleaf abutilon, is a flowering plant native to South America. It is a shrub that typically grows to a height of about 1 to 2 meters, featuring a woody stem and hairy foliage. The leaves are heart-shaped, with a velvety texture and a deep green color, often with a slight reddish tinge on the underside. It produces showy, bell-shaped flowers in shades of yellow, orange, and red, which bloom in clusters during the summer months. The plant is valued for its ornamental appeal and is often cultivated in gardens for its attractive foliage and vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon glechomifolium is primarily native to the Caribbean, including parts of the Bahamas, Cuba, Hispaniola, and Puerto Rico. It is commonly found in tropical and subtropical regions, particularly in coastal areas and moist lowland habitats. This plant thrives in sandy or loamy soils and is often seen in open woodlands and along stream banks. It is an important component of the local flora and is adapted to the warm, humid climate of its native range. Due to its ornamental value, it is occasionally cultivated in other regions with similar environmental conditions.",
    "distribution_introduced_art_desc": "Abutilon glechomifolium was mainly introduced to ornamental horticulture due to its attractive, maple-like leaves and showy yellow flowers. It is commonly cultivated in gardens and landscapes in regions with warm climates. The plant is often used as a decorative shrub or small tree in USDA hardiness zones 8 through 10. Its introduction has led to its presence in various parts of the United States and other tropical and subtropical areas. However, it is important to note that it may spread beyond cultivated areas and become invasive in some environments."
}
