{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon malviflorum",
    "plant_slug": "abutilon-malviflorum",
    "plant_name_scientific": "abutilon malviflorum",
    "intro": "Abutilon malviflorum, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It thrives in warm climates and is often cultivated as an ornamental plant due to its attractive appearance. Abutilon malviflorum typically grows as a shrub or small tree, reaching heights of up to 3 meters.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon malviflorum is primarily native to South America, particularly in regions such as Brazil, Argentina, and Paraguay. It is commonly found in tropical and subtropical areas, often growing in dry, open habitats like grasslands and shrublands. This plant thrives in well-drained soils and is adapted to warm climates with distinct wet and dry seasons. It is also occasionally found in parts of Central America and the Caribbean. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Abutilon malviflorum was mainly introduced to the western United States, particularly in California, as an ornamental plant due to its attractive, lantern-shaped flowers. It was also introduced to parts of Hawaii and the Pacific Islands for similar ornamental purposes. The plant thrives in warm, temperate climates and is often found in disturbed areas such as roadsides and abandoned fields. Despite its beauty, it has become invasive in some regions, outcompeting native vegetation. Its rapid growth and ability to spread through seeds make it a challenging species to control in natural habitats."
}
