{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon carinatum",
    "plant_slug": "abutilon-carinatum",
    "plant_name_scientific": "abutilon carinatum",
    "intro": "Abutilon carinatum, commonly known as the Chinese lantern plant, is a deciduous shrub native to Southeast Asia. It is characterized by its heart-shaped, velvety leaves and striking, papery bracts that resemble small lanterns. The plant produces small yellow flowers that are often hidden beneath the showy bracts. It thrives in warm climates and is often cultivated for its ornamental value. Abutilon carinatum is relatively drought-tolerant once established, making it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon carinatum"
    },
    "taxonomy_art_desc": "Abutilon carinatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and often complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and cotton-like fibers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon carinatum, a specific type within the genus Abutilon, known for its unique features such as its ridged stems and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon carinatum is primarily native to Brazil Southeast. This species is commonly found in the coastal regions of this area. It thrives in tropical and subtropical climates with high humidity. The plant is often seen growing in open woodlands and along riverbanks. Its natural range is limited to the southeastern part of Brazil.",
    "distribution_introduced_art_desc": "Abutilon carinatum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, fields, and along streambanks. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It spreads through seeds that are easily dispersed by wind, water, and animals. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
