{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mauritianum subsp. mauritianum",
    "plant_slug": "abutilon-mauritianum-subsp-mauritianum",
    "plant_name_scientific": "abutilon mauritianum subsp. mauritianum",
    "intro": "Abutilon mauritianum subsp. mauritianum, commonly known as the Mauritius velvetleaf, is a flowering plant native to Madagascar. It is characterized by its heart-shaped leaves and showy, lantern-shaped yellow flowers that bloom in clusters. The plant is typically shrub-like, with smooth, often hairy stems that can grow up to several meters in height. It thrives in tropical and subtropical climates, preferring well-drained soil and full sun exposure. Its ornamental value makes it a popular choice for gardens, though it can become invasive in certain regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon mauritianum"
    },
    "taxonomy_art_desc": "Abutilon mauritianum subsp. mauritianum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often exhibiting a distinct life cycle with a sporophyte and gametophyte stage. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Malvales, which includes plants with showy flowers, often with five petals, and is known for its economic importance, including cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, characterized by their sympetalous flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon mauritianum, a specific type within the genus Abutilon, native to Madagascar, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Benin",
        "Botswana",
        "Burundi",
        "Cameroon",
        "Central African Republic",
        "Chad",
        "Comoros",
        "Congo",
        "DR Congo",
        "Eritrea",
        "Ethiopia",
        "Gabon",
        "Ghana",
        "Guinea",
        "Ivory Coast",
        "Kenya",
        "KwaZulu-Natal",
        "Malawi",
        "Mozambique",
        "Nigeria",
        "Northern Provinces",
        "Oman",
        "Rwanda",
        "Senegal",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Togo",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon mauritianum subsp. mauritianum is primarily native to Angola, Benin, Botswana, Burundi, Cameroon, Central African Republic, Chad, Comoros, Congo, DR Congo, Eritrea, Ethiopia, Gabon, Ghana, Guinea, Ivory Coast, Kenya, KwaZulu-Natal, Malawi, Mozambique, Nigeria, Northern Provinces, Oman, Rwanda, Senegal, Somalia, Sudan-South Sudan, Tanzania, Togo, Zambia, and Zimbabwe. This species is commonly found in tropical and subtropical regions across these countries. It thrives in open, sunny habitats such as grasslands, woodlands, and along riverbanks. The plant is often seen in disturbed areas and is adaptable to various soil types. Its native range spans much of sub-Saharan Africa, with some occurrences in the Arabian Peninsula.",
    "distribution_introduced_art_desc": "Abutilon mauritianum subsp. mauritianum was mainly introduced to Hawaii, where it has become an invasive species. It was originally from Madagascar and was brought to Hawaii as an ornamental plant due to its attractive foliage and flowers. The plant thrives in tropical and subtropical climates, leading to its rapid spread across native ecosystems. It competes with native vegetation, often displacing native plants and altering local habitats. Due to its invasive nature, it is now considered a significant threat to the ecological balance in Hawaii."
}
