{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta splendida",
    "plant_slug": "abuta-splendida",
    "plant_name_scientific": "abuta splendida",
    "intro": "Abuta splendida, commonly known as the golden abuta, is a flowering plant native to the tropical regions of South America. It belongs to the family Euphorbiaceae, which includes many species with milky sap. The plant is characterized by its vibrant yellow flowers and palmate leaves, which are often used in traditional medicine. It thrives in humid, shaded environments and is often found in the understory of rainforests. Due to its ornamental value and medicinal properties, it is sometimes cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta splendida is primarily native to the tropical rainforests of western Africa, specifically countries such as Cameroon, Gabon, and the Central African Republic. It thrives in humid, shaded environments within these dense forest ecosystems. The plant is commonly found in the undergrowth of primary and secondary forests, where it benefits from the rich organic soil and consistent moisture. It plays an important role in the local biodiversity and is often used in traditional medicine by indigenous communities. Due to habitat loss and overharvesting, its distribution has become increasingly restricted in recent years.",
    "distribution_introduced_art_desc": "Abuta splendida was mainly introduced to regions with warm, humid climates and well-drained soils, typically found in tropical and subtropical areas. It is commonly cultivated in gardens and greenhouses where it can thrive in partial to full sun. The plant is valued for its ornamental flowers and medicinal properties, which have contributed to its popularity among horticulturists and herbalists. Its introduction has been primarily driven by horticultural interest and traditional medicine practices. However, it is important to monitor its spread to prevent potential invasiveness in non-native environments."
}
