{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta scandens",
    "plant_slug": "abuta-scandens",
    "plant_name_scientific": "abuta scandens",
    "intro": "Abuta scandens, commonly known as the climbing abuta, is a flowering plant native to the tropical regions of South America. It belongs to the family Euphorbiaceae and is characterized by its woody vines that can climb to significant heights. The plant produces small, yellowish-green flowers that are clustered in inflorescences called cyathia. Its leaves are alternate, ovate, and often have a slightly hairy texture. Abuta scandens is also noted for its medicinal properties, with various parts of the plant used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta scandens is primarily native to the tropical regions of South America, particularly in countries such as Brazil, Colombia, and Peru. It thrives in humid, lowland areas with rich soil and ample sunlight. This climbing plant is commonly found in rainforests and secondary growth habitats. It is well adapted to the warm and moist climate of the Amazon Basin. Its distribution is largely restricted to the western part of the continent.",
    "distribution_introduced_art_desc": "Abuta scandens was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, waxy leaves and unique appearance. However, it has since become invasive in certain areas, outcompeting native vegetation. The plant thrives in moist, shaded environments, making it a common sight in forest understories. Its rapid growth and ability to spread through both seeds and rhizomes have raised concerns among conservationists."
}
