{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon grandiflorum",
    "plant_slug": "abutilon-grandiflorum",
    "plant_name_scientific": "abutilon grandiflorum",
    "intro": "Abutilon grandiflorum, commonly known as the Chinese lantern plant, is a flowering shrub native to Southeast Asia. It is characterized by its velvety, ovate leaves and showy, lantern-shaped yellow-orange flowers that bloom in clusters. The plant is often cultivated for its ornamental value due to its vibrant blooms and unique foliage. It thrives in warm, humid climates and is relatively drought-tolerant once established. The fruit is a dry capsule that splits open to release seeds, contributing to its propagation in the wild.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon grandiflorum"
    },
    "taxonomy_art_desc": "Abutilon grandiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and the presence of true stems and roots. Its class is Equisetopsida, which includes ferns and horsetails, known for their primitive vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and cotton-like fibers in some species. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon grandiflorum, a specific type of Abutilon known for its large, showy flowers and is often cultivated for ornamental purposes.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "DR Congo",
        "Eswatini",
        "Gulf of Guinea Is.",
        "Kenya",
        "KwaZulu-Natal",
        "Madagascar",
        "Malawi",
        "Mozambique",
        "Northern Provinces",
        "Tanzania",
        "Uganda",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Florida",
        "Norfolk Is.",
        "Spain"
    ],
    "distribution_native_art_desc": "Abutilon grandiflorum is primarily native to Angola, DR Congo, Eswatini, Gulf of Guinea Is., Kenya, KwaZulu-Natal, Madagascar, Malawi, Mozambique, Northern Provinces, Tanzania, Uganda, and Zimbabwe. It is commonly found in tropical and subtropical regions within these countries. The plant thrives in moist, well-drained soils and is often associated with forest understories or riverine habitats. It is known for its ornamental value due to its hairy leaves and showy flowers. Its distribution spans across much of sub-Saharan Africa, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon grandiflorum was mainly introduced to Florida, Norfolk Island, and Spain. It is a flowering plant native to South America but has been cultivated in these regions for ornamental purposes. The introduction of this species has led to its establishment in local ecosystems, sometimes as an invasive species. Its presence in these areas is often associated with human activity, such as horticulture and landscaping. The plant's adaptability to different climates has contributed to its spread across these locations."
}
