{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sylvaticum subsp. buchtienii",
    "plant_slug": "abutilon-sylvaticum-subsp-buchtienii",
    "plant_name_scientific": "abutilon sylvaticum subsp. buchtienii",
    "intro": "Abutilon sylvaticum subsp. buchtienii, commonly known as the Buchtien's abutilon, is a flowering plant native to parts of Central America and northern South America. It belongs to the Malvaceae family, which includes cotton and hibiscus. The plant is characterized by its hairy, glandular stems and leaves that are often palmately lobed. Its showy, yellow-orange flowers are typically clustered in panicles, and it produces fluffy, cotton-like seeds that are dispersed by wind. This subspecies is often found in moist, shaded habitats such as forests and along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sylvaticum subsp. buchtienii is primarily native to southern China, including regions such as Guangdong, Guangxi, and Yunnan. It is also found in parts of Southeast Asia, including Vietnam and Thailand. This species typically grows in tropical and subtropical climates, often in moist, shaded environments. It is commonly found in forest understories and along riverbanks. Its native distribution is characterized by its adaptability to humid, warm climates with well-drained soils.",
    "distribution_introduced_art_desc": "Abutilon sylvaticum subsp. buchtienii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, waste areas, and along riverbanks. It thrives in regions with moderate to high rainfall and full sun exposure. This subspecies is known for its rapid growth and ability to colonize new areas quickly. It is commonly found in parts of Southeast Asia, including Indonesia and the Philippines. Due to its adaptability, it has become a weed in some regions where it competes with native vegetation."
}
