{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fraseri",
    "plant_slug": "abutilon-fraseri",
    "plant_name_scientific": "abutilon fraseri",
    "intro": "Abutilon fraseri, commonly known as the Fraser's abutilon, is a flowering plant native to the western United States. It is a perennial shrub that typically grows in arid or semi-arid environments. The plant features soft, hairy stems and heart-shaped leaves with a velvety texture. It produces showy, lantern-shaped flowers in shades of yellow and orange, which bloom in the spring. Abutilon fraseri is valued for its ornamental appeal and is often cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon fraseri"
    },
    "taxonomy_art_desc": "Abutilon fraseri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails and some mosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malvales, which consists of flowering plants with a distinctive structure in their flowers and includes species like cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon fraseri, a specific type within the genus Abutilon, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon fraseri is primarily native to New South Wales, Northern Territory, Queensland, South Australia, Victoria, and Western Australia. This species is commonly found in arid and semi-arid regions across these states. It thrives in sandy or rocky soils and is often seen in coastal and inland areas. The plant is well adapted to the harsh climatic conditions of these regions. It plays an important role in local ecosystems and is sometimes used in landscaping due to its ornamental value.",
    "distribution_introduced_art_desc": "Abutilon fraseri was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant thrives in moist, well-drained soils and full sun to partial shade conditions. It is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded as a result of human activity and accidental seed dispersal."
}
