{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon albidum subsp. fruticosum",
    "plant_slug": "abutilon-albidum-subsp-fruticosum",
    "plant_name_scientific": "abutilon albidum subsp. fruticosum",
    "intro": "Abutilon albidum subsp. fruticosum, commonly known as the silverleaf abutilon, is a shrub native to South America. It is characterized by its silvery-white undersides on its leaves, which give it its common name. The plant produces showy, lantern-shaped yellow flowers that bloom in the spring. It thrives in well-drained soil and full sun, making it a suitable ornamental plant in warm climates. Its unique foliage and seasonal blooms make it a popular choice for gardeners seeking a striking, low-maintenance plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon albidum subsp. fruticosum is primarily native to southern Africa, particularly South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, often growing in rocky soils or along riverbanks. This subspecies is adapted to dry climates and can thrive in both full sun and partial shade. It is often seen in shrublands and grasslands, where it contributes to local biodiversity. Its distribution is closely linked to the availability of well-drained soils and moderate to high sunlight exposure.",
    "distribution_introduced_art_desc": "Abutilon albidum subsp. fruticosum was mainly introduced to regions with warm, temperate climates that provide well-drained soils and ample sunlight. It is commonly found in coastal areas and disturbed sites where it thrives due to its adaptability. This subspecies is often used in ornamental horticulture for its attractive, showy flowers and unique, maple-like leaves. It has been introduced to parts of southern Europe, the Mediterranean, and some areas of the United States. However, its spread is limited by its preference for specific environmental conditions and its relatively slow growth rate."
}
