{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon divaricatum",
    "plant_slug": "abutilon-divaricatum",
    "plant_name_scientific": "abutilon divaricatum",
    "intro": "Abutilon divaricatum, commonly known as the Chinese lantern plant, is a flowering plant native to Southeast Asia. It is characterized by its pendulous, spathaceous bracts that resemble small lanterns, which are often brightly colored. The plant produces small, yellowish flowers that are clustered in inflorescences. It is a deciduous shrub that can grow up to 3 meters in height, with hairy, glandular leaves. Abutilon divaricatum is often cultivated for its ornamental value in gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon divaricatum"
    },
    "taxonomy_art_desc": "Abutilon divaricatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and a variety of ecological adaptations. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers that often have five petals. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon divaricatum, a specific type within the genus Abutilon, known for its distinctive appearance and growth habits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Costa Rica",
        "Guatemala",
        "Honduras",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua",
        "Panamá"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon divaricatum is primarily native to Colombia, Costa Rica, Guatemala, Honduras, Mexico Central, Mexico Gulf, Mexico Southeast, Mexico Southwest, Nicaragua, and Panamá. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in areas with warm climates and well-drained soils. Abutilon divaricatum is often associated with disturbed habitats such as roadsides and open woods. Its natural range extends through Central America and parts of southern Mexico.",
    "distribution_introduced_art_desc": "Abutilon divaricatum was mainly introduced to the Pacific Northwest of the United States. It is commonly found in moist, disturbed areas such as roadsides and streambanks. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It thrives in temperate climates with moderate rainfall. Its presence has led to increased management efforts in natural areas to prevent its spread."
}
