{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon avicennae f. nigrum",
    "plant_slug": "abutilon-avicennae-f-nigrum",
    "plant_name_scientific": "abutilon avicennae f. nigrum",
    "intro": "Abutilon avicennae f. nigrum, commonly known as black velvet abutilon, is a shrub native to tropical and subtropical regions. It features hairy, ovate leaves that are often dark green with a velvety texture. The plant produces showy, bell-shaped flowers in shades of yellow or orange, typically blooming in spring. Its fruit is a capsule that splits open to release small, dry seeds. This species is valued for its ornamental appeal and is often cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon avicennae f. nigrum is primarily native to the tropical and subtropical regions of Southeast Asia, including countries such as India, Sri Lanka, and parts of Indonesia. This plant thrives in humid climates with well-drained soils, often found in coastal areas and along riverbanks. It is commonly associated with mangrove ecosystems and can be found in brackish water environments. The species is also present in the Andaman and Nicobar Islands, where it grows in moist, shaded habitats. Its native distribution is closely linked to the ecological conditions of these regions, where it plays a role in local biodiversity.",
    "distribution_introduced_art_desc": "Abutilon avicennae f. nigrum was mainly introduced to areas with warm, humid climates and well-drained soils, often found in coastal regions and disturbed habitats. It thrives in tropical and subtropical environments, making it common in parts of Southeast Asia, the Pacific Islands, and the Caribbean. This plant is often cultivated for its ornamental value due to its unique, lantern-like flowers and fuzzy leaves. It has been reported as an invasive species in some regions where it outcompetes native vegetation. Its distribution is largely influenced by human activity, including horticultural trade and accidental introduction."
}
