{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon virginale",
    "plant_slug": "abutilon-virginale",
    "plant_name_scientific": "abutilon virginale",
    "intro": "Abutilon virginale, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to the Americas. It is a herbaceous perennial that can grow up to 3 meters in height, with heart-shaped, velvety leaves that are typically green on top and silver underneath. The plant produces showy, lantern-shaped yellow flowers that bloom in the summer months. It thrives in moist, well-drained soils and is often found in wetlands, stream banks, and disturbed areas. Its fibrous roots and rapid growth make it an effective pioneer species in ecological succession.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon virginale is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is also found in some areas of southern Florida in the United States. This plant thrives in tropical and subtropical climates, often growing in coastal areas or near waterways. It is commonly associated with mangrove ecosystems and brackish water environments. Its natural range extends to certain regions of Central America as well.",
    "distribution_introduced_art_desc": "Abutilon virginale was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant thrives in moist, well-drained soils and is often considered an invasive species in certain areas. It spreads through seeds dispersed by wind, water, and animals. Due to its rapid growth and adaptability, it can outcompete native vegetation in some ecosystems."
}
