{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cyclonervosum",
    "plant_slug": "abutilon-cyclonervosum",
    "plant_name_scientific": "abutilon cyclonervosum",
    "intro": "Abutilon cyclonervosum, commonly known as the woolly abutilon, is a shrub native to South America. It is characterized by its hairy, velvety leaves that are often lobed or toothed. The plant produces small, yellow flowers that bloom in clusters, followed by fluffy, cotton-like seeds. It thrives in tropical and subtropical climates, preferring well-drained soil and full sun. Its unique appearance and ornamental value make it a popular choice for gardeners and botanists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cyclonervosum is primarily native to South America, specifically Brazil. It is found in the eastern and southern regions of the country, including the states of Paraná, São Paulo, and Rio Grande do Sul. This plant thrives in humid tropical and subtropical climates, often growing in moist forested areas. It is commonly associated with understory vegetation in secondary forests and along riverbanks. Its native distribution is limited to these specific regions within Brazil.",
    "distribution_introduced_art_desc": "Abutilon cyclonervosum was mainly introduced to control erosion and as an ornamental plant due to its attractive foliage and adaptability to various soil types. It is commonly found in disturbed areas, along roadsides, and in agricultural fields where it can thrive in full sun to partial shade. This species has been reported in several regions of the United States, including California, Texas, and Florida, where it has established itself in the wild. Its rapid growth and ability to spread through both seeds and vegetative reproduction make it a potential invasive species in some areas. However, it is not considered a major threat in all regions and is often managed through mechanical or chemical means."
}
