{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon album",
    "plant_slug": "abutilon-album",
    "plant_name_scientific": "abutilon album",
    "intro": "Abutilon album, commonly known as the velvetleaf or white abutilon, is a flowering plant native to the Americas. It is characterized by its broad, velvety leaves that are typically dark green on top and lighter underneath. The plant produces showy, lantern-shaped flowers that range in color from white to pink or red. It thrives in warm, humid climates and is often found in disturbed areas or along roadsides. Abutilon album is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon album is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is also found in parts of India and the Philippines. This plant typically grows in tropical and subtropical regions, often in moist, shaded environments. It is commonly found in lowland forests and along riverbanks. Its natural range extends into some Pacific island nations as well.",
    "distribution_introduced_art_desc": "Abutilon album was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, lantern-shaped leaves and showy yellow flowers. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, disturbed soils and can spread rapidly through seeds dispersed by wind and water. Its introduction has raised concerns among conservationists due to its potential to alter local ecosystems."
}
