{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon palmeri",
    "plant_slug": "abutilon-palmeri",
    "plant_name_scientific": "abutilon palmeri",
    "intro": "Abutilon palmeri, commonly known as Palmer's abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is a shrub or small tree that typically grows in arid and semi-arid environments. The plant has palmately lobed leaves and produces showy, lantern-shaped flowers that range in color from yellow to red. It is adapted to drought conditions and thrives in well-drained soils. The species is often found in rocky habitats and is valued for its ornamental appeal and ecological importance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon palmeri"
    },
    "taxonomy_art_desc": "Abutilon palmeri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true root system, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Malvales, which includes plants with showy flowers and often includes species that produce cotton or other fibrous materials. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers that often have five petals. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon palmeri, a specific type of Abutilon native to North America, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Mexico Northeast",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon palmeri is primarily native to Arizona, California, Mexico Northeast, and Mexico Northwest. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or gravelly soils and is often associated with desert scrub and chaparral habitats. Abutilon palmeri is well adapted to the harsh environmental conditions of its native range. It plays an important role in local ecosystems by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Abutilon palmeri was mainly introduced to the western United States, particularly in California and Nevada. It is often found in disturbed areas such as roadsides, fields, and along creek banks. This plant has become naturalized in these regions, thriving in dry to moist soils. Its introduction is likely due to human activity, including landscaping and accidental seed dispersal. It is considered an invasive species in some areas, outcompeting native vegetation."
}
