{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon acerifolium",
    "plant_slug": "abutilon-acerifolium",
    "plant_name_scientific": "abutilon acerifolium",
    "intro": "Abutilon acerifolium, commonly known as the mapleleaf abutilon, is a flowering plant native to the western United States. It is characterized by its palmately lobed leaves that resemble those of maple trees, giving it its common name. The plant produces showy, bell-shaped flowers that range in color from yellow to red, often appearing in clusters. It thrives in full sun to partial shade and prefers well-drained soil. Abutilon acerifolium is often grown as an ornamental plant for its attractive foliage and seasonal blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon acerifolium is primarily native to the western United States, specifically California and Oregon. It is commonly found in coastal areas and along the Pacific coast. This plant thrives in sandy or gravelly soils and is often associated with maritime climates. It is also known as the \"Chinese lantern plant\" due to its distinctive, papery seed pods. Abutilon acerifolium is an important species in local ecosystems, providing habitat and food for various wildlife.",
    "distribution_introduced_art_desc": "Abutilon acerifolium was mainly introduced to the United States, particularly in California, as an ornamental plant due to its attractive, maple-like leaves and showy flowers. It has been cultivated in gardens and landscapes for its aesthetic value, though it is sometimes considered an invasive species in certain regions. The plant thrives in well-drained soils and full sun, making it adaptable to a variety of environmental conditions. Its introduction has led to concerns about its potential to spread beyond cultivated areas. Despite its ornamental appeal, management strategies are often necessary to prevent it from becoming a weed."
}
