{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta chocoensis",
    "plant_slug": "abuta-chocoensis",
    "plant_name_scientific": "abuta chocoensis",
    "intro": "Abuta chocoensis, commonly known as the Choco abuta, is a flowering plant native to the tropical regions of South America, particularly in Ecuador and Colombia. It belongs to the family Euphorbiaceae and is characterized by its distinctive, palmate leaves and vibrant yellow flowers. The plant is typically shrub-like, with thick, fleshy stems that store water, adapting to its humid, lowland habitat. It thrives in moist, well-drained soils and is often found in dense understory layers of tropical rainforests. Due to its ornamental value and potential medicinal properties, it is sometimes cultivated in botanical gardens and conservation programs.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta chocoensis"
    },
    "taxonomy_art_desc": "Abuta chocoensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological and ecological diversity. Its order is Ranunculales, a group of flowering plants that includes many species with showy flowers and often contains toxic compounds. Its family is Menispermaceae, commonly known as the birthvines, which are mostly tropical climbing plants with distinctive leaf and fruit structures. Its genus is Abuta, a group of flowering plants native to tropical regions, characterized by their spiny fruits and medicinal properties. Its species is Abuta chocoensis, a specific plant species found in the Chocó region, known for its unique botanical features and potential ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta chocoensis is primarily native to Colombia. It is found in the tropical regions of the country, particularly in the western and northern areas. This plant thrives in humid, shaded environments within the rainforest canopy. It is commonly found in the Chocó Department, which is known for its rich biodiversity. Abuta chocoensis plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Abuta chocoensis was mainly introduced to tropical and subtropical regions with high humidity and well-drained soil. It thrives in areas with warm temperatures and partial to full sunlight. This plant is often cultivated for its ornamental value due to its unique foliage and flowering patterns. It has been successfully introduced to parts of Southeast Asia, the Caribbean, and the southern United States. However, its spread is limited by its specific environmental requirements and susceptibility to certain pests."
}
