{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon tridens",
    "plant_slug": "abutilon-tridens",
    "plant_name_scientific": "abutilon tridens",
    "intro": "Abutilon tridens, commonly known as the velvetleaf or Indian velvet, is a tropical shrub native to the Americas. It is characterized by its soft, velvety foliage and clusters of small, yellow flowers. The plant is often found in moist, disturbed habitats such as roadsides and wetlands. Its leaves are palmately lobed and can reach up to 20 centimeters in length. Abutilon tridens is also known for its ability to produce a sticky, milky sap when damaged.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon tridens is primarily native to tropical and subtropical regions of the Americas, including parts of Central and South America. It is commonly found in countries such as Brazil, Mexico, and Argentina. This plant thrives in humid environments and is often associated with coastal areas and riverbanks. It is also present in some Caribbean islands. Its native range extends into parts of the southern United States, particularly in Florida and Texas.",
    "distribution_introduced_art_desc": "Abutilon tridens was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and showy flowers. It has since become naturalized in certain regions, particularly in coastal and lowland areas. The plant spreads primarily through seed dispersal by wind and water, contributing to its rapid establishment in new habitats. Its introduction has raised concerns due to its potential to outcompete native species in invaded areas. Management efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
