{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon albescens",
    "plant_slug": "abutilon-albescens",
    "plant_name_scientific": "abutilon albescens",
    "intro": "Abutilon albescens, commonly known as the white abutilon, is a flowering plant native to South America. It is characterized by its soft, velvety leaves and showy, lantern-shaped flowers that range in color from white to pink. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. It thrives in warm, humid climates and is often cultivated for its ornamental value. The flowers bloom in late spring to early summer, attracting pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon albescens is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is commonly found in tropical and subtropical areas, particularly in coastal regions and disturbed habitats. This plant thrives in well-drained soils and is often seen growing in open woodlands or along riverbanks. Its native range also extends to some parts of Central America and northern South America. It is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Abutilon albescens was mainly introduced to areas with warm, temperate climates that provide well-drained soil and moderate sunlight. It is commonly found in regions such as the Mediterranean, parts of southern Europe, and coastal areas of California. This plant is often cultivated as an ornamental due to its attractive, fuzzy leaves and showy yellow flowers. It thrives in USDA hardiness zones 8 through 10, making it suitable for subtropical and tropical gardens. Its introduction has led to its establishment in some non-native regions where it can become invasive if not managed properly."
}
