{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hildebrandtii",
    "plant_slug": "abutilon-hildebrandtii",
    "plant_name_scientific": "abutilon hildebrandtii",
    "intro": "Abutilon hildebrandtii, commonly known as the woolly abutilon, is a shrub native to southern Africa. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in well-drained soils and prefers full sun to partial shade. Abutilon hildebrandtii is often cultivated as an ornamental plant for its unique foliage and attractive blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hildebrandtii is primarily native to the southern United States, particularly Texas, and parts of northern Mexico. It is commonly found in dry, rocky soils and is often associated with limestone outcrops. This species thrives in arid and semi-arid environments, making it well adapted to the harsh conditions of its native range. It is also found in areas of the southwestern United States, including New Mexico and Arizona. The plant is known for its unique, lantern-shaped flowers and is sometimes referred to as the \"Chinese lantern\" plant.",
    "distribution_introduced_art_desc": "Abutilon hildebrandtii was mainly introduced to the Pacific Islands, where it has become naturalized in certain areas. It is commonly found in coastal regions and disturbed habitats due to its adaptability to various soil types. The plant is often cultivated for its ornamental value, particularly its showy, lantern-shaped flowers. However, it has also been reported as an invasive species in some locations, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
