{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon lucianum",
    "plant_slug": "abutilon-lucianum",
    "plant_name_scientific": "abutilon lucianum",
    "intro": "Abutilon lucianum, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to tropical and subtropical regions. It is characterized by its heart-shaped leaves that are often covered in fine, soft hairs, giving it a velvety texture. The plant produces showy, lantern-shaped flowers that range in color from yellow to red, typically blooming in summer. It thrives in warm climates and is often found in disturbed soils or along roadsides. Abutilon lucianum is also valued for its ornamental appeal and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon lucianum is primarily native to tropical and subtropical regions of Asia, Africa, and the Pacific Islands. It is commonly found in countries such as India, Malaysia, Indonesia, and the Philippines. This plant thrives in warm, humid climates and is often found in coastal areas or near water sources. It is also present in parts of Australia and the Caribbean. Its natural habitat includes forests, shrublands, and disturbed areas where it can spread easily.",
    "distribution_introduced_art_desc": "Abutilon lucianum was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive, lantern-shaped flowers. The plant thrives in tropical and subtropical climates, allowing it to spread rapidly in native habitats. It competes with native plants for resources, leading to ecological concerns. Efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
