{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon nigripunctulatum",
    "plant_slug": "abutilon-nigripunctulatum",
    "plant_name_scientific": "abutilon nigripunctulatum",
    "intro": "Abutilon nigripunctulatum, commonly known as the black-spotted abutilon, is a flowering plant native to South America. It belongs to the Malvaceae family and is characterized by its hairy, ovate leaves and showy, lantern-shaped flowers. The plant produces small, capsule-like fruits that contain numerous seeds. It thrives in tropical and subtropical climates, often growing in moist, well-drained soils. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Pseudabutilon",
        "species": "Pseudabutilon nigripunctulatum"
    },
    "taxonomy_art_desc": "Abutilon nigripunctulatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their spore reproduction and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants like cotton and hibiscus, characterized by their capsule fruits and showy flowers. Its genus is Pseudabutilon, a group of flowering plants within the Malvaceae family, typically found in tropical and subtropical regions. Its species is Pseudabutilon nigripunctulatum, a specific type of plant within this genus, distinguished by its unique characteristics such as its black-punctuated leaves and specific growth habits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon nigripunctulatum is primarily native to Peru. It is found in the tropical and subtropical regions of the country. This plant typically grows in areas with warm climates and well-drained soils. It is commonly found in forested areas and along riverbanks. Its native distribution is limited to specific habitats within Peru.",
    "distribution_introduced_art_desc": "Abutilon nigripunctulatum was mainly introduced to ornamental horticulture due to its attractive, fuzzy leaves and showy yellow flowers. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species is often found in gardens and greenhouses where it thrives in warm, humid conditions. Its introduction has led to its establishment in some natural areas, raising concerns about its potential invasiveness. Proper management is recommended to prevent its spread beyond cultivated settings."
}
