{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon trinervisepalum",
    "plant_slug": "abutilon-trinervisepalum",
    "plant_name_scientific": "abutilon trinervisepalum",
    "intro": "Abutilon trinervisepalum, commonly known as the three-veined hibiscus, is a flowering plant native to tropical regions of South America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its hairy stems and heart-shaped leaves with three prominent veins. Its showy, trumpet-shaped flowers are typically yellow or orange and bloom in clusters. It is often cultivated as an ornamental plant due to its vibrant flowers and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon trinervisepalum is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in humid climates and is often associated with forested or disturbed habitats. It is also present in parts of the Philippines and northern Australia. Due to its adaptability, it can sometimes be found in cultivated areas or as an invasive species in other regions.",
    "distribution_introduced_art_desc": "Abutilon trinervisepalum was mainly introduced to Hawaii. It was brought there intentionally for its ornamental value due to its attractive, lantern-shaped flowers. The plant thrives in tropical climates and has become naturalized in various parts of the island. It is commonly found in disturbed areas such as roadsides and coastal habitats. However, it is considered a potential invasive species in some regions due to its rapid growth and ability to spread easily."
}
