{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon umbellatum subsp. glutinosum",
    "plant_slug": "abutilon-umbellatum-subsp-glutinosum",
    "plant_name_scientific": "abutilon umbellatum subsp. glutinosum",
    "intro": "Abutilon umbellatum subsp. glutinosum, commonly known as sticky abutilon, is a shrub native to tropical and subtropical regions of the Americas. It is characterized by its fuzzy, hairy leaves and showy, lantern-shaped yellow flowers that bloom in clusters. The plant produces capsules that contain numerous small, dry seeds. It thrives in well-drained soils and requires full sun to partial shade. Its sticky leaves and stems are distinctive features that aid in its identification.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon umbellatum subsp. glutinosum is primarily native to the eastern and southeastern United States, including regions such as Florida, Georgia, and parts of the Carolinas. It thrives in moist, sandy soils and is commonly found in coastal areas, wetlands, and along riverbanks. This subspecies is also present in some parts of Texas and the Gulf Coast states. It is often associated with disturbed habitats and can be found in open woodlands and prairies. Its native range extends into the Caribbean, where it is also known to occur in certain island environments.",
    "distribution_introduced_art_desc": "Abutilon umbellatum subsp. glutinosum was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. This species has since become naturalized in certain areas of the island, particularly in disturbed habitats and along roadsides. Its introduction has raised concerns due to its potential to spread and compete with native vegetation. Despite its ornamental value, it is considered a non-native invasive species in some regions of Hawaii."
}
