{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon lanatum",
    "plant_slug": "abutilon-lanatum",
    "plant_name_scientific": "abutilon lanatum",
    "intro": "Abutilon lanatum, commonly known as velvetleaf or woolly abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, hairy leaves and showy, lantern-shaped flowers that range in color from yellow to red. The plant typically grows as an herbaceous perennial, often reaching heights of up to 2 meters. Its hairy texture is due to dense pubescence covering its stems and leaves, which gives it a distinctive appearance. Abutilon lanatum thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon lanatum is primarily native to tropical and subtropical regions of the Americas, including parts of Central and South America. It is commonly found in countries such as Brazil, Peru, and Mexico. This plant thrives in humid environments and is often associated with forest understories or along riverbanks. It is also known to grow in coastal areas and disturbed soils. Its native range extends into the Caribbean as well.",
    "distribution_introduced_art_desc": "Abutilon lanatum was mainly introduced to the Pacific Northwest region of the United States. It has been observed in wetland areas and along riparian zones where it thrives in moist, well-drained soils. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It is often found in disturbed sites such as roadsides and forest edges. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
