{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon circinatum",
    "plant_slug": "abutilon-circinatum",
    "plant_name_scientific": "abutilon circinatum",
    "intro": "Abutilon circinatum, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its soft, hairy foliage and showy, lantern-shaped flowers that range in color from yellow to red. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are alternate, ovate, and often have a velvety texture. Abutilon circinatum is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon circinatum is primarily native to Mexico and Central America. It is found in regions such as southern Mexico, including the states of Oaxaca, Chiapas, and Veracruz. The plant grows in tropical and subtropical environments, often in dry to semi-arid areas. It is commonly found in open woodlands, shrublands, and along riverbanks. Its native range extends into parts of northern South America, including Colombia and Ecuador.",
    "distribution_introduced_art_desc": "Abutilon circinatum was mainly introduced to areas with warm, humid climates, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in regions such as southern California, Arizona, and parts of Hawaii in the United States. The plant thrives in well-drained soil and full sun, making it suitable for both container gardening and landscape planting. Its introduction has led to its establishment in some areas, where it can become invasive if not managed properly. Due to its adaptability, it has been spread through horticultural trade and accidental seed dispersal."
}
