{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon rigidum",
    "plant_slug": "abutilon-rigidum",
    "plant_name_scientific": "abutilon rigidum",
    "intro": "Abutilon rigidum, commonly known as the woolly abutilon, is a shrub native to South America. It is characterized by its hairy, glandular stems and leaves that are often covered in fine, soft hairs. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in spring. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardens. Its unique appearance and adaptability contribute to its appeal in both horticultural and ecological contexts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon rigidum is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with warm, humid climates. This plant thrives in coastal and riverine environments, often growing along the edges of forests or in open grasslands. It is also present in parts of the Philippines and Malaysia, where it is adapted to the local climate and soil conditions. Abutilon rigidum is known for its hairy, woody stems and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Abutilon rigidum was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly used in revegetation projects due to its ability to thrive in poor soil conditions. This plant is also valued for its ornamental qualities, with its hairy leaves and showy flowers. However, it has the potential to become invasive in certain environments if not managed properly. Its introduction has been documented in several regions where soil stabilization is a priority."
}
