{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon flueckigerianum",
    "plant_slug": "abutilon-flueckigerianum",
    "plant_name_scientific": "abutilon flueckigerianum",
    "intro": "Abutilon flueckigerianum, commonly known as the African velvetleaf, is a flowering plant native to tropical regions of Africa. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces small, clustered flowers that are typically yellow or greenish-yellow in color. It thrives in warm, humid climates and is often found in moist woodland or riverine habitats. Abutilon flueckigerianum is valued for its ornamental qualities and is sometimes cultivated as a decorative plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon flueckigerianum is primarily native to western Africa, specifically countries such as Nigeria, Cameroon, and Gabon. It is commonly found in tropical and subtropical regions, growing in moist, shaded areas within forests. This plant thrives in humid climates and is often associated with riverine and swampy habitats. Its distribution is limited to specific ecological niches within these regions. It is not widely cultivated outside its native range.",
    "distribution_introduced_art_desc": "Abutilon flueckigerianum was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in tropical and subtropical regions, including parts of Africa, the Caribbean, and Southeast Asia. The plant thrives in full sun to partial shade and requires regular watering to maintain its vibrant appearance. Its introduction has sometimes led to it becoming invasive in certain ecosystems, outcompeting native species. Due to its adaptability, it is often cultivated in gardens and public landscapes for its aesthetic value."
}
