{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon niveum",
    "plant_slug": "abutilon-niveum",
    "plant_name_scientific": "abutilon niveum",
    "intro": "Abutilon niveum, commonly known as the velvetleaf abutilon, is a perennial shrub native to the southern United States and parts of Mexico. It is characterized by its fuzzy, velvety leaves that give it a soft, tactile appearance. The plant produces showy, lantern-shaped flowers that range in color from white to pink, often blooming in late summer. It thrives in full sun to partial shade and prefers well-drained soil. Due to its ornamental value, it is often cultivated in gardens and landscapes for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon niveum is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is also found in southern Florida, United States, and extends into Central America. This plant thrives in tropical and subtropical climates, often growing in coastal areas and disturbed soils. It is commonly associated with mangrove ecosystems and brackish water environments. Its native range includes countries such as Cuba, Jamaica, Haiti, and the Bahamas.",
    "distribution_introduced_art_desc": "Abutilon niveum was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activities, such as accidental transport on vehicles or cargo. The plant thrives in disturbed areas and can outcompete native vegetation. It is particularly problematic in coastal and lowland habitats. Due to its rapid growth and ability to spread, it poses a significant threat to local ecosystems."
}
