{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon barrancae",
    "plant_slug": "abutilon-barrancae",
    "plant_name_scientific": "abutilon barrancae",
    "intro": "Abutilon barrancae, commonly known as the Barranca Abutilon, is a shrub native to the arid regions of northern Mexico. It is characterized by its hairy, glandular leaves that are often gray-green in color. The plant produces small, yellowish flowers that are clustered in panicles, typically blooming in spring. Its fibrous bark and mucilaginous sap have been used in traditional medicine. Abutilon barrancae is adapted to survive in harsh, dry environments with low water availability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon barrancae is primarily native to the Caribbean region, particularly the Lesser Antilles. It is found in countries such as Saint Lucia, Martinique, and Guadeloupe. This plant typically grows in moist, shaded areas within tropical forests. It is often associated with rocky or limestone soils. Its distribution is limited to specific islands where the climate and habitat conditions are suitable for its growth.",
    "distribution_introduced_art_desc": "Abutilon barrancae was mainly introduced to areas with disturbed soils and human-altered landscapes, such as roadsides, urban wastelands, and agricultural fields. It thrives in regions with warm, humid climates and is commonly found in tropical and subtropical zones. This plant is often considered an invasive species in some regions due to its rapid growth and ability to spread through seeds. It is native to parts of Central and South America but has been introduced to other parts of the world, including the Caribbean and Southeast Asia. Its distribution is largely influenced by human activity and environmental conditions that favor its growth."
}
