{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon grewiifolium",
    "plant_slug": "abutilon-grewiifolium",
    "plant_name_scientific": "abutilon grewiifolium",
    "intro": "Abutilon grewiifolium, commonly known as the woolly abutilon, is a flowering plant native to South America. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. It thrives in warm, humid climates and is often found in coastal areas. Its unique appearance and ornamental value make it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon grewiifolium"
    },
    "taxonomy_art_desc": "Abutilon grewiifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of fern allies and includes plants such as horsetails and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malvales, which comprises flowering plants with a diverse range of forms, including cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants known for their cotton-like fibers and often showy, cup-shaped flowers. Its species is Abutilon grewiifolium, a specific type of plant within the genus Abutilon, characterized by its unique leaf shape and flowering structure.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Peru",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon grewiifolium is primarily native to Brazil North, Peru, and Venezuela. This species is commonly found in the tropical and subtropical regions of these countries. It thrives in areas with warm climates and well-drained soils. The plant is often associated with dry to semi-arid habitats. Its native distribution reflects its adaptation to the diverse environmental conditions of these South American regions.",
    "distribution_introduced_art_desc": "Abutilon grewiifolium was mainly introduced to the western United States, particularly in California and Oregon. It was brought there for its ornamental value due to its attractive, fuzzy leaves and showy flowers. The plant thrives in disturbed areas such as roadsides, fields, and along streambanks. It has become naturalized in some regions, spreading through both seeds and vegetative growth. However, it is considered a non-native species and is not typically invasive in the areas where it is found."
}
