{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cinereum",
    "plant_slug": "abutilon-cinereum",
    "plant_name_scientific": "abutilon cinereum",
    "intro": "Abutilon cinereum, commonly known as velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its soft, hairy leaves and clusters of yellow flowers that bloom in the summer. The plant is often found in moist, disturbed habitats such as roadsides and riverbanks. Its hairy texture gives it a velvety appearance, which is reflected in its common name. Abutilon cinereum is valued for its ornamental qualities and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Pseudabutilon",
        "species": "Pseudabutilon cinereum"
    },
    "taxonomy_art_desc": "Abutilon cinereum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have distinct floral parts and are often associated with complex pollination mechanisms. Its order is Malvales, which includes plants with showy flowers and often includes species that produce cotton or other fibrous materials. Its family is Malvaceae, commonly known as the mallow family, which includes plants with capsule fruits and often hairy leaves. Its genus is Pseudabutilon, a group of flowering plants closely related to the genus Abutilon, often found in tropical and subtropical regions. Its species is Pseudabutilon cinereum, a specific plant within this genus known for its distinctive foliage and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cinereum is primarily native to Argentina Northeast, Argentina Northwest, and Bolivia. This plant is commonly found in the temperate regions of these areas. It thrives in open habitats such as grasslands and shrublands. The species is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in its natural environment.",
    "distribution_introduced_art_desc": "Abutilon cinereum was mainly introduced to New Zealand. It is considered an invasive species in the region. The plant was likely introduced through human activities, such as accidental transport on vehicles or machinery. It thrives in disturbed environments and can outcompete native vegetation. Efforts are being made to control its spread to protect local ecosystems."
}
