{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta rufescens var. oblongata",
    "plant_slug": "abuta-rufescens-var-oblongata",
    "plant_name_scientific": "abuta rufescens var. oblongata",
    "intro": "Abuta rufescens var. oblongata, commonly known as the purple abuta, is a flowering plant native to the Andes Mountains of South America. It is characterized by its distinctive purple to reddish-brown flowers that bloom in clusters. The plant has heart-shaped leaves that are often covered in fine hairs. It thrives in high-altitude environments with cool, moist conditions. Its ornamental value makes it a sought-after plant in botanical gardens and among plant enthusiasts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta rufescens var. oblongata is primarily native to the tropical rainforests of western Africa, particularly in countries such as Cameroon, Gabon, and the Republic of the Congo. This plant thrives in humid, shaded environments within the understory of dense forest ecosystems. It is commonly found in areas with rich, well-drained soils and high rainfall. The species is also occasionally reported in parts of Central Africa, though its primary range remains in the western region. Due to its restricted habitat, it is considered a locally important species in the biodiversity of these rainforest regions.",
    "distribution_introduced_art_desc": "Abuta rufescens var. oblongata was mainly introduced to areas with warm, humid climates that support its growth in shaded or semi-shaded environments. It thrives in well-drained, loamy soils and is often found in forest understories. This plant is commonly cultivated for its ornamental value due to its attractive, heart-shaped leaves and showy flowers. It has been introduced to several regions in Southeast Asia, including parts of Indonesia and the Philippines. However, its introduction has raised concerns about its potential invasiveness in native ecosystems."
}
