{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pedatum",
    "plant_slug": "abutilon-pedatum",
    "plant_name_scientific": "abutilon pedatum",
    "intro": "Abutilon pedatum, commonly known as the velvetleaf abutilon, is a flowering plant native to the southeastern United States. It is a shrub or small tree that can grow up to 10 feet tall, featuring heart-shaped leaves that are soft and fuzzy to the touch. The plant produces showy, lantern-shaped yellow flowers that bloom in the summer months. It thrives in full sun to partial shade and prefers well-drained soil. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pedatum"
    },
    "taxonomy_art_desc": "Abutilon pedatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and specialized pollen structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"cotton bush,\" characterized by their hairy leaves and showy, lantern-shaped flowers. Its species is Abutilon pedatum, a specific type of plant within the genus Abutilon, known for its distinctive appearance and adaptability to various environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pedatum is primarily native to the Northern Territory. It is commonly found in arid and semi-arid regions within this area. The plant thrives in sandy soils and is often seen along riverbanks and in open woodlands. It is well adapted to the harsh climatic conditions of the region. Its distribution is largely confined to the northern parts of Australia.",
    "distribution_introduced_art_desc": "Abutilon pedatum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, disturbed areas such as roadsides, stream banks, and forest edges. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to ecological concerns in regions where it has established itself. However, it is also valued for its ornamental qualities and is sometimes cultivated in gardens."
}
