{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon muticum var. parvifolium",
    "plant_slug": "abutilon-muticum-var-parvifolium",
    "plant_name_scientific": "abutilon muticum var. parvifolium",
    "intro": "Abutilon muticum var. parvifolium, commonly known as the narrow-leaf abutilon, is a flowering plant native to parts of South America. It is a shrub or small tree that typically grows in tropical and subtropical regions. The plant features heart-shaped leaves that are usually smaller and more narrow compared to the typical abutilon species. Its flowers are pendulous and often yellow or orange, adding ornamental value to gardens. It thrives in well-drained soil and requires moderate to high levels of sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon muticum var. parvifolium is primarily native to the coastal regions of southern California and northern Baja California, Mexico. It thrives in sandy or gravelly soils along the shoreline, often in areas with mild, temperate climates. This variety is commonly found in dunes and other coastal habitats where it is adapted to salt spray and wind. It is a shrub-like plant that plays an important role in stabilizing dune ecosystems. Due to its limited range, it is considered a rare and endemic species in its native habitat.",
    "distribution_introduced_art_desc": "Abutilon muticum var. parvifolium was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The distribution of this variety has been limited to specific areas within Washington and Oregon. It is often found in disturbed soils and along roadsides. However, it is not considered invasive and does not spread aggressively in natural habitats."
}
