{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon blandum",
    "plant_slug": "abutilon-blandum",
    "plant_name_scientific": "abutilon blandum",
    "intro": "Abutilon blandum, commonly known as the woolly abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is a perennial shrub characterized by its soft, fuzzy leaves and showy, lantern-shaped yellow flowers. The plant thrives in well-drained soils and full sun, making it suitable for arid and semi-arid environments. Its unique appearance and drought tolerance make it a popular choice for xeriscaping and ornamental gardening. Abutilon blandum is also valued for its ecological benefits, providing nectar for pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon blandum is primarily native to the Caribbean islands, including the Greater Antilles and the Lesser Antilles. It is commonly found in coastal areas and moist lowland regions. This plant thrives in tropical and subtropical climates with high humidity. It is often seen growing in sandy soils near the shoreline. Its native range also extends to parts of southern Florida and the Bahamas.",
    "distribution_introduced_art_desc": "Abutilon blandum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed habitats such as roadsides, streambanks, and open woodlands. This plant is often considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states including Oregon, Washington, and Idaho. Its spread is primarily facilitated by seed dispersal through water and wind."
}
