{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fuscicalyx",
    "plant_slug": "abutilon-fuscicalyx",
    "plant_name_scientific": "abutilon fuscicalyx",
    "intro": "Abutilon fuscicalyx, commonly known as the woolly abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its fuzzy, hairy foliage and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are ovate to lanceolate in shape and often have a velvety texture. Abutilon fuscicalyx is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon fuscicalyx"
    },
    "taxonomy_art_desc": "Abutilon fuscicalyx belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Malvales, which consists of flowering plants that often have showy flowers and include many species used in horticulture. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and some that produce cotton or other fibrous materials. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon fuscicalyx, a specific type of plant within the genus Abutilon, known for its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon fuscicalyx is primarily native to Bolivia. It is commonly found in the eastern regions of the country, particularly in the Amazonian lowlands. This plant thrives in humid, tropical environments with rich, well-drained soils. It is often associated with secondary growth forests and disturbed habitats. Its native range is limited to specific areas within Bolivia, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon fuscicalyx was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in tropical and subtropical regions, including parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in full sun to partial shade and requires regular watering to maintain its vibrant appearance. Its introduction has sometimes led to it becoming invasive in certain ecosystems, outcompeting native vegetation. Due to its adaptability, it is often cultivated in gardens and landscapes where it can provide both aesthetic and ecological benefits."
}
