{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mitchellii var. mollissimum",
    "plant_slug": "abutilon-mitchellii-var-mollissimum",
    "plant_name_scientific": "abutilon mitchellii var. mollissimum",
    "intro": "Abutilon mitchellii var. mollissimum, commonly known as velvetleaf abutilon, is a flowering plant native to the southeastern United States. It is characterized by its fuzzy, velvety leaves that give it its common name. The plant produces showy, lantern-shaped flowers that range in color from yellow to red. It is a deciduous shrub that thrives in moist, well-drained soils. Its botanical features make it a popular choice for ornamental gardening and ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon mitchellii var. mollissimum is primarily native to the southern United States, particularly Texas and New Mexico. It thrives in arid and semi-arid environments, often found in rocky soils and along dry streambeds. This variety is well adapted to hot, dry climates and is commonly seen in desert regions. It is also native to parts of northern Mexico, where it grows in similar ecological conditions. The plant is known for its soft, fuzzy leaves and showy flowers that bloom in the summer.",
    "distribution_introduced_art_desc": "Abutilon mitchellii var. mollissimum was mainly introduced to the southeastern United States, particularly in states like Florida and Georgia. It was brought there for its ornamental value due to its attractive, fuzzy leaves and showy flowers. This plant thrives in warm, humid climates and is often found in disturbed areas such as roadsides and utility rights-of-way. Its introduction has led to its establishment in the wild, where it can sometimes become invasive. Despite its beauty, it requires careful management to prevent it from outcompeting native vegetation."
}
