{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pseudostriatum",
    "plant_slug": "abutilon-pseudostriatum",
    "plant_name_scientific": "abutilon pseudostriatum",
    "intro": "Abutilon pseudostriatum, commonly known as the velvetleaf abutilon, is a flowering plant native to South America. It is characterized by its soft, hairy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an herbaceous perennial, often reaching heights of up to 2 meters. Its fruit is a dry capsule that splits open to release small, wind-dispersed seeds. It thrives in moist, well-drained soils and is often found in shaded or semi-shaded environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pseudostriatum is primarily native to tropical and subtropical regions of South America, particularly Brazil, Paraguay, and Argentina. It thrives in humid, warm climates and is commonly found in lowland areas with well-drained soils. This plant is often associated with secondary forests and disturbed habitats, where it can quickly colonize open spaces. It is also known to grow along riverbanks and in coastal regions, where it benefits from the moist environment. Due to its adaptability, it has been introduced to other parts of the world, but its native range remains concentrated in the aforementioned South American countries.",
    "distribution_introduced_art_desc": "Abutilon pseudostriatum was mainly introduced to the United States as an ornamental plant due to its attractive foliage and unique appearance. It is commonly found in southern regions, particularly in Florida and California, where it thrives in warm, humid climates. This species has been reported in both urban and rural areas, often escaping cultivation and establishing itself in natural habitats. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, efforts are being made to monitor and manage its spread to prevent ecological disruption."
}
