{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon × milleri",
    "plant_slug": "abutilon-×-milleri",
    "plant_name_scientific": "abutilon × milleri",
    "intro": "Abutilon × milleri, commonly known as velvetleaf or miller's abutilon, is a hybrid shrub native to the southeastern United States. It is characterized by its fuzzy, velvety leaves that give it a soft, tactile appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often appearing in clusters. It thrives in full sun to partial shade and is adaptable to various soil types. Due to its ornamental value and invasive tendencies, it is often considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon × milleri is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in humid climates and is often associated with secondary forests or disturbed habitats. It is also cultivated in some parts of the world for its ornamental value due to its attractive foliage and flowers. The plant's native range reflects its adaptability to diverse environmental conditions within its natural habitat.",
    "distribution_introduced_art_desc": "Abutilon × milleri was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, railroads, and waste grounds. This plant is considered an invasive species due to its rapid growth and ability to spread through seed dispersal. It competes with native vegetation, potentially altering local ecosystems. Management efforts often focus on manual removal and herbicide application to control its spread."
}
