{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon turumiquirense",
    "plant_slug": "abutilon-turumiquirense",
    "plant_name_scientific": "abutilon turumiquirense",
    "intro": "Abutilon turumiquirense, commonly known as the Turumiquirenses Abutilon, is a species native to South America, particularly Colombia. It is a shrub or small tree that typically grows in tropical and subtropical regions. The plant features heart-shaped leaves with a velvety texture and produces showy, lantern-shaped flowers in shades of yellow and orange. It is often cultivated for its ornamental value due to its attractive foliage and blooms. The plant prefers well-drained soil and full sun to partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon turumiquirense"
    },
    "taxonomy_art_desc": "Abutilon turumiquirense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and often complex flower structures. Its order is Malvales, which includes plants with showy flowers and often includes species that are economically important, such as cotton and okra. Its family is Malvaceae, commonly known as the mallow family, which is characterized by their hirsute stems, capsule fruits, and often showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their fuzzy leaves and showy flowers. Its species is Abutilon turumiquirense, a specific type of Abutilon native to certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon turumiquirense is primarily native to Venezuela. This species is found in the northern regions of the country, particularly in the states of Zulia and Anzoátegui. It thrives in tropical and subtropical environments, often growing in coastal areas and along riverbanks. The plant is adapted to the warm, humid climate of these regions. Its native distribution is limited to specific habitats within Venezuela.",
    "distribution_introduced_art_desc": "Abutilon turumiquirense was mainly introduced to areas with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant has been reported in several countries in South America, including Colombia, Ecuador, and Peru. Its rapid growth and ability to spread through seeds make it an invasive species in some regions. Due to its adaptability, it is often considered a weed in agricultural and natural ecosystems."
}
