{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta bullata",
    "plant_slug": "abuta-bullata",
    "plant_name_scientific": "abuta bullata",
    "intro": "Abuta bullata, commonly known as the red sanders, is a flowering plant native to the tropical regions of Africa. It belongs to the family Euphorbiaceae and is characterized by its distinctive, fleshy, and often spiny stems. The plant produces small, yellowish flowers that are clustered in inflorescences, and its leaves are typically alternate and ovate in shape. Abuta bullata is known for its medicinal properties, with various parts of the plant used in traditional medicine for their anti-inflammatory and analgesic effects. However, due to overharvesting and habitat loss, it is now considered a threatened species in its natural range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta bullata"
    },
    "taxonomy_art_desc": "Abuta bullata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails and whisk ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Ranunculales, which consists of flowering plants with a wide range of morphological diversity, including buttercups and罂粟. Its family is Menispermaceae, commonly known as the pipevine family, which includes climbing plants and some with medicinal properties. Its genus is Abuta, a group of flowering plants native to tropical regions of South America, known for their ornamental and medicinal uses. Its species is Abuta bullata, a specific plant within the genus Abuta, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "French Guiana",
        "Guyana"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta bullata is primarily native to Brazil North, French Guiana, and Guyana. This plant is found in the tropical rainforests of these regions. It thrives in humid, shaded environments within the understory of dense vegetation. The species is commonly associated with lowland areas and is part of the family Euphorbiaceae. Its native distribution is limited to these specific geographic locations in South America.",
    "distribution_introduced_art_desc": "Abuta bullata was mainly introduced to regions with a tropical and subtropical climate, where it thrives in well-drained soils. It is commonly found in areas with high humidity and partial to full sunlight. This plant is often cultivated for its ornamental value due to its unique foliage and ability to tolerate various soil conditions. It has been introduced to several countries in Southeast Asia and parts of the Americas. However, its spread is limited by its specific climatic requirements and the need for careful cultivation."
}
