{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon virgatum",
    "plant_slug": "abutilon-virgatum",
    "plant_name_scientific": "abutilon virgatum",
    "intro": "Abutilon virgatum, commonly known as the velvetleaf or Indian mallow, is a deciduous shrub native to the Americas. It is characterized by its heart-shaped leaves that are covered in fine, soft hairs, giving it a velvety texture. The plant produces showy, lantern-shaped yellow flowers that bloom in the summer months. It thrives in full sun to partial shade and is often found in moist, well-drained soils. Abutilon virgatum is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon virgatum is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and parts of Alabama. It is also found in the Caribbean, including the Bahamas and Cuba, as well as in parts of Central America. This species thrives in moist, well-drained soils and is commonly found in coastal areas, swamps, and along riverbanks. It is often associated with disturbed habitats and can be seen growing in open woodlands and thickets. Its native range extends into some regions of Mexico, particularly in the southern and eastern parts of the country.",
    "distribution_introduced_art_desc": "Abutilon virgatum was mainly introduced to the Pacific Northwest of the United States. It was brought there as an ornamental plant due to its attractive, lantern-like flowers. The distribution of this species has expanded beyond its original range, particularly in moist, disturbed areas. It is now found in various parts of Oregon and Washington, often along stream banks and roadsides. However, its spread has raised concerns about its potential impact on native plant communities."
}
