{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon webbianum",
    "plant_slug": "abutilon-webbianum",
    "plant_name_scientific": "abutilon webbianum",
    "intro": "Abutilon webbianum, commonly known as the velvetleaf abutilon, is a flowering plant native to Central and South America. It is a shrub or small tree that can grow up to 6 meters in height, characterized by its fuzzy, velvety leaves. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in the summer months. Its fruit is a capsule that splits open to release small, hairy seeds. Abutilon webbianum is often found in disturbed areas, such as roadsides and clearings, and is adapted to a variety of soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon webbianum is primarily native to the tropical and subtropical regions of southern Africa, particularly in countries such as South Africa, Namibia, and Botswana. It thrives in arid and semi-arid environments, often found in rocky soils and along riverbanks. This plant is commonly seen in savanna and woodland habitats, where it adapts well to variable climatic conditions. It plays an important ecological role by providing habitat and food for local wildlife. Due to its resilience, it is sometimes used in restoration projects in degraded landscapes.",
    "distribution_introduced_art_desc": "Abutilon webbianum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant thrives in moist, well-drained soils and full to partial sunlight. It is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded over the past few decades, raising concerns among local conservationists."
}
