{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hannii",
    "plant_slug": "abutilon-hannii",
    "plant_name_scientific": "abutilon hannii",
    "intro": "Abutilon hannii, commonly known as the velvetleaf abutilon, is a flowering plant native to Central and South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its velvety, hairy leaves. The plant produces clusters of small, yellowish-green flowers that bloom in the summer months. Its leaves are alternate, ovate to elliptic in shape, and have a soft, downy texture. The fruit is a capsule that splits open to release small, hairy seeds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon hannii"
    },
    "taxonomy_art_desc": "Abutilon hannii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Malvales, a group of flowering plants that includes economically important species such as cotton and okra, known for their showy flowers and capsule fruits. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy leaves and flowers with five petals. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and lantern-shaped flowers. Its species is Abutilon hannii, a specific type of plant within the genus Abutilon, distinguished by its unique morphological and genetic characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hannii is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This plant typically grows in coastal areas and lowland rainforests. It thrives in humid climates with well-drained soils. Its native distribution is limited to specific habitats within Queensland.",
    "distribution_introduced_art_desc": "Abutilon hannii was mainly introduced to the eastern United States, particularly in Florida and along the Gulf Coast. It has been reported in several states including Texas, Louisiana, and Mississippi. This plant is commonly found in disturbed habitats such as roadsides, abandoned fields, and wetlands. It has been classified as an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its introduction is believed to have occurred through accidental dispersal via contaminated soil or seeds."
}
