{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon coahuilae",
    "plant_slug": "abutilon-coahuilae",
    "plant_name_scientific": "abutilon coahuilae",
    "intro": "Abutilon coahuilae, commonly known as the Coahuila Abutilon, is a flowering plant native to the Chihuahuan Desert in northern Mexico. It is a shrub or small tree that typically grows to a height of 1 to 3 meters. The plant features palmate leaves with five to seven lobes, and its flowers are yellow or orange, often clustered in terminal panicles. It produces capsules as fruit, which contain numerous small, wind-dispersed seeds. This species is adapted to arid environments and is characterized by its drought tolerance and ability to thrive in poor soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon coahuilae"
    },
    "taxonomy_art_desc": "Abutilon coahuilae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and many are used for their fibers or ornamental value. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"cottonball trees,\" known for their showy, lantern-shaped flowers. Its species is Abutilon coahuilae, a specific type of Abutilon native to Mexico, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Mexico Northeast",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon coahuilae is primarily native to Arizona, Mexico Northeast, and Mexico Northwest. This plant is found in the arid and semi-arid regions of these areas. It thrives in rocky soils and is often associated with desert environments. The species is adapted to the harsh climate conditions of its native range. It is a rare and endemic plant within its distribution area.",
    "distribution_introduced_art_desc": "Abutilon coahuilae was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in dry, rocky soils and is often associated with disturbed areas. This plant is known for its fuzzy, maple-like leaves and showy yellow flowers. It has been used in landscaping for its ornamental value. However, it is considered an invasive species in some regions due to its rapid growth and ability to spread aggressively."
}
