{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon longicuspe",
    "plant_slug": "abutilon-longicuspe",
    "plant_name_scientific": "abutilon longicuspe",
    "intro": "Abutilon longicuspe, commonly known as the long-beaked abutilon, is a flowering plant native to South America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its hairy, glandular leaves and showy, lantern-shaped flowers that range in color from yellow to red. It typically grows in moist, shady environments such as forests and stream banks. Abutilon longicuspe is valued for its ornamental qualities and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon longicuspe"
    },
    "taxonomy_art_desc": "Abutilon longicuspe belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, a group of flowering plants that includes families such as Malvaceae, Theaceae, and Tiliaceae, known for their showy flowers and sometimes hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton, okra, and hibiscus, characterized by their sympetalous flowers and capsules. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants, known for their showy, lantern-shaped flowers. Its species is Abutilon longicuspe, a specific type within the genus Abutilon, distinguished by its elongated, pointed leaves and its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "DR Congo",
        "Eritrea",
        "Ethiopia",
        "Kenya",
        "Malawi",
        "Mozambique",
        "Rwanda",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "Yemen",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon longicuspe is primarily native to Angola, DR Congo, Eritrea, Ethiopia, Kenya, Malawi, Mozambique, Rwanda, Sudan-South Sudan, Tanzania, Uganda, Yemen, Zambia, and Zimbabwe. It is commonly found in tropical and subtropical regions within these countries. The plant typically grows in open woodlands, savannas, and along riverbanks. It is well adapted to the diverse climates and soils of its native range. Its distribution spans across much of sub-Saharan Africa, with some populations extending into the Arabian Peninsula.",
    "distribution_introduced_art_desc": "Abutilon longicuspe was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shaded areas such as forest floors and along stream banks. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states including Oregon, Washington, and California. Its introduction is often associated with human activities such as landscaping and accidental seed dispersal."
}
