{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hulseanum",
    "plant_slug": "abutilon-hulseanum",
    "plant_name_scientific": "abutilon hulseanum",
    "intro": "Abutilon hulseanum, commonly known as the velvetleaf abutilon, is a deciduous shrub native to tropical and subtropical regions. It features heart-shaped leaves that are typically velvety to the touch, giving it its common name. The plant produces showy, lantern-shaped flowers in shades of yellow, orange, and red, which bloom in late summer. It thrives in well-drained soil and full sun to partial shade, making it a popular choice for ornamental gardens. Due to its rapid growth and ability to spread, it is sometimes considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon hulseanum"
    },
    "taxonomy_art_desc": "Abutilon hulseanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, which comprises flowering plants with typically showy flowers and includes families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, characterized by their hairy stems, showy flowers, and capsule fruits. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their ornamental value and distinctive foliage. Its species is Abutilon hulseanum, a specific type within the genus Abutilon, recognized for its unique characteristics and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba",
        "Florida",
        "Honduras",
        "Jamaica",
        "Leeward Is.",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southeast",
        "New Mexico",
        "Puerto Rico",
        "Texas",
        "Windward Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hulseanum is primarily native to Cuba, Florida, Honduras, Jamaica, Leeward Is., Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Southeast, New Mexico, Puerto Rico, Texas, and Windward Is. This plant is commonly found in tropical and subtropical regions, often growing in coastal areas and disturbed soils. It thrives in warm climates with ample sunlight and is often seen along roadsides and in open woodlands. The species is also known for its distinctive, lantern-shaped flowers that bloom in the summer months. Its wide distribution across the Caribbean and southern United States highlights its adaptability to diverse environmental conditions.",
    "distribution_introduced_art_desc": "Abutilon hulseanum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive fuzzy leaves and showy flowers. It was brought there during the 19th century by European settlers and horticulturalists who sought to introduce exotic plant species. Despite its aesthetic appeal, it has since become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to thrive in disturbed soils have contributed to its spread across various island environments. Conservation efforts are now underway to control its population and protect native plant communities."
}
