{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon indicum subsp. guineense",
    "plant_slug": "abutilon-indicum-subsp-guineense",
    "plant_name_scientific": "abutilon indicum subsp. guineense",
    "intro": "Abutilon indicum subsp. guineense, commonly known as the African velvetleaf, is a shrub native to tropical regions of Africa. It is characterized by its palmate leaves, which are often lobed and have a velvety texture. The plant produces small, yellowish-green flowers that are clustered in racemes, followed by capsule fruits containing numerous seeds. It thrives in warm, humid climates and is often found in disturbed soils or along riverbanks. Due to its rapid growth, it can become invasive in certain areas, outcompeting native vegetation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon indicum subsp. guineense is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Cameroon. It is also found in parts of West Africa, including Senegal and Mali. This plant thrives in humid environments and is commonly found in lowland areas with well-drained soils. It is often associated with disturbed habitats such as roadsides and agricultural fields. Its native range extends into parts of southern Arabia and the Indian subcontinent.",
    "distribution_introduced_art_desc": "Abutilon indicum subsp. guineense was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive, fuzzy leaves and showy flowers. It is commonly cultivated in gardens and landscapes in areas with warm climates, such as parts of Southeast Asia, Africa, and the Caribbean. The plant thrives in well-drained soil and requires full sun to partial shade for optimal growth. Its introduction has sometimes led to naturalization in certain regions, where it can become a weed in disturbed habitats. Despite its ornamental appeal, it is important to manage its spread to prevent ecological impacts."
}
