{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon ranadei",
    "plant_slug": "abutilon-ranadei",
    "plant_name_scientific": "abutilon ranadei",
    "intro": "Abutilon ranadei, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its broad, heart-shaped leaves that are often covered in fine, soft hairs, giving it a velvety texture. The plant produces clusters of small, yellowish-green flowers that bloom in the spring and summer months. Its growth habit is typically shrub-like, with multiple stems that can reach heights of up to 2 meters. Abutilon ranadei is often cultivated for its ornamental value due to its attractive foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon ranadei"
    },
    "taxonomy_art_desc": "Abutilon ranadei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their ancient lineage and diverse morphological features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Malvales, which comprises flowering plants with a distinctive type of flower and includes families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon ranadei, a specific type of plant within the genus Abutilon, known for its unique characteristics and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon ranadei is primarily native to India. It is found in various regions across the country, particularly in the southern and eastern states. This plant thrives in tropical and subtropical climates, often growing in moist, shaded areas. It is commonly associated with forested regions and is sometimes found in disturbed habitats. Its native distribution in India highlights its ecological significance in local biodiversity.",
    "distribution_introduced_art_desc": "Abutilon ranadei was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, maple-like leaves and showy flowers. The plant has since spread beyond cultivated areas and is now found in various habitats, including disturbed soils and along roadsides. It is considered an invasive species in some parts of its range due to its rapid growth and ability to outcompete native vegetation. Efforts are being made to control its spread and prevent further ecological impact."
}
