{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon virgatum var. paraguariense",
    "plant_slug": "abutilon-virgatum-var-paraguariense",
    "plant_name_scientific": "abutilon virgatum var. paraguariense",
    "intro": "Abutilon virgatum var. paraguariense, commonly known as the Paraguayan velvetleaf, is a flowering plant native to South America. It is characterized by its broad, velvety leaves and clusters of small, yellowish-green flowers. The plant is a member of the Malvaceae family, which includes hibiscus and cotton. It typically grows in moist, tropical environments and is often found in disturbed areas. Its ornamental value is due to its attractive foliage and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon virgatum var. paraguariense is primarily native to South America, specifically Argentina, Brazil, Paraguay, and Uruguay. This plant is commonly found in the temperate to subtropical regions of these countries. It thrives in moist, well-drained soils and is often found in open woodlands, grasslands, and along riverbanks. The species is known for its distinctive, lantern-shaped flowers and is sometimes cultivated for ornamental purposes. It plays an important ecological role in its native habitats by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Abutilon virgatum var. paraguariense was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in tropical and subtropical regions, including parts of the southern United States, Central America, and the Caribbean. The plant thrives in full sun to partial shade and is often used in landscaping for its rapid growth and ability to tolerate various soil conditions. It has been reported as an invasive species in some regions, outcompeting native vegetation. Due to its adaptability, it has been introduced to a wide range of environments beyond its native habitat."
}
