{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon myrianthum",
    "plant_slug": "abutilon-myrianthum",
    "plant_name_scientific": "abutilon myrianthum",
    "intro": "Abutilon myrianthum, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its soft, velvety leaves that give it its common name. The plant produces clusters of small, pale yellow flowers that bloom in the summer months. It thrives in warm climates and is often found in disturbed soils or along roadsides. Abutilon myrianthum is also valued for its ornamental appeal and is sometimes cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon myrianthum"
    },
    "taxonomy_art_desc": "Abutilon myrianthum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include economically significant genera like cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, characterized by their sympetalous flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their ornamental value and distinctive seed pods. Its species is Abutilon myrianthum, a specific type of Abutilon known for its large, showy flowers and is often cultivated for its ornamental appeal.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Ecuador",
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon myrianthum is primarily native to Colombia, Ecuador, and Peru. This plant is commonly found in the Andean region of South America. It thrives in tropical and subtropical climates, often growing in shaded or semi-shaded areas. It is typically found in moist, well-drained soils along riverbanks and in forest understories. The species is known for its ornamental value and is sometimes cultivated for its unique foliage.",
    "distribution_introduced_art_desc": "Abutilon myrianthum was mainly introduced to areas with warm climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It has been reported in parts of the United States, particularly in southern states like Florida and Texas. The plant thrives in full sun to partial shade and is commonly found in disturbed areas such as roadsides and abandoned fields. Its rapid growth and ability to spread through both seeds and vegetative reproduction have led to its establishment in some regions. However, it is not considered invasive in most areas where it is introduced."
}
