{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon schaeferi",
    "plant_slug": "abutilon-schaeferi",
    "plant_name_scientific": "abutilon schaeferi",
    "intro": "Abutilon schaeferi, commonly known as the Schaefer's Abutilon, is a flowering plant native to South America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its fuzzy, heart-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Its unique appearance makes it a popular choice for gardeners seeking exotic foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon schaeferi"
    },
    "taxonomy_art_desc": "Abutilon schaeferi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Malvales, which includes plants with distinctive flowers that often have five petals and a superior ovary. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and okra, characterized by their hairy leaves and capsule fruits. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" which are shrubs or herbs with showy, lantern-shaped flowers. Its species is Abutilon schaeferi, a specific type within the genus Abutilon, known for its unique floral structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Namibia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon schaeferi is primarily native to Namibia. This species is found in the arid and semi-arid regions of the country. It typically grows in rocky soils and along dry riverbeds. The plant is well adapted to the harsh environmental conditions of Namibia. It plays an important role in the local ecosystem and is part of the native flora of the region.",
    "distribution_introduced_art_desc": "Abutilon schaeferi was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive foliage and unique flowering habits. The distribution has expanded beyond its initial introduction, particularly in areas with mild climates and well-drained soils. It is commonly found in gardens and along roadsides in Oregon and Washington. However, its spread has raised concerns about its potential to become invasive in certain ecosystems."
}
