{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon parviflorum",
    "plant_slug": "abutilon-parviflorum",
    "plant_name_scientific": "abutilon parviflorum",
    "intro": "Abutilon parviflorum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is a shrub or small tree that typically grows to a height of 1–3 meters. The plant features heart-shaped, velvety leaves that are dark green on the upper surface and lighter on the underside. Its flowers are small, yellowish-green, and clustered in racemes, often blooming in the spring. The plant is known for its rapid growth and is sometimes considered an invasive species in certain areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon parviflorum is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and Malaysia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This plant thrives in humid climates and is often associated with coastal and riverine habitats. It is also present in parts of India and the Philippines. Due to its adaptability, it can sometimes be found in cultivated gardens or as an ornamental plant in other regions.",
    "distribution_introduced_art_desc": "Abutilon parviflorum was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through human activities, such as accidental transport on vehicles or cargo. The plant thrives in disturbed habitats, including roadsides and coastal areas. It competes with native plants, threatening local biodiversity. Due to its aggressive growth, it requires ongoing management to control its spread."
}
