{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon timoriense",
    "plant_slug": "abutilon-timoriense",
    "plant_name_scientific": "abutilon timoriense",
    "intro": "Abutilon timoriense, commonly known as the Timor Abutilon, is a shrub native to the island of Timor. It belongs to the Malvaceae family, which includes hibiscus and cotton plants. The plant is characterized by its velvety, ovate leaves and showy, lantern-shaped flowers that range in color from yellow to red. It thrives in tropical and subtropical climates and is often found in coastal areas. Due to its ornamental value, it is sometimes cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon timoriense is primarily native to the island of Timor, including the eastern half of the island of Timor and the western half of the island of Timor, as well as the nearby islands of Atauro and Jaco. It is commonly found in coastal areas and lowland regions, often growing in disturbed or open habitats. The plant thrives in tropical climates with high humidity and well-drained soils. It is also present in parts of Indonesia, particularly in the Maluku Islands. Its native range is limited to these specific regions in Southeast Asia.",
    "distribution_introduced_art_desc": "Abutilon timoriense was mainly introduced to Hawaii, where it has become an invasive species. It was originally from the island of Timor and was likely brought there as an ornamental plant due to its attractive foliage and flowers. The plant thrives in tropical climates and spreads rapidly through seeds dispersed by wind, water, and animals. It competes with native vegetation, leading to ecological concerns in the region. Efforts are underway to control its spread and prevent further habitat disruption."
}
