{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon aristulosum",
    "plant_slug": "abutilon-aristulosum",
    "plant_name_scientific": "abutilon aristulosum",
    "intro": "Abutilon aristulosum, commonly known as the velvetleaf abutilon, is a perennial shrub native to tropical regions of the Americas. It is characterized by its soft, fuzzy leaves that give it a velvety texture, and its showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows to a height of 1–3 meters and thrives in warm, humid climates. It is often found in disturbed soils and can be invasive in some areas. Its botanical features make it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon aristulosum is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in open habitats such as forests, shrublands, and along riverbanks. It is often seen growing in secondary vegetation and disturbed sites. Its native range extends to parts of Indonesia and Malaysia as well.",
    "distribution_introduced_art_desc": "Abutilon aristulosum was mainly introduced to South Africa, where it has become an invasive species. It was likely introduced through human activities such as accidental transport via trade or horticultural practices. The plant thrives in disturbed habitats, including roadsides and open forests, contributing to its rapid spread. It poses a threat to native biodiversity by outcompeting local vegetation for resources. Efforts are ongoing to control its spread and mitigate its ecological impact."
}
