{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon jacquinii",
    "plant_slug": "abutilon-jacquinii",
    "plant_name_scientific": "abutilon jacquinii",
    "intro": "Abutilon jacquinii, commonly known as the velvetleaf abutilon, is a species of flowering plant in the mallow family, Malvaceae. It is native to South America, particularly Brazil, and is characterized by its fuzzy, hairy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. It thrives in warm, humid climates and is often found in tropical and subtropical regions. Abutilon jacquinii is valued for its ornamental appeal and is occasionally cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon jacquinii is primarily native to South America, specifically countries such as Brazil, Colombia, and Ecuador. It is commonly found in tropical and subtropical regions, particularly in areas with moist, well-drained soils. This plant thrives in open woodlands, forest edges, and along riverbanks. It is often associated with secondary growth habitats and can be found at low to moderate elevations. Its natural range extends into parts of Central America as well.",
    "distribution_introduced_art_desc": "Abutilon jacquinii was mainly introduced to the southeastern United States, particularly in Florida and parts of Georgia. It is commonly found in disturbed areas such as roadsides, vacant lots, and along riverbanks. This species thrives in moist, well-drained soils and is often considered an invasive plant in certain regions. Its rapid growth and ability to spread through seeds make it a challenge for land managers. Despite its invasive tendencies, it is sometimes cultivated for its ornamental value due to its showy flowers."
}
