{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon virgatum var. typica",
    "plant_slug": "abutilon-virgatum-var-typica",
    "plant_name_scientific": "abutilon virgatum var. typica",
    "intro": "Abutilon virgatum var. typica, commonly known as the velvetleaf abutilon, is a deciduous shrub native to the southeastern United States. It is characterized by its fuzzy, velvety leaves that are typically heart-shaped or ovate in form. The plant produces clusters of small, yellowish-green flowers that bloom in the summer months. Its fibrous roots and hairy stems are adaptations that help it thrive in moist, sandy soils. It is often found in wetlands, marshes, and along stream banks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon virgatum var. typica is primarily native to the southeastern United States, including states such as Florida, Georgia, South Carolina, and parts of Alabama. It is commonly found in coastal areas, wetlands, and disturbed habitats along the Atlantic and Gulf Coasts. This plant thrives in sandy or loamy soils and is often seen in open woodlands, marshes, and along roadsides. It is an erect shrub that can grow up to several feet tall, featuring fuzzy leaves and showy, lantern-shaped flowers. Due to its adaptability, it is also sometimes cultivated in gardens in similar climates.",
    "distribution_introduced_art_desc": "Abutilon virgatum var. typica was mainly introduced to the United States, particularly in the southern regions, as an ornamental plant due to its attractive, lantern-shaped flowers. It has been cultivated in gardens and landscapes for its aesthetic value, often used in public parks and private yards. The plant thrives in warm climates and is commonly found in coastal areas and along roadsides. Despite its ornamental appeal, it has also become invasive in some regions, outcompeting native vegetation. Its introduction has led to ecological concerns, prompting efforts to manage its spread."
}
