{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon americanum",
    "plant_slug": "abutilon-americanum",
    "plant_name_scientific": "abutilon americanum",
    "intro": "Abutilon americanum, commonly known as the velvetleaf or American abutilon, is a flowering plant native to the Americas. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its broad, heart-shaped leaves. The plant produces clusters of small, yellow flowers that bloom in the summer months. Its fruit is a capsule that splits open to release seeds, which are dispersed by wind. Abutilon americanum is often found in disturbed areas, such as roadsides and fields, and is adapted to a variety of soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon americanum is primarily native to the southern United States, including Texas, Florida, and parts of the Gulf Coast. It is also found in Mexico and extends into Central America. This plant thrives in warm, humid climates and is commonly found in coastal areas and disturbed soils. It is often seen growing along roadsides, in open woods, and near water sources. Its natural range includes regions with a subtropical to tropical climate.",
    "distribution_introduced_art_desc": "Abutilon americanum was mainly introduced to the coastal areas of southern California and the Pacific Northwest. It was brought in for its ornamental value due to its showy flowers and unique leaf shapes. The plant thrives in moist, well-drained soils and full sun to partial shade conditions. It has become naturalized in some regions, sometimes outcompeting native vegetation. Its introduction has raised concerns about its potential impact on local ecosystems."
}
