{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon rosiflorum",
    "plant_slug": "abutilon-rosiflorum",
    "plant_name_scientific": "abutilon rosiflorum",
    "intro": "Abutilon rosiflorum, commonly known as the roseflower abutilon, is a flowering plant native to South America. It is a shrub that typically grows to a height of 1 to 3 meters, featuring soft, hairy stems and heart-shaped leaves. The plant produces clusters of showy, rose-like flowers in shades of pink to red, which bloom in the spring and summer. Its botanical characteristics include stamens that are longer than the petals, and it is often cultivated for its ornamental value. The plant thrives in well-drained soil and full sun, making it suitable for garden cultivation in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon rosiflorum is primarily native to southern Africa, specifically South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, growing in rocky soils and along riverbanks. This plant thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is often seen in open woodlands and grasslands, where it can tolerate both full sun and partial shade. Due to its adaptability, it is also occasionally cultivated in other parts of the world with similar climatic conditions.",
    "distribution_introduced_art_desc": "Abutilon rosiflorum was mainly introduced to regions with warm, temperate climates where it can thrive in well-drained soils. It is commonly found in coastal areas and disturbed sites due to its adaptability to various environmental conditions. This plant is often used in landscaping for its ornamental value, particularly its showy flowers. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its distribution is largely influenced by human activity and climate suitability."
}
