{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon globiflorum",
    "plant_slug": "abutilon-globiflorum",
    "plant_name_scientific": "abutilon globiflorum",
    "intro": "Abutilon globiflorum, commonly known as the globe flower or woolly abutilon, is a flowering plant native to South America. It is characterized by its soft, hairy leaves and clusters of small, globe-shaped flowers that bloom in shades of yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its flowers are borne in dense inflorescences, which give it a unique and ornamental appearance. It prefers well-drained soil and full sun to partial shade, making it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon globiflorum is primarily native to tropical and subtropical regions of South America, particularly Brazil, Paraguay, and Argentina. It thrives in humid, warm climates and is commonly found in lowland areas with well-drained soils. This plant is often associated with disturbed habitats such as riverbanks, roadsides, and open woodlands. It is known for its showy, globe-shaped flower clusters that attract pollinators like bees and butterflies. Due to its adaptability, it has also been introduced to other parts of the world, including the Caribbean and southern United States.",
    "distribution_introduced_art_desc": "Abutilon globiflorum was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive, globe-shaped flowers. However, it has since spread rapidly and is now considered a significant threat to native ecosystems. The plant thrives in disturbed areas and can outcompete native vegetation for resources. Efforts are ongoing to control its spread and mitigate its impact on local biodiversity."
}
