{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon avicennae f. parviflorum",
    "plant_slug": "abutilon-avicennae-f-parviflorum",
    "plant_name_scientific": "abutilon avicennae f. parviflorum",
    "intro": "Abutilon avicennae f. parviflorum, commonly known as the small-flowered Chinese Abutilon, is a variant of the Abutilon genus native to China. It is a deciduous shrub characterized by its hairy stems and heart-shaped leaves. The plant produces small, pale yellow flowers that bloom in clusters during the summer months. It thrives in well-drained soil and partial to full sunlight, making it suitable for garden cultivation. Its ornamental value comes from its foliage and unique flowering habit.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon avicennae f. parviflorum is primarily native to the coastal regions of southeastern Brazil, particularly in the states of Espírito Santo, Rio de Janeiro, and São Paulo. This plant thrives in sandy soils along the Atlantic coast, where it is often found in dunes and open coastal vegetation. It is adapted to the humid and warm climate typical of the region, with high rainfall during the summer months. The species is also occasionally found in nearby inland areas with similar environmental conditions. Due to its restricted habitat, it is considered a rare and endemic plant in this part of Brazil.",
    "distribution_introduced_art_desc": "Abutilon avicennae f. parviflorum was mainly introduced to areas with warm, humid climates and well-drained soils, typically in coastal regions. It thrives in full sun to partial shade and is often found in disturbed habitats such as roadsides, waste areas, and along riverbanks. This plant is commonly cultivated for its ornamental value due to its distinctive foliage and showy flowers. It has been reported as an invasive species in several regions outside its native range. Its rapid growth and ability to spread through seeds make it a challenging weed to control."
}
