{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pakistanicum",
    "plant_slug": "abutilon-pakistanicum",
    "plant_name_scientific": "abutilon pakistanicum",
    "intro": "Abutilon pakistanicum, commonly known as the Kashmir velvetleaf, is a flowering plant native to the regions of Pakistan and Kashmir. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its soft, hairy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in late summer to early autumn, attracting pollinators such as bees and butterflies. Its leaves are ovate to elliptic in shape, with a velvety texture, and it thrives in well-drained soils in temperate to subtropical climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pakistanicum"
    },
    "taxonomy_art_desc": "Abutilon pakistanicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, known for their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose and magnolia families. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and some with specialized seed structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and capsule fruits. Its genus is Abutilon, a group of flowering plants known for their showy, lantern-shaped flowers and are often referred to as \"Chinese lanterns.\" Its species is Abutilon pakistanicum, a specific type of Abutilon native to Pakistan, characterized by its distinctive floral morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India",
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pakistanicum is primarily native to India and Pakistan. It is commonly found in regions with a warm, dry climate. This plant thrives in arid and semi-arid environments. It is often seen growing in rocky soils and along the edges of forests. Its natural range extends across various parts of South Asia.",
    "distribution_introduced_art_desc": "Abutilon pakistanicum was mainly introduced to areas with a warm, semi-arid climate, particularly in regions of Pakistan and parts of northern India. It thrives in well-drained soils and is often found in disturbed habitats such as roadsides and agricultural fields. This plant is valued for its ornamental foliage and has been cultivated for its unique leaf shapes and vibrant colors. It is also used in traditional medicine and as a source of fiber. Due to its adaptability, it has spread to other regions where similar environmental conditions exist."
}
