{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon bedfordianum var. tomentellum",
    "plant_slug": "abutilon-bedfordianum-var-tomentellum",
    "plant_name_scientific": "abutilon bedfordianum var. tomentellum",
    "intro": "Abutilon bedfordianum var. tomentellum, commonly known as the fuzzy abutilon, is a deciduous shrub native to the United States, particularly in the southeastern region. It is characterized by its soft, hairy foliage and showy, lantern-shaped flowers that typically bloom in the spring. The plant produces capsule fruits that contain numerous small, wind-dispersed seeds. It thrives in full sun to partial shade and prefers well-drained soil, making it a popular choice for ornamental gardening. Its unique appearance and adaptability contribute to its value in both landscape design and ecological settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon bedfordianum var. tomentellum is primarily native to the Caribbean islands, particularly the Greater Antilles. This variant is commonly found in coastal areas and lowland regions where it thrives in humid, tropical climates. It is especially prevalent in countries such as Cuba, Jamaica, and the Bahamas. The plant is adapted to sandy or rocky soils and often grows in shaded or semi-shaded environments. Its native distribution is closely linked to the ecological conditions of these islands.",
    "distribution_introduced_art_desc": "Abutilon bedfordianum var. tomentellum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain regions, particularly in coastal areas. It is commonly found in urban environments and along roadsides. However, it is considered a potential weed in some areas due to its ability to spread readily."
}
