{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon uratocarpum",
    "plant_slug": "abutilon-uratocarpum",
    "plant_name_scientific": "abutilon uratocarpum",
    "intro": "Abutilon uratocarpum, commonly known as the Brazilian abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 5 meters in height, featuring heart-shaped leaves with a rough texture. The plant produces clusters of small, pale yellow to greenish flowers, which are followed by elongated, woody pods containing seeds. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sunlight. The botanical characteristics of this species make it a distinctive and ornamental plant in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon uratocarpum is primarily native to the Caribbean region, including parts of Cuba, Hispaniola, Jamaica, and the Bahamas. It is commonly found in coastal areas and lowland forests where it thrives in humid, tropical climates. This plant is often associated with sandy soils and can be found growing along beaches and in disturbed habitats. It plays an important ecological role in its native range by providing food and shelter for local wildlife. Due to its ornamental value, it is also cultivated in some tropical regions outside its natural distribution.",
    "distribution_introduced_art_desc": "Abutilon uratocarpum was mainly introduced to South America, particularly in countries like Brazil, Argentina, and Paraguay. It is commonly found in tropical and subtropical regions, often growing in disturbed areas such as roadsides and abandoned fields. The plant is known for its ornamental value due to its showy yellow flowers and velvety leaves. It has been introduced for horticultural purposes but has also become invasive in some areas. Its distribution is largely restricted to regions with warm climates and well-drained soils."
}
