{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon grevilleanum",
    "plant_slug": "abutilon-grevilleanum",
    "plant_name_scientific": "abutilon grevilleanum",
    "intro": "Abutilon grevilleanum, commonly known as the velvetleaf abutilon, is a deciduous shrub native to tropical and subtropical regions. It is characterized by its hairy, velvety leaves that give it a distinctive texture. The plant produces showy, bell-shaped flowers that range in color from yellow to orange, often appearing in clusters. It thrives in well-drained soil and requires full sun to partial shade. Abutilon grevilleanum is often cultivated for its ornamental value in gardens and as a landscape plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon grevilleanum is primarily native to the Caribbean islands, including Cuba, Hispaniola, Jamaica, and the Bahamas. It is also found in parts of Central America, such as Belize and Guatemala. This plant typically grows in coastal areas and is often associated with sandy or rocky soils. It thrives in warm, humid climates and is commonly seen in tropical and subtropical regions. Its native distribution is largely restricted to these specific geographic areas within the Caribbean and Central America.",
    "distribution_introduced_art_desc": "Abutilon grevilleanum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering habits. The plant has since become naturalized in certain regions, particularly in the North Island. It is commonly found in disturbed areas such as roadsides and forest margins. However, its spread is limited and it does not pose a significant threat to native ecosystems."
}
