{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta brevifolia",
    "plant_slug": "abuta-brevifolia",
    "plant_name_scientific": "abuta brevifolia",
    "intro": "Abuta brevifolia, commonly known as the African butterbean, is a climbing shrub native to tropical Africa. It belongs to the family Malvaceae and is characterized by its thick, fleshy stems and heart-shaped leaves. The plant produces showy, pinkish-white flowers that are clustered in racemes. Its fruit is a capsule that contains several kidney-shaped seeds. Abuta brevifolia is also valued for its medicinal properties in traditional African medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta brevifolia"
    },
    "taxonomy_art_desc": "Abuta brevifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Ranunculales, a group of flowering plants that includes many herbs and shrubs, often with showy flowers and a wide range of ecological adaptations. Its family is Menispermaceae, commonly known as the pipevine family, which includes climbing plants with distinctive leaves and often toxic compounds. Its genus is Abuta, a group of flowering plants native to tropical regions, characterized by their woody vines and medicinal properties. Its species is Abuta brevifolia, a specific plant within the genus Abuta, known for its short leaves and potential use in traditional medicine.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta brevifolia is primarily native to Brazil North. It is found in the northern regions of Brazil, particularly in the Amazon Basin. This plant thrives in tropical rainforest environments with high humidity and abundant rainfall. It is commonly found in lowland areas with rich, well-drained soil. Abuta brevifolia is known for its medicinal properties and is often used in traditional medicine by local communities.",
    "distribution_introduced_art_desc": "Abuta brevifolia was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It thrives in environments with partial to full sunlight and requires consistent moisture throughout the growing season. This plant is often cultivated for its ornamental value due to its attractive foliage and unique flowers. It is also valued for its medicinal properties, which have been traditionally used in herbal remedies. However, its introduction has raised concerns about its potential invasiveness in non-native habitats."
}
