{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon senile",
    "plant_slug": "abutilon-senile",
    "plant_name_scientific": "abutilon senile",
    "intro": "Abutilon senile, commonly known as the fuzzy abutilon, is a flowering plant native to the southern United States and parts of Mexico. It is characterized by its soft, hairy leaves and showy, lantern-shaped flowers that typically bloom in shades of yellow, orange, or red. The plant thrives in well-drained soil and full sun to partial shade, making it a popular choice for ornamental gardening. It is a deciduous shrub that can grow up to 6 feet tall, with a sprawling habit that often requires pruning. Its botanical features make it a valuable addition to landscapes seeking both aesthetic appeal and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon senile is primarily native to the southeastern United States, including states such as Florida, Georgia, and South Carolina. It thrives in warm, humid climates and is commonly found in coastal areas and along riverbanks. This plant is often associated with disturbed soils and can be seen growing in open woodlands or along roadsides. It is also native to parts of the Caribbean, including the Bahamas and Cuba. Abutilon senile is a perennial shrub that is well adapted to the subtropical and tropical environments of its native range.",
    "distribution_introduced_art_desc": "Abutilon senile was mainly introduced to New Zealand as an ornamental plant due to its attractive, maple-like leaves and showy flowers. It is now considered a weed in certain regions, particularly in the North Island, where it spreads rapidly along stream banks and in disturbed areas. The plant thrives in moist, fertile soils and can form dense stands that outcompete native vegetation. Its introduction has led to ecological concerns, as it can alter local ecosystems and reduce biodiversity. Management efforts include manual removal and the use of herbicides to control its spread."
}
