{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon macrocarpum",
    "plant_slug": "abutilon-macrocarpum",
    "plant_name_scientific": "abutilon macrocarpum",
    "intro": "Abutilon macrocarpum, commonly known as the big-seed abutilon, is a shrub native to South America. It belongs to the Malvaceae family, which includes hibiscus and cotton plants. The plant is characterized by its hairy, ovate leaves and showy, yellow-orange flowers that bloom in late summer. Its fruit is a capsule containing large, hard seeds. It is often cultivated for its ornamental value and is adapted to grow in a variety of soil types.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon macrocarpum"
    },
    "taxonomy_art_desc": "Abutilon macrocarpum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their spore reproduction and often possessing vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their showy, lantern-shaped flowers. Its species is Abutilon macrocarpum, a specific type within the genus Abutilon, distinguished by its large, showy flowers and is native to certain regions of South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast",
        "Senegal"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon macrocarpum is primarily native to Brazil Southeast and Senegal. This species is found in the tropical regions of these areas. It thrives in warm, humid climates with well-drained soils. The plant is commonly found in forest understories and along riverbanks. Its distribution reflects its adaptability to diverse ecological conditions in these regions.",
    "distribution_introduced_art_desc": "Abutilon macrocarpum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowers. However, it has since become invasive, spreading rapidly in natural ecosystems. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its introduction has led to concerns about its impact on native plant species and biodiversity."
}
