{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta vaupesensis",
    "plant_slug": "abuta-vaupesensis",
    "plant_name_scientific": "abuta vaupesensis",
    "intro": "Abuta vaupesensis, commonly known as the Amazonian buttercup, is a flowering plant native to the tropical rainforests of South America. It belongs to the family Euphorbiaceae and is characterized by its striking yellow flowers and succulent leaves. The plant is often found growing in moist, shaded environments within the understory of dense forests. Its latex contains various bioactive compounds, making it of interest in pharmacological research. Due to habitat loss, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta vaupesensis"
    },
    "taxonomy_art_desc": "Abuta vaupesensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Ranunculales, which includes flowering plants with showy flowers and often includes species that are toxic or have medicinal properties. Its family is Menispermaceae, commonly known as the birthwort family, which consists of mostly tropical and subtropical plants with distinctive leaf and fruit structures. Its genus is Abuta, a group of flowering plants native to tropical regions of South America, known for their ornamental value and medicinal uses. Its species is Abuta vaupesensis, a specific plant within the genus Abuta, found in the Amazon basin, characterized by its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta vaupesensis is primarily native to Colombia. It is found in the tropical regions of the country, particularly in the Amazon basin. This plant thrives in humid, lowland areas with rich soil and abundant rainfall. It is commonly found in the departments of Vaupés and Guainía. Abuta vaupesensis is an important component of the local flora and plays a role in the ecological balance of its habitat.",
    "distribution_introduced_art_desc": "Abuta vaupesensis was mainly introduced to the data as a rare species with limited geographic distribution. It is native to the Amazon rainforest in South America, specifically in regions of Venezuela and Colombia. The plant is known for its unique tubular flowers and is often found in moist, shaded environments. Due to its restricted habitat, it is considered vulnerable to habitat loss and environmental changes. Conservation efforts are ongoing to protect this species and its natural ecosystem."
}
