{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon contractum",
    "plant_slug": "abutilon-contractum",
    "plant_name_scientific": "abutilon contractum",
    "intro": "Abutilon contractum, commonly known as the narrowleaf abutilon, is a flowering plant native to the southeastern United States. It is a deciduous shrub or small tree that typically grows in moist, sandy soils. The plant features narrow, elliptical leaves and produces showy, spiny capsules that contain numerous small seeds. It blooms in the spring and summer, attracting pollinators with its yellow flowers. The species is valued for its ornamental appeal and is often used in landscaping for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon contractum is primarily native to the Caribbean, Central America, and northern South America. It is commonly found in tropical and subtropical regions, particularly in countries such as Mexico, Guatemala, Belize, and parts of Colombia. This plant thrives in moist, well-drained soils and is often found in coastal areas or near rivers. It is also present in some islands of the Greater Antilles, including Cuba and Hispaniola. Its natural range extends into parts of the southern United States, particularly Florida.",
    "distribution_introduced_art_desc": "Abutilon contractum was mainly introduced to control erosion and for its ornamental value in tropical and subtropical regions. It is commonly found in disturbed soils and along roadsides where it can thrive in full sun to partial shade. The plant is known for its fuzzy, hairy leaves and showy yellow flowers that bloom throughout the growing season. Due to its rapid growth and ability to spread through both seeds and vegetative means, it has become an invasive species in several areas. Its introduction has led to ecological concerns as it can outcompete native vegetation in certain environments."
}
