{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta manausensis",
    "plant_slug": "abuta-manausensis",
    "plant_name_scientific": "abuta manausensis",
    "intro": "Abuta manausensis, commonly known as the Amazonian buttercup, is a flowering plant native to the rainforests of the Amazon Basin. It belongs to the family Euphorbiaceae and is characterized by its striking yellow flowers and milky sap. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its leaves are alternate, simple, and often have a waxy texture. Abuta manausensis is valued for its medicinal properties, particularly in traditional Amazonian medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta manausensis is primarily native to the Amazon Basin, specifically in the northern regions of South America. It is found in countries such as Brazil, Colombia, and Ecuador. This plant thrives in humid tropical forests and is commonly found in the understory of these ecosystems. It is often associated with areas near rivers and in lowland rainforests. Due to its restricted habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abuta manausensis was mainly introduced to the Amazon rainforest region of Brazil, specifically in the state of Amazonas. It is commonly found in the understory of humid evergreen forests, where it thrives in the shaded and moist conditions. This plant is often associated with areas near rivers and along the edges of forested landscapes. Its introduction to these regions has been largely due to its ornamental value and traditional medicinal uses. However, its spread is limited by its specific habitat requirements and the fragmented nature of its natural range."
}
