{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon abutiloides",
    "plant_slug": "abutilon-abutiloides",
    "plant_name_scientific": "abutilon abutiloides",
    "intro": "Abutilon abutiloides, commonly known as velvetleaf, is a flowering plant native to tropical regions of the Americas. It is characterized by its heart-shaped leaves that are covered in a dense, soft pubescence, giving it a velvety texture. The plant produces clusters of small, pale yellow flowers that bloom in the summer months. Its fruit is a spiny capsule that contains several seeds. Abutilon abutiloides is often found in disturbed habitats and can be invasive in some areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon abutiloides"
    },
    "taxonomy_art_desc": "Abutilon abutiloides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers that often have five petals. Its genus is Abutilon, a group of flowering plants that are typically shrubs or trees with palmate leaves and showy, often fuzzy flowers. Its species is Abutilon abutiloides, a specific type of plant within the genus Abutilon, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Bahamas",
        "Colombia",
        "Cuba",
        "Dominican Republic",
        "Haiti",
        "Honduras",
        "Jamaica",
        "Leeward Is.",
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Puerto Rico",
        "Texas",
        "Turks-Caicos Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon abutiloides is primarily native to Arizona, Bahamas, Colombia, Cuba, Dominican Republic, Haiti, Honduras, Jamaica, Leeward Is., Mexico Central, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, Puerto Rico, Texas, Turks-Caicos Is. This species thrives in tropical and subtropical regions, often found in coastal areas and disturbed habitats. It is commonly associated with sandy soils and can be seen growing along roadsides and in open woodlands. The plant is known for its ornamental value, with its fuzzy leaves and showy flowers. Its wide native range suggests a high adaptability to various environmental conditions.",
    "distribution_introduced_art_desc": "Abutilon abutiloides was mainly introduced to the Pacific Northwest of the United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It thrives in moist, well-drained soils and can spread through seeds carried by wind or water. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
