{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon nealleyi",
    "plant_slug": "abutilon-nealleyi",
    "plant_name_scientific": "abutilon nealleyi",
    "intro": "Abutilon nealleyi, commonly known as the Nealley's abutilon, is a flowering plant native to the southern United States and northern Mexico. It is a shrub or small tree that typically grows in arid or semi-arid environments. The plant produces showy, lantern-shaped flowers in shades of yellow, orange, and red, which bloom in the summer months. Its leaves are alternate, ovate, and have a rough texture, while its bark is smooth and grayish in color. Abutilon nealleyi is valued for its ornamental appeal and is often cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon nealleyi is primarily native to the western coast of South America, specifically in Ecuador and Peru. It is commonly found in coastal areas and near the mouths of rivers. This plant thrives in sandy or rocky soils along the shoreline. It is often associated with mangrove ecosystems and tidal zones. Its distribution is limited to these specific coastal habitats in the region.",
    "distribution_introduced_art_desc": "Abutilon nealleyi was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive foliage and unique appearance. It has since become naturalized in several areas, often growing in disturbed soils and along roadsides. The plant's spread is attributed to both human activity and its ability to thrive in a variety of environmental conditions. It is considered a potential weed in some regions due to its rapid growth and competitive nature. Despite its ornamental value, its introduction has raised concerns about its impact on native ecosystems."
}
