{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon truncatum",
    "plant_slug": "abutilon-truncatum",
    "plant_name_scientific": "abutilon truncatum",
    "intro": "Abutilon truncatum, commonly known as the Indian mallow, is a flowering plant native to tropical and subtropical regions. It is characterized by its fuzzy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to red. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its seeds are enclosed in a three-lobed capsule that splits open when mature to release the seeds. Abutilon truncatum is often cultivated for its ornamental value and is adapted to well-drained soils and full sun.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon truncatum is primarily native to Central America, the Caribbean, and parts of South America. It is commonly found in countries such as Mexico, Guatemala, Belize, Honduras, and Nicaragua. This plant thrives in tropical and subtropical regions, often growing in disturbed soils near rivers, roadsides, and forest edges. It is also present in some areas of the southern United States, including Florida and Texas. Its native range includes regions with warm, humid climates and well-drained soils.",
    "distribution_introduced_art_desc": "Abutilon truncatum was mainly introduced to the western United States, particularly in California and Oregon. It was brought there for its ornamental value due to its attractive, lantern-shaped leaves and showy flowers. The plant has since become naturalized in some areas, often growing along roadsides and in disturbed soils. It is considered an invasive species in certain regions because of its rapid growth and ability to spread aggressively. Despite its beauty, it can outcompete native plants and alter local ecosystems."
}
