{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon angulatum",
    "plant_slug": "abutilon-angulatum",
    "plant_name_scientific": "abutilon angulatum",
    "intro": "Abutilon angulatum, commonly known as the Chinese lantern plant, is a flowering plant native to Southeast Asia. It belongs to the Malvaceae family and is characterized by its distinctive, lantern-shaped bracts that enclose its small, inconspicuous flowers. The plant typically grows as an upright shrub with hairy, lobed leaves that are often grayish in appearance. It thrives in warm, humid climates and is often cultivated for its ornamental value. The flowers, which are usually yellow or greenish, are pollinated by insects, and the plant produces capsule fruits that contain numerous seeds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon angulatum"
    },
    "taxonomy_art_desc": "Abutilon angulatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their primitive floral structures and diverse habitats. Its order is Malvales, which includes plants with showy flowers and often includes species that produce cotton or other fibrous materials. Its family is Malvaceae, commonly known as the mallow family, which includes plants with a distinctive sympetalous flower and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern\" for their ornamental qualities. Its species is Abutilon angulatum, a specific type within the genus Abutilon that is characterized by its unique leaf shape and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Aldabra",
        "Angola",
        "Botswana",
        "Burundi",
        "Cameroon",
        "Chad",
        "DR Congo",
        "Eritrea",
        "Ethiopia",
        "Gambia",
        "Kenya",
        "KwaZulu-Natal",
        "Madagascar",
        "Malawi",
        "Mali",
        "Mauritania",
        "Mozambique",
        "Namibia",
        "Nigeria",
        "Northern Provinces",
        "Rwanda",
        "Senegal",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon angulatum is primarily native to Aldabra, Angola, Botswana, Burundi, Cameroon, Chad, DR Congo, Eritrea, Ethiopia, Gambia, Kenya, KwaZulu-Natal, Madagascar, Malawi, Mali, Mauritania, Mozambique, Namibia, Nigeria, Northern Provinces, Rwanda, Senegal, Somalia, Sudan-South Sudan, Tanzania, Uganda, Zambia, and Zimbabwe. It is commonly found in arid and semi-arid regions across these areas. The plant thrives in open habitats such as grasslands, savannas, and rocky outcrops. It is well adapted to dry climates and can tolerate poor soil conditions. Its distribution spans a wide range of sub-Saharan Africa and the island of Aldabra.",
    "distribution_introduced_art_desc": "Abutilon angulatum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, dunes, and coastal habitats. This plant thrives in sandy or gravelly soils and is often associated with maritime environments. It is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded beyond its original range due to human activity and climate change."
}
