{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta platyphylla",
    "plant_slug": "abuta-platyphylla",
    "plant_name_scientific": "abuta platyphylla",
    "intro": "Abuta platyphylla, commonly known as the flat-leaf abuta, is a flowering plant native to the tropical regions of South America. It belongs to the family Euphorbiaceae and is characterized by its thick, fleshy stems and broad, heart-shaped leaves. The plant produces small, clustered flowers that are typically yellow or greenish in color. Abuta platyphylla is often cultivated for its ornamental value due to its unique foliage and ability to thrive in warm, humid climates. It is also used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta platyphylla"
    },
    "taxonomy_art_desc": "Abuta platyphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Ranunculales, a group of flowering plants known for their showy flowers and often containing toxic compounds. Its family is Menispermaceae, a family of flowering plants commonly known as the \"douglasias,\" which includes many species with distinctive leaf and fruit structures. Its genus is Abuta, a group of flowering plants native to tropical regions, characterized by their palmate leaves and fleshy fruits. Its species is Abuta platyphylla, a specific plant within the genus Abuta known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta platyphylla is primarily native to Brazil North. It is found in the northern regions of Brazil, particularly in the Amazon Basin. This plant thrives in tropical rainforest environments with high humidity and abundant rainfall. It is commonly found in dense undergrowth and along riverbanks. Its distribution is largely restricted to the specific ecological conditions of this region.",
    "distribution_introduced_art_desc": "Abuta platyphylla was mainly introduced to the Southeastern United States, particularly in states like Florida and Georgia. It has also been found in parts of Texas and the Carolinas. This plant is often cultivated in gardens and landscapes due to its ornamental value. It thrives in well-drained soils and full sun to partial shade conditions. However, it is considered an invasive species in some areas, posing a threat to native plant communities."
}
