{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta macrophylla",
    "plant_slug": "abuta-macrophylla",
    "plant_name_scientific": "abuta macrophylla",
    "intro": "Abuta macrophylla, commonly known as the giant abuta, is a flowering plant native to the Andean regions of South America. It is characterized by its large, heart-shaped leaves that can reach up to 30 centimeters in diameter. The plant produces clusters of small, yellowish-white flowers that bloom in spring. It thrives in humid, shaded environments and is often found in cloud forests. Abuta macrophylla is valued for its ornamental qualities and has been used in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta macrophylla is primarily native to the western regions of the United States, particularly in California, Nevada, and Utah. It thrives in rocky, arid, and semi-arid environments, often growing in mountainous areas with well-drained soils. This plant is commonly found in sagebrush steppe and woodland habitats at elevations ranging from 1,500 to 6,000 feet. It is well adapted to the harsh climate of its native range, with thick, waxy leaves that help reduce water loss. Abuta macrophylla is also known to grow in parts of northern Mexico, extending its distribution into the southwestern United States.",
    "distribution_introduced_art_desc": "Abuta macrophylla was mainly introduced to areas with moist, well-drained soils and partial to full sunlight. It thrives in temperate climates and is often cultivated for its ornamental value. The plant is commonly found in gardens and landscapes in regions with mild winters. It is also used in traditional medicine for its potential health benefits. Its distribution has been expanded through horticultural efforts and ecological planting initiatives."
}
