{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon lignosum",
    "plant_slug": "abutilon-lignosum",
    "plant_name_scientific": "abutilon lignosum",
    "intro": "Abutilon lignosum, commonly known as the velvetleaf or Chinese lantern plant, is a shrub native to tropical and subtropical regions. It is characterized by its soft, fuzzy leaves that give it a velvety texture. The plant produces lantern-shaped flowers that range in color from yellow to orange, often with a red or purple calyx. It thrives in warm climates and is often used in ornamental gardening. Abutilon lignosum is also known for its ability to tolerate a variety of soil types and its relatively low maintenance requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon lignosum is primarily native to Southeast Asia, including countries such as India, Sri Lanka, and parts of Indonesia. It is also found in the Pacific Islands, including Hawaii and parts of the Philippines. This plant thrives in tropical and subtropical climates, often growing in coastal areas or near water sources. It is commonly found in moist, well-drained soils and can be seen in both natural and cultivated settings. Its native range extends to some regions of Australia as well.",
    "distribution_introduced_art_desc": "Abutilon lignosum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, stream banks, and forest edges. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It thrives in moist, well-drained soils and can tolerate a wide range of environmental conditions. Its spread has raised concerns among land managers and conservationists."
}
