{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon viscosum",
    "plant_slug": "abutilon-viscosum",
    "plant_name_scientific": "abutilon viscosum",
    "intro": "Abutilon viscosum, commonly known as velvetleaf, is a flowering plant native to the Americas. It is characterized by its broad, heart-shaped leaves that are covered in a dense, velvety pubescence. The plant produces clusters of small, greenish-yellow flowers that bloom in the summer months. Its fruit is a capsule that splits open to release numerous seeds. Velvetleaf is often found in disturbed soils and can become invasive in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon viscosum"
    },
    "taxonomy_art_desc": "Abutilon viscosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, characterized by their showy flowers and capsule fruits. Its family is Malvaceae, commonly known as the mallow family, which includes plants with velvety leaves and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and capsule fruits. Its species is Abutilon viscosum, a specific plant within the genus Abutilon, known for its sticky leaves and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest",
        "Aruba",
        "Bahamas",
        "Bolivia",
        "Cayman Is.",
        "Colombia",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "Ecuador",
        "Galápagos",
        "Haiti",
        "Honduras",
        "Jamaica",
        "Leeward Is.",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Netherlands Antilles",
        "Nicaragua",
        "Panamá",
        "Paraguay",
        "Peru",
        "Puerto Rico",
        "Texas",
        "Trinidad-Tobago",
        "Turks-Caicos Is.",
        "Venezuela",
        "Venezuelan Antilles",
        "Windward Is."
    ],
    "distribution_introduced": [
        "French Guiana"
    ],
    "distribution_native_art_desc": "Abutilon viscosum is primarily native to Argentina Northwest, Aruba, Bahamas, Bolivia, Cayman Is., Colombia, Costa Rica, Cuba, Dominican Republic, Ecuador, Galápagos, Haiti, Honduras, Jamaica, Leeward Is., Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, Netherlands Antilles, Nicaragua, Panamá, Paraguay, Peru, Puerto Rico, Texas, Trinidad-Tobago, Turks-Caicos Is., Venezuela, Venezuelan Antilles, and Windward Is. This plant thrives in tropical and subtropical regions, often found in coastal areas and disturbed habitats. It is commonly associated with sandy soils and can be found in open woodlands, coastal dunes, and along roadsides. The species is well adapted to warm climates and is often used in ornamental gardening due to its attractive foliage. Its native range spans across much of the Americas, from the Caribbean to South America and parts of Central America.",
    "distribution_introduced_art_desc": "Abutilon viscosum was mainly introduced to French Guiana. It is a species native to the Americas but has been established in various regions outside its native range. In French Guiana, it is often found growing in disturbed habitats such as roadsides and open areas. The plant is known for its sticky leaves and showy flowers, which can make it a common sight in local ecosystems. Its introduction may have ecological implications due to its ability to thrive in diverse environments."
}
