{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon leiospermum",
    "plant_slug": "abutilon-leiospermum",
    "plant_name_scientific": "abutilon leiospermum",
    "intro": "Abutilon leiospermum, commonly known as velvetleaf abutilon, is a flowering plant native to Central and South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its velvety, hairy leaves. The plant produces clusters of small, yellowish-green flowers that bloom in the summer months. Its fruit is a capsule that splits open to release seeds, which are dispersed by wind. The species is often found in moist, tropical environments and is adapted to thrive in partial shade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon leiospermum is primarily native to South America, particularly in regions of Brazil, Paraguay, and Argentina. It is commonly found in tropical and subtropical areas, often growing in open woodlands, savannas, and along riverbanks. This plant thrives in moist, well-drained soils and is adapted to a variety of environmental conditions. It is known for its distinctive lantern-shaped flowers and is sometimes cultivated for ornamental purposes. Its native range includes parts of the Amazon Basin and the surrounding lowland areas.",
    "distribution_introduced_art_desc": "Abutilon leiospermum was mainly introduced to New Zealand, where it has become a problematic invasive species. It was initially brought there for ornamental purposes due to its attractive foliage and flowers. However, it has since spread aggressively, outcompeting native plants and altering local ecosystems. The plant thrives in a variety of habitats, including coastal areas and disturbed soils, which contributes to its invasive potential. Efforts are ongoing to control its spread and mitigate its environmental impact."
}
