{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon molle",
    "plant_slug": "abutilon-molle",
    "plant_name_scientific": "abutilon molle",
    "intro": "Abutilon molle, commonly known as velvetleaf, is a herbaceous plant native to the Americas. It is characterized by its soft, velvety leaves that give it its common name. The plant produces small, pale yellow flowers that are often clustered in racemes. It thrives in warm, humid climates and is often found in disturbed soils. Abutilon molle is also known for its fibrous stems, which have been used in traditional crafts and textiles.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon molle is primarily native to the southern United States, particularly Texas, New Mexico, and parts of Arizona. It is commonly found in dry, rocky areas and along the edges of deserts. This plant thrives in arid and semi-arid environments, often growing in limestone soils. It is also found in northern Mexico, including regions such as Chihuahua and Sonora. Abutilon molle is well adapted to withstand drought conditions and high temperatures.",
    "distribution_introduced_art_desc": "Abutilon molle was mainly introduced to the United States, particularly in the southern regions, as an ornamental plant due to its attractive foliage and showy flowers. It is commonly found in gardens and along roadsides in states such as Texas, Florida, and California. The plant is also known as the velvetleaf or Chinese lantern plant, and it has been naturalized in many areas where it can thrive in warm, humid climates. Its introduction has led to its spread in certain ecosystems, sometimes becoming invasive. Despite its ornamental value, it requires careful management to prevent it from outcompeting native vegetation."
}
