{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon glabriflorum",
    "plant_slug": "abutilon-glabriflorum",
    "plant_name_scientific": "abutilon glabriflorum",
    "intro": "Abutilon glabriflorum, commonly known as the woolly abutilon, is a flowering plant native to Mexico and parts of Central America. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its soft, hairy leaves and showy yellow flowers. The plant produces capsule fruits that contain numerous seeds, which are dispersed by wind. It thrives in tropical and subtropical climates, often found in coastal areas and disturbed soils. Its botanical features make it an ornamental plant valued for its unique appearance and adaptability.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon glabriflorum"
    },
    "taxonomy_art_desc": "Abutilon glabriflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in temperate regions. Its order is Malvales, which includes plants with flowers that have five petals and a distinctive type of stamen. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as hibiscus and cotton. Its genus is Abutilon, a group of flowering plants known for their ornamental value and often having silky or hairy leaves. Its species is Abutilon glabriflorum, a specific type of plant within the genus Abutilon that is characterized by its smooth flowers and is typically found in certain geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon glabriflorum is primarily native to Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Southeast, and Mexico Southwest. This species is commonly found in the wild in these regions, particularly in areas with warm and humid climates. It thrives in open habitats such as forests, grasslands, and along riverbanks. The plant is well adapted to the diverse ecosystems of these Mexican regions. Its native distribution highlights its ecological significance in the biodiversity of central and southern Mexico.",
    "distribution_introduced_art_desc": "Abutilon glabriflorum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-shaped flowers. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plants for cultivation. Despite its ornamental value, it has since become naturalized in some areas, spreading beyond cultivated gardens. The plant thrives in tropical and subtropical climates, often found in disturbed habitats such as roadsides and forest edges. Its introduction has raised concerns about its potential impact on native ecosystems."
}
