{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon theophrasti var. nigrum",
    "plant_slug": "abutilon-theophrasti-var-nigrum",
    "plant_name_scientific": "abutilon theophrasti var. nigrum",
    "intro": "Abutilon theophrasti var. nigrum, commonly known as black Indian hemp, is a variant of the common velvetleaf plant. It is a herbaceous annual that typically grows in tropical and subtropical regions. The plant features heart-shaped leaves with a velvety texture and produces small, inconspicuous green flowers. Its seeds are encased in a fibrous, woody capsule, which is characteristic of the Abutilon genus. This variety is known for its potential use in fiber production and as a source of natural materials.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon theophrasti var. nigrum is primarily native to the Americas, including parts of North and South America. It is commonly found in regions with temperate to warm climates, particularly in the United States, Mexico, and Central America. This variant is often associated with disturbed soils and can thrive in agricultural areas. It is also known to grow in semi-arid and coastal environments. The plant has been introduced to other parts of the world, including Europe and Asia, but its native range remains in the Americas.",
    "distribution_introduced_art_desc": "Abutilon theophrasti var. nigrum was mainly introduced to the United States as a potential source of fiber for industrial use. It was also cultivated in Europe and parts of Asia for its fibrous properties and ornamental value. The plant is considered an invasive species in some regions due to its rapid growth and ability to spread through seed dispersal. Its introduction has led to ecological concerns in areas where it competes with native vegetation. Despite its invasive tendencies, it remains an important species in certain agricultural and horticultural contexts."
}
