{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon durangense",
    "plant_slug": "abutilon-durangense",
    "plant_name_scientific": "abutilon durangense",
    "intro": "Abutilon durangense, commonly known as the Durango abutilon, is a flowering plant native to Mexico. It belongs to the Malvaceae family and is characterized by its hairy stems and heart-shaped leaves. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It thrives in warm, sunny environments and is often found in dry, rocky soils. Due to its ornamental value, it is sometimes cultivated in gardens despite its limited distribution in the wild.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon durangense is primarily native to Mexico, specifically the states of Durango and Chihuahua. It is found in the mountainous regions of these areas, particularly in the Sierra Madre Occidental and the Chihuahuan Desert. This plant typically grows in rocky soils and dry, open habitats. It is adapted to arid and semi-arid climates with low rainfall. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abutilon durangense was mainly introduced to the southern United States, particularly in Texas and New Mexico. It is commonly found in disturbed areas such as roadsides, fields, and along riverbanks. This plant thrives in dry to moderately moist soils and full sun exposure. Its introduction has been associated with human activities, including agriculture and land development. Due to its adaptability, it has become an invasive species in some regions, outcompeting native vegetation."
}
