{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon alii",
    "plant_slug": "abutilon-alii",
    "plant_name_scientific": "abutilon alii",
    "intro": "Abutilon alii, commonly known as the Chinese lantern plant, is a species of flowering plant in the mallow family. It is native to Southeast Asia and is characterized by its distinctive, lantern-shaped seed pods that turn red as they mature. The plant produces showy, fluffy yellow flowers that bloom in the spring. It is often cultivated as an ornamental plant for its vibrant foliage and unique fruiting structures. Abutilon alii thrives in warm, humid climates and prefers well-drained soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon alii"
    },
    "taxonomy_art_desc": "Abutilon alii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, a group of flowering plants that includes many species with showy flowers and a variety of growth forms. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton, hibiscus, and okra, characterized by their capsule fruits and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"Chinese lanterns\" or \"velvetleaf,\" which are typically shrubs or trees with hairy leaves and showy flowers. Its species is Abutilon alii, a specific plant within the genus Abutilon, known for its distinctive appearance and often cultivated as an ornamental plant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Pakistan"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon alii is primarily native to Pakistan. It is commonly found in the southern regions of the country, particularly in the Punjab and Sindh provinces. This plant thrives in tropical and subtropical climates, often growing in open fields and along roadsides. It is known for its attractive foliage and is sometimes cultivated for ornamental purposes. Its native distribution is limited to specific areas within Pakistan due to its particular habitat requirements.",
    "distribution_introduced_art_desc": "Abutilon alii was mainly introduced to tropical and subtropical regions for its ornamental value due to its unique foliage and flowering habits. It is commonly found in gardens and greenhouses in countries like Australia, the United States, and parts of Southeast Asia. The plant thrives in warm climates with high humidity and well-draining soil. Its introduction has sometimes led to concerns about its potential to become invasive in certain ecosystems. Despite its beauty, proper management is recommended to prevent unintended ecological impacts."
}
