{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon wissadifolium",
    "plant_slug": "abutilon-wissadifolium",
    "plant_name_scientific": "abutilon wissadifolium",
    "intro": "Abutilon wissadifolium, commonly known as the \"velvetleaf abutilon,\" is a flowering plant native to Brazil. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Its unique foliage and vibrant blooms make it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon wissadifolium is primarily native to Brazil. It is found in the states of Pará, Maranhão, and Piauí. This species grows in tropical and subtropical regions, often in moist, shaded areas. It is commonly associated with Atlantic Forest ecosystems. The plant is adapted to humid climates and thrives in well-drained soils.",
    "distribution_introduced_art_desc": "Abutilon wissadifolium was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in tropical and subtropical regions, particularly in parts of Central and South America. The plant thrives in full sun to partial shade and requires regular watering to maintain its lush appearance. It has been introduced to several regions outside its native range, including parts of the southern United States and the Caribbean. Due to its adaptability, it can sometimes become invasive in non-native environments if not properly managed."
}
