{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta duckei",
    "plant_slug": "abuta-duckei",
    "plant_name_scientific": "abuta duckei",
    "intro": "Abuta duckei, commonly known as the African buttercup, is a flowering plant native to tropical Africa. It belongs to the family Euphorbiaceae and is characterized by its striking yellow-orange flowers. The plant has palmate leaves with five to seven lobes, and it produces small, greenish fruits that contain seeds. Abuta duckei is often found in moist, shaded areas such as forests and along stream banks. Its botanical features make it a notable species in both ecological and horticultural contexts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta duckei is primarily native to the tropical rainforests of western Africa, particularly in countries such as Nigeria, Cameroon, and the Central African Republic. It thrives in humid, shaded environments within these regions. The plant is commonly found in the undergrowth of dense forest areas, where it benefits from the high levels of moisture and organic matter in the soil. It is often associated with secondary growth forests and is not typically found in open or disturbed habitats. Due to its restricted range, it is considered a relatively rare and localized species within its native region.",
    "distribution_introduced_art_desc": "Abuta duckei was mainly introduced to regions with warm, humid climates that support its growth. It thrives in well-drained soils and is often found in disturbed habitats such as roadsides and clearings. This plant is commonly spread through seeds dispersed by wind, water, and animals. It has been reported in several countries in Southeast Asia and parts of Africa. Its introduction has raised concerns due to its potential to become an invasive species in non-native environments."
}
