{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon substellatum",
    "plant_slug": "abutilon-substellatum",
    "plant_name_scientific": "abutilon substellatum",
    "intro": "Abutilon substellatum, commonly known as the starleaf abutilon, is a shrub native to South America. It features palmately lobed leaves that are often covered in fine hairs, giving them a soft, fuzzy appearance. The plant produces small, yellowish-green flowers that are clustered in racemes, which bloom in the spring. Its fruit is a capsule that splits open to release small, hairy seeds. Abutilon substellatum is often cultivated for its ornamental value and adaptability to various soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon substellatum"
    },
    "taxonomy_art_desc": "Abutilon substellatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with diverse morphological features. Its order is Malvales, a group of flowering plants that includes families such as Malvaceae, which are known for their showy flowers and cotton-like fibers. Its family is Malvaceae, commonly known as the mallow family, which includes plants with a wide range of morphologies and ecological adaptations. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon substellatum, a specific type of Abutilon known for its distinctive star-shaped flowers and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Thailand"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon substellatum is primarily native to Thailand. This species is commonly found in the tropical and subtropical regions of the country. It thrives in areas with high humidity and well-drained soil. The plant is often seen growing in open woodlands and along riverbanks. Its native distribution is largely confined to specific ecological zones within Thailand.",
    "distribution_introduced_art_desc": "Abutilon substellatum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-like flowers. It was likely brought there during the 19th or early 20th century by horticulturists and gardeners seeking exotic plant species for cultivation. The plant has since become naturalized in some areas, spreading through both seed dispersal and vegetative propagation. It thrives in coastal and disturbed habitats, often along roadsides and in open forests. However, its introduction has raised concerns about its potential impact on native plant communities."
}
