{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta oblongifolia",
    "plant_slug": "abuta-oblongifolia",
    "plant_name_scientific": "abuta oblongifolia",
    "intro": "Abuta oblongifolia, commonly known as the African butter bean, is a flowering plant native to tropical regions of Africa. It belongs to the family Euphorbiaceae and is characterized by its woody shrub structure. The plant produces small, yellowish flowers that are clustered in inflorescences, and its leaves are alternate, simple, and ovate in shape. Abuta oblongifolia is known for its medicinal properties, with various parts of the plant used in traditional medicine. It thrives in well-drained soils and is often found in dry to semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta oblongifolia is primarily native to the tropical regions of Africa, particularly in countries such as Nigeria, Ghana, and Cameroon. It thrives in humid, lowland forests and is commonly found in the understory of these ecosystems. The plant is also present in parts of western and central Africa, including the Democratic Republic of the Congo and Uganda. It prefers well-drained soils and is often associated with secondary growth areas. Due to its medicinal properties, it has been traditionally used by local communities for various health purposes.",
    "distribution_introduced_art_desc": "Abuta oblongifolia was mainly introduced to regions with warm, humid climates and well-drained soils, where it thrives in full sun to partial shade. It is commonly found in tropical and subtropical areas, including parts of Southeast Asia, the Pacific Islands, and some regions of the Americas. This plant is often cultivated for its ornamental value due to its striking flowers and attractive foliage. It prefers moderate to high levels of sunlight and requires regular watering to maintain its health and vigor. Its introduction has been primarily for horticultural purposes, though it has also been used in traditional medicine in some cultures."
}
