{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hernandioides",
    "plant_slug": "abutilon-hernandioides",
    "plant_name_scientific": "abutilon hernandioides",
    "intro": "Abutilon hernandioides, commonly known as the woolly abutilon, is a flowering plant native to Central and South America. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant produces yellow to orange flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. Its leaves are typically heart-shaped and covered in fine hairs, giving it a distinctive, velvety appearance. Abutilon hernandioides is often cultivated for its ornamental value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hernandioides is primarily native to Central America, including countries such as Mexico, Guatemala, Belize, and Honduras. It is also found in parts of South America, particularly in northern regions like Colombia and Ecuador. This plant typically grows in tropical and subtropical areas, often in disturbed habitats such as roadsides, forests edges, and dry shrublands. It thrives in well-drained soils and is commonly found at low to moderate elevations. Its distribution is largely confined to the Neotropical region, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon hernandioides was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-shaped flowers. It has since become naturalized in several areas, spreading through both wind and water dispersal mechanisms. The plant thrives in coastal and disturbed habitats, often colonizing open areas with sandy or rocky soils. Its rapid growth and ability to form dense stands have led to concerns about its impact on native plant communities. Despite its invasive tendencies, it remains popular in horticulture for its aesthetic value."
}
