{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon longicuspe var. epilosum",
    "plant_slug": "abutilon-longicuspe-var-epilosum",
    "plant_name_scientific": "abutilon longicuspe var. epilosum",
    "intro": "Abutilon longicuspe var. epilosum, commonly known as the silky abutilon, is a shrub native to South America, particularly Brazil. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped yellow flowers that bloom in the spring. The plant has a woody stem with a corky texture, and its leaves are ovate with a hairy underside. It thrives in warm, humid climates and is often cultivated as an ornamental plant for its aesthetic appeal. The species is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon longicuspe var. epilosum is primarily native to the tropical regions of South America, particularly Brazil. It is found in the Atlantic Forest biome, which spans the eastern coast of Brazil. This plant thrives in humid, shaded environments within the understory of dense tropical rainforests. It is commonly associated with areas that have high rainfall and fertile, well-drained soils. Due to habitat loss, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Abutilon longicuspe var. epilosum was mainly introduced to the coastal regions of southern California and Baja California. It is commonly found in disturbed areas such as roadsides, gravelly soils, and sandy beaches. This plant thrives in sunny, well-drained environments and is often associated with maritime climates. Its introduction has led to its establishment in native plant communities, sometimes competing with local flora. It is considered a non-native invasive species in some areas, requiring management to prevent its spread."
}
