{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon eremitopetalum",
    "plant_slug": "abutilon-eremitopetalum",
    "plant_name_scientific": "abutilon eremitopetalum",
    "intro": "Abutilon eremitopetalum, commonly known as the desert hibiscus, is a flowering plant native to arid regions of the southwestern United States and northern Mexico. It is characterized by its hairy, glandular stems and leaves that are typically ovate to lanceolate in shape. The plant produces showy, yellow to orange flowers that bloom in late spring to early summer. Its fibrous, woody root system helps it survive in dry, sandy soils. Abutilon eremitopetalum is often found in desert scrub and rocky habitats, where it thrives with minimal water.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon eremitopetalum"
    },
    "taxonomy_art_desc": "Abutilon eremitopetalum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, characterized by their showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a variety of ecological and economic significance. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their showy, lantern-shaped flowers and hairy leaves. Its species is Abutilon eremitopetalum, a specific type of plant within the genus Abutilon, distinguished by its unique floral and morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Hawaii"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon eremitopetalum is primarily native to Hawaii. This plant is found in the Hawaiian Islands, where it grows in specific ecological niches. It is commonly associated with dry, coastal habitats and rocky areas. Due to its limited distribution, it is considered a rare and endemic species. Conservation efforts are often necessary to protect its natural habitat.",
    "distribution_introduced_art_desc": "Abutilon eremitopetalum was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. The plant is often considered an invasive species due to its rapid growth and ability to spread through seed dispersal. It is also used in local horticulture for its ornamental value, particularly its showy yellow flowers. However, its spread has raised concerns among conservationists due to its potential impact on native vegetation."
}
