{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon rufescens",
    "plant_slug": "abutilon-rufescens",
    "plant_name_scientific": "abutilon rufescens",
    "intro": "Abutilon rufescens, commonly known as the red abutilon, is a flowering plant native to the southern United States and parts of Mexico. It is a shrub or small tree that typically grows to a height of 3 to 6 meters. The plant features heart-shaped leaves with a soft, fuzzy texture and produces clusters of small, yellowish-green flowers. It thrives in well-drained soil and full sun, making it suitable for cultivation in warm climates. The plant is also valued for its ornamental qualities and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon rufescens is primarily native to Central America, the Caribbean, and northern South America. It is commonly found in countries such as Mexico, Guatemala, Belize, Honduras, and parts of Colombia. This plant thrives in tropical and subtropical regions, often growing in dry to moist forests and along riverbanks. It is well adapted to warm climates and can tolerate a variety of soil types. Its natural range extends into the southern United States, particularly in Texas and Florida.",
    "distribution_introduced_art_desc": "Abutilon rufescens was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and along riverbanks. It thrives in temperate to subtropical climates and is often found in regions with moderate rainfall. This plant is commonly spread through seeds dispersed by wind, water, or human activity. Its rapid growth and adaptability make it an invasive species in many regions outside its native range. It is often considered a weed in agricultural and natural ecosystems."
}
