{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon periplocifolium var. peruvianum",
    "plant_slug": "abutilon-periplocifolium-var-peruvianum",
    "plant_name_scientific": "abutilon periplocifolium var. peruvianum",
    "intro": "Abutilon periplocifolium var. peruvianum, commonly known as the Peruvian Abutilon, is a flowering plant native to South America. It is characterized by its hairy, glandular stems and heart-shaped leaves that are often lobed. The plant produces clusters of small, yellowish flowers that bloom in the summer months. It thrives in warm, humid climates and is often found in tropical and subtropical regions. Its ornamental value makes it a popular choice for gardens and as a houseplant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon periplocifolium var. peruvianum is primarily native to the Andean regions of South America, particularly in Peru and Ecuador. This plant is commonly found in high-altitude grasslands and rocky slopes within these areas. It thrives in temperate climates with well-drained soils and moderate rainfall. The species is adapted to the unique environmental conditions of the Andes, including cooler temperatures and strong sunlight. Due to its restricted habitat, it is considered a rare and localized plant in its native range.",
    "distribution_introduced_art_desc": "Abutilon periplocifolium var. peruvianum was mainly introduced to the Pacific Northwest of the United States. It was brought in during the late 19th century as part of early botanical collections and ornamental plant introductions. The plant thrives in moist, well-drained soils and is often found near streams and wetlands. It has since naturalized in certain areas, becoming a common sight in riparian zones. Despite its ornamental value, it is considered a potential invasive species in some regions."
}
