{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon bedfordianum var. discolor",
    "plant_slug": "abutilon-bedfordianum-var-discolor",
    "plant_name_scientific": "abutilon bedfordianum var. discolor",
    "intro": "Abutilon bedfordianum var. discolor, commonly known as the velvetleaf abutilon, is a perennial shrub native to the southern United States. It is characterized by its fuzzy, velvety leaves that are typically a deep green with a silvery underside. The plant produces showy, lantern-shaped flowers in shades of yellow, orange, and red, which bloom in late spring to early summer. It thrives in full sun to partial shade and prefers well-drained soil. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon bedfordianum var. discolor is primarily native to the southeastern United States, particularly Florida and parts of Georgia. It thrives in coastal areas and is commonly found in sandy soils along the Atlantic and Gulf coasts. This plant is well adapted to humid, warm climates and often grows in disturbed or open habitats. It is also known to occur in the Caribbean, including the Bahamas and Cuba. Its native range extends into parts of Central America, where it is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Abutilon bedfordianum var. discolor was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive, fuzzy leaves and showy flowers. The distribution of this species has been limited to specific regions within New Zealand, primarily in the North Island. It is often found in disturbed habitats such as roadsides and waste areas. Despite its ornamental value, it is not considered a major invasive species in the region."
}
