{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon malirianum",
    "plant_slug": "abutilon-malirianum",
    "plant_name_scientific": "abutilon malirianum",
    "intro": "Abutilon malirianum, commonly known as the Malian velvetleaf, is a flowering plant native to tropical regions of Africa. It belongs to the Malvaceae family, which includes cotton and hibiscus, and is characterized by its soft, fuzzy foliage. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It thrives in warm, humid climates and is often found in wetlands or along riverbanks. Its rapid growth and adaptability make it both a valuable ornamental plant and a potential weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon malirianum is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in humid climates and is often associated with disturbed habitats like forest edges and agricultural lands. It is also present in parts of the Indian subcontinent, including India and Sri Lanka. Due to its adaptability, it has been introduced to other tropical regions around the world.",
    "distribution_introduced_art_desc": "Abutilon malirianum was mainly introduced to control erosion and stabilize soil in degraded areas. It is commonly used in reclamation projects due to its rapid growth and ability to thrive in poor soil conditions. This plant has been introduced in several tropical and subtropical regions for its ecological benefits. However, it can become invasive in some environments if not managed properly. Its introduction has had both positive and negative impacts on local ecosystems."
}
