{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon crassinervium",
    "plant_slug": "abutilon-crassinervium",
    "plant_name_scientific": "abutilon crassinervium",
    "intro": "Abutilon crassinervium, commonly known as the broad-veined abutilon, is a flowering plant native to tropical regions of South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its rough, hairy stems and lobed leaves with prominent veins. The plant produces showy, lantern-shaped yellow flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. Its fruit is a capsule that splits open to release small, hairy seeds, aiding in wind dispersal. Abutilon crassinervium is valued for its ornamental qualities and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon crassinervium is primarily native to the tropical and subtropical regions of South America, particularly Brazil, Colombia, and Peru. It thrives in humid, shaded environments within the undergrowth of rainforests. This plant is commonly found in areas with high rainfall and well-drained soils. It is often associated with secondary growth forests and disturbed habitats. Its distribution is limited to specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Abutilon crassinervium was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through accidental means, such as being carried in soil or on plant material. The plant thrives in disturbed areas and can outcompete native vegetation. It is now found in various habitats across the Hawaiian Islands. Due to its aggressive growth, it poses a threat to local ecosystems and requires ongoing management efforts."
}
