{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon eetveldeanum",
    "plant_slug": "abutilon-eetveldeanum",
    "plant_name_scientific": "abutilon eetveldeanum",
    "intro": "Abutilon eetveldeanum, commonly known as the Eetvelde's abutilon, is a species of flowering plant in the mallow family. It is characterized by its hairy, ovate leaves and showy, lantern-shaped flowers that typically bloom in shades of yellow or orange. The plant is native to South America, particularly Brazil, and thrives in warm, humid climates. It is often cultivated as an ornamental plant due to its attractive foliage and long-lasting blooms. Abutilon eetveldeanum prefers well-drained soil and full sun to partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon eetveldeanum is primarily native to the tropical regions of South America, particularly Brazil. It is found in the Amazon rainforest and surrounding areas, where it thrives in humid and warm climates. This species is commonly associated with moist lowland forests and riverine habitats. It is also occasionally found in parts of Central America. Due to its restricted range, it is considered a rare and endemic plant in its native habitat.",
    "distribution_introduced_art_desc": "Abutilon eetveldeanum was mainly introduced to South Africa. It is commonly found in the Western Cape region, where it thrives in coastal and sandy soils. The plant was introduced as an ornamental species due to its attractive foliage and flowering habits. It has since become naturalized in certain areas, posing a potential threat to local biodiversity. Its distribution is primarily limited to the western parts of the country, though it may spread further under favorable conditions."
}
