{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon benense",
    "plant_slug": "abutilon-benense",
    "plant_name_scientific": "abutilon benense",
    "intro": "Abutilon benense, commonly known as the Brazilian velvetleaf, is a tropical plant native to South America. It is characterized by its broad, heart-shaped leaves that are often covered in fine, soft hairs. The plant produces clusters of small, yellowish-green flowers that bloom in the spring and summer. Its fibrous roots and hairy stems make it a distinctive member of the Malvaceae family. Abutilon benense is often found in moist, shaded environments such as forests and along riverbanks.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Pseudabutilon",
        "species": "Pseudabutilon benense"
    },
    "taxonomy_art_desc": "Abutilon benense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails, and is known for having vascular tissues. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Malvales, a group of flowering plants that includes plants like cotton and hibiscus, and is characterized by certain floral and leaf structures. Its family is Malvaceae, commonly known as the mallow family, which includes a wide range of plants with showy flowers and often hairy leaves. Its genus is Pseudabutilon, a group of flowering plants that are closely related to the genus Abutilon and are typically shrubs or trees. Its species is Pseudabutilon benense, a specific type within the genus Pseudabutilon, which is native to certain regions of South America and is characterized by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil West-Central",
        "Paraguay",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon benense is primarily native to Bolivia, Brazil West-Central, Paraguay, and Venezuela. This species is commonly found in tropical and subtropical regions within these countries. It typically grows in open areas, such as savannas and disturbed soils. The plant is well adapted to the warm and humid climates of its native range. It plays an important role in local ecosystems and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Abutilon benense was mainly introduced to regions with warm, humid climates where it can thrive in full sun to partial shade. It is commonly found in tropical and subtropical areas, particularly in parts of South America, Africa, and Southeast Asia. This plant is often cultivated for its ornamental value due to its attractive, velvety leaves and showy flowers. It prefers well-drained soil and can tolerate a range of soil types as long as they are not waterlogged. Due to its adaptability, it has been introduced to various regions outside its native range for horticultural purposes."
}
