{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon subviscosum",
    "plant_slug": "abutilon-subviscosum",
    "plant_name_scientific": "abutilon subviscosum",
    "intro": "Abutilon subviscosum, commonly known as the sticky abutilon, is a shrub native to South America. It is characterized by its hairy, glandular stems and leaves that often have a sticky texture. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange. It thrives in warm, humid climates and is often found in coastal areas. Its botanical features make it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon subviscosum"
    },
    "taxonomy_art_desc": "Abutilon subviscosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and a wide variety of flower structures. Its order is Malvales, a group of flowering plants that includes many economically important species such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their glandular hairs and showy flowers. Its species is Abutilon subviscosum, a specific type of Abutilon with subviscous (slightly sticky) hairs and is typically found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon subviscosum is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This plant typically grows in coastal and lowland areas. It thrives in sandy or rocky soils along the coastline. Its distribution is largely restricted to the northern and eastern parts of Queensland.",
    "distribution_introduced_art_desc": "Abutilon subviscosum was mainly introduced to control erosion and stabilize soils in disturbed areas. It is commonly found in coastal and sandy environments where its fibrous root system helps prevent soil degradation. The plant's rapid growth and ability to thrive in poor soil conditions make it a popular choice for land rehabilitation projects. However, its invasive potential has led to concerns about its spread into native ecosystems. Despite its benefits, careful management is required to prevent it from becoming a nuisance in natural habitats."
}
