{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon saltense",
    "plant_slug": "abutilon-saltense",
    "plant_name_scientific": "abutilon saltense",
    "intro": "Abutilon saltense, commonly known as the saltbush abutilon, is a shrub native to arid and semi-arid regions of the southwestern United States and northern Mexico. It is characterized by its hairy, gray-green leaves that help reduce water loss in hot, dry environments. The plant produces small, yellowish flowers that bloom in clusters, typically during the spring and early summer. Its fibrous roots make it drought-tolerant and suitable for erosion control in degraded soils. Abutilon saltense is also valued for its ornamental appeal and ability to thrive in challenging landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon saltense is primarily native to the coastal regions of South America, particularly in Argentina and Chile. It thrives in sandy or rocky soils along the coastline, where it is exposed to salt spray and strong winds. This plant is commonly found in the Patagonian region, where it adapts well to the harsh maritime climate. It is also occasionally reported in parts of Uruguay and southern Brazil. Due to its unique habitat, it is considered a rare and endemic species in these areas.",
    "distribution_introduced_art_desc": "Abutilon saltense was mainly introduced to areas with warm, humid climates and well-drained soils, typically in tropical and subtropical regions. It is often found in coastal areas, disturbed sites, and along roadsides where it can thrive in full sun to partial shade. This plant is known for its distinctive, lantern-shaped flowers and is commonly used in ornamental gardening. It has been introduced to several countries in the Americas, including parts of the Caribbean and South America. Due to its adaptability, it can sometimes become invasive in non-native environments."
}
