{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon endlichii",
    "plant_slug": "abutilon-endlichii",
    "plant_name_scientific": "abutilon endlichii",
    "intro": "Abutilon endlichii, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions of the Americas. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its hairy, velvety stems and leaves. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. Its leaves are heart-shaped and have a soft, fuzzy texture, contributing to its ornamental appeal. Abutilon endlichii is often cultivated for its aesthetic value in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon endlichii is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It is commonly found in savanna and woodland habitats, often growing along riverbanks and in areas with well-drained soils. This species thrives in warm climates with moderate to high rainfall, and it is often seen in open vegetation types. It is also occasionally found in parts of southern Arabia and the Indian subcontinent. The plant is known for its soft, hairy leaves and showy flowers, which attract various pollinators.",
    "distribution_introduced_art_desc": "Abutilon endlichii was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its unique appearance and adaptability. It was first brought there in the 19th century by early botanists and horticulturists who were interested in introducing exotic flora. The plant thrives in tropical and subtropical climates, which makes it well-suited for the warm and humid conditions of these regions. Over time, it has become naturalized in some areas, leading to concerns about its potential impact on native ecosystems. Its introduction has contributed to the diversity of ornamental plants in these regions but also raises questions about ecological management."
}
