{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fraseri subsp. diplotrichum",
    "plant_slug": "abutilon-fraseri-subsp-diplotrichum",
    "plant_name_scientific": "abutilon fraseri subsp. diplotrichum",
    "intro": "Abutilon fraseri subsp. diplotrichum, commonly known as the Fraser's abutilon, is a shrub native to eastern Australia. It is characterized by its hairy, glandular leaves and showy, lantern-shaped yellow flowers that bloom in spring. The plant typically grows in coastal heathlands and sandy soils, preferring full sun to partial shade. Its fibrous roots and branching structure make it adaptable to various soil conditions. It is valued for its ornamental appeal and ecological benefits to local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon fraseri"
    },
    "taxonomy_art_desc": "Abutilon fraseri subsp. diplotrichum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and includes families such as Malvaceae, Theaceae, and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with palmate leaves and fibrous or hairy stems. Its genus is Abutilon, a group of flowering plants known for their distinctive, lantern-shaped flowers and often used in ornamental horticulture. Its species is Abutilon fraseri, a plant that is further divided into subspecies, with subsp. diplotrichum being a specific variant characterized by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon fraseri subsp. diplotrichum is primarily native to Victoria. This subspecies is found in the coastal regions of Victoria, Australia. It thrives in sandy soils along the shoreline. It is commonly observed in areas with moderate rainfall and coastal climates. The plant is well adapted to the unique environmental conditions of the Victorian coastline.",
    "distribution_introduced_art_desc": "Abutilon fraseri subsp. diplotrichum was mainly introduced to areas with warm, humid climates and well-drained soils, typically in coastal or lowland regions. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant thrives in full sun to partial shade and is often seen in tropical and subtropical environments. Its rapid growth and ability to spread through both seeds and vegetative propagation contribute to its invasive potential in new areas. It is considered a problematic weed in some regions due to its competitive nature and persistence."
}
