{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta cuspidata var. ovalifolia",
    "plant_slug": "abuta-cuspidata-var-ovalifolia",
    "plant_name_scientific": "abuta cuspidata var. ovalifolia",
    "intro": "Abuta cuspidata var. ovalifolia, commonly known as the ovalleaf abuta, is a species native to the Andean regions of South America. It is a climbing shrub characterized by its thick, fleshy stems and heart-shaped leaves. The plant produces clusters of small, yellowish flowers followed by orange or red berries. Its leaves are typically oval or ovate, giving it its varietal name. It is valued for its ornamental appeal and is often grown in shaded garden environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta cuspidata var. ovalifolia is primarily native to the tropical regions of Southeast Asia, particularly Indonesia and the Philippines. This plant is commonly found in lowland rainforests and secondary growth areas. It thrives in humid, shaded environments with well-drained soil. The species is also occasionally reported in parts of Malaysia and Papua New Guinea. Due to its restricted habitat, it is considered a rare and localized species in its native range.",
    "distribution_introduced_art_desc": "Abuta cuspidata var. ovalifolia was mainly introduced to the western United States, particularly in regions with temperate climates. It is commonly found in areas with well-drained soils and partial to full sun exposure. This plant is often cultivated for its ornamental value due to its attractive foliage and unique flowering structure. It has been introduced to gardens and parks as a decorative plant in USDA hardiness zones 6 through 9. However, it is important to monitor its spread to prevent potential ecological impacts in native habitats."
}
