{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon ramiflorum",
    "plant_slug": "abutilon-ramiflorum",
    "plant_name_scientific": "abutilon ramiflorum",
    "intro": "Abutilon ramiflorum, commonly known as the ramiflorum abutilon, is a flowering plant native to South America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its hairy, glandular stems and heart-shaped leaves. Its flowers are typically yellow or orange, with five petals and a prominent central stamen. It thrives in moist, well-drained soils and is often found in forested or coastal areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon ramiflorum"
    },
    "taxonomy_art_desc": "Abutilon ramiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and often fibrous tissues. Its family is Malvaceae, commonly known as the mallow family, which includes plants with palmate leaves and capsule fruits. Its genus is Abutilon, a group of flowering plants commonly known as the velvetleaf or Chinese lantern, characterized by their woolly leaves and showy flowers. Its species is Abutilon ramiflorum, a specific type of plant within the genus Abutilon, distinguished by its branching inflorescences and is native to certain regions of South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia",
        "Brazil Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Brazil West-Central",
        "Paraguay",
        "Peru",
        "Uruguay"
    ],
    "distribution_introduced": [
        "Venezuela"
    ],
    "distribution_native_art_desc": "Abutilon ramiflorum is primarily native to Argentina Northeast, Argentina Northwest, Bolivia, Brazil Northeast, Brazil South, Brazil Southeast, Brazil West-Central, Paraguay, Peru, and Uruguay. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in moist, well-drained soils and is often found in open woodlands or along riverbanks. The species is known for its distinctive foliage and showy flowers, which contribute to its ecological and ornamental value. Its native range spans much of South America, particularly in the eastern and southern regions.",
    "distribution_introduced_art_desc": "Abutilon ramiflorum was mainly introduced to Venezuela. It is a species native to South America, but its introduction to Venezuela has led to its establishment in certain regions. The plant is commonly found in disturbed habitats such as roadsides and open areas. Its spread is likely due to human activities and its ability to thrive in a variety of soil conditions. However, it is not considered invasive in Venezuela and is primarily found in specific ecological niches."
}
