{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sparmannioides",
    "plant_slug": "abutilon-sparmannioides",
    "plant_name_scientific": "abutilon sparmannioides",
    "intro": "Abutilon sparmannioides, commonly known as the woolly abutilon, is a flowering plant belonging to the Malvaceae family. It is native to South America, particularly Brazil, and is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its flowers are usually yellow or orange, and it blooms during the spring and summer seasons. Abutilon sparmannioides is often cultivated for ornamental purposes due to its attractive foliage and vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sparmannioides is primarily native to southern Africa, specifically South Africa. It is found in the Eastern Cape and Western Cape provinces. This plant typically grows in coastal areas and is adapted to sandy or rocky soils. It thrives in regions with a Mediterranean climate, characterized by dry summers and wet winters. Abutilon sparmannioides is commonly found in fynbos vegetation, which is a unique biome in South Africa.",
    "distribution_introduced_art_desc": "Abutilon sparmannioides was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering habits. The species has since become naturalized in certain regions, particularly in the North Island. It thrives in a variety of soil types and is commonly found in disturbed areas such as roadsides and forest margins. However, its spread has raised concerns due to its potential to become invasive in native ecosystems."
}
