{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta imene",
    "plant_slug": "abuta-imene",
    "plant_name_scientific": "abuta imene",
    "intro": "Abuta imene, commonly known as the African butterbean, is a flowering plant native to tropical regions of Africa. It belongs to the family Malvaceae and is characterized by its distinctive yellow flowers and capsule-like fruits. The plant typically grows as an erect shrub, reaching heights of up to 2 meters. Its leaves are palmately lobed, and it produces edible seeds that are used in local cuisines. The botanical features of Abuta imene make it an important species in both ecological and agricultural contexts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta imene"
    },
    "taxonomy_art_desc": "Abuta imene belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes green algae and land plants, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group of vascular plants that includes ferns and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Ranunculales, which consists of flowering plants with diverse forms, often including showy flowers and sometimes toxic compounds. Its family is Menispermaceae, commonly known as the pipevine family, which includes woody vines and shrubs, many of which contain alkaloids. Its genus is Abuta, a group of flowering plants native to tropical regions, known for their medicinal properties and unique fruit structures. Its species is Abuta imene, a specific plant within the genus Abuta, characterized by its distinct morphology and potential ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Brazil West-Central",
        "Colombia",
        "Ecuador",
        "French Guiana",
        "Guyana",
        "Peru",
        "Suriname",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta imene is primarily native to Bolivia, Brazil North, Brazil West-Central, Colombia, Ecuador, French Guiana, Guyana, Peru, Suriname, and Venezuela. It is found in the tropical regions of South America, particularly in the Amazon Basin and surrounding areas. This plant thrives in humid, lowland environments with rich soil. It is commonly found in forests and along riverbanks. Its native distribution spans several countries across the continent.",
    "distribution_introduced_art_desc": "Abuta imene was mainly introduced to the region of Southeast Asia, particularly in countries like Indonesia and the Philippines. It is commonly found in lowland and mountainous areas with moist, well-drained soils. The plant is often cultivated for its ornamental value due to its striking yellow flowers. It is also used in traditional medicine for its purported health benefits. However, its introduction has raised concerns about its potential impact on local ecosystems."
}
