{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hirtum",
    "plant_slug": "abutilon-hirtum",
    "plant_name_scientific": "abutilon hirtum",
    "intro": "Abutilon hirtum, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to the Americas. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its fuzzy, hairy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in late spring to early summer. Its leaves are typically heart-shaped and covered in fine, soft hairs, giving it a distinctive velvety texture. Abutilon hirtum is often cultivated for its ornamental value and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon hirtum"
    },
    "taxonomy_art_desc": "Abutilon hirtum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails and some mosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Malvales, a group of flowering plants that includes cotton, hibiscus, and okra. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants. Its species is Abutilon hirtum, a specific type of plant within the genus Abutilon, characterized by its hairy leaves and showy, lantern-shaped flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Bangladesh",
        "Botswana",
        "Burundi",
        "Cameroon",
        "Caprivi Strip",
        "Chad",
        "China South-Central",
        "Djibouti",
        "DR Congo",
        "Eritrea",
        "Ethiopia",
        "India",
        "Iran",
        "Kenya",
        "Mozambique",
        "Namibia",
        "Niger",
        "Nigeria",
        "Northern Provinces",
        "Oman",
        "Pakistan",
        "Palestine",
        "Rwanda",
        "Saudi Arabia",
        "Somalia",
        "Sri Lanka",
        "Sudan-South Sudan",
        "Tanzania",
        "Thailand",
        "Uganda",
        "Vietnam",
        "Yemen",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Aruba",
        "Bahamas",
        "Belize",
        "Colombia",
        "Costa Rica",
        "Cuba",
        "Dominican Republic",
        "El Salvador",
        "Florida",
        "Guatemala",
        "Haiti",
        "Honduras",
        "Jamaica",
        "Leeward Is.",
        "Marquesas",
        "Mauritius",
        "Netherlands Antilles",
        "New Caledonia",
        "Nicaragua",
        "Panamá",
        "Peru",
        "Puerto Rico",
        "Rodrigues",
        "Réunion",
        "Taiwan",
        "Trinidad-Tobago",
        "Turks-Caicos Is.",
        "Venezuela",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abutilon hirtum is primarily native to Angola, Bangladesh, Botswana, Burundi, Cameroon, Caprivi Strip, Chad, China South-Central, Djibouti, DR Congo, Eritrea, Ethiopia, India, Iran, Kenya, Mozambique, Namibia, Niger, Nigeria, Northern Provinces, Oman, Pakistan, Palestine, Rwanda, Saudi Arabia, Somalia, Sri Lanka, Sudan-South Sudan, Tanzania, Thailand, Uganda, Vietnam, Yemen, and Zimbabwe. It is commonly found in tropical and subtropical regions, often growing in open woodlands, grasslands, and along riverbanks. The plant thrives in areas with well-drained soils and a warm climate. It is known for its hairy leaves and showy flowers, which attract pollinators. Abutilon hirtum has been used in traditional medicine and for ornamental purposes in various parts of its native range.",
    "distribution_introduced_art_desc": "Abutilon hirtum was mainly introduced to the Caribbean islands, Central America, and parts of South America, including Aruba, Bahamas, Belize, Colombia, Costa Rica, Cuba, Dominican Republic, El Salvador, Florida, Guatemala, Haiti, Honduras, Jamaica, Leeward Is., Marquesas, Mauritius, Netherlands Antilles, New Caledonia, Nicaragua, Panamá, Peru, Puerto Rico, Rodrigues, Réunion, Taiwan, Trinidad-Tobago, Turks-Caicos Is., Venezuela, and Windward Is. It has been widely distributed across these regions, often as an ornamental plant or for its fibrous bark. The plant's adaptability to various climates has contributed to its successful introduction and establishment in these areas. It is commonly found in coastal regions and disturbed habitats. Its presence in these locations highlights its role as an invasive or naturalized species in many of these regions."
}
