{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon grandiflorum var. iringense",
    "plant_slug": "abutilon-grandiflorum-var-iringense",
    "plant_name_scientific": "abutilon grandiflorum var. iringense",
    "intro": "Abutilon grandiflorum var. iringense, commonly known as the Iringa abutilon, is a shrub native to eastern Africa. It is characterized by its soft, hairy leaves and showy, lantern-shaped yellow flowers that bloom in clusters. The plant typically grows in moist, well-drained soils and thrives in full sun to partial shade. It is often found in forest margins and along stream banks, contributing to local biodiversity. Its ornamental value makes it a popular choice for gardens and landscaping in suitable climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon grandiflorum"
    },
    "taxonomy_art_desc": "Abutilon grandiflorum var. iringense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which includes vascular plants with a wide range of forms, from ferns to flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and okra, characterized by their capsule fruits and often hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as the \"Chinese lantern\" plants, known for their fuzzy leaves and showy flowers. Its species is Abutilon grandiflorum, a specific type of Abutilon that is known for its large, showy flowers and is often cultivated for ornamental purposes.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon grandiflorum var. iringense is primarily native to Tanzania. This variant of the species is found in the eastern and southern regions of the country. It typically grows in coastal areas and lowland forests. The plant is adapted to the tropical climate of Tanzania. It is often seen in natural habitats such as riverine forests and coastal vegetation.",
    "distribution_introduced_art_desc": "Abutilon grandiflorum var. iringense was mainly introduced to the coastal regions of eastern Brazil, where it thrives in humid, tropical climates. It is commonly found in areas with well-drained sandy soils and receives ample sunlight. This variety is often cultivated for its ornamental value due to its attractive, palmate leaves and showy yellow flowers. It has been introduced to several regions beyond its native range, including parts of Southeast Asia and the Caribbean. However, its spread is generally limited to areas with similar environmental conditions to its natural habitat."
}
