{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon straminicarpum",
    "plant_slug": "abutilon-straminicarpum",
    "plant_name_scientific": "abutilon straminicarpum",
    "intro": "Abutilon straminicarpum, commonly known as the Indian mallow or velvetleaf, is a flowering plant native to tropical and subtropical regions. It is a shrub or small tree that typically grows to a height of 1 to 3 meters. The plant features palmate leaves with five to seven lobes, and its flowers are usually yellow or orange with five petals. The fruit is a capsule that splits open to release small, hairy seeds. It thrives in well-drained soils and is often found in disturbed areas or along roadsides.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon straminicarpum is primarily native to Mexico Central. It is found in regions of central Mexico, including parts of the states such as Hidalgo, Puebla, and Tlaxcala. This plant typically grows in tropical and subtropical climates, often in areas with well-drained soils. It is commonly associated with disturbed habitats and can be found in open woodlands and along riverbanks. Its native distribution is limited to specific ecological zones within Mexico Central.",
    "distribution_introduced_art_desc": "Abutilon straminicarpum was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its ornamental value due to its attractive foliage and flowers. However, it has since spread rapidly, outcompeting native vegetation in certain areas. The plant thrives in disturbed habitats and can form dense stands that alter local ecosystems. Efforts are ongoing to control its spread and mitigate its impact on native flora."
}
