{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon australe",
    "plant_slug": "abutilon-australe",
    "plant_name_scientific": "abutilon australe",
    "intro": "Abutilon australe, commonly known as the velvetleaf abutilon, is a flowering plant native to Australia. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its fuzzy, velvety leaves. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in spring and summer. Its leaves are opposite, ovate, and often have a distinctive waxy texture. Abutilon australe is adapted to a variety of soil types and is relatively drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon australe is primarily native to eastern and southeastern Australia, including parts of New South Wales, Victoria, Tasmania, and South Australia. It thrives in coastal regions and is commonly found in sandy or rocky soils. This plant is often associated with open woodlands, heathlands, and coastal dunes. It is well adapted to the temperate to subtropical climate of these areas. Abutilon australe is a small shrub that plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Abutilon australe was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various climates. It has since become naturalized in several regions, particularly in coastal and riverine areas. The plant spreads primarily through seed dispersal by wind and water, contributing to its rapid colonization of new habitats. It is considered a potential weed in some areas due to its aggressive growth habits. However, it is also valued for its ecological benefits, providing shelter and food for native wildlife."
}
