{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon × rubrum-multiflorum",
    "plant_slug": "abutilon-×-rubrum-multiflorum",
    "plant_name_scientific": "abutilon × rubrum-multiflorum",
    "intro": "Abutilon × rubrum-multiflorum, commonly known as the Chinese lantern plant, is a hybrid species within the Malvaceae family. It is characterized by its showy, papery bracts that resemble small lanterns, typically in shades of red, orange, or yellow. The plant is deciduous, shedding its leaves in winter, and produces small, inconspicuous flowers that are followed by fluffy, cotton-like seed pods. It thrives in full sun to partial shade and prefers well-drained soil, making it a popular choice for ornamental gardening. Its rapid growth and vibrant foliage make it a striking addition to gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon × rubrum-multiflorum is primarily native to the southeastern United States, including parts of Georgia, Florida, and South Carolina. It is commonly found in wetlands, swampy areas, and along the edges of rivers and streams. This plant thrives in humid, tropical climates and is often associated with disturbed or moist habitats. It is also known to grow in coastal regions where the soil is sandy or loamy. Its natural range extends into the Caribbean as well, where it is sometimes considered an invasive species.",
    "distribution_introduced_art_desc": "Abutilon × rubrum-multiflorum was mainly introduced to ornamental horticulture due to its attractive, lantern-shaped flowers and its ability to thrive in a variety of climates. It is commonly cultivated in gardens and landscapes for its aesthetic value. The plant is often used in tropical and subtropical regions where it can grow as a shrub or small tree. Its introduction has been associated with both intentional cultivation and accidental spread through seed dispersal. However, it is not considered invasive in most regions where it is grown."
}
