{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon parishii",
    "plant_slug": "abutilon-parishii",
    "plant_name_scientific": "abutilon parishii",
    "intro": "Abutilon parishii, commonly known as the golden abutilon, is a shrub native to the arid regions of southern Africa. It is characterized by its hairy, glandular stems and broad, heart-shaped leaves that are often covered in fine hairs. The plant produces small, yellowish-green flowers that bloom in clusters, adding a subtle ornamental value. It thrives in well-drained soils and is adapted to dry, hot climates. Due to its drought tolerance, it is often cultivated as a low-maintenance ornamental plant in arid landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon parishii"
    },
    "taxonomy_art_desc": "Abutilon parishii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and subtropical regions. Its order is Malvales, which includes plants with distinctive flowers and often includes species with cotton-like fibers. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as hibiscus and cotton, characterized by their five-petaled flowers. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern,\" known for their hairy leaves and showy flowers. Its species is Abutilon parishii, a specific type of plant within the genus Abutilon, distinguished by its unique morphological characteristics and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon parishii is primarily native to Arizona, Mexico Northwest. This plant is commonly found in the southwestern United States, particularly in Arizona. It thrives in arid and semi-arid environments, often growing in rocky or sandy soils. Abutilon parishii is adapted to the harsh climate of its native range, which includes parts of northern Mexico. Its distribution is largely restricted to specific regions within these areas.",
    "distribution_introduced_art_desc": "Abutilon parishii was mainly introduced to New Zealand. It is considered an environmental weed in certain regions of the country. The plant was likely introduced through human activity, possibly as a contaminant in agricultural products or ornamental plant imports. It has since spread into native habitats, posing a threat to local biodiversity. Efforts are ongoing to control its spread and prevent further invasion of natural areas."
}
