{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon × sulphureum",
    "plant_slug": "abutilon-×-sulphureum",
    "plant_name_scientific": "abutilon × sulphureum",
    "intro": "Abutilon × sulphureum, commonly known as the sulfur plant or golden abutilon, is a hybrid species within the Malvaceae family. It is characterized by its vibrant yellow-orange flowers that bloom in late summer to early autumn. The plant features soft, fuzzy leaves that are typically heart-shaped or ovate in form. It thrives in full sun to partial shade and prefers well-drained soil. Abutilon × sulphureum is often cultivated as an ornamental plant for its showy blooms and unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon × sulphureum is primarily native to tropical and subtropical regions of the Americas, including parts of Central and South America. It is commonly found in countries such as Brazil, Mexico, and Peru. This plant thrives in warm, humid climates and is often associated with coastal and lowland areas. It is also known to grow in disturbed habitats and along riverbanks. Its native range includes a variety of ecosystems, from forests to open grasslands.",
    "distribution_introduced_art_desc": "Abutilon × sulphureum was mainly introduced to ornamental horticulture due to its striking yellow-orange flowers and unique, maple-like leaves. It is commonly cultivated in gardens and as a houseplant because of its adaptability to various growing conditions. This plant is often found in tropical and subtropical regions where it thrives in warm, humid climates. It has been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has led to ecological concerns in regions where it has established itself outside of controlled garden environments."
}
