{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon theophrasti",
    "plant_slug": "abutilon-theophrasti",
    "plant_name_scientific": "abutilon theophrasti",
    "intro": "Abutilon theophrasti, commonly known as velvetleaf, is a herbaceous annual plant native to the Americas. It is characterized by its fuzzy, velvety leaves that give it its common name, and it produces small, greenish-yellow flowers that are typically clustered in the leaf axils. The plant is known for its rapid growth and ability to thrive in a variety of soil types, making it a common weed in agricultural fields. Its seeds are dispersed by wind, contributing to its invasive potential in many regions. The plant has also been studied for its potential use in biofuel production due to its high biomass yield.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon theophrasti"
    },
    "taxonomy_art_desc": "Abutilon theophrasti belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in temperate regions. Its order is Malvales, which includes plants with distinctive flowers and includes families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with palmate leaves and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as velvetleaf or Indian mallow, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon theophrasti, a specific plant within the genus Abutilon, known for its hairy leaves and yellow flowers, often found in disturbed habitats.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China North-Central",
        "China South-Central",
        "China Southeast",
        "Inner Mongolia",
        "Kazakhstan",
        "Kirgizstan",
        "Manchuria",
        "Mongolia",
        "Tadzhikistan",
        "Taiwan",
        "Turkmenistan",
        "Uzbekistan",
        "Xinjiang"
    ],
    "distribution_introduced": [
        "Afghanistan",
        "Alabama",
        "Albania",
        "Altay",
        "Amur",
        "Arizona",
        "Arkansas",
        "Austria",
        "Azores",
        "Bahamas",
        "Bangladesh",
        "Bermuda",
        "Bulgaria",
        "California",
        "Central European Russia",
        "Colorado",
        "Connecticut",
        "Corse",
        "Cuba",
        "Cyprus",
        "Czechia-Slovakia",
        "Delaware",
        "East Aegean Is.",
        "Egypt",
        "Finland",
        "Florida",
        "France",
        "Georgia",
        "Germany",
        "Great Britain",
        "Greece",
        "Hungary",
        "Idaho",
        "Illinois",
        "India",
        "Indiana",
        "Iowa",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Japan",
        "Kansas",
        "Kentucky",
        "Korea",
        "Kriti",
        "Krym",
        "KwaZulu-Natal",
        "Libya",
        "Louisiana",
        "Maine",
        "Malawi",
        "Maryland",
        "Massachusetts",
        "Mexico Northwest",
        "Michigan",
        "Minnesota",
        "Mississippi",
        "Missouri",
        "Montana",
        "Morocco",
        "Nebraska",
        "Netherlands",
        "Nevada",
        "New Hampshire",
        "New Jersey",
        "New Mexico",
        "New South Wales",
        "New York",
        "New Zealand North",
        "New Zealand South",
        "North Carolina",
        "North Caucasus",
        "North Dakota",
        "North European Russia",
        "Northern Provinces",
        "NW. Balkan Pen.",
        "Ohio",
        "Oklahoma",
        "Ontario",
        "Oregon",
        "Pakistan",
        "Palestine",
        "Panamá",
        "Pennsylvania",
        "Poland",
        "Portugal",
        "Primorye",
        "Queensland",
        "Rhode I.",
        "Romania",
        "Sardegna",
        "Sinai",
        "South Australia",
        "South Carolina",
        "South Dakota",
        "South European Russia",
        "Spain",
        "Tennessee",
        "Texas",
        "Thailand",
        "Transcaucasus",
        "Tunisia",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Utah",
        "Vermont",
        "Victoria",
        "Vietnam",
        "Virginia",
        "Washington",
        "West Himalaya",
        "West Siberia",
        "West Virginia",
        "Western Australia",
        "Wisconsin",
        "Wyoming"
    ],
    "distribution_native_art_desc": "Abutilon theophrasti is primarily native to China North-Central, China South-Central, China Southeast, Inner Mongolia, Kazakhstan, Kirgizstan, Manchuria, Mongolia, Tadzhikistan, Taiwan, Turkmenistan, Uzbekistan, and Xinjiang. This plant is commonly found in temperate regions with well-drained soils. It thrives in open habitats such as fields, roadsides, and disturbed areas. Theophrasti is known for its hairy leaves and lantern-shaped seed pods. Its native range spans across parts of East Asia and Central Asia.",
    "distribution_introduced_art_desc": "Abutilon theophrasti was mainly introduced to a wide range of regions across the globe, including Afghanistan, Alabama, Albania, Altay, Amur, Arizona, Arkansas, Austria, Azores, Bahamas, Bangladesh, Bermuda, Bulgaria, California, Central European Russia, Colorado, Connecticut, Corse, Cuba, Cyprus, Czechia-Slovakia, Delaware, East Aegean Is., Egypt, Finland, Florida, France, Georgia, Germany, Great Britain, Greece, Hungary, Idaho, Illinois, India, Indiana, Iowa, Iran, Iraq, Ireland, Irkutsk, Italy, Japan, Kansas, Kentucky, Korea, Kriti, Krym, KwaZulu-Natal, Libya, Louisiana, Maine, Malawi, Maryland, Massachusetts, Mexico Northwest, Michigan, Minnesota, Mississippi, Missouri, Montana, Morocco, Nebraska, Netherlands, Nevada, New Hampshire, New Jersey, New Mexico, New South Wales, New York, New Zealand North, New Zealand South, North Carolina, North Caucasus, North Dakota, North European Russia, Northern Provinces, NW. Balkan Pen., Ohio, Oklahoma, Ontario, Oregon, Pakistan, Palestine, Panamá, Pennsylvania, Poland, Portugal, Primorye, Queensland, Rhode I., Romania, Sardegna, Sinai, South Australia, South Carolina, South Dakota, South European Russia, Spain, Tennessee, Texas, Thailand, Transcaucasus, Tunisia, Türkey, Türkey-in-Europe, Ukraine, Utah, Vermont, Victoria, Vietnam, Virginia, Washington, West Himalaya, West Siberia, West Virginia, Western Australia, Wisconsin, Wyoming. This widespread introduction suggests its adaptability to diverse climates and environments. It is commonly found in disturbed areas such as roadsides, fields, and waste places. The plant is often considered an invasive species in many regions due to its rapid growth and ability to outcompete native vegetation. Its introduction has raised concerns about ecological impacts in various parts of the world."
}
