{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon arboreum",
    "plant_slug": "abutilon-arboreum",
    "plant_name_scientific": "abutilon arboreum",
    "intro": "Abutilon arboreum, commonly known as the velvetleaf or tree abutilon, is a flowering plant native to tropical regions of the Americas. It is a shrub or small tree that can grow up to 6 meters tall, characterized by its hairy, velvety stems and leaves. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often appearing in clusters. Its leaves are typically heart-shaped and have a rough, textured surface. Abutilon arboreum is known for its adaptability to various soil types and its ability to thrive in warm, humid climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon arboreum is primarily native to Central and South America. It is found in countries such as Brazil, Colombia, Ecuador, and Peru. This plant thrives in tropical and subtropical regions, often in humid lowland areas. It is commonly found in forests, along riverbanks, and in disturbed habitats. Its distribution includes parts of the Caribbean as well.",
    "distribution_introduced_art_desc": "Abutilon arboreum was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage and showy flowers. It is commonly found in areas with warm climates, such as parts of Southeast Asia, the Pacific Islands, and the Caribbean. The plant thrives in well-drained soil and full sun, making it suitable for gardens and landscapes. Its introduction has sometimes led to it becoming an invasive species in certain regions. Despite its beauty, proper management is needed to prevent it from spreading uncontrollably."
}
