{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon austroafricanum",
    "plant_slug": "abutilon-austroafricanum",
    "plant_name_scientific": "abutilon austroafricanum",
    "intro": "Abutilon austroafricanum, commonly known as the African velvetleaf, is a flowering plant native to southern Africa. It is a shrub or small tree that can grow up to 5 meters in height, characterized by its palmate leaves and showy, lantern-shaped flowers. The plant produces yellow flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. Its fibrous bark and soft, fuzzy leaves make it a distinctive species within the Malvaceae family. Abutilon austroafricanum is adapted to a variety of soil types and can thrive in both moist and dry conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon austroafricanum"
    },
    "taxonomy_art_desc": "Abutilon austroafricanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms with simple flower structures. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with capsule fruits and often showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon austroafricanum, a specific type of plant within the genus Abutilon, native to southern Africa, known for its ornamental value and unique foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Botswana",
        "Cape Provinces",
        "Eswatini",
        "KwaZulu-Natal",
        "Mozambique",
        "Namibia",
        "Northern Provinces",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon austroafricanum is primarily native to Botswana, Cape Provinces, Eswatini, KwaZulu-Natal, Mozambique, Namibia, Northern Provinces, and Zimbabwe. It is commonly found in regions with tropical and subtropical climates. The plant thrives in open woodlands, grasslands, and along riverbanks. It is well adapted to the diverse environmental conditions of southern Africa. Its native distribution spans across several countries in the region, reflecting its ecological versatility.",
    "distribution_introduced_art_desc": "Abutilon austroafricanum was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in coastal climates. This plant is often used as an ornamental due to its attractive foliage and flowers. It has also been reported in other parts of southern Africa, including Namibia and Zimbabwe. However, its spread is limited compared to other invasive species in the region."
}
