{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon micranthum",
    "plant_slug": "abutilon-micranthum",
    "plant_name_scientific": "abutilon micranthum",
    "intro": "Abutilon micranthum, commonly known as the woolly abutilon, is a flowering plant native to South America. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that typically range in color from yellow to orange. The plant is a shrub or small tree, often growing up to 3 meters in height. It thrives in warm, humid climates and is often found in coastal areas and disturbed soils. The flowers bloom in late spring to early summer, attracting pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon micranthum is primarily native to South America, specifically Brazil. It is found in the northeastern region of the country, including the states of Pará, Maranhão, and Piauí. This plant thrives in tropical and subtropical climates, often growing in moist, shaded areas within dense forests. It is commonly associated with riverine and coastal ecosystems. Its native range is limited to these specific regions within Brazil.",
    "distribution_introduced_art_desc": "Abutilon micranthum was mainly introduced to the Pacific Northwest region of the United States. It was initially brought in for its ornamental value due to its attractive fuzzy leaves and showy flowers. The plant has since spread to other areas, including parts of California and Oregon, where it thrives in moist, temperate climates. It is considered an invasive species in some regions because of its rapid growth and ability to outcompete native vegetation. Proper management is necessary to control its spread and minimize its impact on local ecosystems."
}
