{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon selerianum",
    "plant_slug": "abutilon-selerianum",
    "plant_name_scientific": "abutilon selerianum",
    "intro": "Abutilon selerianum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to red. It thrives in warm climates and is often found in disturbed soils or along roadsides. Abutilon selerianum is sometimes cultivated for its ornamental value due to its attractive foliage and blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon selerianum is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with humid climates. This plant thrives in coastal and mangrove environments, often growing along the edges of tidal flats and brackish water areas. It is also present in parts of New Guinea and the Indian subcontinent. Its native distribution is closely associated with coastal ecosystems where it plays a role in stabilizing shorelines and supporting local biodiversity.",
    "distribution_introduced_art_desc": "Abutilon selerianum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowering characteristics. The plant has since become naturalized in certain regions, particularly in coastal and disturbed areas. It is considered a potential weed in some parts of the country. Its spread is often associated with human activity and the movement of contaminated soil or plant material."
}
