{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon badium",
    "plant_slug": "abutilon-badium",
    "plant_name_scientific": "abutilon badium",
    "intro": "Abutilon badium, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its heart-shaped leaves and showy, lantern-like flowers that range in color from yellow to orange. The plant typically grows as an annual or perennial herb, reaching heights of up to 2 meters. Its hairy stems and foliage give it a distinctive, fuzzy appearance. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon badium is primarily native to Southeast Asia, including countries such as Thailand, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant thrives in humid climates and is typically associated with forest undergrowth or along stream banks. It is also known to occur in parts of India and Malaysia. Its distribution is closely linked to areas with high rainfall and fertile soils.",
    "distribution_introduced_art_desc": "Abutilon badium was mainly introduced to areas with disturbed soils and agricultural landscapes. It thrives in sunny, open environments and is often found along roadsides and in pastures. This plant is known for its hairy stems and showy yellow flowers that attract pollinators. It has been reported as an invasive species in several regions where it outcompetes native vegetation. Its rapid growth and ability to spread through seeds make it a challenging weed to control."
}
