{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon simulans",
    "plant_slug": "abutilon-simulans",
    "plant_name_scientific": "abutilon simulans",
    "intro": "Abutilon simulans, commonly known as the Chinese lantern plant, is a flowering plant native to Southeast Asia. It is a shrub that can grow up to 3 meters tall, featuring hairy stems and heart-shaped leaves. The plant produces clusters of small, bell-shaped yellow flowers that bloom in the summer months. Its fruit is a distinctive, inflated, orange-red capsule that splits open to release seeds. The plant is often cultivated for its ornamental value and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon simulans"
    },
    "taxonomy_art_desc": "Abutilon simulans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families like Malvaceae and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with palmate leaves and capsule fruits. Its genus is Abutilon, a group of flowering plants known for their showy, lantern-shaped flowers and often used in ornamental horticulture. Its species is Abutilon simulans, a specific type of plant within the genus Abutilon that is characterized by its unique floral structure and growth habits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon simulans is primarily native to Mexico Central, Mexico Northeast, and Mexico Southwest. This species is found in the tropical and subtropical regions of these areas. It typically grows in open forests, disturbed sites, and along stream banks. The plant is well adapted to the warm and humid climate of its native range. Its natural distribution reflects its preference for well-drained soils and partial to full sunlight.",
    "distribution_introduced_art_desc": "Abutilon simulans was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. Despite its aesthetic value, it has since become invasive in some areas, outcompeting native vegetation. The plant thrives in moist, shady environments and spreads rapidly through seeds. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
