{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon indicum var. australiense",
    "plant_slug": "abutilon-indicum-var-australiense",
    "plant_name_scientific": "abutilon indicum var. australiense",
    "intro": "Abutilon indicum var. australiense, commonly known as the woolly abutilon, is a flowering plant native to Australia. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in late winter to early spring, attracting pollinators such as bees and birds. Its hairy stems and leaves are adapted to arid conditions, making it drought-tolerant and suitable for xeriscaping. The plant is also valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon indicum var. australiense is primarily native to eastern Australia, including regions such as New South Wales and Queensland. It is commonly found in coastal areas, sandy soils, and open woodlands. This plant thrives in warm, temperate climates and is often associated with disturbed or degraded habitats. It is also known to occur in parts of South Australia and the southern regions of Western Australia. Its distribution reflects its adaptability to a range of environmental conditions within its native range.",
    "distribution_introduced_art_desc": "Abutilon indicum var. australiense was mainly introduced to Australia as an ornamental plant due to its attractive fuzzy leaves and showy flowers. It has since become naturalized in various regions, particularly in coastal and disturbed areas. The plant thrives in warm, sunny conditions and is commonly found in gardens and along roadsides. Its spread has raised concerns due to its potential to invade native vegetation. Despite its ornamental value, it is considered a weed in some areas where it outcompetes local flora."
}
