{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cecilii",
    "plant_slug": "abutilon-cecilii",
    "plant_name_scientific": "abutilon cecilii",
    "intro": "Abutilon cecilii, commonly known as the Cecil's abutilon, is a flowering plant native to the tropical regions of Central America. It is a shrub or small tree that can grow up to 3 meters in height, featuring soft, hairy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. Its fibrous bark and hairy foliage are characteristic of the Malvaceae family, which includes hibiscus and cotton. Abutilon cecilii is often cultivated for its ornamental value and is relatively easy to care for in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cecilii is primarily native to the eastern United States, specifically the southeastern region. It is found in states such as Florida, Georgia, South Carolina, and North Carolina. This plant typically grows in wetlands, swamps, and along the edges of streams and rivers. It thrives in moist, sandy soils and is often found in coastal areas. Abutilon cecilii is a shrub that can reach heights of up to 3 meters and is known for its showy, lantern-shaped flowers.",
    "distribution_introduced_art_desc": "Abutilon cecilii was mainly introduced to areas with warm, humid climates and well-drained soils, often in regions with mild winters. It is commonly found in coastal and lowland areas where it thrives in full sun to partial shade. This plant is typically introduced as an ornamental due to its attractive, velvety leaves and showy flowers. It has been reported in several countries in the Pacific and parts of Southeast Asia. However, its spread is limited by its preference for specific environmental conditions."
}
