{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cornutum",
    "plant_slug": "abutilon-cornutum",
    "plant_name_scientific": "abutilon cornutum",
    "intro": "Abutilon cornutum, commonly known as the horned abutilon, is a flowering plant native to South America. It is a shrub that typically grows to a height of 1 to 3 meters, featuring hairy stems and heart-shaped leaves. The plant produces showy, lantern-shaped flowers in shades of yellow to orange, which bloom in late spring to early summer. Its fruit is a capsule that splits open to release small, wind-dispersed seeds. Abutilon cornutum is often cultivated for its ornamental value and is adapted to a variety of soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cornutum is primarily native to the eastern United States, particularly in the southeastern region. It is found in states such as Florida, Georgia, South Carolina, and North Carolina. This plant thrives in moist, well-drained soils and is commonly found in wetlands, swamps, and along riverbanks. It is also known to grow in disturbed areas and is often associated with sandy or loamy soils. Abutilon cornutum is an important component of the wetland ecosystems in its native range.",
    "distribution_introduced_art_desc": "Abutilon cornutum was mainly introduced to new environments as an ornamental plant due to its unique, fuzzy leaves and showy flowers. It has been widely cultivated in temperate and subtropical regions for its aesthetic value. However, in some areas, it has escaped cultivation and established itself as an invasive species, outcompeting native vegetation. Its rapid growth and ability to spread through seeds make it a concern for ecological balance. Proper management is necessary to prevent its spread in non-native habitats."
}
