{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta wilson-brownei",
    "plant_slug": "abuta-wilson-brownei",
    "plant_name_scientific": "abuta wilson-brownei",
    "intro": "Abuta wilson-brownei, commonly known as the Wilson's abuta, is a flowering plant native to the Andes region of South America. It belongs to the family Euphorbiaceae and is characterized by its distinctive, clustered flowers and thick, fleshy leaves. The plant typically grows in high-altitude areas with cool, moist conditions. Its bark and leaves have been used in traditional medicine for their purported health benefits. Abuta wilson-brownei is valued for its ornamental appeal and ecological significance in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta wilson-brownei is primarily native to the western regions of the African continent, specifically in countries such as Angola, Namibia, and parts of southern Zambia. It thrives in arid and semi-arid environments, often found in rocky soils and mountainous areas. This plant is commonly associated with the Namib Desert and surrounding regions where it adapts to extreme climatic conditions. It is an important component of the local flora, contributing to the ecological balance of its habitat. Due to its restricted range, it is considered a rare and endemic species in these areas.",
    "distribution_introduced_art_desc": "Abuta wilson-brownei was mainly introduced to areas with specific ecological conditions that mimic its native habitat, such as well-drained soils and moderate rainfall. It has been observed in regions with a temperate climate, often thriving in shaded or semi-shaded environments. This plant is commonly found in disturbed sites, including roadsides and forest edges, where it can establish itself quickly. Its introduction has led to concerns about its potential invasiveness in non-native regions. Proper monitoring is essential to assess its impact on local ecosystems."
}
