{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta oblonga var. angustifolia",
    "plant_slug": "abuta-oblonga-var-angustifolia",
    "plant_name_scientific": "abuta oblonga var. angustifolia",
    "intro": "Abuta oblonga var. angustifolia, commonly known as narrow-leaved abuta, is a flowering plant native to the tropical regions of South America. It belongs to the family Euphorbiaceae and is characterized by its upright growth habit and woody stems. The plant produces small, greenish-yellow flowers arranged in clusters, which are often surrounded by modified leaves called bracts. Its leaves are typically narrow and elliptical, with a smooth or slightly hairy surface. Abuta oblonga var. angustifolia is often cultivated for its ornamental value and has been used in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta oblonga var. angustifolia is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It is commonly found in lowland rainforests and moist, shaded habitats. This variant is known for its distinctive elliptical leaves and clusters of small, fragrant flowers. It thrives in humid climates with well-drained soil. The plant is often used in traditional medicine for its purported health benefits.",
    "distribution_introduced_art_desc": "Abuta oblonga var. angustifolia was mainly introduced to areas with well-drained soils and partial to full sun exposure. It thrives in temperate climates and is commonly found in regions with moderate rainfall. This variant is often cultivated for its ornamental value due to its attractive foliage and unique growth habit. It is also valued for its potential medicinal properties in traditional herbal practices. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
