{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon croizatianum",
    "plant_slug": "abutilon-croizatianum",
    "plant_name_scientific": "abutilon croizatianum",
    "intro": "Abutilon croizatianum, commonly known as the croizatianum abutilon, is a flowering plant native to tropical regions of South America. It is a shrub or small tree that typically grows to a height of 2–5 meters. The plant features palmate leaves with five to seven lobes, and it produces showy, lantern-shaped yellow flowers. It is often cultivated for its ornamental value due to its attractive foliage and blooms. The plant prefers well-drained soil and full sun to partial shade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon croizatianum is primarily native to South America, specifically Brazil. It is found in the states of Pará, Maranhão, and Piauí. This species thrives in tropical and subtropical regions with high humidity and well-drained soils. It is commonly found in open forests, shrublands, and along riverbanks. The plant is known for its ornamental value and is sometimes cultivated for its unique foliage.",
    "distribution_introduced_art_desc": "Abutilon croizatianum was mainly introduced to ornamental horticulture and landscaping due to its attractive, lantern-shaped flowers and soft, fuzzy foliage. It is commonly cultivated in warm climates as a decorative plant for gardens and public spaces. The species has been introduced to several regions outside its native range, including parts of the Mediterranean, southern Europe, and the United States. Its rapid growth and ability to thrive in a variety of soil conditions have contributed to its widespread use in horticultural practices. However, it is also considered an invasive species in some areas where it can outcompete native vegetation."
}
