{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon asiaticum var. subasperum",
    "plant_slug": "abutilon-asiaticum-var-subasperum",
    "plant_name_scientific": "abutilon asiaticum var. subasperum",
    "intro": "Abutilon asiaticum var. subasperum, commonly known as the rough abutilon, is a flowering plant native to Southeast Asia. It belongs to the Malvaceae family and is characterized by its woolly, hairy leaves and showy, lantern-shaped flowers. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. Its flowers are usually yellow or orange, and it produces capsule fruits that contain numerous seeds. It is often cultivated for its ornamental value and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon asiaticum var. subasperum is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. This plant is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. It is typically associated with forest understories and riverbanks, where it thrives in humid conditions. The species is known for its hairy, rough-textured leaves and is sometimes cultivated for ornamental purposes. Its native distribution reflects its adaptation to the warm, humid climates of Southeast Asia.",
    "distribution_introduced_art_desc": "Abutilon asiaticum var. subasperum was mainly introduced to Hawaii, where it has established populations in disturbed areas and along roadsides. It is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. The plant thrives in coastal and lowland habitats, often spreading through seeds dispersed by wind and water. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems. Efforts are being made to control its spread and prevent further invasion of native habitats."
}
