{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon goudotianum",
    "plant_slug": "abutilon-goudotianum",
    "plant_name_scientific": "abutilon goudotianum",
    "intro": "Abutilon goudotianum, commonly known as the Indian mallow, is a flowering plant native to tropical regions of Asia. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to red. The plant belongs to the Malvaceae family, which includes other cotton and hibiscus species. It thrives in warm, humid climates and is often used in ornamental gardening. Abutilon goudotianum is also valued for its medicinal properties in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon goudotianum is primarily native to the tropical regions of Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in lowland areas with warm, humid climates and is often associated with disturbed habitats like roadsides and abandoned fields. This species thrives in areas with well-drained soil and ample sunlight, making it a common sight in tropical forests and agricultural landscapes. It is also occasionally found in parts of the Indian subcontinent, particularly in northeastern India. Due to its adaptability, it has been introduced to other tropical and subtropical regions around the world.",
    "distribution_introduced_art_desc": "Abutilon goudotianum was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive, maple-like leaves and showy flowers. It is commonly found in gardens and as a decorative plant in areas with warm climates. The species has been cultivated in parts of Southeast Asia, the Pacific Islands, and some regions of the Americas. Its introduction has sometimes led to its naturalization in local ecosystems. However, it is not considered invasive in most of these areas."
}
