{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon stipulare",
    "plant_slug": "abutilon-stipulare",
    "plant_name_scientific": "abutilon stipulare",
    "intro": "Abutilon stipulare, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its soft, hairy leaves and showy, lantern-shaped flowers that range in color from yellow to red. The plant typically grows as an annual or perennial shrub, reaching heights of up to 2 meters. Its fruits are capsules that split open to release seeds, aiding in its propagation. Abutilon stipulare is often found in disturbed soils and can thrive in a variety of environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon stipulare is primarily native to Southeast Asia, particularly regions such as Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical areas, often growing in coastal forests and lowland habitats. This plant thrives in humid climates with well-drained soils and is often associated with mangrove ecosystems. It is also known to occur in parts of India and the Pacific Islands. Its native distribution reflects its adaptation to warm, moist environments with high biodiversity.",
    "distribution_introduced_art_desc": "Abutilon stipulare was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, streambanks, and forest edges. This plant thrives in moist, well-drained soils and can tolerate partial shade. Its rapid growth and ability to spread through seeds make it a potential invasive species in some areas. It is often considered a weed in agricultural and natural settings."
}
