{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon englerianum",
    "plant_slug": "abutilon-englerianum",
    "plant_name_scientific": "abutilon englerianum",
    "intro": "Abutilon englerianum, commonly known as the Engler's abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 3 meters in height. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. Its leaves are heart-shaped and have a velvety texture, while its bark is smooth and grayish. It thrives in warm, humid climates and is often found in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon englerianum is primarily native to South America, specifically the Andean regions of Ecuador and Peru. It is commonly found in tropical and subtropical areas, growing in humid, shaded environments. This plant thrives in moist, well-drained soils and is often associated with cloud forests. It is known for its ornamental value due to its colorful bracts and is sometimes cultivated for horticultural purposes. Its natural range is limited to specific ecological zones within its native countries.",
    "distribution_introduced_art_desc": "Abutilon englerianum was mainly introduced to areas with warm, humid climates, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in tropical and subtropical regions, including parts of Southeast Asia, Africa, and the Pacific Islands. The plant thrives in well-drained soil and full sun to partial shade, making it adaptable to various garden environments. Its introduction has sometimes led to it becoming invasive in certain regions, outcompeting native vegetation. Due to its rapid growth and ability to spread through seeds, it requires careful management in non-native habitats."
}
