{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon umbelliflorum",
    "plant_slug": "abutilon-umbelliflorum",
    "plant_name_scientific": "abutilon umbelliflorum",
    "intro": "Abutilon umbelliflorum, commonly known as the woolly abutilon, is a flowering plant native to the southern United States and parts of Mexico. It is characterized by its soft, fuzzy leaves and showy, yellowish-green flowers that bloom in clusters. The plant typically grows as an upright shrub, reaching heights of up to 3 meters. It thrives in full sun to partial shade and prefers well-drained soils. Abutilon umbelliflorum is often cultivated for its ornamental value and ability to attract pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon umbelliflorum"
    },
    "taxonomy_art_desc": "Abutilon umbelliflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Malvales, which includes plants with distinctive flowers and often includes species that produce cotton or other fibers. Its family is Malvaceae, commonly known as the mallow family, characterized by their hirsute (hairy) stems and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" often found in tropical and subtropical regions. Its species is Abutilon umbelliflorum, a specific type of Abutilon known for its umbellate inflorescence and is native to certain regions of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia",
        "Brazil South",
        "Brazil Southeast",
        "Paraguay",
        "Uruguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon umbelliflorum is primarily native to Argentina Northeast, Argentina Northwest, Bolivia, Brazil South, Brazil Southeast, Paraguay, and Uruguay. This plant is commonly found in these regions, thriving in the diverse ecosystems present there. It is typically associated with tropical and subtropical climates, often growing in open areas or along riverbanks. The species is well adapted to the environmental conditions of its native range, including varying soil types and climatic patterns. Its natural distribution highlights its ecological significance in the South American region.",
    "distribution_introduced_art_desc": "Abutilon umbelliflorum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-shaped flowers. It was brought there during the 19th century by European settlers and gardeners who admired its unique appearance. Despite its ornamental value, it has since become an invasive species in some areas, outcompeting native plants and altering local ecosystems. Its rapid growth and ability to spread through seeds have made it a challenge for land managers. However, it remains popular in horticulture for its visual appeal and ease of cultivation."
}
