{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon wrightii",
    "plant_slug": "abutilon-wrightii",
    "plant_name_scientific": "abutilon wrightii",
    "intro": "Abutilon wrightii, commonly known as the Chinese lantern plant, is a flowering plant native to China and Korea. It is a shrub or small tree that can grow up to 6 meters tall, featuring smooth, grayish bark and alternate, heart-shaped leaves. The plant produces clusters of bright orange or red bracts that resemble lanterns, which are not flowers but modified leaves. These bracts are often mistaken for flowers and are the primary ornamental feature of the plant. Abutilon wrightii thrives in full sun to partial shade and is relatively drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon wrightii"
    },
    "taxonomy_art_desc": "Abutilon wrightii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Malvales, which includes plants with distinctive flowers that often have five petals and a central column of stamens. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and hibiscus, characterized by their fibrous capsules and sticky hairs. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their showy, lantern-shaped flowers. Its species is Abutilon wrightii, a specific type of plant within the genus Abutilon, native to certain regions and recognized for its unique floral and vegetative features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "New Mexico",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon wrightii is primarily native to Mexico Gulf, Mexico Northeast, Mexico Northwest, New Mexico, and Texas. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in open habitats such as grasslands, rocky slopes, and disturbed soils. The species is well adapted to the climate and soil conditions of its native range. It plays an important ecological role in supporting local wildlife and biodiversity.",
    "distribution_introduced_art_desc": "Abutilon wrightii was mainly introduced to the United States, particularly in the southern states. It is commonly found in disturbed areas such as roadsides, fields, and along riverbanks. This plant has been reported in several states including Texas, Louisiana, and Florida. Its introduction is believed to be due to its adaptability and rapid growth. However, it is not considered invasive in most regions where it is found."
}
