{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon australe var. malvifolium",
    "plant_slug": "abutilon-australe-var-malvifolium",
    "plant_name_scientific": "abutilon australe var. malvifolium",
    "intro": "Abutilon australe var. malvifolium, commonly known as the velvetleaf abutilon, is a flowering plant native to Australia. It is characterized by its large, heart-shaped leaves that are velvety to the touch, giving it its common name. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in spring. It thrives in well-drained soils and full sun, making it a popular choice for ornamental gardens. Its fibrous stems and hairy leaves are notable botanical features that contribute to its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon australe var. malvifolium is primarily native to eastern Australia, including regions of New South Wales, Victoria, and parts of Queensland. It thrives in coastal and sandy soils, often found in heathlands and open forests. This variant is known for its distinctive palmate leaves and is commonly found along the eastern coastline. It is adapted to temperate to subtropical climates and can tolerate moderate drought conditions. The plant plays an important role in local ecosystems, providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Abutilon australe var. malvifolium was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowers. The distribution of this variant is limited to specific regions within New Zealand, primarily in the North Island. It is commonly found in cultivated gardens and along roadsides. Despite its introduction, it has not become invasive and remains a relatively rare species in the wild."
}
