{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon hasslerianum f. pilcomayensis",
    "plant_slug": "abutilon-hasslerianum-f-pilcomayensis",
    "plant_name_scientific": "abutilon hasslerianum f. pilcomayensis",
    "intro": "Abutilon hasslerianum f. pilcomayensis, commonly known as the Pilcomayo abutilon, is a flowering plant native to South America, particularly Argentina and Bolivia. It belongs to the Malvaceae family and is characterized by its hairy, glandular stems and broad, heart-shaped leaves. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It thrives in moist, well-drained soils and is often found in riparian habitats. Due to its ornamental value, it is occasionally cultivated in gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon hasslerianum f. pilcomayensis is primarily native to the highland regions of southern Peru and northern Bolivia. It is found in the Andean foothills and valleys, particularly in the departments of Puno and La Paz. This plant thrives in temperate climates with well-drained soils and moderate rainfall. It is commonly found in shrublands and open forests at elevations ranging from 2,500 to 4,000 meters. Its distribution is closely associated with the Pilcomayo River basin, which explains its specific epithet.",
    "distribution_introduced_art_desc": "Abutilon hasslerianum f. pilcomayensis was mainly introduced to areas with a tropical or subtropical climate, characterized by warm temperatures and moderate to high rainfall. It thrives in well-drained soils and is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant is often cultivated for its ornamental value due to its attractive, lantern-shaped flowers. It has been reported in several countries in South America, particularly in regions with similar environmental conditions to its native habitat. Its introduction has led to its establishment in some non-native regions, where it can become invasive if not managed properly."
}
