{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon lemmonii",
    "plant_slug": "abutilon-lemmonii",
    "plant_name_scientific": "abutilon lemmonii",
    "intro": "Abutilon lemmonii, commonly known as the desert hibiscus, is a flowering plant native to the southwestern United States and northern Mexico. It is a shrub or small tree that typically grows in arid and semi-arid environments. The plant features showy, hibiscus-like flowers that are usually pink or red, blooming in summer. Its leaves are heart-shaped and often have a fuzzy texture, while its stems are woody and can be branched. Abutilon lemmonii is well adapted to drought conditions, making it a resilient plant in desert landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon lemmonii is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Texas. This plant typically grows in arid and semi-arid environments, including desert scrub and rocky habitats. It is often associated with limestone soils and can be found in areas with low rainfall. Its distribution is limited to specific ecological zones where it can thrive in the harsh desert conditions.",
    "distribution_introduced_art_desc": "Abutilon lemmonii was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, fields, and along streambanks. This plant thrives in full sun to partial shade and prefers well-drained soils. It is often considered a weed due to its rapid growth and ability to spread easily. Abutilon lemmonii has become naturalized in many regions where it was originally non-native."
}
