{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon monospermum",
    "plant_slug": "abutilon-monospermum",
    "plant_name_scientific": "abutilon monospermum",
    "intro": "Abutilon monospermum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It thrives in well-drained soil and requires full sun to partial shade for optimal growth. Abutilon monospermum is often cultivated as an ornamental plant due to its attractive foliage and unique floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon monospermum is primarily native to parts of India, including the states of Tamil Nadu, Kerala, and Karnataka. It is also found in Sri Lanka and some regions of Southeast Asia. This plant typically grows in tropical and subtropical areas, often in moist, shaded environments. It is commonly seen in forest understories and along stream banks. Its natural range extends into parts of southern China and the Andaman Islands.",
    "distribution_introduced_art_desc": "Abutilon monospermum was mainly introduced to areas with warm, humid climates, particularly in tropical and subtropical regions. It thrives in well-drained soils and is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant is often considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its introduction has led to ecological concerns in several countries where it has spread beyond cultivated areas. The distribution of Abutilon monospermum is largely influenced by human activities, including agriculture and landscaping."
}
