{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon vesicarium",
    "plant_slug": "abutilon-vesicarium",
    "plant_name_scientific": "abutilon vesicarium",
    "intro": "Abutilon vesicarium, commonly known as the bladderleaf abutilon, is a flowering plant native to Central and South America. It is characterized by its hairy, glandular stems and leaves that are often covered in small, bladder-like structures. The plant produces yellow flowers that are clustered in dense, spherical inflorescences. It thrives in moist, well-drained soils and is often found in tropical and subtropical regions. Due to its ornamental value, it is sometimes cultivated in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon vesicarium is primarily native to South America, particularly in regions of Brazil, Paraguay, and Argentina. It is commonly found in tropical and subtropical areas, often growing in moist, shaded environments such as forests and along riverbanks. This species thrives in humid climates with well-drained soil, making it a common sight in the Amazon basin and surrounding regions. It is also occasionally found in parts of Central America, extending its native range slightly northward. The plant is known for its ornamental value and is sometimes cultivated for its hairy, maple-like leaves and showy flowers.",
    "distribution_introduced_art_desc": "Abutilon vesicarium was mainly introduced to control erosion and stabilize soils in disturbed areas. It is commonly used in reclamation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its ornamental qualities, including its showy, lantern-shaped flowers. However, it can become invasive in some regions, outcompeting native vegetation. Its introduction has led to both ecological benefits and management challenges in certain ecosystems."
}
