{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon oxycarpum var. incanum",
    "plant_slug": "abutilon-oxycarpum-var-incanum",
    "plant_name_scientific": "abutilon oxycarpum var. incanum",
    "intro": "Abutilon oxycarpum var. incanum, commonly known as the silverleaf abutilon, is a flowering plant native to tropical regions of South America. It is characterized by its hairy, silver-gray foliage and pendulous clusters of yellow flowers. The plant produces capsule fruits that contain small, round seeds. It thrives in warm, humid climates and is often cultivated as an ornamental plant. Its unique appearance and adaptability make it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon oxycarpum"
    },
    "taxonomy_art_desc": "Abutilon oxycarpum var. incanum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies, known for their ancient lineage and unique structural features. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms, often with separate male and female flowers. Its order is Malvales, a group of flowering plants that includes economically important families such as Malvaceae, with plants often having showy flowers and specialized structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a wide range of ecological and economic significance. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy, lantern-shaped flowers. Its species is Abutilon oxycarpum, a specific type within the genus Abutilon, which is further differentiated by its varietal form incanum, known for its distinctive silver-gray foliage and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon oxycarpum var. incanum is primarily native to South Australia. It is found in the arid and semi-arid regions of the state. This variety is adapted to the harsh environmental conditions of the region. It typically grows in sandy or rocky soils. Its native distribution is largely restricted to specific areas within South Australia.",
    "distribution_introduced_art_desc": "Abutilon oxycarpum var. incanum was mainly introduced to the Pacific Northwest region of the United States. It has been found growing in disturbed areas such as roadsides, fields, and along stream banks. The plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It was likely introduced through human activities, such as landscaping or accidental seed dispersal. Its distribution has expanded in recent years, raising concerns among local conservationists."
}
