{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon longicuspe var. pilosicalyx",
    "plant_slug": "abutilon-longicuspe-var-pilosicalyx",
    "plant_name_scientific": "abutilon longicuspe var. pilosicalyx",
    "intro": "Abutilon longicuspe var. pilosicalyx, commonly known as the woolly abutilon, is a species native to the tropical regions of South America. It is a shrub or small tree characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant has a hairy stem and leaves that are typically ovate to elliptical in shape. It thrives in warm, humid climates and is often cultivated for its ornamental value. The flowers bloom in clusters and are pollinated primarily by insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon longicuspe"
    },
    "taxonomy_art_desc": "Abutilon longicuspe var. pilosicalyx belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex reproductive structures and vascular systems. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often found in tropical and temperate regions. Its order is Malvales, which includes plants with showy flowers and often hairy leaves, such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, characterized by their five-petaled flowers and often fuzzy or hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as Chinese lanterns, known for their showy, lantern-shaped flowers. Its species is Abutilon longicuspe, a specific type within the genus Abutilon, distinguished by its elongated, pointed leaves and unique floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Kenya"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon longicuspe var. pilosicalyx is primarily native to Kenya. This variant is found in the eastern and southern regions of the country. It typically grows in arid and semi-arid environments. The plant is adapted to the local climate and soil conditions of Kenya. It is commonly found in grasslands and along riverbanks in its native habitat.",
    "distribution_introduced_art_desc": "Abutilon longicuspe var. pilosicalyx was mainly introduced to areas with warm, humid climates and well-drained soils, often as an ornamental plant due to its attractive foliage and flowers. It is commonly found in regions of the southeastern United States, particularly in Florida and along the Gulf Coast. This plant thrives in full sun to partial shade and is often used in landscaping for its aesthetic value. However, it can become invasive in some environments if not managed properly. Its introduction has led to concerns about its impact on native plant communities in certain regions."
}
