{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon × savitzii",
    "plant_slug": "abutilon-×-savitzii",
    "plant_name_scientific": "abutilon × savitzii",
    "intro": "Abutilon × savitzii, commonly known as the Chinese lantern plant, is a hybrid species within the Malvaceae family. It is characterized by its distinctive, papery, lantern-shaped bracts that range in color from red to orange. The plant is native to China and has been widely cultivated for its ornamental value. It thrives in full sun to partial shade and prefers well-drained soil. Abutilon × savitzii is often used in gardens and as a houseplant due to its unique appearance and relatively easy care requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon × savitzii is primarily native to South America, specifically Argentina and Chile. It is commonly found in the temperate regions of these countries. This plant typically grows in coastal areas and along riverbanks. It thrives in well-drained soils and is often associated with shrublands and coastal vegetation. Its native range is limited to these specific regions in South America.",
    "distribution_introduced_art_desc": "Abutilon × savitzii was mainly introduced to the United States, particularly in the southern states, as an ornamental plant due to its attractive, lantern-shaped leaves and showy flowers. It has been widely cultivated in gardens and landscapes for its aesthetic value. However, it has also become invasive in some regions, outcompeting native vegetation and altering local ecosystems. Its spread is often facilitated by its ability to reproduce both sexually and vegetatively. Despite its ornamental appeal, its ecological impact has raised concerns among conservationists and land managers."
}
