{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon calycinum",
    "plant_slug": "abutilon-calycinum",
    "plant_name_scientific": "abutilon calycinum",
    "intro": "Abutilon calycinum, commonly known as velvetleaf abutilon, is a deciduous shrub native to tropical regions of the Americas. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in the spring and summer. Its fibrous roots and hairy stems are adaptations to its native environment, allowing it to thrive in disturbed soils. Abutilon calycinum is often cultivated for ornamental purposes due to its attractive foliage and blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon calycinum is primarily native to Southeast Asia, including countries such as Thailand, Vietnam, and the Philippines. It is commonly found in tropical and subtropical regions, often growing in moist, shaded environments. This plant is typically associated with lowland forests and riverine areas where it thrives in humid conditions. It is also found in parts of India and Indonesia, where it is sometimes cultivated for its ornamental value. Its native distribution reflects its adaptation to warm, wet climates with ample rainfall.",
    "distribution_introduced_art_desc": "Abutilon calycinum was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for ornamental purposes due to its attractive, maple-like leaves and showy flowers. The plant thrives in disturbed areas and spreads rapidly, outcompeting native vegetation. Its introduction has led to ecological concerns, as it can alter local ecosystems and reduce biodiversity. Efforts are being made to control its spread through manual removal and herbicide application."
}
