{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pritchardii",
    "plant_slug": "abutilon-pritchardii",
    "plant_name_scientific": "abutilon pritchardii",
    "intro": "Abutilon pritchardii, commonly known as the desert hibiscus, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its hairy, glandular stems and heart-shaped leaves that are often covered in fine绒毛. The plant produces showy, yellow-orange flowers that bloom in summer, attracting pollinators such as bees and butterflies. It thrives in arid and semi-arid environments, demonstrating drought tolerance and adaptability to poor soil conditions. Its botanical features make it a distinctive and resilient species within the Malvaceae family.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pritchardii"
    },
    "taxonomy_art_desc": "Abutilon pritchardii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which comprises flowering plants with distinctive flowers and often includes species with specialized adaptations for pollination. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and hibiscus, characterized by their showy flowers and often hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" which are typically shrubs or herbs with showy, lantern-shaped flowers. Its species is Abutilon pritchardii, a specific type within the genus Abutilon, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pritchardii is primarily native to Angola. It is found in the southern part of the country, particularly in the regions of Cunene and Namibe. This plant thrives in arid and semi-arid environments, often growing in rocky or sandy soils. It is commonly found in shrublands and along riverbanks. Due to its limited distribution, it is considered a rare and endemic species in Angola.",
    "distribution_introduced_art_desc": "Abutilon pritchardii was mainly introduced to the western United States, particularly in California and Nevada. It is often found in disturbed areas such as roadsides, fields, and along streams. This plant thrives in dry, sandy soils and is adapted to arid environments. It is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded in recent years, raising concerns among land managers and conservationists."
}
