{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon flanaganii",
    "plant_slug": "abutilon-flanaganii",
    "plant_name_scientific": "abutilon flanaganii",
    "intro": "Abutilon flanaganii, commonly known as the flanagan's abutilon, is a flowering plant native to Mexico. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its woolly, hairy stems and heart-shaped leaves. It produces showy, lantern-shaped yellow flowers that bloom in the summer months. This species is often cultivated for its ornamental value and is relatively easy to grow in well-drained soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon flanaganii"
    },
    "taxonomy_art_desc": "Abutilon flanaganii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological features. Its order is Malvales, which consists of flowering plants that often have showy flowers and include economically important genera like cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with velvety leaves and flowers that are often pink or white. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and lantern-shaped flowers. Its species is Abutilon flanaganii, a specific type of velvetleaf native to certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon flanaganii is primarily native to the western United States, specifically California and Oregon. It is commonly found in coastal areas and moist woodlands. This plant thrives in regions with a Mediterranean climate, characterized by cool, wet winters and warm, dry summers. It is often associated with sandy or gravelly soils along the Pacific coast. Abutilon flanaganii is also occasionally found in parts of Nevada and Baja California.",
    "distribution_introduced_art_desc": "Abutilon flanaganii was mainly introduced to Hawaii. It is considered an invasive species in the region. The plant spreads rapidly through seed dispersal by wind and water. It competes with native vegetation for resources. Its presence poses a threat to the local ecosystem."
}
