{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon burandtii",
    "plant_slug": "abutilon-burandtii",
    "plant_name_scientific": "abutilon burandtii",
    "intro": "Abutilon burandtii, commonly known as the Burandt's velvetleaf, is a flowering plant native to tropical regions of South America. It is characterized by its broad, heart-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to red. The plant belongs to the Malvaceae family, which includes hibiscus and cotton, and is known for its hairy, velvety texture. It thrives in warm, humid climates and is often found in disturbed habitats such as roadsides and clearings. Abutilon burandtii is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon burandtii"
    },
    "taxonomy_art_desc": "Abutilon burandtii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with capsule fruits and often hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their showy, lantern-shaped flowers. Its species is Abutilon burandtii, a specific type of plant within the genus Abutilon, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon burandtii is primarily native to Venezuela. It is found in the northern regions of the country, particularly in the states of Zulia and Mérida. This plant thrives in tropical and subtropical climates, often growing in open areas and along roadsides. It is commonly associated with disturbed soils and can be found in dry to semi-humid environments. Its native distribution is limited to specific ecological zones within Venezuela.",
    "distribution_introduced_art_desc": "Abutilon burandtii was mainly introduced to Hawaii, where it has become an invasive species. It was originally from South America and was likely introduced through human activities such as trade or ornamental plant cultivation. The plant thrives in coastal areas and disturbed soils, leading to its rapid spread across the islands. It competes with native vegetation, threatening local ecosystems and biodiversity. Efforts are ongoing to control its spread and mitigate its impact on the environment."
}
