{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pilosicalyx",
    "plant_slug": "abutilon-pilosicalyx",
    "plant_name_scientific": "abutilon pilosicalyx",
    "intro": "Abutilon pilosicalyx, commonly known as the silky abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its soft, hairy foliage. The leaves are typically ovate or elliptic, with a velvety texture due to the dense pubescence. It produces clusters of yellow flowers that bloom in late spring to early summer, followed by small, woody capsules containing seeds. This species is often cultivated for its ornamental value and is adapted to a variety of soil types.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pilosicalyx"
    },
    "taxonomy_art_desc": "Abutilon pilosicalyx belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often includes species with specialized fruit types. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a variety of fruit types such as capsules. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon pilosicalyx, a specific type of Abutilon known for its hairy foliage and distinctive floral morphology, often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Eritrea",
        "Ethiopia",
        "Kenya",
        "Somalia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pilosicalyx is primarily native to Eritrea, Ethiopia, Kenya, and Somalia. This species is commonly found in arid and semi-arid regions within these countries. It thrives in dry, open habitats such as grasslands and rocky areas. The plant is well adapted to the harsh environmental conditions of its native range. It plays a role in local ecosystems and is sometimes used in traditional practices.",
    "distribution_introduced_art_desc": "Abutilon pilosicalyx was mainly introduced to the Pacific Islands as an ornamental plant due to its attractive foliage and unique appearance. It has since become naturalized in several regions, including Hawaii and parts of Southeast Asia. The plant thrives in tropical and subtropical climates, often growing along roadsides and in disturbed areas. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, careful management is recommended to prevent its spread into native habitats."
}
