{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon crispum var. imberbe",
    "plant_slug": "abutilon-crispum-var-imberbe",
    "plant_name_scientific": "abutilon crispum var. imberbe",
    "intro": "Abutilon crispum var. imberbe, commonly known as the woolly abutilon, is a species native to South America, particularly Brazil. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The leaves are typically ovate to elliptic, with a hairy texture that gives the plant its common name. It thrives in tropical and subtropical climates, preferring well-drained soil and partial to full sun exposure. The plant is often cultivated for its ornamental value due to its unique foliage and vibrant floral displays.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon crispum var. imberbe is primarily native to the Caribbean Islands, including Cuba, Hispaniola, and the Bahamas. It is commonly found in coastal areas and lowland regions with sandy or limestone soils. This plant thrives in tropical and subtropical climates, often growing near the shoreline or in open, sunny habitats. It is well adapted to salt spray and can tolerate periodic flooding. Its native range is limited to these specific island environments, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon crispum var. imberbe was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The introduction occurred during the early 20th century as part of efforts to diversify the local landscape. It has since become naturalized in certain areas, though it is not considered a major invasive species. Its distribution is limited to specific regions within Hawaii where it thrives in tropical conditions."
}
