{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon megapotamicum",
    "plant_slug": "abutilon-megapotamicum",
    "plant_name_scientific": "abutilon megapotamicum",
    "intro": "Abutilon megapotamicum, commonly known as the velvetleaf or Brazilian abutilon, is a shrub native to South America. It is characterized by its fuzzy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant thrives in warm, humid climates and is often found in tropical and subtropical regions. Its fibrous stems and leaves have been used in traditional medicine and for textile production. The species is also valued for its ornamental appeal in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon megapotamicum is primarily native to South America, specifically Argentina, Brazil, and Paraguay. It is commonly found in the temperate regions of these countries, particularly in the southern part of Brazil. This plant thrives in areas with well-drained soils and a temperate climate. It is often associated with open woodlands and grasslands. Its natural range extends into parts of Uruguay and northern Argentina as well.",
    "distribution_introduced_art_desc": "Abutilon megapotamicum was mainly introduced to new environments as an ornamental plant due to its attractive foliage and unique appearance. It has been reported in several regions outside its native range, including parts of the United States and Europe. The plant's ability to thrive in a variety of soil types and its tolerance to different climatic conditions have contributed to its spread. However, its introduction has raised concerns about potential invasiveness in some areas. Despite its ornamental value, careful management is recommended to prevent unintended ecological impacts."
}
