{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta barbata",
    "plant_slug": "abuta-barbata",
    "plant_name_scientific": "abuta barbata",
    "intro": "Abuta barbata, commonly known as the hairy abuta, is a flowering plant native to the tropical regions of South America. It belongs to the family Euphorbiaceae, which includes a wide variety of plants with diverse morphological features. The plant is characterized by its striking, palmate leaves and clusters of small, yellowish flowers. Abuta barbata is often found in humid, shaded environments within tropical forests. Its unique appearance and ecological role make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta barbata"
    },
    "taxonomy_art_desc": "Abuta barbata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails and some aquatic plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as magnolias and laurels. Its order is Ranunculales, a group of flowering plants that includes buttercups, watercress, and other herbs with showy flowers. Its family is Menispermaceae, commonly known as the birthwort family, which includes climbing plants and some with medicinal properties. Its genus is Abuta, a group of flowering plants native to tropical regions, known for their ornamental value and medicinal uses. Its species is Abuta barbata, a specific type within the genus Abuta, characterized by its unique morphology and ecological preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "French Guiana",
        "Guyana",
        "Suriname"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta barbata is primarily native to Brazil North, French Guiana, Guyana, and Suriname. This plant is found in the tropical rainforest regions of these countries. It thrives in humid, shaded environments within the dense canopy of the forest. Abuta barbata is commonly found in the understory layers of these ecosystems. Its distribution is closely tied to the specific climatic and soil conditions of the Amazon and adjacent regions.",
    "distribution_introduced_art_desc": "Abuta barbata was mainly introduced to South America, particularly in regions with tropical and subtropical climates. It is commonly found in countries such as Brazil, Colombia, and Peru. This plant thrives in humid environments and is often cultivated for its ornamental value. It has also been introduced to parts of Southeast Asia for horticultural purposes. However, its spread outside its native range is limited due to specific climatic requirements."
}
