{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon densevillosum",
    "plant_slug": "abutilon-densevillosum",
    "plant_name_scientific": "abutilon densevillosum",
    "intro": "Abutilon densevillosum, commonly known as the woolly abutilon, is a flowering plant native to South America. It is characterized by its densely hairy, woolly stems and leaves, which give it a distinctive appearance. The plant produces showy, lantern-shaped yellow flowers that bloom in late spring to early summer. It thrives in full sun to partial shade and prefers well-drained soil. Abutilon densevillosum is often cultivated as an ornamental plant due to its unique foliage and vibrant blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon densevillosum is primarily native to the southern United States, specifically Texas and northern Mexico. It thrives in arid and semi-arid environments, often found in rocky soils and along dry streambeds. This plant is commonly associated with the Chihuahuan Desert region, where it adapts well to the harsh climate. It is also present in parts of New Mexico and Arizona, where it grows in open woodlands and grasslands. Due to its drought tolerance, it is well-suited to the hot, dry conditions of its native habitat.",
    "distribution_introduced_art_desc": "Abutilon densevillosum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, ditches, and urban landscapes. This plant has become naturalized in several states, including Oregon and Washington. Its rapid growth and adaptability have led to its spread beyond its original introduction sites. However, it is not considered invasive in most areas where it is established."
}
