{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon berlandieri",
    "plant_slug": "abutilon-berlandieri",
    "plant_name_scientific": "abutilon berlandieri",
    "intro": "Abutilon berlandieri, commonly known as the velvetleaf abutilon, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its fuzzy, velvety leaves and clusters of yellow flowers that bloom in late spring to early summer. The plant thrives in full sun to partial shade and prefers well-drained soil. It is often found in disturbed habitats such as roadsides and fields. Botanically, it is part of the Malvaceae family, which includes other plants like hibiscus and cotton.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon berlandieri"
    },
    "taxonomy_art_desc": "Abutilon berlandieri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and some with specialized structures like bracts. Its family is Malvaceae, commonly known as the mallow family, which includes plants like cotton and hibiscus, characterized by their showy flowers and capsule fruits. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their distinctive, lantern-shaped seed pods. Its species is Abutilon berlandieri, a specific type of Abutilon native to the southwestern United States and northern Mexico, characterized by its hairy leaves and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northeast",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon berlandieri is primarily native to Mexico Northeast and Texas. This species is commonly found in arid and semi-arid regions within these areas. It thrives in open habitats such as grasslands, rocky slopes, and disturbed soils. The plant is well adapted to the hot and dry climates of its native range. It plays an important role in local ecosystems and is sometimes used in traditional practices.",
    "distribution_introduced_art_desc": "Abutilon berlandieri was mainly introduced to the southwestern United States and parts of Mexico. It is commonly found in disturbed areas such as roadsides, fields, and along riverbanks. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It thrives in a variety of soil types and can tolerate both drought and flood conditions. Its introduction has led to ecological concerns in areas where it has established itself outside its native range."
}
