{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sinense",
    "plant_slug": "abutilon-sinense",
    "plant_name_scientific": "abutilon sinense",
    "intro": "Abutilon sinense, commonly known as Chinese Abutilon, is a flowering plant native to China and parts of Southeast Asia. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its palmate leaves and showy, lantern-shaped flowers. The plant produces yellow to orange flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. It thrives in warm, humid climates and is often cultivated for its ornamental value. The fruit is a capsule that contains numerous small, hairy seeds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon sinense"
    },
    "taxonomy_art_desc": "Abutilon sinense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Malvales, a group of flowering plants that includes economically important genera such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as the Chinese lanterns or velvetleafs, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon sinense, a specific type of plant within the genus Abutilon, native to China and known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast",
        "Thailand"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sinense is primarily native to China South-Central, China Southeast, and Thailand. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in moist, well-drained soils and is often found in forested or open areas. The species is known for its ornamental value and is sometimes cultivated for its unique foliage. Its native distribution reflects its adaptation to the warm and humid climates of southern China and neighboring regions.",
    "distribution_introduced_art_desc": "Abutilon sinense was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive foliage and flowers. It is commonly found in gardens and landscaped areas in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in warm climates with well-drained soil and partial to full sunlight. Its rapid growth and ability to spread through seeds and vegetative propagation have led to its establishment in some native ecosystems. However, it is considered a potential invasive species in certain regions where it can outcompete native vegetation."
}
