{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon salicifolium",
    "plant_slug": "abutilon-salicifolium",
    "plant_name_scientific": "abutilon salicifolium",
    "intro": "Abutilon salicifolium, commonly known as the velvetleaf abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its heart-shaped, soft, velvety leaves that give it a distinctive appearance. The plant produces clusters of small, yellowish-green flowers that bloom in the spring and summer. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. Abutilon salicifolium is also valued for its adaptability to various climates and its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Corynabutilon",
        "species": "Corynabutilon salicifolium"
    },
    "taxonomy_art_desc": "Abutilon salicifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group of vascular plants that includes ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Malvales, which consists of flowering plants with showy flowers and includes families such as Malvaceae, Theaceae, and Tiliaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and is well-known for its cotton and okra species. Its genus is Corynabutilon, a group of flowering plants within the Malvaceae family, characterized by their distinctive leaf shapes and floral structures. Its species is Corynabutilon salicifolium, a specific plant within this genus known for its willow-like leaves and is commonly found in certain regions of South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Chile Central"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon salicifolium is primarily native to Chile Central. It is found in the central regions of Chile, including the Valparaíso and Maule regions. This plant typically grows in coastal areas and dry valleys. It is adapted to the Mediterranean climate of the region, characterized by dry summers and wet winters. It is often found in disturbed soils and along roadsides.",
    "distribution_introduced_art_desc": "Abutilon salicifolium was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, streambanks, and open woodlands. This species is often considered an invasive plant due to its rapid growth and ability to outcompete native vegetation. It thrives in a variety of soil types and can tolerate both full sun and partial shade. Its presence has raised concerns among land managers due to its potential to alter local ecosystems."
}
