{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon abutilon",
    "plant_slug": "abutilon-abutilon",
    "plant_name_scientific": "abutilon abutilon",
    "intro": "Abutilon abutilon, commonly known as the velvetleaf or Indian mallow, is a flowering plant belonging to the Malvaceae family. It is characterized by its broad, heart-shaped leaves that are often covered in fine, soft hairs, giving it a velvety texture. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in late spring to early summer. It is native to tropical and subtropical regions of the Americas and is often found in disturbed habitats such as roadsides and waste areas. Abutilon abutilon is also valued for its ornamental appeal and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon abutilon is primarily native to South America, particularly in regions spanning from Brazil to Argentina. It is commonly found in tropical and subtropical areas, including parts of Central America and the Caribbean. This species thrives in moist, well-drained soils and is often associated with disturbed habitats such as roadsides and clearings. It is also present in some parts of Africa and Southeast Asia, where it has been introduced. The plant is known for its hairy leaves and showy flowers, making it a distinctive species in its native range.",
    "distribution_introduced_art_desc": "Abutilon abutilon was mainly introduced to New Zealand, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive, lantern-shaped flowers. However, it has since spread rapidly and is now considered a problematic weed in various ecosystems. The plant thrives in disturbed soils and can outcompete native vegetation. Its introduction has led to increased management efforts to control its spread and mitigate its ecological impact."
}
