{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta panamensis",
    "plant_slug": "abuta-panamensis",
    "plant_name_scientific": "abuta panamensis",
    "intro": "Abuta panamensis, commonly known as the Panamanian abuta, is a flowering plant native to Central America, particularly Panama. It belongs to the family Euphorbiaceae and is characterized by its shrub-like growth habit. The plant features palmate leaves with five to seven lobes, and it produces small, clustered yellowish flowers. Abuta panamensis is adapted to tropical and subtropical environments, often growing in moist, well-drained soils. Its botanical features make it an interesting subject for ecological and horticultural study.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta panamensis"
    },
    "taxonomy_art_desc": "Abuta panamensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some primitive seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse flower structures and reproductive strategies. Its order is Ranunculales, which consists of flowering plants with a variety of growth forms and includes many species with showy flowers and toxic compounds. Its family is Menispermaceae, commonly known as the birthwort family, which includes tropical and temperate plants with distinctive leaf shapes and often poisonous properties. Its genus is Abuta, a group of flowering plants native to tropical regions, characterized by their climbing habit and unique floral structures. Its species is Abuta panamensis, a specific plant within the genus Abuta found in Panama, distinguished by its morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Belize",
        "Costa Rica",
        "Guatemala",
        "Honduras",
        "Mexico Gulf",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua",
        "Panamá"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta panamensis is primarily native to Belize, Costa Rica, Guatemala, Honduras, Mexico Gulf, Mexico Southeast, Mexico Southwest, Nicaragua, and Panamá. This plant is found in the tropical and subtropical regions of Central America. It typically grows in lowland areas with moist, well-drained soils. Abuta panamensis is commonly associated with forest understories and secondary growth habitats. Its distribution spans across several countries in the region, reflecting its adaptability to diverse ecological conditions.",
    "distribution_introduced_art_desc": "Abuta panamensis was mainly introduced to the data as a rare and ecologically significant species native to Panama. It is characterized by its unique morphological features and potential medicinal properties. The introduction of this plant into the dataset aims to highlight its importance in biodiversity conservation. It is primarily found in specific habitats within its native range, such as tropical rainforests. This inclusion provides valuable insights for ecological research and conservation efforts."
}
