{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon discissum",
    "plant_slug": "abutilon-discissum",
    "plant_name_scientific": "abutilon discissum",
    "intro": "Abutilon discissum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its palmate leaves, which are often hairy and have a velvety texture. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Abutilon discissum is valued for its ornamental appeal and is sometimes cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon discissum is primarily native to South America, particularly in regions of Brazil, Paraguay, and Argentina. It is commonly found in tropical and subtropical areas, often growing in moist, shaded environments. This plant is typically associated with rainforests and riverine habitats, where it thrives in humid conditions. It is known for its distinctive velvety leaves and showy flowers that attract pollinators. Due to its ornamental value, it has been introduced to other parts of the world, but its native range remains concentrated in the aforementioned South American countries.",
    "distribution_introduced_art_desc": "Abutilon discissum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in wetland areas and along the edges of streams and rivers. The plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It has been reported in Washington, Oregon, and California. Its spread is often associated with human activities such as landscaping and accidental seed dispersal."
}
