{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mollicomum",
    "plant_slug": "abutilon-mollicomum",
    "plant_name_scientific": "abutilon mollicomum",
    "intro": "Abutilon mollicomum, commonly known as velvetleaf abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped yellow flowers that bloom in late spring to early summer. The plant typically grows as an annual or biennial herb, reaching heights of up to 2 meters. Its leaves are heart-shaped and covered in fine, silky hairs, giving it a velvety texture. It thrives in full sun to partial shade and is often found in disturbed soils along roadsides and in dry, open habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon mollicomum"
    },
    "taxonomy_art_desc": "Abutilon mollicomum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient lineages with primitive floral structures. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallows, which includes plants with a wide range of morphological diversity. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon mollicomum, a specific type of plant within the genus Abutilon, known for its soft, hairy leaves and distinctive floral features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southwest",
        "New Mexico",
        "Texas"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon mollicomum is primarily native to Arizona, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southwest, New Mexico, and Texas. This species is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in desert scrub and chaparral habitats. The plant is well adapted to the hot and dry climate of its native range. It plays an important ecological role in supporting local wildlife and maintaining biodiversity in these regions.",
    "distribution_introduced_art_desc": "Abutilon mollicomum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, fields, and along streambanks. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It thrives in moist, well-drained soils and can tolerate a range of light conditions. Its spread has raised concerns among land managers and conservationists."
}
