{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta colombiana",
    "plant_slug": "abuta-colombiana",
    "plant_name_scientific": "abuta colombiana",
    "intro": "Abuta colombiana, commonly known as the Colombian abuta, is a flowering plant native to the Andean regions of South America. It belongs to the family Euphorbiaceae and is characterized by its distinctive, palmate leaves and vibrant yellow flowers. The plant thrives in moist, shaded environments and is often found in cloud forests. Its latex contains various bioactive compounds, making it of interest in pharmacological research. Due to habitat loss, it is considered vulnerable and requires conservation efforts to ensure its survival.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta colombiana"
    },
    "taxonomy_art_desc": "Abuta colombiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Ranunculales, a group of flowering plants that includes many herbaceous species with showy flowers and often toxic compounds. Its family is Menispermaceae, commonly known as the birthwort family, which includes woody vines and shrubs with distinctive leaves and medicinal properties. Its genus is Abuta, a group of flowering plants native to tropical regions, characterized by their woody stems and palmately lobed leaves. Its species is Abuta colombiana, a specific plant species found in Colombia, known for its medicinal uses and unique botanical features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil North",
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta colombiana is primarily native to Brazil North and Colombia. It is found in the tropical rainforests of these regions. The plant thrives in humid, shaded environments. It is commonly found in the Amazon Basin and other dense forest areas. Its distribution is limited to these specific geographic locations in South America.",
    "distribution_introduced_art_desc": "Abuta colombiana was mainly introduced to regions with tropical and subtropical climates where it can thrive in well-drained soils. It is commonly found in areas with high humidity and partial shade, making it suitable for cultivation in gardens and greenhouses. This plant is valued for its ornamental foliage and potential medicinal properties. Its introduction has been primarily for horticultural purposes and traditional use in herbal medicine. However, it is important to monitor its spread to prevent potential ecological impacts in non-native environments."
}
