{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon tubulosum var. breviflorum",
    "plant_slug": "abutilon-tubulosum-var-breviflorum",
    "plant_name_scientific": "abutilon tubulosum var. breviflorum",
    "intro": "Abutilon tubulosum var. breviflorum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces small, yellowish-green flowers that bloom in clusters, often followed by distinctive, spiny seed pods. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Its botanical features make it a popular choice for ornamental gardening due to its unique texture and visual appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon tubulosum"
    },
    "taxonomy_art_desc": "Abutilon tubulosum var. breviflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some ferns, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and is often associated with cotton and okra. Its genus is Abutilon, a group of flowering plants commonly known as the velvetleaf or Chinese lantern, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon tubulosum, a specific type within the genus Abutilon, known for its tubular flowers and is a variant of the species with breviflorum.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon tubulosum var. breviflorum is primarily native to Queensland. This variant of the species is found in the eastern part of Australia, specifically within the state of Queensland. It thrives in tropical and subtropical regions, often in coastal and lowland areas. The plant is commonly associated with sandy soils and can be found in open woodlands and along riverbanks. Its distribution is limited to the native range in Queensland, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon tubulosum var. breviflorum was mainly introduced to areas with warm, temperate climates that provide adequate sunlight and well-drained soil. It is commonly found in regions with mild winters and hot, dry summers, making it suitable for cultivation in southern United States, parts of Australia, and Mediterranean climates. This plant is often used as an ornamental due to its showy, lantern-shaped flowers and attractive foliage. Its introduction has been primarily for horticultural purposes, though it can sometimes become invasive in certain environments. It thrives in USDA hardiness zones 8 through 10, where it can grow as a shrub or small tree."
}
