{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon bridgesii",
    "plant_slug": "abutilon-bridgesii",
    "plant_name_scientific": "abutilon bridgesii",
    "intro": "Abutilon bridgesii, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its hairy, ovate leaves and showy, lantern-shaped flowers that range in color from yellow to red. The plant typically grows as an erect shrub or small tree, reaching heights of up to 5 meters. It thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and waste areas. The species is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon bridgesii is primarily native to the coastal regions of southern Africa, specifically South Africa. It is found in the eastern and southeastern parts of the country, including the provinces of KwaZulu-Natal and Eastern Cape. This plant thrives in sandy or rocky coastal soils and is often found in dune environments. It is adapted to the warm, humid climate and can tolerate salt spray from the sea. Abutilon bridgesii is an important component of the coastal vegetation in these areas.",
    "distribution_introduced_art_desc": "Abutilon bridgesii was mainly introduced to areas with warm, humid climates, often as an ornamental plant due to its attractive foliage and flowering. It thrives in tropical and subtropical regions, where it can grow as a shrub or small tree. The plant is commonly found in disturbed soils and along roadsides, indicating its adaptability to various environments. Its introduction has sometimes led to it becoming invasive in certain regions, outcompeting native vegetation. Proper management is necessary to prevent its spread in ecosystems where it is not native."
}
