{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon ramosum",
    "plant_slug": "abutilon-ramosum",
    "plant_name_scientific": "abutilon ramosum",
    "intro": "Abutilon ramosum, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its fuzzy, velvety leaves. The plant produces showy, lantern-shaped flowers in shades of yellow, orange, and red, which bloom in clusters. Its leaves are alternate, simple, and often have a waxy texture, while its stems are woody and branched. Abutilon ramosum is commonly cultivated as an ornamental plant due to its attractive foliage and vibrant flowers.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon ramosum"
    },
    "taxonomy_art_desc": "Abutilon ramosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and complex reproductive structures. Its order is Malvales, which includes plants with showy flowers and often includes species with specialized seed structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and hibiscus, characterized by their sympetalous flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"Chinese lanterns\" or \"velvetleaf,\" often featuring hairy leaves and showy flowers. Its species is Abutilon ramosum, a specific type within the genus Abutilon, known for its branched growth habit and distinctive, lantern-like flower structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Benin",
        "Botswana",
        "Burkina",
        "Cameroon",
        "Cape Verde",
        "Central African Republic",
        "Chad",
        "DR Congo",
        "Eritrea",
        "Ethiopia",
        "India",
        "Kenya",
        "Malawi",
        "Mali",
        "Mozambique",
        "Namibia",
        "Niger",
        "Nigeria",
        "Northern Provinces",
        "Pakistan",
        "Saudi Arabia",
        "Senegal",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "West Himalaya",
        "Yemen",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon ramosum is primarily native to Angola, Benin, Botswana, Burkina, Cameroon, Cape Verde, Central African Republic, Chad, DR Congo, Eritrea, Ethiopia, India, Kenya, Malawi, Mali, Mozambique, Namibia, Niger, Nigeria, Northern Provinces, Pakistan, Saudi Arabia, Senegal, Somalia, Sudan-South Sudan, Tanzania, Uganda, West Himalaya, Yemen, Zambia, and Zimbabwe. It is commonly found in arid and semi-arid regions across these countries. The plant thrives in tropical and subtropical climates, often growing in open areas or along roadsides. It is known for its distinctive, lantern-shaped flowers and is sometimes used in traditional medicine. Its wide native distribution reflects its adaptability to various environmental conditions.",
    "distribution_introduced_art_desc": "Abutilon ramosum was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, fuzzy leaves and showy flowers. However, it has since become invasive in certain wetland areas, outcompeting native vegetation. The plant thrives in moist, disturbed soils and can spread rapidly along waterways. Its introduction has raised concerns among conservationists due to its potential to alter local ecosystems."
}
