{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon graveolens",
    "plant_slug": "abutilon-graveolens",
    "plant_name_scientific": "abutilon graveolens",
    "intro": "Abutilon graveolens, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to tropical and subtropical regions. It is characterized by its fuzzy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It thrives in warm climates and is often found in disturbed soils, making it a common weed in agricultural areas. Its rapid growth and adaptability contribute to its success in various environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon graveolens is primarily native to the Caribbean, Central America, and northern South America. It is commonly found in tropical and subtropical regions, particularly in countries such as Mexico, Guatemala, Honduras, and parts of Brazil. This plant thrives in moist, well-drained soils and is often found in coastal areas or near rivers. It is also present in some parts of southern Florida in the United States. Its natural habitat includes forests, shrublands, and disturbed sites where it can grow vigorously.",
    "distribution_introduced_art_desc": "Abutilon graveolens was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It thrives in moist, well-drained soils and can spread through both seeds and vegetative reproduction. Efforts to control its spread often involve manual removal and herbicide application."
}
