{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sessiliflorum",
    "plant_slug": "abutilon-sessiliflorum",
    "plant_name_scientific": "abutilon sessiliflorum",
    "intro": "Abutilon sessiliflorum, commonly known as the woolly abutilon, is a flowering plant native to South America. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an upright shrub, reaching heights of up to 2 meters. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening. The flowers bloom in the spring and early summer, attracting pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sessiliflorum is primarily native to southern Africa, particularly South Africa. It is found in regions such as the Western Cape, Eastern Cape, and parts of the Northern Province. This plant typically grows in coastal areas, fynbos vegetation, and rocky outcrops. It thrives in well-drained soils and is adapted to a Mediterranean climate with dry summers and wet winters. Due to its unique appearance and hardy nature, it is sometimes cultivated as an ornamental plant.",
    "distribution_introduced_art_desc": "Abutilon sessiliflorum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique flower structure. The plant has since become naturalized in certain regions, particularly in coastal areas and disturbed soils. Its spread has raised concerns due to its potential to outcompete native vegetation. Despite its ornamental value, careful management is needed to prevent its invasion of natural habitats."
}
