{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mauritianum var. cabrae",
    "plant_slug": "abutilon-mauritianum-var-cabrae",
    "plant_name_scientific": "abutilon mauritianum var. cabrae",
    "intro": "Abutilon mauritianum var. cabrae, commonly known as the Cape ivy, is a perennial shrub native to Madagascar. It is characterized by its opposite, ovate to lanceolate leaves that are often hairy and have a rough texture. The plant produces clusters of small, yellowish-green flowers that bloom in late spring to early summer. Its fruit is a capsule that splits open to release numerous seeds. It is often found in moist, shaded environments and is sometimes considered an invasive species in certain regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon mauritianum"
    },
    "taxonomy_art_desc": "Abutilon mauritianum var. cabrae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, a group of flowering plants that includes plants such as cotton and okra, known for their showy flowers and specialized seed structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and a variety of ecological and economic importance. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their showy, lantern-shaped flowers. Its species is Abutilon mauritianum, a specific type within the genus Abutilon, which is native to Madagascar and known for its unique floral structures and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "DR Congo",
        "Uganda"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon mauritianum var. cabrae is primarily native to DR Congo and Uganda. This variant of the species is found in the tropical and subtropical regions of these countries. It typically grows in areas with high humidity and well-drained soils. The plant is often associated with disturbed habitats such as riverbanks and forest edges. Its native distribution is limited to these specific regions in Central Africa.",
    "distribution_introduced_art_desc": "Abutilon mauritianum var. cabrae was mainly introduced to control erosion and for ornamental purposes in tropical and subtropical regions. It is commonly found in coastal areas and disturbed sites where it establishes quickly due to its vigorous growth habit. This plant has become invasive in some regions, outcompeting native vegetation and altering local ecosystems. Its ability to thrive in poor soil conditions contributes to its spread and persistence. However, its introduction has led to ecological concerns in several areas where it is not native."
}
