{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pilosocinereum",
    "plant_slug": "abutilon-pilosocinereum",
    "plant_name_scientific": "abutilon pilosocinereum",
    "intro": "Abutilon pilosocinereum, commonly known as the silky abutilon, is a flowering plant native to South America. It is characterized by its soft, fuzzy leaves and clusters of small, pale yellow flowers. The plant belongs to the Malvaceae family, which includes hibiscus and cotton. It thrives in moist, well-drained soils and is often found in tropical and subtropical regions. Its ornamental value makes it a popular choice for gardens and landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pilosocinereum"
    },
    "taxonomy_art_desc": "Abutilon pilosocinereum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their complex vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malvales, which consists of flowering plants with distinctive flowers and often includes cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, characterized by their showy flowers and cotton-like fibers in some species. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their fuzzy leaves and showy flowers. Its species is Abutilon pilosocinereum, a specific type of Abutilon known for its hairy leaves and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Free State",
        "Northern Provinces"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pilosocinereum is primarily native to the Free State and Northern Provinces of South Africa. It is commonly found in these regions, where it thrives in semi-arid to arid environments. The plant is typically associated with rocky soils and open vegetation types. It is well adapted to the local climate and plays a role in the ecological balance of these areas. Its distribution is limited to these specific provinces, making it a regionally significant species.",
    "distribution_introduced_art_desc": "Abutilon pilosocinereum was mainly introduced to areas with warm, humid climates and well-drained soils, often found in disturbed habitats such as roadsides and abandoned fields. It is commonly found in tropical and subtropical regions, including parts of Southeast Asia, the Pacific Islands, and northern Australia. This plant is known for its hairy stems and showy yellow flowers, which make it a popular ornamental species. It has been introduced to various regions for horticultural purposes due to its aesthetic appeal and adaptability. However, it can become invasive in some environments if not managed properly."
}
