{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cistiflorum",
    "plant_slug": "abutilon-cistiflorum",
    "plant_name_scientific": "abutilon cistiflorum",
    "intro": "Abutilon cistiflorum, commonly known as the woolly abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped yellow flowers that bloom in late summer. The plant belongs to the Malvaceae family, which includes hibiscus and cotton, and is known for its adaptability to arid environments. It typically grows as a shrub or small tree, reaching heights of up to 6 feet. Its unique foliage and vibrant blooms make it a popular choice for ornamental gardening in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cistiflorum is primarily native to the Mediterranean Basin, including parts of southern Europe, North Africa, and western Asia. It is commonly found in regions with a temperate climate, particularly in areas with well-drained soils. This plant thrives in sunny locations and is often associated with rocky or coastal habitats. It is known for its distinctive cup-shaped flowers and is sometimes cultivated for ornamental purposes. Its native range includes countries such as Spain, Italy, Morocco, and Turkey.",
    "distribution_introduced_art_desc": "Abutilon cistiflorum was mainly introduced to control erosion and stabilize soil in disturbed areas. It is commonly used in restoration projects due to its rapid growth and ability to thrive in poor soil conditions. This plant is also valued for its ornamental qualities, including its showy flowers and distinctive foliage. However, it has the potential to become invasive in certain environments if not managed properly. Its introduction has been documented in several regions where it is used for ecological and aesthetic purposes."
}
