{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon bedfordianum subsp. discolor",
    "plant_slug": "abutilon-bedfordianum-subsp-discolor",
    "plant_name_scientific": "abutilon bedfordianum subsp. discolor",
    "intro": "Abutilon bedfordianum subsp. discolor, commonly known as the velvetleaf abutilon, is a flowering plant native to the southeastern United States. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that typically range in color from yellow to orange. The plant is a shrub or small tree, often reaching heights of up to 10 feet, with a sprawling growth habit. Its leaves are palmately lobed and have a velvety texture, while its flowers bloom in late summer to early fall. It is often found in moist, disturbed soils and is considered an invasive species in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon bedfordianum subsp. discolor is primarily native to the southeastern United States, particularly Florida and parts of Georgia. It is commonly found in wetlands, marshes, and along the edges of water bodies in these regions. This subspecies thrives in humid, tropical climates and is often associated with coastal areas. It is also occasionally found in the Caribbean, including the Bahamas and Cuba. The plant is well adapted to wet soil conditions and plays a role in the ecological diversity of its native habitats.",
    "distribution_introduced_art_desc": "Abutilon bedfordianum subsp. discolor was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive fuzzy leaves and showy flowers. The distribution of this species has been limited to specific regions within New Zealand, primarily in the North Island. It is commonly found in gardens and along coastal areas where the climate is mild. Despite its introduction, it has not become naturalized in the wild and remains a cultivated plant."
}
