{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon ceratocarpum",
    "plant_slug": "abutilon-ceratocarpum",
    "plant_name_scientific": "abutilon ceratocarpum",
    "intro": "Abutilon ceratocarpum, commonly known as the horned abutilon, is a shrub native to parts of South America. It is characterized by its hairy, glandular stems and leaves that are usually ovate to elliptic in shape. The plant produces small, yellowish-green flowers that are clustered in panicles, followed by distinctive, spiny capsules as its fruit. It thrives in moist, well-drained soils and is often found in tropical and subtropical regions. Due to its unique appearance and ornamental value, it is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon ceratocarpum is primarily native to the Caribbean, including parts of the Greater Antilles and the Lesser Antilles. It is also found in southern Florida, USA, and extends into Central America. This plant thrives in tropical and subtropical regions, often growing in coastal areas or near freshwater sources. It is commonly associated with disturbed habitats such as roadsides, clearings, and abandoned fields. Its natural range includes countries like Cuba, Jamaica, Haiti, and the Dominican Republic.",
    "distribution_introduced_art_desc": "Abutilon ceratocarpum was mainly introduced to control erosion and as an ornamental plant in tropical and subtropical regions. It is commonly found in disturbed soils and along roadsides due to its rapid growth and adaptability. The plant thrives in areas with high humidity and moderate to high rainfall. It has been reported in several countries in Southeast Asia, the Pacific Islands, and parts of Africa. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems."
}
