{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon densiflorum",
    "plant_slug": "abutilon-densiflorum",
    "plant_name_scientific": "abutilon densiflorum",
    "intro": "Abutilon densiflorum, commonly known as the woolly abutilon, is a flowering plant native to Central and South America. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its soft, hairy leaves and showy, lantern-shaped flowers. The plant produces clusters of small, yellow-orange flowers that bloom in late summer to early autumn. It thrives in tropical and subtropical climates, preferring well-drained soil and partial shade. Its botanical features make it a popular choice for ornamental gardening due to its unique appearance and adaptability.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon densiflorum"
    },
    "taxonomy_art_desc": "Abutilon densiflorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants known for their showy flowers and includes families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with characteristic floral structures and cotton-like fibers. Its genus is Abutilon, a group of flowering plants known for their ornamental value and hairy leaves. Its species is Abutilon densiflorum, a specific type of plant within the genus Abutilon that is distinguished by its dense flowering and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Brazil South",
        "Brazil Southeast",
        "Paraguay"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon densiflorum is primarily native to Argentina Northeast, Brazil South, Brazil Southeast, and Paraguay. This plant is commonly found in regions with tropical and subtropical climates. It thrives in areas with well-drained soils and moderate to high humidity. The species is often associated with disturbed habitats and can be found in open woodlands and savannas. Its distribution reflects its adaptability to a range of environmental conditions within these regions.",
    "distribution_introduced_art_desc": "Abutilon densiflorum was mainly introduced to coastal and sandy areas along the Atlantic coast of Brazil. It is commonly found in regions with sandy soils and moderate to high humidity. This plant is often used in ornamental landscaping due to its attractive foliage and showy flowers. It has also been reported in some parts of southern Florida and along the southeastern United States. Its introduction has raised concerns about its potential to become invasive in non-native habitats."
}
