{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon falcatum",
    "plant_slug": "abutilon-falcatum",
    "plant_name_scientific": "abutilon falcatum",
    "intro": "Abutilon falcatum, commonly known as the Chinese lantern plant, is a deciduous shrub native to China and Southeast Asia. It is characterized by its heart-shaped, velvety leaves that turn red or purple in the fall. The plant produces clusters of small, lantern-shaped orange to red flowers that bloom in late summer. It thrives in full sun to partial shade and prefers well-drained soil. Abutilon falcatum is often cultivated for its ornamental value and is relatively easy to grow in temperate climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon falcatum"
    },
    "taxonomy_art_desc": "Abutilon falcatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their complex flower structures and diverse leaf forms. Its order is Malvales, a group of flowering plants that includes many economically important species such as cotton and okra. Its family is Malvaceae, commonly known as the mallow family, which consists of flowering plants with showy flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants known for their distinctive, often pendulous flowers and are commonly referred to as \"Chinese lanterns.\" Its species is Abutilon falcatum, a specific type of plant within the genus Abutilon that is characterized by its narrow, leaf-like appearance and is native to certain regions of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon falcatum is primarily native to Brazil Southeast. It is found in the southeastern region of Brazil, including the states of São Paulo, Minas Gerais, and Espírito Santo. This plant thrives in tropical and subtropical climates, often growing in coastal areas and along riverbanks. It is commonly found in humid forests and open woodlands. Its native distribution is closely associated with the biodiversity-rich ecosystems of the southeastern part of the country.",
    "distribution_introduced_art_desc": "Abutilon falcatum was mainly introduced to Florida, United States, as an ornamental plant due to its attractive foliage and showy flowers. It has since become naturalized in various wetland and disturbed areas across the southeastern United States. The plant is often found in swamps, marshes, and along waterways where it thrives in moist to wet conditions. Its rapid growth and ability to spread through seed dispersal have led to its classification as an invasive species in some regions. Management efforts focus on controlling its spread to protect native ecosystems."
}
