{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pyramidale",
    "plant_slug": "abutilon-pyramidale",
    "plant_name_scientific": "abutilon pyramidale",
    "intro": "Abutilon pyramidale, commonly known as the velvetleaf abutilon, is a shrub native to the Americas. It is characterized by its soft, hairy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows in tropical and subtropical regions, preferring well-drained soil and full sun. It is often cultivated as an ornamental plant due to its attractive foliage and blooms. Abutilon pyramidale is also known for its adaptability to various growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pyramidale"
    },
    "taxonomy_art_desc": "Abutilon pyramidale belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Malvales, which includes plants with distinctive flowers and includes economically important species such as cotton and hibiscus. Its family is Malvaceae, commonly known as the mallow family, characterized by their sympetalous flowers and velvety leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their ornamental value and hairy foliage. Its species is Abutilon pyramidale, a specific type of plant within the genus Abutilon, known for its pyramidal shape and is often cultivated for its aesthetic appeal.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pyramidale is primarily native to Venezuela. It is found in the tropical and subtropical regions of the country. This plant thrives in areas with warm climates and well-drained soils. It is commonly found in dry forests and shrublands. Its natural habitat includes parts of the northern and central regions of Venezuela.",
    "distribution_introduced_art_desc": "Abutilon pyramidale was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and flowering habits. It is commonly found in gardens and along roadsides, where it thrives in a variety of soil types and light conditions. Despite its ornamental value, it has become invasive in some areas, outcompeting native species and altering local ecosystems. The plant's rapid growth and ability to spread through seeds and vegetative reproduction contribute to its success as an introduced species. Management efforts are ongoing to control its spread and mitigate its ecological impact."
}
