{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon longilobum",
    "plant_slug": "abutilon-longilobum",
    "plant_name_scientific": "abutilon longilobum",
    "intro": "Abutilon longilobum, commonly known as the woolly abutilon, is a flowering plant native to South America. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its leaves are ovate with lobed edges, and it produces capsule fruits that contain numerous seeds. Abutilon longilobum is often cultivated for its ornamental value and is relatively easy to grow in well-drained soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon longilobum"
    },
    "taxonomy_art_desc": "Abutilon longilobum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and fibrous tissues. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a genus of flowering plants in the mallow family, known for their ornamental value and distinctive, lantern-like flowers. Its species is Abutilon longilobum, a specific type of Abutilon characterized by its elongated lobes on the leaves and is often cultivated for its aesthetic appeal.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon longilobum is primarily native to Western Australia. It is found in the region's coastal areas and sandy soils. This plant thrives in the warm, dry climate typical of the southwestern part of the state. It is commonly seen in heathlands and open woodlands. Its natural distribution is limited to specific habitats within Western Australia.",
    "distribution_introduced_art_desc": "Abutilon longilobum was mainly introduced to the Pacific Northwest region of the United States. It was introduced as an ornamental plant due to its attractive, maple-like leaves and showy yellow flowers. This species has since become naturalized in moist, disturbed areas such as streambanks and forest edges. It is considered a potential invasive species in some areas due to its rapid growth and ability to spread through seed dispersal. However, its impact on native ecosystems is still being studied."
}
