{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon ferrugineum",
    "plant_slug": "abutilon-ferrugineum",
    "plant_name_scientific": "abutilon ferrugineum",
    "intro": "Abutilon ferrugineum, commonly known as the rusty abutilon, is a flowering plant native to South America. It is a shrub that typically grows to a height of about 1 to 2 meters. The plant features heart-shaped leaves with a velvety texture and a distinctive rust-colored underside. Its flowers are yellow and occur in clusters, adding ornamental value to the plant. It thrives in well-drained soil and full sun, making it a suitable choice for gardens in temperate climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon ferrugineum is primarily native to South America, specifically Argentina, Chile, and Peru. It is commonly found in the Andean region, growing in dry to semi-arid environments. This plant thrives in rocky soils and is often seen in open landscapes or along the edges of forests. It is well adapted to the harsh conditions of the Andes, including high altitudes and variable rainfall. Due to its resilience, it is sometimes cultivated in gardens in regions with similar climates.",
    "distribution_introduced_art_desc": "Abutilon ferrugineum was mainly introduced to control erosion and stabilize soil in degraded or disturbed areas. It is commonly used in revegetation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is often found along roadsides, in disturbed habitats, and in areas with low rainfall. It has become a widespread invasive species in many regions outside its native range. Its introduction has led to concerns about its impact on native plant communities and ecosystem balance."
}
