{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon lauraster",
    "plant_slug": "abutilon-lauraster",
    "plant_name_scientific": "abutilon lauraster",
    "intro": "Abutilon lauraster, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its fuzzy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an annual or perennial herb, often found in disturbed soils and along roadsides. It belongs to the Malvaceae family, which includes hibiscus and cotton, and is known for its ability to thrive in a variety of environmental conditions. The plant's unique appearance and adaptability make it a notable species in botanical studies.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon lauraster"
    },
    "taxonomy_art_desc": "Abutilon lauraster belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and root system. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and ferns, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological characteristics. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and okra, characterized by their capsule fruits and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"Chinese lanterns\" or \"velvetleaf,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon lauraster, a specific type of plant within the genus Abutilon, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cameroon",
        "Madagascar",
        "Malawi",
        "Mozambique",
        "Northern Provinces",
        "Tanzania",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon lauraster is primarily native to Cameroon, Madagascar, Malawi, Mozambique, Northern Provinces, Tanzania, Zambia, and Zimbabwe. This species is commonly found in tropical and subtropical regions within these countries. It thrives in areas with warm climates and well-drained soils. The plant is often associated with forest margins and open woodlands. Its natural range reflects its adaptability to diverse ecological conditions across sub-Saharan Africa.",
    "distribution_introduced_art_desc": "Abutilon lauraster was mainly introduced to the Pacific Northwest region of the United States. It has been observed growing along roadsides and in disturbed areas, often thriving in moist, well-drained soils. The plant is considered an invasive species in some areas due to its rapid growth and ability to spread through seed dispersal. It is commonly found in Oregon and Washington, where it competes with native vegetation. Its introduction is likely due to human activity, such as landscaping and accidental seed transport."
}
