{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pilosum",
    "plant_slug": "abutilon-pilosum",
    "plant_name_scientific": "abutilon pilosum",
    "intro": "Abutilon pilosum, commonly known as the velvetleaf or fuzzy abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its fuzzy, hairy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as an upright shrub or small tree, reaching heights of up to 3 meters. Its fibrous roots and woody stems make it a resilient species often found in disturbed soils. Abutilon pilosum is also valued for its ornamental appeal and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pilosum is primarily native to South America, particularly in regions of Brazil, Paraguay, and Argentina. It thrives in tropical and subtropical climates, often found in disturbed areas such as roadsides, riverbanks, and open woodlands. This species is well adapted to moist environments and can tolerate a range of soil types. It is commonly encountered in the Atlantic Forest biome, where it contributes to the region's biodiversity. Due to its hardy nature, it has also been introduced to other parts of the world, including parts of Africa and Southeast Asia.",
    "distribution_introduced_art_desc": "Abutilon pilosum was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and unique appearance. It was first recorded in the 19th century and has since become naturalized in various regions of the country. The plant thrives in coastal and urban environments, often growing along roadsides and in disturbed soils. Its introduction has led to concerns about its potential to invade native ecosystems. Despite its ornamental value, it is considered a potential weed in some areas of New Zealand."
}
