{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fugax",
    "plant_slug": "abutilon-fugax",
    "plant_name_scientific": "abutilon fugax",
    "intro": "Abutilon fugax, commonly known as the Mexican velvetleaf, is a flowering plant native to Central America and parts of the southern United States. It is a deciduous shrub characterized by its soft, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant thrives in warm, humid climates and is often found in disturbed soils, such as along roadsides or in abandoned fields. Its rapid growth and ability to spread through seeds make it an invasive species in some regions. The botanical features of Abutilon fugax make it both ecologically significant and a challenge for land management.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon fugax"
    },
    "taxonomy_art_desc": "Abutilon fugax belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and fibrous fruits. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy leaves and showy flowers, often found in tropical and temperate regions. Its genus is Abutilon, a group of flowering plants commonly known as the Chinese lanterns or velvety abutilons, characterized by their fuzzy leaves and lantern-shaped flowers. Its species is Abutilon fugax, a specific type of Abutilon plant that is native to certain regions and is recognized by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon fugax is primarily native to Queensland. It is found in the eastern part of the state, particularly in the tropical and subtropical regions. This plant typically grows in rainforest and coastal areas, often in moist, shaded environments. It is commonly associated with creeklines and riverine forests. Abutilon fugax is an important component of the local flora, contributing to the biodiversity of Queensland's ecosystems.",
    "distribution_introduced_art_desc": "Abutilon fugax was mainly introduced to control erosion and for ornamental purposes in disturbed areas. It is commonly found in roadsides, waste areas, and along riverbanks. The plant is native to South America but has been introduced to several regions including parts of Africa and Asia. It spreads through its seeds, which are dispersed by wind and water. Due to its rapid growth, it can become invasive in certain environments."
}
