{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon jaliscanum",
    "plant_slug": "abutilon-jaliscanum",
    "plant_name_scientific": "abutilon jaliscanum",
    "intro": "Abutilon jaliscanum, commonly known as the Jalisco abutilon, is a flowering plant native to Mexico. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its fuzzy, ovate leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It typically grows in shrub form and thrives in well-drained soil with full sun exposure. This species is valued for its ornamental qualities and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon jaliscanum is primarily native to Mexico, specifically the state of Jalisco. It is also found in parts of central and southern Mexico, including the states of Guanajuato, Michoacán, and Oaxaca. This plant thrives in tropical and subtropical climates, often growing in open areas, along roadsides, and in disturbed soils. It is commonly found in dry to semi-arid regions with well-drained soils. Abutilon jaliscanum is a shrub or small tree that plays a role in local ecosystems and has some traditional uses in indigenous communities.",
    "distribution_introduced_art_desc": "Abutilon jaliscanum was mainly introduced to the Pacific Northwest of the United States. It is commonly found in moist, shaded areas such as along streambanks and in forest understories. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It spreads primarily through seed dispersal by water and animals. Its introduction has led to ecological concerns, prompting management efforts to control its spread."
}
