{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon oxycarpum f. incanum",
    "plant_slug": "abutilon-oxycarpum-f-incanum",
    "plant_name_scientific": "abutilon oxycarpum f. incanum",
    "intro": "Abutilon oxycarpum f. incanum, commonly known as the silverleaf abutilon, is a variant of the common abutilon species. It is characterized by its silvery-white, fuzzy foliage that gives it a distinctive appearance. The plant is native to South America and thrives in warm, humid climates. It produces small, yellow flowers that bloom in the summer months. This variety is often cultivated as an ornamental plant due to its unique texture and visual appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon oxycarpum f. incanum is primarily native to the arid and semi-arid regions of northern Africa, particularly Egypt, Sudan, and parts of the Arabian Peninsula. It thrives in environments with low rainfall and high temperatures, often found in rocky or sandy soils. This plant is commonly associated with coastal and desert margins, where it adapts to harsh climatic conditions. Its natural habitat includes areas with limited water availability, making it a resilient species in such ecosystems. It is also occasionally found in cultivated areas near its native range.",
    "distribution_introduced_art_desc": "Abutilon oxycarpum f. incanum was mainly introduced to areas with warm, humid climates where it can thrive in well-drained soils. It is commonly found in regions with mild winters and long growing seasons, making it suitable for cultivation in tropical and subtropical environments. This plant is often used as an ornamental due to its attractive foliage and unique flowering habits. It has been introduced to several countries in the Pacific and Southeast Asia, where it has become naturalized in some areas. Its distribution is largely limited to regions where it can receive adequate sunlight and maintain consistent moisture levels."
}
