{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon dentatum",
    "plant_slug": "abutilon-dentatum",
    "plant_name_scientific": "abutilon dentatum",
    "intro": "Abutilon dentatum, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is characterized by its fuzzy, velvety leaves that give it a distinctive appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to red. It thrives in warm, humid climates and is often found in disturbed soils. Abutilon dentatum is cultivated for its ornamental value and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon dentatum is primarily native to southern Africa, including countries such as South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, often growing along rocky outcrops and in sandy soils. This plant is well adapted to dry climates and can tolerate periods of drought. It is often seen in open woodlands and thorny shrublands. Its native range extends into parts of southern Arabia as well.",
    "distribution_introduced_art_desc": "Abutilon dentatum was mainly introduced to the United States, particularly in the southern regions, as an ornamental plant due to its attractive foliage and showy flowers. It has been cultivated in gardens and landscapes for its unique appearance and adaptability to various soil types. Despite its ornamental value, it has also become invasive in some areas, outcompeting native vegetation. The plant thrives in warm climates and can spread rapidly through seed dispersal. Its introduction has led to ecological concerns in certain regions where it disrupts local ecosystems."
}
