{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon subumbellatum",
    "plant_slug": "abutilon-subumbellatum",
    "plant_name_scientific": "abutilon subumbellatum",
    "intro": "Abutilon subumbellatum, commonly known as the Mexican abutilon or velvetleaf, is a flowering plant native to Central America and parts of the southern United States. It is a shrub or small tree that typically grows up to 3 meters tall, characterized by its broad, heart-shaped leaves and showy, lantern-shaped flowers. The plant produces yellow to orange flowers that bloom in clusters, often in the summer months. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Abutilon subumbellatum is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon subumbellatum"
    },
    "taxonomy_art_desc": "Abutilon subumbellatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and often having spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their distinctive flower structures and sometimes hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and often cotton-like fibers. Its genus is Abutilon, a group of flowering plants that are often referred to as \"Chinese lanterns\" due to their inflated seed pods. Its species is Abutilon subumbellatum, a specific type of plant within the genus Abutilon, characterized by its unique flowering pattern and physical features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Sri Lanka"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon subumbellatum is primarily native to Sri Lanka. It is found in various habitats across the island, including dry and wet zones. This plant typically grows in open areas, forest margins, and along roadsides. It is well adapted to the tropical climate of Sri Lanka. Its distribution is largely confined to the native range within the country.",
    "distribution_introduced_art_desc": "Abutilon subumbellatum was mainly introduced to the western coast of the United States, particularly in California and Oregon. It was brought there as an ornamental plant due to its attractive, lantern-shaped flowers and fuzzy leaves. This species has since become naturalized in some areas, often growing in disturbed soils and along roadsides. It is considered invasive in parts of its range, outcompeting native vegetation. Despite its invasive tendencies, it remains popular in horticulture for its unique appearance and adaptability."
}
