{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon integerrimum",
    "plant_slug": "abutilon-integerrimum",
    "plant_name_scientific": "abutilon integerrimum",
    "intro": "Abutilon integerrimum, commonly known as velvetleaf or Indian mallow, is a flowering plant native to the Americas. It is characterized by its soft, velvety leaves that give it its common name, and it produces showy, lantern-shaped flowers in shades of yellow to orange. The plant is typically shrub-like, with a fibrous root system and can grow up to several meters in height. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Its hairy stems and broad leaves make it easily identifiable in the botanical landscape.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon integerrimum is primarily native to the southwestern United States and northern Mexico. It is commonly found in regions such as Arizona, New Mexico, and parts of Texas. This plant thrives in arid and semi-arid environments, often growing in rocky soils and along riverbanks. It is well adapted to dry climates and can tolerate periods of drought. Its native range includes areas with mild winters and hot, dry summers.",
    "distribution_introduced_art_desc": "Abutilon integerrimum was mainly introduced to the Pacific Northwest region of the United States. It has been found growing along roadsides and in disturbed areas, often thriving in dry to moderately moist soils. This plant is considered an invasive species in some areas due to its rapid growth and ability to spread through seeds. It is commonly found in Oregon and Washington, where it has established populations in natural and urban environments. Its introduction has raised concerns among local ecologists due to its potential impact on native plant communities."
}
