{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta seemannii",
    "plant_slug": "abuta-seemannii",
    "plant_name_scientific": "abuta seemannii",
    "intro": "Abuta seemannii, commonly known as the African butterbean, is a flowering plant native to tropical Africa. It belongs to the family Malvaceae and is characterized by its palmate leaves and showy, pink or purple flowers. The plant produces capsule fruits that contain small, kidney-shaped seeds. It thrives in moist, well-drained soils and is often found in forest understories. Due to its ornamental value and medicinal properties, it is sometimes cultivated in gardens and traditional medicine practices.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta seemannii"
    },
    "taxonomy_art_desc": "Abuta seemannii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and root system. Its class is Equisetopsida, which consists of a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their primitive floral structures. Its order is Ranunculales, a group of flowering plants that includes many species with showy flowers and often toxic properties. Its family is Menispermaceae, a family of flowering plants commonly known as the pipevines, which are often found in tropical and subtropical regions. Its genus is Abuta, a group of flowering plants native to tropical Africa and Asia, known for their medicinal properties. Its species is Abuta seemannii, a specific plant within the genus Abuta, noted for its unique morphological features and potential pharmacological applications.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta seemannii is primarily native to Colombia. It is found in the tropical regions of the country, particularly in the Andean foothills and lowland areas. This plant thrives in humid, shaded environments within the rainforests. It is commonly found in regions with high biodiversity, such as the departments of Amazonas, Cauca, and Nariño. Its native distribution is closely tied to the specific ecological conditions of these regions.",
    "distribution_introduced_art_desc": "Abuta seemannii was mainly introduced to regions with tropical and subtropical climates, where it thrives in well-drained soils and receives ample sunlight. It is commonly found in areas with seasonal rainfall patterns, making it suitable for cultivation in parts of Southeast Asia, Africa, and the Caribbean. This plant is often grown for its ornamental value due to its attractive foliage and unique flowers. It has also been introduced for medicinal purposes, as certain parts of the plant are used in traditional remedies. However, its introduction has raised concerns about potential ecological impacts in non-native habitats."
}
