{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pseudocleistogamum",
    "plant_slug": "abutilon-pseudocleistogamum",
    "plant_name_scientific": "abutilon pseudocleistogamum",
    "intro": "Abutilon pseudocleistogamum, commonly known as the cleistogamous abutilon, is a flowering plant native to tropical regions of South America. It belongs to the Malvaceae family and is characterized by its unique reproductive strategy, producing both open and closed (cleistogamous) flowers. The plant typically grows as an herbaceous shrub with hairy stems and heart-shaped leaves. Its cleistogamous flowers are self-pollinated, while the open flowers are pollinated by insects. This species is valued for its ornamental potential and ecological role in supporting pollinator populations.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pseudocleistogamum"
    },
    "taxonomy_art_desc": "Abutilon pseudocleistogamum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants with showy flowers and often includes species with cotton-like fibers. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon pseudocleistogamum, a specific type within the genus Abutilon, distinguished by its unique floral and morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [
        "Réunion"
    ],
    "distribution_native_art_desc": "Abutilon pseudocleistogamum is primarily native to Madagascar. It is found in the central and eastern regions of the island, where the climate is tropical and humid. This plant thrives in moist, well-drained soils and is often found in forested areas. It is a member of the Malvaceae family and is known for its distinctive, lantern-shaped flowers. Due to its limited range, it is considered a rare and endemic species within Madagascar.",
    "distribution_introduced_art_desc": "Abutilon pseudocleistogamum was mainly introduced to Réunion. It is a species of the Malvaceae family, known for its ornamental value and adaptability to various environmental conditions. The plant has been reported in several locations across the island, including coastal and disturbed areas. Its introduction may be linked to horticultural activities or accidental spread through human activities. However, its ecological impact and distribution patterns are still being studied."
}
