{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon amplissimum var. subpeltatum",
    "plant_slug": "abutilon-amplissimum-var-subpeltatum",
    "plant_name_scientific": "abutilon amplissimum var. subpeltatum",
    "intro": "Abutilon amplissimum var. subpeltatum, commonly known as the velvetleaf abutilon, is a species of flowering plant in the mallow family. It is characterized by its large, heart-shaped leaves that are often covered in a fine, velvety texture. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color. It is native to tropical regions of the Americas and thrives in warm, humid climates. This plant is often cultivated for its ornamental value and can be found in gardens and greenhouses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon amplissimum var. subpeltatum is primarily native to the Caribbean islands, particularly Cuba, Hispaniola, and the Bahamas. This variant of the species is commonly found in coastal areas and lowland forests where it thrives in humid, tropical conditions. It is often associated with sandy soils and is frequently seen growing along shorelines and in disturbed habitats. The plant is known for its showy, lantern-shaped flowers that bloom in the summer months. Due to its limited range, it is considered a rare and endemic species within its native region.",
    "distribution_introduced_art_desc": "Abutilon amplissimum var. subpeltatum was mainly introduced to areas with warm, humid climates and well-drained soils, typically in regions with mild winters. It is commonly found in disturbed habitats such as roadsides, waste areas, and along riverbanks. This plant thrives in full sun to partial shade and is often seen in tropical and subtropical regions. It has become naturalized in several countries in the Pacific and Southeast Asia. Its rapid growth and adaptability make it a common invasive species in some areas."
}
