{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon grandifolium",
    "plant_slug": "abutilon-grandifolium",
    "plant_name_scientific": "abutilon grandifolium",
    "intro": "Abutilon grandifolium, commonly known as the Chinese lantern plant, is a flowering plant native to Southeast Asia. It is characterized by its broad, heart-shaped leaves and its striking, lantern-shaped seed pods that turn red as they mature. The plant produces showy yellow flowers that bloom in clusters, adding ornamental value to gardens. It thrives in warm climates and is often cultivated for its decorative foliage and unique fruiting structures. Abutilon grandifolium is a member of the Malvaceae family, which includes hibiscus and cotton.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon grandifolium"
    },
    "taxonomy_art_desc": "Abutilon grandifolium belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Malvales, which consists of flowering plants with typically showy flowers and includes families such as Malvaceae, Theaceae, and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with a distinctive sympetalous flower structure and is often associated with cotton and okra. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their showy, lantern-shaped flowers. Its species is Abutilon grandifolium, a specific type within the genus Abutilon, distinguished by its large, broad leaves and vibrant flowers, often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast",
        "Argentina Northwest",
        "Bolivia",
        "Brazil South",
        "Chile North",
        "Paraguay",
        "Peru",
        "Uruguay"
    ],
    "distribution_introduced": [
        "Angola",
        "Assam",
        "Burkina",
        "Canary Is.",
        "Cape Provinces",
        "Cape Verde",
        "China Southeast",
        "Egypt",
        "Ethiopia",
        "Gulf of Guinea Is.",
        "Hawaii",
        "India",
        "KwaZulu-Natal",
        "Madeira",
        "Mali",
        "Marquesas",
        "Morocco",
        "Mozambique",
        "New South Wales",
        "New Zealand North",
        "Northern Provinces",
        "Pakistan",
        "Portugal",
        "Puerto Rico",
        "Queensland",
        "Réunion",
        "Senegal",
        "Society Is.",
        "Spain",
        "Taiwan",
        "Tuamotu",
        "Tubuai Is.",
        "Tunisia",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Abutilon grandifolium is primarily native to Argentina Northeast, Argentina Northwest, Bolivia, Brazil South, Chile North, Paraguay, Peru, and Uruguay. This plant is commonly found in regions with temperate to subtropical climates. It thrives in areas with well-drained soils and moderate rainfall. The species is often seen in open woodlands and along riverbanks. Its native distribution spans across several South American countries.",
    "distribution_introduced_art_desc": "Abutilon grandifolium was mainly introduced to a wide range of regions across Africa, Asia, and the Pacific, including Angola, India, Hawaii, and the Canary Islands. It has been documented in various countries such as Egypt, Ethiopia, and Morocco, as well as in parts of Southeast Asia like China and Taiwan. The plant is also present in several islands in the Indian and Pacific Oceans, including the Society Islands and the Tuamotu Archipelago. Its introduction likely occurred through human activity, such as trade or horticultural practices, leading to its establishment in these diverse environments. This distribution suggests that Abutilon grandifolium has adapted well to a variety of climates and ecological conditions."
}
