{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon exstipulare",
    "plant_slug": "abutilon-exstipulare",
    "plant_name_scientific": "abutilon exstipulare",
    "intro": "Abutilon exstipulare, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its hairy, velvety stems and broad, heart-shaped leaves that are often lobed. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in summer. It thrives in warm, humid climates and is often found in disturbed soils or along roadsides. Abutilon exstipulare is valued for its ornamental appeal and is sometimes cultivated as a garden plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon exstipulare"
    },
    "taxonomy_art_desc": "Abutilon exstipulare belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Malvales, which consists of flowering plants with a variety of growth forms and includes families like Malvaceae and Theaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and cotton-like seeds. Its genus is Abutilon, a group of flowering plants known for their ornamental value and often referred to as \"velvetleaf\" due to their soft, hairy leaves. Its species is Abutilon exstipulare, a specific type of plant within the genus Abutilon that is distinguished by its unique morphological features and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Réunion"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon exstipulare is primarily native to Réunion. It is a flowering plant species that thrives in the tropical climate of this island. The plant is commonly found in coastal areas and lowland forests. It plays an important role in the local ecosystem and is adapted to the unique environmental conditions of Réunion. Due to its native habitat, it is often cultivated in similar tropical regions for ornamental purposes.",
    "distribution_introduced_art_desc": "Abutilon exstipulare was mainly introduced to the United States as an ornamental plant due to its attractive, lantern-shaped flowers and its ability to thrive in a variety of climates. It was first introduced in the early 19th century and has since been cultivated in gardens and landscapes across the country. The plant is commonly found in the southeastern United States, particularly in Florida and along the Gulf Coast. It has also been reported in parts of California and the Pacific Northwest, where it has occasionally become naturalized. Despite its ornamental value, it is considered a potential invasive species in some regions due to its rapid growth and ability to spread through seeds."
}
