{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon oxycarpum var. malvifolium",
    "plant_slug": "abutilon-oxycarpum-var-malvifolium",
    "plant_name_scientific": "abutilon oxycarpum var. malvifolium",
    "intro": "Abutilon oxycarpum var. malvifolium, commonly known as the velvetleaf abutilon, is a species of flowering plant in the mallow family, Malvaceae. It is characterized by its soft, velvety leaves that are typically lobed or deeply divided, giving it a distinctive appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often attracting pollinators such as bees and butterflies. It thrives in warm climates and is often found in tropical and subtropical regions. Its botanical features make it a popular choice for ornamental gardening and ecological landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon oxycarpum var. malvifolium is primarily native to Southeast Asia, including countries such as India, Sri Lanka, and parts of Indonesia. It is commonly found in tropical and subtropical regions, particularly in areas with warm, humid climates. This plant thrives in moist, well-drained soils and is often found in open woodlands or along riverbanks. It is also present in some regions of Africa, such as Kenya and Tanzania. Due to its ornamental value, it has been introduced to other parts of the world, but its native range remains largely within Southeast Asia and eastern Africa.",
    "distribution_introduced_art_desc": "Abutilon oxycarpum var. malvifolium was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive foliage and unique floral characteristics. This variety is commonly found in gardens and greenhouses, where it thrives in mild, moist climates. It has also been reported in some naturalized areas, particularly near water sources. Despite its ornamental value, it is considered a non-native species in these regions."
}
