{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon fruticosum var. fruticosum",
    "plant_slug": "abutilon-fruticosum-var-fruticosum",
    "plant_name_scientific": "abutilon fruticosum var. fruticosum",
    "intro": "Abutilon fruticosum var. fruticosum, commonly known as the velvetleaf abutilon, is a shrub native to tropical and subtropical regions. It is characterized by its hairy, velvety leaves that give it a distinctive appearance. The plant produces showy, bell-shaped flowers in shades of yellow, orange, or red, which bloom in clusters. Its growth habit is typically sprawling or shrub-like, with multiple branches. It thrives in well-drained soil and requires full sun to partial shade for optimal growth.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon fruticosum"
    },
    "taxonomy_art_desc": "Abutilon fruticosum var. fruticosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, known for their showy flowers and capsule fruits. Its family is Malvaceae, commonly known as the mallow family, which includes plants with a distinctive sympetalous flower and a variety of economic uses. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon fruticosum, a specific variety within the genus Abutilon, known for its shrub-like growth and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Algeria",
        "Angola",
        "Arkansas",
        "Botswana",
        "Burkina",
        "Chad",
        "Djibouti",
        "Egypt",
        "Eritrea",
        "Ethiopia",
        "Gulf States",
        "India",
        "Iran",
        "Kenya",
        "Mali",
        "Mauritania",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Southwest",
        "Morocco",
        "Namibia",
        "New Mexico",
        "Niger",
        "Northern Provinces",
        "Oklahoma",
        "Oman",
        "Pakistan",
        "Palestine",
        "Saudi Arabia",
        "Senegal",
        "Sinai",
        "Socotra",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Texas",
        "Yemen",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Aldabra"
    ],
    "distribution_native_art_desc": "Abutilon fruticosum var. fruticosum is primarily native to Algeria, Angola, Arkansas, Botswana, Burkina, Chad, Djibouti, Egypt, Eritrea, Ethiopia, Gulf States, India, Iran, Kenya, Mali, Mauritania, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Southwest, Morocco, Namibia, New Mexico, Niger, Northern Provinces, Oklahoma, Oman, Pakistan, Palestine, Saudi Arabia, Senegal, Sinai, Socotra, Somalia, Sudan-South Sudan, Tanzania, Texas, Yemen, and Zimbabwe. This plant is commonly found in arid and semi-arid regions, often growing in rocky or sandy soils. It is well adapted to hot and dry climates, making it a resilient species in these environments. The plant is sometimes used for its ornamental value due to its distinctive foliage and flowers. It plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Abutilon fruticosum var. fruticosum was mainly introduced to Aldabra. It is a shrub or small tree native to tropical and subtropical regions. The plant is characterized by its hairy stems and showy yellow flowers. It thrives in well-drained soil and full sun. It is often found in coastal areas and disturbed habitats on the island."
}
