{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon guineense",
    "plant_slug": "abutilon-guineense",
    "plant_name_scientific": "abutilon guineense",
    "intro": "Abutilon guineense, commonly known as the woolly abutilon, is a flowering plant native to tropical Africa. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant is often found in moist, wooded areas and thrives in warm, humid climates. Its fibrous stems and hairy foliage make it a distinctive species within the Malvaceae family. Abutilon guineense is also valued for its ornamental qualities and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon guineense"
    },
    "taxonomy_art_desc": "Abutilon guineense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Malvales, which consists of flowering plants that often have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and cotton-like fibers. Its genus is Abutilon, a group of flowering plants known for their ornamental value and hairy leaves. Its species is Abutilon guineense, a specific type within the genus Abutilon, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Burkina",
        "Cameroon",
        "Cape Verde",
        "China South-Central",
        "DR Congo",
        "Eswatini",
        "Ghana",
        "Gulf of Guinea Is.",
        "Kenya",
        "KwaZulu-Natal",
        "Madagascar",
        "Malawi",
        "Mozambique",
        "Northern Provinces",
        "Rwanda",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Togo",
        "Uganda",
        "Zimbabwe"
    ],
    "distribution_introduced": [
        "Hainan",
        "India",
        "Leeward Is.",
        "Mauritius",
        "New Guinea",
        "Queensland",
        "Réunion",
        "Taiwan",
        "Thailand"
    ],
    "distribution_native_art_desc": "Abutilon guineense is primarily native to Angola, Burkina, Cameroon, Cape Verde, China South-Central, DR Congo, Eswatini, Ghana, Gulf of Guinea Is., Kenya, KwaZulu-Natal, Madagascar, Malawi, Mozambique, Northern Provinces, Rwanda, Somalia, Sudan-South Sudan, Tanzania, Togo, Uganda, and Zimbabwe. This species is commonly found in tropical and subtropical regions, often growing in moist, well-drained soils. It is typically associated with forest edges, riverbanks, and disturbed areas. The plant is known for its hairy stems and showy flowers, which contribute to its ecological and ornamental value. Its wide distribution across sub-Saharan Africa and parts of Asia highlights its adaptability to diverse environmental conditions.",
    "distribution_introduced_art_desc": "Abutilon guineense was mainly introduced to Hainan, India, Leeward Is., Mauritius, New Guinea, Queensland, Réunion, Taiwan, and Thailand. It is commonly found in tropical and subtropical regions, where it thrives in warm and humid climates. The plant is often cultivated for its ornamental value due to its attractive foliage and flowers. It has been introduced to various island and mainland areas, likely through horticultural trade or accidental spread. Its distribution highlights its adaptability to diverse environments across the Indo-Pacific region."
}
