{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon paranthemum",
    "plant_slug": "abutilon-paranthemum",
    "plant_name_scientific": "abutilon paranthemum",
    "intro": "Abutilon paranthemum, commonly known as the woolly abutilon, is a flowering plant native to South America. It is characterized by its hairy, velvety leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. It thrives in warm, humid climates and is often found in coastal areas and disturbed soils. The flowers are primarily pollinated by insects, and the plant is valued for its ornamental appeal in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon paranthemum is primarily native to South America, specifically Argentina and Chile. It is commonly found in the Andean regions, particularly in the western part of the continent. This plant thrives in dry, rocky, and coastal environments. It is often seen growing in open areas with poor soil conditions. Its native range is limited to these specific regions within South America.",
    "distribution_introduced_art_desc": "Abutilon paranthemum was mainly introduced to areas with warm, temperate climates where it can thrive in well-drained soils. It is commonly found in regions with mild winters and hot, dry summers. This plant is often cultivated as an ornamental due to its attractive, lobed leaves and showy flowers. It has been reported in several countries, including parts of the United States and Australia. Its introduction has sometimes led to concerns about its potential to become invasive in certain environments."
}
