{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon intermedium",
    "plant_slug": "abutilon-intermedium",
    "plant_name_scientific": "abutilon intermedium",
    "intro": "Abutilon intermedium, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is a shrub or small tree that can grow up to 6 meters in height, characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in late summer to early autumn. Its leaves are typically heart-shaped and have a velvety texture, while its bark is smooth and grayish in color. Abutilon intermedium is often found in disturbed soils and thrives in full sun to partial shade.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon intermedium is primarily native to South America, particularly in regions such as Argentina, Bolivia, Brazil, Paraguay, and Uruguay. It thrives in tropical and subtropical climates, often found in open woodlands, savannas, and along riverbanks. This species is well adapted to humid environments and can tolerate a range of soil types. It is commonly encountered in the Andean foothills and lowland areas of its native range. Abutilon intermedium is also occasionally found in parts of Central America, though it is more widespread in the southern regions of the continent.",
    "distribution_introduced_art_desc": "Abutilon intermedium was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, fields, and along stream banks. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It thrives in a variety of soil types and can tolerate both full sun and partial shade. Its presence has led to concerns about its impact on local ecosystems and biodiversity."
}
