{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon arequipense",
    "plant_slug": "abutilon-arequipense",
    "plant_name_scientific": "abutilon arequipense",
    "intro": "Abutilon arequipense, commonly known as the Arequipa abutilon, is a flowering plant native to the Andean region of South America. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its hairy stems and broad, heart-shaped leaves. The plant produces showy, lantern-shaped flowers that are typically yellow or orange in color, which bloom in clusters during the spring and summer seasons. It thrives in well-drained soils and full sun, making it a suitable ornamental plant in temperate climates. The species is also valued for its ecological role in supporting local pollinators and birdlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon arequipense"
    },
    "taxonomy_art_desc": "Abutilon arequipense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families like Malvaceae and Sterculiaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers with five petals. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their showy, lantern-shaped flowers. Its species is Abutilon arequipense, a specific type of Abutilon native to South America, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon arequipense is primarily native to Peru. It is found in the arid and semi-arid regions of the country, particularly in the southern and central areas. This plant thrives in dry, rocky environments and is commonly found in coastal and mountainous regions. It is adapted to the harsh climate of the Peruvian Andes. Its native distribution is largely restricted to specific ecological zones within Peru.",
    "distribution_introduced_art_desc": "Abutilon arequipense was mainly introduced to the Pacific coast of South America, particularly in countries such as Chile and Peru. It is commonly found in coastal areas, riverbanks, and disturbed soils where it thrives in sunny to partially shaded conditions. This plant is often associated with human-modified landscapes, including roadsides and agricultural fields. Its introduction has led to its establishment as a naturalized species in several regions. Due to its adaptability, it has become a common sight in both urban and rural environments along the coast."
}
