{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sylvaticum subsp. klugii",
    "plant_slug": "abutilon-sylvaticum-subsp-klugii",
    "plant_name_scientific": "abutilon sylvaticum subsp. klugii",
    "intro": "Abutilon sylvaticum subsp. klugii, commonly known as the Klug's velvetleaf, is a shrub native to Central and South America. It belongs to the Malvaceae family and is characterized by its hairy, ovate leaves and showy, lantern-shaped yellow flowers. The plant typically grows in tropical and subtropical regions, often in moist, shaded environments. It is known for its fibrous bark, which has been used in traditional medicine, and its ability to thrive in disturbed soils. The subspecies klugii is distinguished by its slightly smaller leaves and more compact growth habit compared to the typical form of A. sylvaticum.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sylvaticum subsp. klugii is primarily native to Central America, including countries such as Mexico, Guatemala, Belize, Honduras, and El Salvador. It is also found in parts of northern South America, particularly in Venezuela and Colombia. This species thrives in tropical and subtropical regions, often growing in humid lowland areas with well-drained soil. It is commonly associated with disturbed habitats, such as forest edges, clearings, and along roadsides. Its native range extends into the Caribbean islands, where it is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Abutilon sylvaticum subsp. klugii was mainly introduced to the southeastern United States, particularly in states like Florida and Georgia. It was brought there for its ornamental value due to its attractive, lantern-shaped leaves and showy flowers. This subspecies thrives in moist, well-drained soils and is often found in disturbed habitats such as roadsides and vacant lots. It has become naturalized in some areas, raising concerns about its potential invasiveness. Despite its beauty, its spread requires careful monitoring to prevent ecological disruption."
}
