{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta negroensis",
    "plant_slug": "abuta-negroensis",
    "plant_name_scientific": "abuta negroensis",
    "intro": "Abuta negroensis, commonly known as black abuta, is a flowering plant native to the tropical regions of South America. It belongs to the family Euphorbiaceae and is characterized by its distinctive dark purple to black bark, which gives it its common name. The plant produces small, yellowish flowers arranged in clusters, and its leaves are typically heart-shaped with a rough texture. It thrives in humid, shaded environments and is often found in forest understories. Due to its unique appearance and potential medicinal properties, it is of interest to botanists and herbalists alike.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta negroensis is primarily native to the tropical regions of Central Africa, specifically the Democratic Republic of the Congo and the Republic of the Congo. It grows in humid lowland rainforests, often in areas with high rainfall and warm temperatures. This plant is typically found in the understory of dense forest ecosystems, where it thrives in shaded, moist conditions. It is commonly associated with secondary growth areas and can be found in both natural and disturbed forest habitats. Due to its restricted range and habitat specificity, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abuta negroensis was mainly introduced to the data to highlight its unique ecological and medicinal significance. This plant is native to the high-altitude regions of Ethiopia and has been traditionally used in local medicine for its purported health benefits. The introduction of Abuta negroensis into the dataset aims to enhance understanding of its distribution and potential applications. It is characterized by its distinctive black bark and is often found in rocky, arid environments. Further research is needed to fully explore its ecological role and conservation status."
}
