{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta cuspidata",
    "plant_slug": "abuta-cuspidata",
    "plant_name_scientific": "abuta cuspidata",
    "intro": "Abuta cuspidata, commonly known as the African butterbean, is a climbing shrub native to tropical Africa. It belongs to the family Leguminosae, also known as the Fabaceae family, and is characterized by its compound leaves and small, yellow flowers. The plant produces distinctive, bean-like pods that contain edible seeds, which are often used in local cuisines. Its root system is notable for containing compounds that have been studied for potential medicinal properties. Abuta cuspidata thrives in moist, shaded environments and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta cuspidata is primarily native to the tropical and subtropical regions of South America, particularly in countries such as Brazil, Peru, and Colombia. It is commonly found in the Amazon Basin and surrounding areas, growing in humid, shaded environments within dense rainforests. This plant thrives in lowland and montane forests, often near rivers and streams. It is known for its distinctive red or orange flowers and is sometimes cultivated for ornamental purposes. Due to habitat loss, Abuta cuspidata is considered vulnerable in some parts of its native range.",
    "distribution_introduced_art_desc": "Abuta cuspidata was mainly introduced to the western United States, particularly in states like California, Oregon, and Washington. It was brought there for its ornamental value due to its attractive foliage and unique fruit structure. The plant has been cultivated in gardens and botanical collections as a curiosity and for its potential medicinal properties. However, it is not considered invasive in these regions and is generally well-behaved in controlled environments. Its introduction has been limited to horticultural and research purposes rather than natural spread."
}
