{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mangarevicum",
    "plant_slug": "abutilon-mangarevicum",
    "plant_name_scientific": "abutilon mangarevicum",
    "intro": "Abutilon mangarevicum, commonly known as the mangareva fanflower, is a flowering plant native to the tropical regions of the Pacific, particularly the islands of Mangareva and Pitcairn. It is characterized by its broad, heart-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. It thrives in coastal areas and is adapted to sandy soils and salt spray. Abutilon mangarevicum is also valued for its ornamental qualities and is sometimes cultivated in subtropical gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon mangarevicum"
    },
    "taxonomy_art_desc": "Abutilon mangarevicum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and often having a distinct life cycle with spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Malvales, which includes plants with showy flowers and often includes species that produce cotton or other fibrous materials. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers that often have five petals. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon mangarevicum, a specific type of plant within the genus Abutilon, known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon mangarevicum is primarily native to the Pacific Islands, including Hawaii, Tonga, and Samoa. It is commonly found in coastal areas and lowland forests. This plant thrives in tropical and subtropical climates with high humidity. It is often associated with rocky or sandy soils in its natural habitat. Its distribution is limited to specific regions within the Pacific Ocean.",
    "distribution_introduced_art_desc": "Abutilon mangarevicum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive fuzzy leaves and showy flowers. The plant has since become naturalized in certain regions, particularly in the North Island. It is often found in coastal areas and disturbed habitats. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
