{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon venosum",
    "plant_slug": "abutilon-venosum",
    "plant_name_scientific": "abutilon venosum",
    "intro": "Abutilon venosum, commonly known as the velvetleaf abutilon, is a flowering plant native to the Americas. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its hairy, velvety leaves. The leaves are typically heart-shaped with a prominent central vein, and they are often green with a slightly fuzzy texture. Its flowers are yellow or orange, clustered in loose inflorescences, and bloom in the summer months. The plant is adapted to a variety of soil types and is often found in disturbed areas, such as roadsides and fields.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon venosum"
    },
    "taxonomy_art_desc": "Abutilon venosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Malvales, which includes plants known for their showy flowers and often includes species with specialized structures like hirsute leaves. Its family is Malvaceae, commonly known as the mallow family, which is characterized by their sympetalous flowers and cotton-like fibers in some species. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" which are typically shrubs with hairy leaves and showy flowers. Its species is Abutilon venosum, a specific type within the genus Abutilon that is recognized for its distinctive venation patterns and is often found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil South",
        "Brazil Southeast"
    ],
    "distribution_introduced": [
        "Gulf of Guinea Is."
    ],
    "distribution_native_art_desc": "Abutilon venosum is primarily native to Brazil South and Brazil Southeast. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in moist, well-drained soils and is often associated with forest understories. Its distribution includes parts of the Atlantic Forest biome. The species is well adapted to the warm and humid climate of these regions.",
    "distribution_introduced_art_desc": "Abutilon venosum was mainly introduced to the Gulf of Guinea Islands. It is commonly found in coastal areas and disturbed habitats. This plant is often associated with human activities such as agriculture and land development. It has become naturalized in several regions of the archipelago. Its introduction has raised concerns due to its potential invasive tendencies."
}
