{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon oxycarpum var. oxycarpum",
    "plant_slug": "abutilon-oxycarpum-var-oxycarpum",
    "plant_name_scientific": "abutilon oxycarpum var. oxycarpum",
    "intro": "Abutilon oxycarpum var. oxycarpum, commonly known as the velvetleaf abutilon, is a perennial shrub native to tropical regions of the Americas. It is characterized by its soft, hairy leaves that are typically ovate to elliptic in shape. The plant produces showy, lantern-shaped flowers in shades of yellow, orange, or red, which bloom in late summer to early autumn. Its fruits are small, round capsules that split open to release seeds. The plant is often grown as an ornamental due to its attractive foliage and vibrant floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon oxycarpum"
    },
    "taxonomy_art_desc": "Abutilon oxycarpum var. oxycarpum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and vascular tissue. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their floral structures and fibrous tissues. Its family is Malvaceae, commonly known as the mallow family, which includes plants with capsule fruits and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their ornamental flowers and fibrous bark. Its species is Abutilon oxycarpum, a specific type within the genus Abutilon, known for its distinctive fruiting structures and ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [
        "New Caledonia"
    ],
    "distribution_native_art_desc": "Abutilon oxycarpum var. oxycarpum is primarily native to New South Wales, Northern Territory, Queensland, South Australia, Victoria, and Western Australia. This plant is commonly found in arid and semi-arid regions across these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The species is well adapted to the climatic conditions of the Australian interior. It plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native range.",
    "distribution_introduced_art_desc": "Abutilon oxycarpum var. oxycarpum was mainly introduced to New Caledonia. It is a variant of the species Abutilon oxycarpum, which is native to South America. The introduction of this plant to New Caledonia likely occurred through human activity, such as horticultural trade or accidental transport. It has since become established in the region, adapting to the local climate and ecosystems. This plant is now considered an introduced species in New Caledonia, contributing to the area's botanical diversity."
}
