{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon planiflorum",
    "plant_slug": "abutilon-planiflorum",
    "plant_name_scientific": "abutilon planiflorum",
    "intro": "Abutilon planiflorum, commonly known as the velvetleaf abutilon, is a shrub native to the Americas. It is characterized by its soft, fuzzy leaves and clusters of yellow flowers that bloom in the summer. The plant has a hairy stem and heart-shaped leaves that are often covered in fine, velvety hairs. It thrives in warm, humid climates and is often found in disturbed soils. Abutilon planiflorum is valued for its ornamental qualities and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon planiflorum is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in moist, well-drained soils and is often found near rivers, swamps, or in forested areas. It is also present in parts of the Philippines and northern Australia. Its native distribution is closely associated with humid climates and is often used in traditional medicine and ornamental horticulture.",
    "distribution_introduced_art_desc": "Abutilon planiflorum was mainly introduced to Hawaii, where it has become an invasive species. It was initially brought there for ornamental purposes due to its attractive foliage and flowers. However, it has since spread rapidly, outcompeting native plants and altering local ecosystems. The plant thrives in disturbed areas and can form dense stands that reduce biodiversity. Efforts are ongoing to control its spread and mitigate its impact on native habitats."
}
