{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon brenesii",
    "plant_slug": "abutilon-brenesii",
    "plant_name_scientific": "abutilon brenesii",
    "intro": "Abutilon brenesii, commonly known as the Mexican velvetleaf, is a flowering plant native to Central America and parts of the Caribbean. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its heart-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It is often found in moist, tropical environments and can thrive in partial shade. Abutilon brenesii is also valued for its ornamental appeal and is sometimes cultivated in gardens for its aesthetic qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon brenesii is primarily native to Central America, including countries such as Costa Rica, Panama, and parts of Mexico. It is commonly found in tropical and subtropical regions, particularly in lowland areas with moist, well-drained soils. This species thrives in humid environments and is often associated with secondary growth forests and disturbed habitats. It is also known to occur in the Caribbean islands, such as the Greater Antilles. Its natural range extends into parts of northern South America, including Ecuador and Colombia.",
    "distribution_introduced_art_desc": "Abutilon brenesii was mainly introduced to the Hawaiian Islands. It is considered an invasive species in the region due to its rapid growth and ability to outcompete native vegetation. The plant thrives in disturbed areas such as roadsides, vacant lots, and coastal regions. Its introduction has led to ecological concerns as it alters habitat structure and reduces biodiversity. Efforts are being made to control its spread through manual removal and herbicide application."
}
