{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon venosum var. lanatum",
    "plant_slug": "abutilon-venosum-var-lanatum",
    "plant_name_scientific": "abutilon venosum var. lanatum",
    "intro": "Abutilon venosum var. lanatum, commonly known as the woolly abutilon, is a species of flowering plant in the mallow family. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. Native to South America, this plant thrives in warm, humid climates and is often cultivated as an ornamental. It prefers well-drained soil and partial to full sunlight. The plant is also valued for its ability to attract pollinators such as bees and butterflies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon venosum var. lanatum is primarily native to the southern United States, particularly Texas, New Mexico, and Arizona. It thrives in arid and semi-arid regions, often found in rocky soils and along dry streambeds. This variant is adapted to hot, dry climates and can tolerate periods of drought. It is commonly seen in desert scrub and grassland habitats. Its native range extends into parts of northern Mexico as well.",
    "distribution_introduced_art_desc": "Abutilon venosum var. lanatum was mainly introduced to ornamental horticulture and landscaping due to its unique, fuzzy appearance and adaptability to various growing conditions. It is commonly cultivated in tropical and subtropical regions for its aesthetic value and ability to thrive in both container and in-ground settings. The plant is often used in gardens, as a houseplant, and in public landscapes for its ornamental appeal. Its introduction has led to its establishment in some non-native areas, raising concerns about its potential invasiveness. Despite its popularity, it is generally considered a non-native species with limited ecological impact in most regions."
}
