{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon incanum subsp. pringlei",
    "plant_slug": "abutilon-incanum-subsp-pringlei",
    "plant_name_scientific": "abutilon incanum subsp. pringlei",
    "intro": "Abutilon incanum subsp. pringlei, commonly known as the Pringle's velvetleaf, is a flowering plant native to parts of South America. It is characterized by its soft, hairy leaves and showy, lantern-shaped flowers that typically bloom in shades of yellow or orange. The plant thrives in warm, humid climates and is often found in disturbed habitats such as roadsides and forest edges. Its hairy foliage and unique floral structure make it a distinctive species within the Malvaceae family. It is also valued in horticulture for its ornamental qualities and adaptability to various soil types.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon incanum subsp. pringlei is primarily native to southern South America, specifically Argentina and Chile. It is found in the Andean region, particularly in the provinces of Neuquén and Río Negro in Argentina, as well as in the coastal areas of southern Chile. This species grows in dry, rocky habitats and is often found in shrublands and grasslands. It is adapted to the temperate and semi-arid climates of its native range. Due to its restricted distribution, it is considered a rare and endemic plant in these regions.",
    "distribution_introduced_art_desc": "Abutilon incanum subsp. pringlei was mainly introduced to the United States, particularly in the southwestern regions. It has been found in states such as Texas, New Mexico, and Arizona. This plant is commonly found in disturbed areas, including roadsides and abandoned fields. It is considered an invasive species in some areas due to its rapid growth and ability to spread easily. Its introduction has raised concerns among conservationists due to its potential impact on native plant communities."
}
