{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon periplocifolium var. zeylanicum",
    "plant_slug": "abutilon-periplocifolium-var-zeylanicum",
    "plant_name_scientific": "abutilon periplocifolium var. zeylanicum",
    "intro": "Abutilon periplocifolium var. zeylanicum, commonly known as the Indian mallow, is a shrub native to the Indian subcontinent. It features heart-shaped, velvety leaves that are often tinged with red or purple on the underside. The plant produces yellow flowers that are clustered in dense, panicle-like inflorescences. Its fibrous stems are valued for their use in traditional textiles and papermaking. Botanically, it belongs to the Malvaceae family, which includes other plants like cotton and hibiscus.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon periplocifolium var. zeylanicum is primarily native to southern India, particularly the states of Tamil Nadu, Kerala, and parts of the Andaman Islands. It thrives in tropical and subtropical climates, often found in moist, shaded areas such as forests and along riverbanks. This species is commonly associated with coastal regions and is adapted to sandy or loamy soils. It is also found in Sri Lanka and parts of Southeast Asia, including the Maldives. The plant is known for its ornamental value and is sometimes cultivated for its hairy, maple-like leaves and showy flowers.",
    "distribution_introduced_art_desc": "Abutilon periplocifolium var. zeylanicum was mainly introduced to ornamental horticulture and traditional medicine practices. It is valued for its attractive, velvety foliage and its potential medicinal properties. The plant has been cultivated in various regions with warm climates, including parts of Southeast Asia and the Pacific Islands. Its introduction has sometimes led to its establishment in natural habitats, raising concerns about its invasive potential. Despite its ornamental appeal, it requires careful management to prevent ecological disruption."
}
