{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon matopense",
    "plant_slug": "abutilon-matopense",
    "plant_name_scientific": "abutilon matopense",
    "intro": "Abutilon matopense, commonly known as the Matopensé abutilon, is a flowering plant native to South America, particularly Brazil. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers that range in color from yellow to red. It thrives in tropical and subtropical climates and is often cultivated for its ornamental value. Abutilon matopense is also used in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon matopense is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is found in countries such as Cuba, Jamaica, Hispaniola, and Puerto Rico. This plant typically grows in tropical and subtropical environments, often in coastal areas or near freshwater sources. It thrives in humid climates with well-drained soils. Abutilon matopense is commonly found in dry forests, woodlands, and along riverbanks.",
    "distribution_introduced_art_desc": "Abutilon matopense was mainly introduced to the Greater Antilles, particularly in Cuba, Hispaniola, and Jamaica, as part of ornamental horticulture. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. The plant has adapted well to the tropical and subtropical climates of these regions. Its rapid growth and ability to thrive in poor soils have contributed to its spread. However, it is not considered invasive in these areas and is primarily cultivated for its ornamental value."
}
