{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cryptopetalum",
    "plant_slug": "abutilon-cryptopetalum",
    "plant_name_scientific": "abutilon cryptopetalum",
    "intro": "Abutilon cryptopetalum, commonly known as the narrow-leaved abutilon, is a flowering plant native to Central America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its narrow, lance-shaped leaves and showy, bell-shaped yellow flowers that bloom in clusters. It typically grows in moist, shaded environments such as forest understories. Abutilon cryptopetalum is often cultivated for its ornamental value due to its attractive foliage and vibrant floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon cryptopetalum"
    },
    "taxonomy_art_desc": "Abutilon cryptopetalum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging lineages with a wide range of morphological diversity. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants with capsule fruits and often hairy stems and leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"Chinese lanterns\" or \"velvetleaf,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon cryptopetalum, a specific type within the genus Abutilon, distinguished by its unique floral structure and growth characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cryptopetalum is primarily native to New South Wales, Northern Territory, Queensland, South Australia, and Western Australia. This species is found in various regions across these states, typically in arid and semi-arid environments. It thrives in sandy or rocky soils and is often found in shrublands and open woodlands. The plant is well adapted to the harsh climatic conditions of these areas. Its native distribution highlights its ecological significance in the Australian landscape.",
    "distribution_introduced_art_desc": "Abutilon cryptopetalum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in disturbed areas such as roadsides, waste grounds, and along stream banks. This plant has adapted well to moist, shady environments and can thrive in a variety of soil types. It is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded beyond its original range, posing ecological challenges in certain ecosystems."
}
