{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon spinifex",
    "plant_slug": "abutilon-spinifex",
    "plant_name_scientific": "abutilon spinifex",
    "intro": "Abutilon spinifex, commonly known as the spiny abutilon, is a species of flowering plant in the mallow family, Malvaceae. It is native to South America, particularly Argentina and Chile, and thrives in arid and semi-arid environments. The plant is characterized by its hairy, spiny stems and heart-shaped leaves that are often covered in fine, soft hairs. Its flowers are typically yellow or orange, with five petals and stamens that are prominent and showy. Abutilon spinifex is often used in xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon spinifex is primarily native to the Mediterranean region, including parts of southern Europe, northern Africa, and the Middle East. It thrives in dry, rocky habitats and is commonly found in coastal areas and open woodlands. This plant is well adapted to arid and semi-arid climates, often growing in regions with mild winters and hot, dry summers. It is also occasionally found in cultivated areas where it can spread as a weed. Its native range includes countries such as Spain, Italy, Morocco, and Israel.",
    "distribution_introduced_art_desc": "Abutilon spinifex was mainly introduced to New Zealand. It is commonly found in coastal areas and disturbed sites. The plant has become naturalized in various regions of the country. It is considered a weed in some parts of New Zealand due to its invasive growth habit. Its distribution is largely limited to the northern and eastern parts of the country."
}
