{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon bracteosum",
    "plant_slug": "abutilon-bracteosum",
    "plant_name_scientific": "abutilon bracteosum",
    "intro": "Abutilon bracteosum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its broad, heart-shaped leaves that are often covered in fine, soft hairs, giving it a velvety texture. The plant produces clusters of small, yellowish-green flowers that bloom in late summer. It is a shrub or small tree that can grow up to several meters in height. Abutilon bracteosum is often found in moist, well-drained soils and is adapted to warm, humid climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon bracteosum"
    },
    "taxonomy_art_desc": "Abutilon bracteosum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true root system and vascular tissue. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Malvales, which includes plants with showy flowers and often includes species with specialized seed dispersal mechanisms. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton and hibiscus, characterized by their sympetalous flowers and fibrous fruits. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their woolly leaves and showy flowers. Its species is Abutilon bracteosum, a specific type within the genus Abutilon, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon bracteosum is primarily native to Mexico Southeast, Mexico Southwest, and Nicaragua. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in warm, humid climates with well-drained soil. Abutilon bracteosum is often seen growing in open woodlands and along riverbanks. Its native distribution highlights its adaptability to diverse ecological conditions in Central America.",
    "distribution_introduced_art_desc": "Abutilon bracteosum was mainly introduced to areas with warm, humid climates and well-drained soils, often in disturbed habitats such as roadsides and abandoned fields. It is commonly found in regions of the southern United States, including Texas, Florida, and parts of California. This plant thrives in full sun to partial shade and is known for its showy, lantern-shaped flowers. It has been reported as an invasive species in some areas due to its rapid growth and ability to spread through seeds. Its introduction has raised concerns among land managers due to its potential to outcompete native vegetation."
}
