{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon glaucum",
    "plant_slug": "abutilon-glaucum",
    "plant_name_scientific": "abutilon glaucum",
    "intro": "Abutilon glaucum, commonly known as the velvetleaf or woolly abutilon, is a flowering plant native to the Americas. It is characterized by its fuzzy, gray-green foliage and showy, lantern-shaped flowers that range in color from yellow to orange. The plant thrives in warm, humid climates and is often found in tropical and subtropical regions. Its hairy leaves and branched stems contribute to its distinctive appearance. Abutilon glaucum is often cultivated as an ornamental plant due to its aesthetic appeal and adaptability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon glaucum is primarily native to the Mediterranean region, including parts of southern Europe, North Africa, and western Asia. It thrives in coastal areas and rocky soils, often found in regions with a temperate climate. This plant is commonly associated with coastal dunes and scrublands, where it adapts well to salty and well-drained conditions. It is also found in parts of the Middle East and the Canary Islands. Its natural range extends into some areas of southern France and northern Spain.",
    "distribution_introduced_art_desc": "Abutilon glaucum was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and showy flowers. It was first brought to the country in the 19th century by European settlers who admired its aesthetic value. Despite its ornamental appeal, it has since become an invasive species in certain regions of New Zealand, outcompeting native vegetation. The plant thrives in a variety of soil types and can grow in both full sun and partial shade, contributing to its rapid spread. Efforts are ongoing to control its population to protect local ecosystems from its negative impacts."
}
