{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon buchii",
    "plant_slug": "abutilon-buchii",
    "plant_name_scientific": "abutilon buchii",
    "intro": "Abutilon buchii, commonly known as the velvetleaf abutilon, is a tropical shrub native to Central and South America. It is characterized by its soft, fuzzy leaves that give it a distinctive velvety appearance. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often attracting pollinators like bees and butterflies. It thrives in warm, humid climates and is often grown as an ornamental plant. Its rapid growth and adaptability make it suitable for use in tropical gardens and as a ground cover.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon buchii"
    },
    "taxonomy_art_desc": "Abutilon buchii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants with showy flowers and often includes species with specialized seed pods. Its family is Malvaceae, commonly known as the mallow family, characterized by their cotton-like fibers and showy, often five-petaled flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" known for their fuzzy leaves and distinctive seed pods. Its species is Abutilon buchii, a specific type within the genus Abutilon, distinguished by its unique morphological features and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Cuba",
        "Dominican Republic",
        "Haiti"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon buchii is primarily native to Cuba, the Dominican Republic, and Haiti. This species is found in the tropical regions of these Caribbean islands. It typically grows in coastal areas and disturbed habitats. The plant is well adapted to the warm, humid climate of its native range. It is commonly seen in open woodlands and along riverbanks in these regions.",
    "distribution_introduced_art_desc": "Abutilon buchii was mainly introduced to areas with warm, humid climates, particularly in tropical and subtropical regions. It thrives in well-drained soil and full sun to partial shade conditions. This plant is commonly found in coastal areas and disturbed sites due to its adaptability. It has been introduced to several countries in the Pacific, including Hawaii and parts of Southeast Asia. Its rapid growth and ornamental value have made it a popular choice for landscaping, though it can become invasive in some environments."
}
