{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon cinctum",
    "plant_slug": "abutilon-cinctum",
    "plant_name_scientific": "abutilon cinctum",
    "intro": "Abutilon cinctum, commonly known as the velvetleaf or Indian mallow, is a flowering plant native to tropical regions of the Americas. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its velvety, hairy leaves that give it a distinctive texture. The plant produces showy, lantern-shaped flowers that range in color from yellow to red, often with a prominent central tube. Its capsules contain numerous small, flat, kidney-shaped seeds, which are dispersed by wind. Abutilon cinctum is adapted to thrive in warm, humid climates and is often found in disturbed soils or along riverbanks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon cinctum is primarily native to the Caribbean, Central America, and northern South America. It is commonly found in regions such as Mexico, Guatemala, Belize, Honduras, and parts of the Amazon basin. This plant typically grows in tropical and subtropical environments, often in coastal areas or along riverbanks. It thrives in well-drained soils and is often seen in disturbed habitats or secondary forests. Its native range includes countries across the eastern and southern parts of the New World.",
    "distribution_introduced_art_desc": "Abutilon cinctum was mainly introduced to ornamental horticulture and landscaping due to its attractive, lantern-shaped flowers and bushy growth habit. It is commonly cultivated in tropical and subtropical regions as a decorative plant. The species has been reported in several countries, including parts of the United States, Australia, and Southeast Asia. Its introduction has sometimes led to local invasions in non-native habitats, raising concerns about its ecological impact. Despite its aesthetic appeal, proper management is necessary to prevent its spread in natural ecosystems."
}
