{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon haitiense",
    "plant_slug": "abutilon-haitiense",
    "plant_name_scientific": "abutilon haitiense",
    "intro": "Abutilon haitiense, commonly known as the Haitian abutilon, is a flowering plant native to the Caribbean, particularly Haiti. It is a shrub or small tree that can grow up to 3 meters in height, characterized by its soft, hairy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in clusters, often attracting pollinators such as bees and butterflies. Its fruit is a three-lobed capsule that splits open to release seeds, contributing to its propagation in suitable habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon haitiense"
    },
    "taxonomy_art_desc": "Abutilon haitiense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, which consists of flowering plants that typically have showy flowers and are often found in tropical and subtropical regions. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon haitiense, a specific type of plant native to Haiti, known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Dominican Republic",
        "Haiti"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon haitiense is primarily native to the Dominican Republic and Haiti. This species is commonly found in the tropical regions of these two Caribbean nations. It thrives in humid, warm climates with well-drained soil. The plant is often seen growing in coastal areas and along riverbanks. Its native distribution is limited to these specific geographic locations.",
    "distribution_introduced_art_desc": "Abutilon haitiense was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive, lantern-shaped flowers. It is commonly cultivated in gardens and landscapes for its showy blooms and unique foliage. The plant thrives in warm climates with well-drained soil and full sun exposure. It has been reported in several countries, including parts of the United States, Australia, and Southeast Asia. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
