{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon peruvianum",
    "plant_slug": "abutilon-peruvianum",
    "plant_name_scientific": "abutilon peruvianum",
    "intro": "Abutilon peruvianum, commonly known as the velvetleaf or Peruvian abutilon, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 5 meters tall, characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in clusters, often attracting pollinators like bees and butterflies. Its leaves are typically heart-shaped and have a velvety texture, which contributes to its common name. The plant is adapted to grow in a variety of soil types and is often found in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon peruvianum is primarily native to South America, particularly in countries such as Peru, Bolivia, and Ecuador. It is commonly found in tropical and subtropical regions, often growing in dry to moist areas. This plant thrives in open habitats like shrublands, grasslands, and disturbed soils. It is also present in parts of Central America and the Caribbean. Abutilon peruvianum is well adapted to varying environmental conditions, making it a resilient species in its native range.",
    "distribution_introduced_art_desc": "Abutilon peruvianum was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and tolerance to coastal conditions. It has since become naturalized in certain areas, particularly along the coastlines of the North Island. The plant is known for its ability to thrive in sandy soils and withstand salt spray, which contributes to its spread in coastal environments. Although it is not considered a major invasive species, it can form dense stands in disturbed areas. Its distribution in New Zealand is largely restricted to the northern and western regions where the climate is most suitable."
}
