{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon aurantiacum",
    "plant_slug": "abutilon-aurantiacum",
    "plant_name_scientific": "abutilon aurantiacum",
    "intro": "Abutilon aurantiacum, commonly known as the scarlet globe abutilon, is a flowering plant native to Mexico. It is a shrub or small tree that typically grows to a height of 1–3 meters. The plant is characterized by its velvety, heart-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to orange-red. It blooms from summer to fall and is often cultivated for its ornamental value. The fruit is a dry capsule that splits open to release small, hairy seeds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon aurantiacum is primarily native to Central America, including countries such as Guatemala, Honduras, and El Salvador. It is also found in parts of northern South America, particularly in regions of Venezuela and Colombia. This species thrives in tropical and subtropical climates, often growing in moist, well-drained soils. It is commonly found in lowland areas, especially near rivers and in forested regions. Abutilon aurantiacum is known for its vibrant yellow flowers and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Abutilon aurantiacum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, disturbed habitats such as roadsides, riverbanks, and forest edges. This plant is considered an invasive species due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states including Oregon, Washington, and California. Its spread is often facilitated by human activities and seed dispersal through wind and water."
}
