{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon dianthum",
    "plant_slug": "abutilon-dianthum",
    "plant_name_scientific": "abutilon dianthum",
    "intro": "Abutilon dianthum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its broad, velvety leaves and clusters of small, yellowish-white flowers. The plant typically grows as an annual or perennial herb, often reaching heights of up to 2 meters. Its fibrous roots and hairy stems are adaptations to its warm, humid environments. Abutilon dianthum is often found in disturbed soils and is sometimes considered a weed in agricultural settings.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon dianthum is primarily native to the tropical and subtropical regions of South America, particularly in countries such as Brazil, Argentina, and Paraguay. It thrives in moist, shaded environments within the Atlantic Forest and other dense tropical habitats. This plant is commonly found in areas with high humidity and well-drained soil, often growing along riverbanks and in forest understories. Its distribution is also extended to parts of Central America, where it adapts to similar climatic conditions. Abutilon dianthum is a valuable species for both ecological and horticultural purposes in its native range.",
    "distribution_introduced_art_desc": "Abutilon dianthum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and flowers. The plant has since become naturalized in certain regions, particularly in coastal areas. It is now considered a weed in some parts of the country. Its spread has raised concerns due to its potential impact on native ecosystems."
}
