{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon indicum subsp. albescens",
    "plant_slug": "abutilon-indicum-subsp-albescens",
    "plant_name_scientific": "abutilon indicum subsp. albescens",
    "intro": "Abutilon indicum subsp. albescens, commonly known as the white-velvet abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its soft, hairy foliage and clusters of pale yellow to white flowers. The plant typically grows as an annual or perennial shrub, reaching heights of up to 1.5 meters. Its leaves are palmately lobed, and the flowers are often borne in dense, showy inflorescences. It thrives in well-drained soil and full sun, making it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon indicum"
    },
    "taxonomy_art_desc": "Abutilon indicum subsp. albescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse morphological adaptations. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their primitive floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, characterized by their showy flowers and often hairy stems. Its family is Malvaceae, commonly known as the mallow family, which includes a wide range of plants with showy flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as Chinese lanterns or velvetleaf, characterized by their fuzzy leaves and showy, lantern-shaped flowers. Its species is Abutilon indicum, a specific type of plant within the genus Abutilon, known for its distinctive appearance and often used in ornamental gardening.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Nansei-shoto",
        "Northern Territory",
        "Queensland",
        "Sulawesi",
        "Western Australia"
    ],
    "distribution_introduced": [
        "Gilbert Is.",
        "Line Is.",
        "Marianas",
        "Tokelau-Manihiki",
        "Tuamotu",
        "Wake I."
    ],
    "distribution_native_art_desc": "Abutilon indicum subsp. albescens is primarily native to the Nansei-shoto, Northern Territory, Queensland, Sulawesi, and Western Australia. This species is commonly found in coastal and tropical regions across these areas. It thrives in sandy soils and is often associated with coastal dunes and scrublands. The plant is well adapted to the arid and semi-arid climates of its native range. It plays an important ecological role in stabilizing coastal environments and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Abutilon indicum subsp. albescens was mainly introduced to Gilbert Is., Line Is., Marianas, Tokelau-Manihiki, Tuamotu, and Wake I. It is a non-native species that has established populations in these remote island regions. The introduction likely occurred through human activity, such as shipping or intentional planting. It thrives in coastal and disturbed habitats, often outcompeting native vegetation. Its presence in these areas raises concerns about its impact on local ecosystems and biodiversity."
}
