{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pedrae-brancae",
    "plant_slug": "abutilon-pedrae-brancae",
    "plant_name_scientific": "abutilon pedrae-brancae",
    "intro": "Abutilon pedrae-brancae, commonly known as the Pedra Branca abutilon, is a shrub native to Brazil. It belongs to the Malvaceae family, which includes hibiscus and cotton plants. The plant is characterized by its hairy stems and heart-shaped leaves with serrated edges. It produces showy yellow flowers that bloom in clusters, attracting pollinators such as bees and butterflies. Due to its ornamental value and limited distribution, it is considered a rare and potentially endangered species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon pedrae-brancae"
    },
    "taxonomy_art_desc": "Abutilon pedrae-brancae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Malvales, which consists of flowering plants with showy flowers and often includes plants with specialized seed structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon pedrae-brancae, a specific type of Abutilon that is native to Brazil and is known for its unique characteristics and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pedrae-brancae is primarily native to Brazil Southeast. This plant is found in the coastal regions of the state of Espírito Santo. It thrives in sandy soils along the Atlantic Forest biome. It is commonly observed in areas with mild temperatures and moderate rainfall. Its natural habitat includes dunes and rocky outcrops near the coast.",
    "distribution_introduced_art_desc": "Abutilon pedrae-brancae was mainly introduced to areas with disturbed soils and human-modified landscapes, such as roadsides, agricultural fields, and urban environments. It thrives in regions with warm, temperate climates and moderate to high rainfall. This species is often found in coastal and inland regions where it can establish itself quickly in open, sunny areas. Its adaptability to different soil types and ability to tolerate environmental stress contribute to its successful spread. It is considered an invasive species in some regions due to its competitive growth and potential to alter local ecosystems."
}
