{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mitchellii",
    "plant_slug": "abutilon-mitchellii",
    "plant_name_scientific": "abutilon mitchellii",
    "intro": "Abutilon mitchellii, commonly known as the velvetleaf abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is a shrub or small tree that can grow up to 6 meters tall, characterized by its fuzzy, velvety leaves that give it its common name. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, typically blooming in the spring and summer. It thrives in well-drained soils and full sun, making it a popular choice for ornamental gardens. Its adaptability and striking appearance make it a valuable addition to xeriscaped landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon mitchellii"
    },
    "taxonomy_art_desc": "Abutilon mitchellii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a true root system and vascular tissue. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Malvales, which consists of flowering plants with a distinctive structure in their flowers and often includes plants with cotton-like fibers. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and often has cotton or okra as members. Its genus is Abutilon, a group of flowering plants commonly known as \"Chinese lanterns\" due to their distinctive seed pods. Its species is Abutilon mitchellii, a specific type of Abutilon known for its ornamental value and unique foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon mitchellii is primarily native to Queensland and Western Australia. It is commonly found in arid and semi-arid regions within these states. This plant typically grows in sandy or rocky soils, often in open woodlands or shrublands. It is well adapted to the dry climate and can thrive with minimal water. Its distribution is largely restricted to the specific ecological zones of Queensland and Western Australia.",
    "distribution_introduced_art_desc": "Abutilon mitchellii was mainly introduced to the United States as an ornamental plant due to its attractive, lantern-like flowers and its ability to thrive in various climates. It is commonly found in gardens and along roadsides in southern states such as Texas, California, and Florida. This plant has also been reported in some regions of Hawaii and parts of the Pacific Islands where it has become naturalized. Its introduction has led to concerns about its potential to spread into native ecosystems. Despite its ornamental value, its invasive tendencies require careful management in certain areas."
}
