{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon calliphyllum",
    "plant_slug": "abutilon-calliphyllum",
    "plant_name_scientific": "abutilon calliphyllum",
    "intro": "Abutilon calliphyllum, commonly known as the silky abutilon, is a perennial shrub native to the eastern United States. It is characterized by its soft, hairy leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant typically grows in moist, well-drained soils and thrives in partial to full sun. It is often found in woodlands and along stream banks, where it contributes to the local biodiversity. The silky abutilon is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and flowers.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon calliphyllum"
    },
    "taxonomy_art_desc": "Abutilon calliphyllum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female reproductive structures. Its order is Malvales, which includes plants with showy flowers and often includes species with specialized floral structures. Its family is Malvaceae, commonly known as the mallow family, which includes plants with velvety leaves and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and lantern-shaped seed pods. Its species is Abutilon calliphyllum, a specific type of plant within the genus Abutilon, distinguished by its unique morphological features and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon calliphyllum is primarily native to New South Wales and Queensland in Australia. This species is commonly found in coastal and inland areas, particularly in regions with sandy or loamy soils. It thrives in warm, temperate climates and is often associated with open woodlands and heathlands. The plant is well adapted to the environmental conditions of these regions, including seasonal rainfall patterns. Its native distribution reflects its ecological preferences and historical range across eastern Australia.",
    "distribution_introduced_art_desc": "Abutilon calliphyllum was mainly introduced to the Pacific Northwest region of the United States. It is commonly found in moist, shady areas such as woodlands and along stream banks. This plant is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states including Oregon, Washington, and California. Its introduction is often associated with human activities such as landscaping and accidental seed dispersal."
}
