{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon lineatum",
    "plant_slug": "abutilon-lineatum",
    "plant_name_scientific": "abutilon lineatum",
    "intro": "Abutilon lineatum, commonly known as the Chinese lantern plant, is a flowering plant in the mallow family. It is native to Southeast Asia and is characterized by its velvety, hairy leaves and showy, lantern-shaped flowers. The plant typically grows as an upright shrub or small tree, reaching heights of up to 10 feet. Its flowers, which range in color from orange to red, bloom in late summer and early fall. Abutilon lineatum is often cultivated for its ornamental value and is relatively easy to grow in well-drained soil and full sun.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon lineatum"
    },
    "taxonomy_art_desc": "Abutilon lineatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants like cotton and hibiscus, known for their showy flowers and fruit types. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and a variety of fruit types such as capsules. Its genus is Abutilon, a group of flowering plants commonly known as the Chinese lanterns or velvetleafs, characterized by their fuzzy leaves and showy flowers. Its species is Abutilon lineatum, a specific type of Abutilon known for its distinctive leaf shape and is often cultivated for ornamental purposes.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon lineatum is primarily native to Brazil Southeast. It is found in the coastal regions of the southeastern part of Brazil. This plant thrives in tropical and subtropical climates. It is commonly found in areas with well-drained soils and partial shade. Its native distribution is limited to this specific region in Brazil.",
    "distribution_introduced_art_desc": "Abutilon lineatum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-like flowers. It was brought there during the 19th century by European settlers and horticulturists who admired its unique appearance. Despite its ornamental value, it has since become an invasive species in some areas, outcompeting native plants and altering local ecosystems. The plant thrives in tropical and subtropical climates, making it well-suited to the environment of the Pacific Islands. Its rapid growth and ability to spread through seeds have contributed to its widespread establishment in non-native regions."
}
