{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon pulverulentum",
    "plant_slug": "abutilon-pulverulentum",
    "plant_name_scientific": "abutilon pulverulentum",
    "intro": "Abutilon pulverulentum, commonly known as the dusty abutilon, is a flowering plant native to the arid regions of the southwestern United States and northern Mexico. It is a shrub or small tree that typically grows to a height of 1–3 meters, featuring hairy, grayish-green foliage that helps reduce water loss in its harsh environment. The plant produces showy, lantern-shaped yellow or orange flowers that bloom in late summer to early fall. Its leaves are palmately lobed and often covered in a fine, powdery coating, which gives it its common name. Abutilon pulverulentum is well adapted to drought conditions and is often used in xeriscaping due to its low water requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon pulverulentum is primarily native to the Caribbean, particularly the islands of Cuba, Hispaniola, and the Bahamas. It thrives in coastal areas and low-lying regions with sandy or limestone soils. This species is commonly found in dune environments and along the shores of tropical and subtropical regions. It is adapted to salt spray and can tolerate periodic flooding. Its native range is limited to these specific geographic areas within the Caribbean.",
    "distribution_introduced_art_desc": "Abutilon pulverulentum was mainly introduced to areas with disturbed soils and human-altered landscapes. It thrives in environments with moderate to high sunlight exposure. This plant is commonly found along roadsides, construction sites, and abandoned fields. Its rapid growth and ability to spread through seeds make it an invasive species in many regions. It competes with native vegetation, altering local ecosystems and reducing biodiversity."
}
