{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta heterophylla",
    "plant_slug": "abuta-heterophylla",
    "plant_name_scientific": "abuta heterophylla",
    "intro": "Abuta heterophylla, commonly known as the variable abuta, is a flowering plant native to the Andean regions of South America. It is characterized by its distinctive, palmate leaves that vary in shape and size depending on the plant's growth conditions. The plant produces small, greenish-yellow flowers that are clustered in dense inflorescences. It thrives in moist, shaded environments and is often found in cloud forests. Abuta heterophylla is valued for its ornamental appeal and has been used in traditional medicine for its potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta heterophylla is primarily native to the western Himalayas, including regions in northern India, Nepal, and Bhutan. It is commonly found in moist, temperate forests at elevations ranging from 1,500 to 3,000 meters. This plant thrives in shaded, humid environments and is often associated with mixed deciduous and coniferous forests. It is also occasionally found in parts of eastern Afghanistan and southwestern China. Due to its limited range, it is considered a rare and endemic species in these regions.",
    "distribution_introduced_art_desc": "Abuta heterophylla was mainly introduced to areas with specific soil and climate conditions that support its growth. It thrives in well-drained soils and temperate to subtropical climates. The plant is commonly found in regions with mild winters and warm summers. It has been introduced to several parts of the world, including North America and Europe, for ornamental and medicinal purposes. However, its spread is limited due to its specific environmental requirements."
}
