{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon insigne",
    "plant_slug": "abutilon-insigne",
    "plant_name_scientific": "abutilon insigne",
    "intro": "Abutilon insigne, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is characterized by its heart-shaped leaves and showy, lantern-shaped flowers that range in color from yellow to orange. The plant is often cultivated for its ornamental value due to its vibrant blooms and unique foliage. It thrives in warm, humid climates and is typically grown as an annual or tender perennial. Abutilon insigne is also valued in traditional medicine for its potential health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon insigne"
    },
    "taxonomy_art_desc": "Abutilon insigne belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their distinctive flowers and often hairy foliage. Its family is Malvaceae, commonly known as the mallow family, which includes plants with five-petaled flowers and capsule fruits. Its genus is Abutilon, a group of flowering plants commonly known as the \"velvetleaf\" or \"Chinese lantern\" plants, characterized by their hairy leaves and showy flowers. Its species is Abutilon insigne, a specific type of plant within the genus Abutilon, known for its ornamental value and unique floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon insigne is primarily native to Colombia and Venezuela. It is commonly found in tropical and subtropical regions within these countries. The plant typically grows in areas with warm climates and well-drained soils. It is often seen in open woodlands and along riverbanks. Its native distribution is limited to these specific geographic regions in South America.",
    "distribution_introduced_art_desc": "Abutilon insigne was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and showy flowers. It was first recorded in the 19th century and has since become naturalized in various regions of the country. The plant thrives in coastal and urban environments, often spreading through seed dispersal by wind and water. It is considered a potential weed in some areas due to its rapid growth and ability to colonize disturbed soils. Despite its aesthetic appeal, its invasive tendencies have raised concerns among conservationists."
}
