{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta chiapasensis",
    "plant_slug": "abuta-chiapasensis",
    "plant_name_scientific": "abuta chiapasensis",
    "intro": "Abuta chiapasensis, commonly known as the Chiapas abuta, is a flowering plant native to the tropical regions of Central America, particularly Mexico. It belongs to the family Euphorbiaceae and is characterized by its striking, palmate leaves and clusters of small, yellowish flowers. The plant typically grows in moist, shaded environments such as rainforests and mountainous regions. Its roots are often used in traditional medicine for their purported health benefits. Due to habitat loss and overharvesting, it is considered a vulnerable species in its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta chiapasensis"
    },
    "taxonomy_art_desc": "Abuta chiapasensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and primitive angiosperms, often with showy flowers and diverse leaf forms. Its order is Ranunculales, a group of flowering plants that includes families like Ranunculaceae, known for their diverse morphology and often toxic compounds. Its family is Menispermaceae, a family of flowering plants commonly known as the pipevine family, characterized by their climbing habits and distinctive leaf and fruit structures. Its genus is Abuta, a group of flowering plants native to tropical regions, typically with palmate leaves and fleshy fruits. Its species is Abuta chiapasensis, a specific plant species found in Central America, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Guatemala",
        "Mexico Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta chiapasensis is primarily native to Guatemala and the southeastern part of Mexico. This species is commonly found in tropical and subtropical regions within these areas. It thrives in humid, shaded environments, often in the understory of dense forests. The plant is particularly associated with regions that have rich biodiversity and diverse ecosystems. Its native distribution highlights its importance in the flora of Central America.",
    "distribution_introduced_art_desc": "Abuta chiapasensis was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained, sandy or loamy soils. It prefers full sun to partial shade and is commonly found in open woodlands and scrublands. This plant is known for its medicinal properties and has been used in traditional medicine for various health benefits. Its introduction has been primarily for horticultural and pharmaceutical purposes. However, it is not commonly cultivated in large-scale agricultural systems."
}
