{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon angulatum var. angulatum",
    "plant_slug": "abutilon-angulatum-var-angulatum",
    "plant_name_scientific": "abutilon angulatum var. angulatum",
    "intro": "Abutilon angulatum var. angulatum, commonly known as the angular abutilon, is a flowering plant native to South America. It is a shrub or small tree that typically grows to a height of 2–5 meters. The plant features palmate leaves with three to five lobes, and it produces showy, lantern-shaped flowers in shades of yellow, orange, or red. It thrives in full sun to partial shade and prefers well-drained soil. The plant is often cultivated for its ornamental value and is relatively drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon angulatum"
    },
    "taxonomy_art_desc": "Abutilon angulatum var. angulatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Malvales, which includes plants such as cotton and hibiscus, known for their showy flowers and often hairy leaves. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and a wide variety of growth forms. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon angulatum, a specific type within the genus Abutilon, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Angola",
        "Botswana",
        "Burundi",
        "Cameroon",
        "Chad",
        "DR Congo",
        "Eritrea",
        "Ethiopia",
        "Gambia",
        "Kenya",
        "KwaZulu-Natal",
        "Malawi",
        "Mali",
        "Mauritania",
        "Mozambique",
        "Namibia",
        "Nigeria",
        "Northern Provinces",
        "Rwanda",
        "Senegal",
        "Somalia",
        "Sudan-South Sudan",
        "Tanzania",
        "Uganda",
        "Zambia",
        "Zimbabwe"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon angulatum var. angulatum is primarily native to Angola, Botswana, Burundi, Cameroon, Chad, DR Congo, Eritrea, Ethiopia, Gambia, Kenya, KwaZulu-Natal, Malawi, Mali, Mauritania, Mozambique, Namibia, Nigeria, Northern Provinces, Rwanda, Senegal, Somalia, Sudan-South Sudan, Tanzania, Uganda, Zambia, and Zimbabwe. It is commonly found in tropical and subtropical regions across these countries. The plant thrives in open woodlands, savannas, and along riverbanks. It is often seen growing in well-drained soils with ample sunlight. Its native distribution spans much of sub-Saharan Africa, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon angulatum var. angulatum was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, fields, and along streambanks. This plant thrives in full sun to partial shade and prefers well-drained soils. It is often considered an invasive species due to its rapid growth and ability to spread through seeds. Its presence can outcompete native vegetation, altering local ecosystems."
}
