{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon inaequilaterum",
    "plant_slug": "abutilon-inaequilaterum",
    "plant_name_scientific": "abutilon inaequilaterum",
    "intro": "Abutilon inaequilaterum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its fuzzy, velvety leaves and showy, trumpet-shaped flowers that range in color from yellow to red. It thrives in warm climates and is often cultivated as an ornamental plant due to its attractive foliage and blooms. Abutilon inaequilaterum prefers well-drained soil and full sun to partial shade.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon inaequilaterum"
    },
    "taxonomy_art_desc": "Abutilon inaequilaterum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their diverse floral structures and complex reproductive systems. Its order is Malvales, which includes plants with showy flowers and often includes species with cotton-like seeds. Its family is Malvaceae, commonly known as the mallow family, which includes plants such as cotton, okra, and hibiscus. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their fuzzy leaves and showy flowers. Its species is Abutilon inaequilaterum, a specific type of velvetleaf known for its distinctive appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon inaequilaterum is primarily native to Brazil Southeast. This species is found in the southeastern region of Brazil, where it thrives in tropical and subtropical climates. It is commonly associated with coastal and riverine areas within this region. The plant is often found in shaded, moist environments such as forests and shrublands. Its native distribution is limited to this specific geographic area in Brazil.",
    "distribution_introduced_art_desc": "Abutilon inaequilaterum was mainly introduced to ornamental horticulture and landscaping due to its attractive, lantern-shaped flowers and its ability to thrive in a variety of environmental conditions. It is commonly found in regions with warm climates, where it is cultivated for its aesthetic value in gardens and public spaces. This plant has also been introduced to some areas outside its native range, where it can sometimes become an invasive species. Its adaptability and rapid growth make it a popular choice for both residential and commercial landscaping. However, its introduction has raised concerns about its potential to outcompete native vegetation in non-native environments."
}
