{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutua africana",
    "plant_slug": "abutua-africana",
    "plant_name_scientific": "abutua africana",
    "intro": "Abutua africana, commonly known as the African flame tree, is a deciduous tree native to tropical Africa. It belongs to the family Bignoniaceae and is characterized by its striking orange-red flowers that bloom in clusters. The plant has compound leaves with small, oval-shaped leaflets and produces capsule fruits containing seeds. It thrives in full sun and well-drained soil, making it a popular ornamental plant. Its rapid growth and showy blooms make it a valuable addition to gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutua africana is primarily native to western and central Africa. It is found in countries such as Nigeria, Cameroon, Gabon, and the Congo Republic. This plant typically grows in tropical rainforests and humid lowland areas. It thrives in regions with high rainfall and warm temperatures. Abutua africana is commonly found in the understory of dense forest ecosystems.",
    "distribution_introduced_art_desc": "Abutua africana was mainly introduced to new habitats in Southeast Asia and parts of Oceania for its ornamental value and potential medicinal properties. It is commonly cultivated in tropical and subtropical regions due to its ability to thrive in warm, humid climates. The plant is often used in landscaping and as a decorative element in gardens and parks. Its introduction has raised concerns about its potential to become invasive in certain ecosystems. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
