{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon claussenii",
    "plant_slug": "abutilon-claussenii",
    "plant_name_scientific": "abutilon claussenii",
    "intro": "Abutilon claussenii, commonly known as the velvetleaf abutilon, is a shrub native to the southern United States and northern Mexico. It is characterized by its hairy, ovate leaves that are often tinged with red or purple on the underside. The plant produces clusters of small, yellow flowers that bloom in late summer to early autumn. Its fruit is a spiny capsule that contains numerous seeds. Abutilon claussenii is often cultivated for its ornamental value and ability to thrive in a variety of soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon claussenii is primarily native to Central America, including countries such as Guatemala, Belize, and parts of Honduras. It is also found in the Caribbean islands, particularly in the Greater Antilles. This plant thrives in tropical and subtropical climates, often growing in moist, well-drained soils. It is commonly associated with disturbed habitats, such as forest edges and abandoned fields. Its native range extends into northern South America, including regions of Venezuela and Colombia.",
    "distribution_introduced_art_desc": "Abutilon claussenii was mainly introduced to areas with warm, dry climates and well-drained soils, often found in regions with Mediterranean or semi-arid conditions. It is commonly cultivated as an ornamental plant due to its attractive, lantern-shaped flowers and fuzzy, velvety leaves. The plant thrives in full sun to partial shade and is relatively drought-tolerant once established. It is often used in landscaping for its aesthetic value and ability to thrive in coastal environments. However, it can become invasive in some regions if not managed properly."
}
