{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon paludosum",
    "plant_slug": "abutilon-paludosum",
    "plant_name_scientific": "abutilon paludosum",
    "intro": "Abutilon paludosum, commonly known as swamp abutilon, is a herbaceous plant native to wetland habitats in the southeastern United States. It is characterized by its fuzzy, hairy stems and broad, heart-shaped leaves that often have a waxy texture. The plant produces clusters of small, yellowish-green flowers that bloom in the summer months. It thrives in moist, well-drained soils and is often found in marshes, swamps, and along the edges of ponds. Due to its adaptability to wet conditions, it plays an important role in stabilizing soil and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Namibia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon paludosum is primarily native to Namibia. It is commonly found in the arid and semi-arid regions of the country. This plant thrives in sandy or gravelly soils along riverbanks and in open habitats. It is well adapted to the dry climate and can tolerate periods of drought. Its native range in Namibia reflects its ecological preference for coastal and inland dry environments.",
    "distribution_introduced_art_desc": "Abutilon paludosum was mainly introduced to wetlands and disturbed areas along coastal regions. It is commonly found in marshy soils and tidal zones where it thrives in saline and brackish conditions. This plant is often considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. It is used in erosion control and as a source of fiber in certain regions. Its distribution has expanded due to human activities and climate change impacts."
}
