{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta dwyeriana",
    "plant_slug": "abuta-dwyeriana",
    "plant_name_scientific": "abuta dwyeriana",
    "intro": "Abuta dwyeriana, commonly known as the red abuta, is a flowering plant native to the Andean region of South America. It belongs to the family Euphorbiaceae and is characterized by its striking red or orange flowers that bloom in clusters. The plant has elliptical, dark green leaves with a slightly hairy texture. It thrives in moist, well-drained soils and prefers partial to full sun. Abuta dwyeriana is valued for its ornamental appeal and is often cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta dwyeriana"
    },
    "taxonomy_art_desc": "Abuta dwyeriana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which includes ferns and their relatives, known for their vascular systems and often possessing spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the magnolia family. Its order is Ranunculales, which consists of flowering plants with diverse morphological features, including many species with showy flowers and toxic compounds. Its family is Menispermaceae, commonly known as the Menispermaceae or the \"douglasias,\" characterized by woody vines with distinctive leaves and medicinal properties. Its genus is Abuta, a group of flowering plants native to tropical regions, known for their ornamental value and potential medicinal uses. Its species is Abuta dwyeriana, a specific type within the genus Abuta, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Panamá"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta dwyeriana is primarily native to Panama. It is found in the tropical regions of the country, particularly in the lowland areas. This plant thrives in humid and warm climates with well-drained soil. It is commonly found in forested areas and along riverbanks. Its native distribution is limited to specific ecosystems within Panama.",
    "distribution_introduced_art_desc": "Abuta dwyeriana was mainly introduced to areas with warm, humid climates and well-drained soils, typically found in tropical and subtropical regions. It thrives in environments with partial to full sunlight and is often cultivated in gardens for its ornamental value. The plant is known for its striking, waxy leaves and unique, pod-like fruits that attract wildlife. It has been introduced to several countries in Southeast Asia, the Pacific Islands, and parts of the Americas. However, it is considered invasive in some regions due to its rapid growth and ability to spread aggressively."
}
