{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta convexa",
    "plant_slug": "abuta-convexa",
    "plant_name_scientific": "abuta convexa",
    "intro": "Abuta convexa, commonly known as the warty abuta, is a flowering plant native to the Andes Mountains of South America. It is characterized by its distinctive, warty, and often hairy stems and leaves. The plant produces showy, bell-shaped flowers that range in color from white to pink, typically blooming in late spring to early summer. Abuta convexa thrives in high-altitude environments with cool temperatures and well-drained soil. It is valued for its ornamental appeal and has been used in traditional medicine for various health purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta convexa is primarily native to the tropical regions of South America, particularly Brazil, Peru, and Colombia. It thrives in lowland areas with warm and humid climates. This plant is commonly found in the Amazon rainforest and other dense tropical forests. It prefers well-drained soils and is often seen growing near rivers and in secondary forests. Abuta convexa is an important species in its native habitat, contributing to the biodiversity of the region.",
    "distribution_introduced_art_desc": "Abuta convexa was mainly introduced to the data as a rare and unique species with specific ecological and medicinal significance. It is characterized by its distinctive convex-shaped leaves and its ability to thrive in specific soil and climate conditions. The introduction of this plant into the dataset highlights its potential value in botanical research and conservation efforts. Due to its limited distribution, it is considered a species of interest for ecological studies. The data provides insights into its habitat preferences and possible conservation status."
}
