{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon esquirolii",
    "plant_slug": "abutilon-esquirolii",
    "plant_name_scientific": "abutilon esquirolii",
    "intro": "Abutilon esquirolii, commonly known as the Mexican velvetleaf, is a flowering plant native to Mexico and parts of Central America. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its hairy, ovate leaves and showy, lantern-shaped flowers. The plant produces yellow-orange flowers that bloom in clusters, typically during the summer months. It thrives in warm, humid climates and is often found in disturbed soils or along riverbanks. The leaves are palmately lobed, and the plant is known for its ornamental value in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon esquirolii is primarily native to the island of Socotra, which is located in the Arabian Sea off the coast of eastern Africa. This unique plant is found in the arid and semi-arid regions of Socotra, where it thrives in rocky and coastal habitats. It is a rare and endemic species, adapted to the specific environmental conditions of its native range. Due to its limited distribution, it is considered a valuable component of Socotra's unique flora. Conservation efforts are ongoing to protect this plant from threats such as habitat loss and over-collection.",
    "distribution_introduced_art_desc": "Abutilon esquirolii was mainly introduced to the Hawaiian Islands. It was brought there during the late 19th century as an ornamental plant due to its attractive, lantern-shaped flowers. The plant has since become naturalized and is now found in various disturbed habitats across the archipelago. It is considered a non-native species that has established itself in the local ecosystem. However, its impact on native flora and fauna remains minimal compared to other invasive species in the region."
}
