{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon benedictum",
    "plant_slug": "abutilon-benedictum",
    "plant_name_scientific": "abutilon benedictum",
    "intro": "Abutilon benedictum, commonly known as the velvetleaf abutilon, is a shrub native to the southeastern United States. It is characterized by its fuzzy, velvety leaves that give it a distinctive texture. The plant produces showy, lantern-shaped flowers that range in color from yellow to orange, often appearing in clusters. It thrives in full sun to partial shade and prefers well-drained soil. Abutilon benedictum is often used in ornamental gardening for its unique foliage and seasonal blooms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon benedictum"
    },
    "taxonomy_art_desc": "Abutilon benedictum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with distinctive flowers and often hairy stems. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their showy, lantern-shaped flowers. Its species is Abutilon benedictum, a specific type of Abutilon known for its unique floral structure and is native to certain regions of the world.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Brazil Southeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon benedictum is primarily native to Brazil Southeast. This plant is found in the southeastern region of Brazil, including the states of São Paulo, Minas Gerais, and Rio de Janeiro. It thrives in tropical and subtropical climates, often growing in open forests and along riverbanks. The species is well adapted to the humid and warm conditions of this region. Its native distribution is closely tied to the ecological characteristics of the southeastern Brazilian landscape.",
    "distribution_introduced_art_desc": "Abutilon benedictum was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, lantern-shaped flowers. The plant has since spread beyond cultivated areas and is now found in disturbed habitats such as roadsides and stream banks. Its introduction has led to concerns about its potential to outcompete native species in these environments. Despite its beauty, it is considered a non-native invasive species in some parts of its range."
}
