{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon behrianum",
    "plant_slug": "abutilon-behrianum",
    "plant_name_scientific": "abutilon behrianum",
    "intro": "Abutilon behrianum, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical regions of the Americas. It is a deciduous shrub or small tree that can grow up to 3 meters in height. The plant is characterized by its broad, heart-shaped leaves that are velvety to the touch, giving it its common name. Its flowers are typically yellow or orange, with five petals and a distinctive central column. The plant produces capsule fruits that contain numerous seeds, which are dispersed by wind.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon behrianum is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in lowland areas with high humidity. This plant thrives in coastal and mangrove environments, often growing near the shoreline or in brackish water areas. It is also present in parts of India and the Philippines, where it is adapted to warm and moist climates. Due to its ornamental value, it has been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Abutilon behrianum was mainly introduced to the Pacific Northwest of the United States. It is commonly found in moist, disturbed areas such as roadsides and stream banks. This plant is considered an invasive species in some regions due to its rapid growth and ability to outcompete native vegetation. It has been reported in several states including Oregon, Washington, and California. Its spread is often associated with human activities like land development and gardening."
}
