{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta racemosa",
    "plant_slug": "abuta-racemosa",
    "plant_name_scientific": "abuta racemosa",
    "intro": "Abuta racemosa, commonly known as the yellow root or golden root, is a flowering plant native to the Andes Mountains of South America. It is characterized by its erect, branched stems and clusters of yellow flowers that bloom in the spring. The plant produces small, oval-shaped fruits that contain several seeds. Its leaves are alternate, simple, and have a rough texture. Abuta racemosa is often found in moist, well-drained soils in forested areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta racemosa"
    },
    "taxonomy_art_desc": "Abuta racemosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns, horsetails, and some modern plants with complex structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Ranunculales, a group of flowering plants known for their showy flowers and often containing toxic compounds. Its family is Menispermaceae, a family of flowering plants commonly known as the pipe vines, which are typically woody and have distinctive leaf and fruit structures. Its genus is Abuta, a group of flowering plants native to tropical regions, known for their ornamental value and medicinal properties. Its species is Abuta racemosa, a specific type within the genus Abuta, characterized by its climbing habit, palmate leaves, and clusters of yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Colombia",
        "Panamá"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta racemosa is primarily native to Bolivia, Colombia, and Panamá. This plant is commonly found in the tropical and subtropical regions of these countries. It thrives in humid, forested environments with well-drained soil. Abuta racemosa is often associated with lowland and montane forests. Its distribution is limited to specific ecological zones within these regions.",
    "distribution_introduced_art_desc": "Abuta racemosa was mainly introduced to areas with well-drained soils and moderate to high elevations, typically found in mountainous regions. It thrives in temperate climates with cool summers and cold winters, making it suitable for regions in the northern hemisphere. This plant is commonly found in rocky or forested habitats, often growing in association with other alpine or subalpine species. Its introduction has been primarily for ornamental purposes due to its attractive foliage and unique appearance. However, it is important to note that it is not widely cultivated outside its native range."
}
