{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon vidalii",
    "plant_slug": "abutilon-vidalii",
    "plant_name_scientific": "abutilon vidalii",
    "intro": "Abutilon vidalii, commonly known as the Vidal's abutilon, is a flowering plant native to South America. It belongs to the Malvaceae family, which includes hibiscus and cotton. The plant is characterized by its palmate leaves and showy, lantern-shaped flowers that range in color from yellow to orange. It typically grows in moist, shady environments and is often found in forest understories. Abutilon vidalii is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon vidalii is primarily native to the Caribbean islands, including Cuba, Hispaniola, and the Greater Antilles. It is commonly found in coastal areas and dry forests, where it thrives in well-drained soils. This species is also present in parts of Central America, such as southern Mexico and northern Colombia. It prefers sunny to partially shaded environments and is often seen growing along roadsides and in disturbed habitats. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Abutilon vidalii was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and unique flowering characteristics. It is commonly cultivated in tropical and subtropical regions for its aesthetic value. The plant thrives in warm climates with well-drained soil and full sun exposure. It has been reported in several countries including Australia, the United States, and parts of Southeast Asia. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
