{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon occidentale",
    "plant_slug": "abutilon-occidentale",
    "plant_name_scientific": "abutilon occidentale",
    "intro": "Abutilon occidentale, commonly known as the velvetleaf or Chinese lantern plant, is a flowering shrub native to tropical and subtropical regions. It features heart-shaped leaves that are typically velvety and green, with a distinctive waxy texture. The plant produces lantern-shaped seed pods that turn red when mature, adding ornamental value. It thrives in warm climates and requires well-drained soil for optimal growth. Abutilon occidentale is often cultivated for its aesthetic appeal and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon occidentale is primarily native to the southwestern United States and northwestern Mexico. It is commonly found in regions such as Arizona, New Mexico, and parts of California. This plant thrives in arid and semi-arid environments, often growing in rocky soils and along riverbanks. It is well adapted to the hot, dry climates of its native range. Abutilon occidentale is also known as the velvetleaf abutilon due to its soft, fuzzy leaves.",
    "distribution_introduced_art_desc": "Abutilon occidentale was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-shaped flowers. It was brought there during the 19th century by European settlers and has since become naturalized in various coastal and disturbed habitats. The plant thrives in warm, humid climates and is commonly found in gardens and along roadsides. Its rapid growth and ability to spread through seeds have led to its classification as an invasive species in some areas. Despite its ornamental value, it poses a threat to native plant communities by outcompeting them for resources."
}
