{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon trilobatum",
    "plant_slug": "abutilon-trilobatum",
    "plant_name_scientific": "abutilon trilobatum",
    "intro": "Abutilon trilobatum, commonly known as velvetleaf, is a flowering plant native to the Americas. It is characterized by its heart-shaped leaves and showy, lantern-shaped yellow flowers. The plant is typically found in moist, disturbed soils and is often considered a weed in agricultural settings. It has a hairy texture on its stems and leaves, giving it a velvety appearance. Abutilon trilobatum is part of the Malvaceae family, which includes other plants like cotton and hibiscus.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon trilobatum is primarily native to the Caribbean, Central America, and northern South America. It is commonly found in tropical and subtropical regions, including parts of Mexico, the Bahamas, and the Greater Antilles. This plant thrives in coastal areas, sandy soils, and disturbed habitats. It is often seen growing along beaches, dunes, and in open woodlands. Its native range extends into parts of the southern United States, such as Florida and Texas.",
    "distribution_introduced_art_desc": "Abutilon trilobatum was mainly introduced to ornamental horticulture due to its attractive, lantern-shaped flowers and its ability to thrive in a variety of environmental conditions. It is commonly used in gardens and landscapes for its aesthetic value and easy maintenance. The plant is also valued for its medicinal properties, which have been utilized in traditional medicine practices. Its introduction has led to its cultivation in many regions outside its native habitat. However, it is important to monitor its spread to prevent potential ecological impacts."
}
