{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon yucatanum",
    "plant_slug": "abutilon-yucatanum",
    "plant_name_scientific": "abutilon yucatanum",
    "intro": "Abutilon yucatanum, commonly known as the Yucatan velvetleaf, is a shrub native to Central America and the Caribbean. It is characterized by its hairy, velvety leaves that give it a distinctive appearance. The plant produces small, yellow flowers that bloom in clusters, often attracting pollinators like bees and butterflies. Its seeds are encased in a capsule that splits open to release the seeds. Abutilon yucatanum is often found in moist, tropical environments and is valued for its ornamental qualities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon yucatanum is primarily native to southern Mexico, including the Yucatán Peninsula, and parts of Central America. It is found in countries such as Belize, Guatemala, Honduras, and El Salvador. This plant typically grows in tropical and subtropical regions, often in dry or semi-arid environments. It is commonly found in open woodlands, scrublands, and along roadsides. Its native distribution is closely associated with limestone soils and coastal areas.",
    "distribution_introduced_art_desc": "Abutilon yucatanum was mainly introduced to tropical and subtropical regions for its ornamental value and potential ecological benefits. It is commonly found in areas with warm climates, including parts of the Caribbean, Central America, and the southern United States. The plant thrives in well-drained soil and full sun, making it suitable for gardens and landscaping. Its introduction has sometimes led to its naturalization in certain environments, raising concerns about its invasive potential. Despite its beauty, careful management is recommended to prevent unintended spread."
}
