{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon macrum",
    "plant_slug": "abutilon-macrum",
    "plant_name_scientific": "abutilon macrum",
    "intro": "Abutilon macrum, commonly known as the woolly abutilon, is a flowering plant native to the southeastern United States. It is a shrub that typically grows to a height of 1 to 3 meters, featuring soft, hairy stems and broad, heart-shaped leaves. The plant produces clusters of small, yellow flowers that bloom in the summer months. Its fibrous, soft hairs are a distinctive botanical feature, giving it a fuzzy appearance. Abutilon macrum is often found in moist, disturbed soils along stream banks and in open woodlands.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon macrum"
    },
    "taxonomy_art_desc": "Abutilon macrum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often associated with primitive floral structures. Its order is Malvales, which includes plants with showy flowers and often includes species with specialized structures like hoods or brushes. Its family is Malvaceae, commonly known as the mallow family, which includes plants with cotton-like fibers and showy flowers. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their distinctive, lantern-shaped flowers. Its species is Abutilon macrum, a specific type of Abutilon known for its unique floral structure and is native to certain regions of South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon macrum is primarily native to Northern Territory, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy soils and is often associated with coastal or inland dunes. The plant is well adapted to the harsh environmental conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Abutilon macrum was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. The plant has since become naturalized in certain areas, particularly in coastal regions. It is considered a potential weed in some parts of the country. Its introduction has raised concerns about its impact on native ecosystems."
}
