{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon glaucum var. muticum",
    "plant_slug": "abutilon-glaucum-var-muticum",
    "plant_name_scientific": "abutilon glaucum var. muticum",
    "intro": "Abutilon glaucum var. muticum, commonly known as the woolly abutilon, is a flowering plant native to the southwestern United States and northern Mexico. It is characterized by its soft, fuzzy leaves and showy, lantern-shaped yellow flowers that bloom in late summer. The plant typically grows as a shrub or small tree, reaching heights of up to 3 meters. It thrives in well-drained soils and full sun, making it a popular choice for xeriscaping. Its unique appearance and drought tolerance make it a valuable addition to arid landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon glaucum var. muticum is primarily native to the western United States, specifically California and Oregon. It is commonly found in coastal areas, particularly along the Pacific coast. This plant thrives in sandy or gravelly soils and is often seen in dunes and other coastal habitats. It is also known to occur in parts of Baja California, Mexico. Its distribution is closely tied to maritime climates with moderate temperatures and coastal influences.",
    "distribution_introduced_art_desc": "Abutilon glaucum var. muticum was mainly introduced to the Pacific Northwest region of the United States. It was brought in during the 19th century as an ornamental plant due to its attractive, lantern-like flowers. This variety is commonly found in disturbed soils and along roadsides, where it thrives in full sun. It has since become naturalized in several areas, spreading through both seed dispersal and vegetative growth. However, its introduction has raised concerns due to its potential to outcompete native plant species in certain habitats."
}
