{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon wissaduloides",
    "plant_slug": "abutilon-wissaduloides",
    "plant_name_scientific": "abutilon wissaduloides",
    "intro": "Abutilon wissaduloides, commonly known as the Wissadula abutilon, is a flowering plant belonging to the Malvaceae family. It is native to South America, particularly Brazil, and is characterized by its hairy, glandular leaves and showy, lantern-shaped flowers. The plant typically grows as a shrub or small tree, reaching heights of up to 5 meters. Its flowers are usually yellow or orange, with a distinctive red or purple calyx that persists after flowering. Abutilon wissaduloides is valued for its ornamental appeal and is sometimes cultivated in tropical and subtropical gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon wissaduloides is primarily native to the Caribbean region, including parts of the Greater and Lesser Antilles. It is found in countries such as Cuba, Hispaniola, Jamaica, and Puerto Rico. This plant typically grows in moist, tropical environments, often near rivers or in coastal areas. It is commonly associated with disturbed habitats and can thrive in both full sun and partial shade. Its native range is limited to these specific islands, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Abutilon wissaduloides was mainly introduced to urban and suburban areas for its ornamental value. It is commonly found along roadsides, in gardens, and near water sources. The plant thrives in warm climates and is often used in landscaping due to its attractive foliage and flowers. It has become naturalized in several regions, sometimes outcompeting native vegetation. Its introduction has led to concerns about its potential invasiveness in certain ecosystems."
}
