{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon giganteum",
    "plant_slug": "abutilon-giganteum",
    "plant_name_scientific": "abutilon giganteum",
    "intro": "Abutilon giganteum, commonly known as the Chinese lantern plant, is a flowering plant native to Southeast Asia. It is characterized by its large, showy, papery bracts that resemble lanterns, which are often mistaken for flowers. The plant typically grows as a shrub or small tree, reaching heights of up to 10 feet. Its leaves are heart-shaped and have a velvety texture, while its flowers are small and yellow, clustered in spikes. It thrives in warm climates and is often cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon giganteum"
    },
    "taxonomy_art_desc": "Abutilon giganteum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and flowers with five petals. Its genus is Abutilon, a group of flowering plants that are often referred to as \"Chinese lanterns\" due to their distinctive seed pods. Its species is Abutilon giganteum, a specific type of plant within the genus Abutilon that is known for its large, showy flowers and is commonly cultivated as an ornamental plant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Colombia",
        "Costa Rica",
        "Cuba",
        "El Salvador",
        "Guatemala",
        "Haiti",
        "Honduras",
        "Jamaica",
        "Mexico Southeast",
        "Nicaragua",
        "Panamá",
        "Peru",
        "Trinidad-Tobago",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon giganteum is primarily native to Colombia, Costa Rica, Cuba, El Salvador, Guatemala, Haiti, Honduras, Jamaica, Mexico Southeast, Nicaragua, Panamá, Peru, Trinidad-Tobago, and Venezuela. This plant is commonly found in tropical and subtropical regions within these countries. It thrives in warm climates with high humidity and well-drained soils. Abutilon giganteum is often associated with disturbed habitats such as roadsides, forests, and riverbanks. Its native distribution spans a wide geographic range across Central and South America.",
    "distribution_introduced_art_desc": "Abutilon giganteum was mainly introduced to ornamental horticulture and landscape design due to its striking, lantern-shaped flowers and attractive foliage. It is commonly cultivated in tropical and subtropical regions for its aesthetic value in gardens and public spaces. The plant thrives in warm climates with well-drained soil and full sun exposure. Its introduction has led to its use in both residential and commercial landscaping projects. However, it is important to note that it may become invasive in certain environments if not managed properly."
}
