{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon melanocarpum var. parvifolium",
    "plant_slug": "abutilon-melanocarpum-var-parvifolium",
    "plant_name_scientific": "abutilon melanocarpum var. parvifolium",
    "intro": "Abutilon melanocarpum var. parvifolium, commonly known as the small-leaf velvetleaf, is a shrub native to tropical regions of South America. It is characterized by its fuzzy, hairy leaves and small, yellowish flowers that bloom in clusters. The plant produces capsule fruits that contain numerous tiny, dark seeds. It thrives in moist, well-drained soils and is often found in disturbed habitats. Its ornamental value is due to its unique foliage and delicate floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon melanocarpum var. parvifolium is primarily native to the western United States, particularly California. It is found in regions with Mediterranean climates, including parts of southern California and the adjacent areas of Baja California. This plant thrives in coastal scrub and chaparral habitats, often growing in well-drained soils. It is commonly associated with rocky outcrops and open woodlands. Its native range is limited, making it a regionally significant species within its ecological niche.",
    "distribution_introduced_art_desc": "Abutilon melanocarpum var. parvifolium was mainly introduced to areas with warm, temperate climates and well-drained soils. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland areas where it can establish itself along disturbed soils. Its introduction has been noted in several parts of the United States, particularly in California and Texas. It is often used in landscaping due to its ornamental value and adaptability."
}
