{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon mucronatum",
    "plant_slug": "abutilon-mucronatum",
    "plant_name_scientific": "abutilon mucronatum",
    "intro": "Abutilon mucronatum, commonly known as the Mexican maple or velvetleaf, is a flowering plant native to Central America and northern South America. It is a deciduous shrub or small tree that can grow up to 6 meters tall, characterized by its heart-shaped leaves and showy, spire-like clusters of yellow flowers. The plant produces small, oval fruits that contain one or two seeds, which are dispersed by wind. Its botanical features make it a popular ornamental plant due to its attractive foliage and floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon mucronatum"
    },
    "taxonomy_art_desc": "Abutilon mucronatum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants with typically showy flowers and includes families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with hairy stems and showy flowers, many of which are cultivated for ornamental purposes. Its genus is Abutilon, a group of flowering plants commonly known as \"velvetleaf\" or \"Chinese lantern,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon mucronatum, a specific plant within the genus Abutilon, known for its distinctive appearance and often used in horticulture.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon mucronatum is primarily native to Mexico Central, Mexico Northeast, Mexico Northwest, and Mexico Southwest. This plant is commonly found in these regions, where it thrives in a variety of habitats. It is often associated with dry to semi-arid environments. The species is well adapted to the climate and soil conditions of these areas. Its native range reflects its ecological preferences and historical distribution across central and northern Mexico.",
    "distribution_introduced_art_desc": "Abutilon mucronatum was mainly introduced to new habitats in tropical and subtropical regions, often as an ornamental plant due to its attractive foliage and flowers. It has been reported in several countries, including parts of the United States, Australia, and Southeast Asia. The plant thrives in disturbed soils and can spread rapidly through seed dispersal. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Proper management is recommended to prevent its spread and minimize ecological impacts."
}
