{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon vitifolium",
    "plant_slug": "abutilon-vitifolium",
    "plant_name_scientific": "abutilon vitifolium",
    "intro": "Abutilon vitifolium, commonly known as the wine-leaf abutilon, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its large, heart-shaped leaves that are often a deep green with a slightly fuzzy texture. The plant produces clusters of showy, yellow-orange flowers that bloom in the spring and summer. It thrives in well-drained soils and full sun, making it suitable for arid and semi-arid climates. Its unique foliage and ornamental flowers make it a popular choice for xeriscaping and drought-tolerant gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon vitifolium is primarily native to the western United States, particularly California. It is found in coastal areas and inland regions, often in sandy or rocky soils. This plant thrives in Mediterranean climates with mild, wet winters and dry summers. It is commonly seen in coastal bluffs, dunes, and open woodlands. Its native range extends into parts of Oregon and Baja California.",
    "distribution_introduced_art_desc": "Abutilon vitifolium was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in disturbed areas such as roadsides, fields, and along streambanks. This plant thrives in a variety of soil types and can tolerate both full sun and partial shade. It is often considered an invasive species due to its rapid growth and ability to outcompete native vegetation. Its distribution has expanded beyond its native range, leading to ecological concerns in some regions."
}
