{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon excelsior",
    "plant_slug": "abutilon-excelsior",
    "plant_name_scientific": "abutilon excelsior",
    "intro": "Abutilon excelsior, commonly known as the velvetleaf abutilon, is a flowering plant native to tropical and subtropical regions. It is characterized by its broad, heart-shaped leaves that are often covered in a soft, velvety texture. The plant produces clusters of yellow flowers that bloom in the summer months. It thrives in well-drained soil and requires full sun to partial shade for optimal growth. Abutilon excelsior is often cultivated as an ornamental plant due to its attractive foliage and showy blooms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon excelsior is primarily native to the Caribbean region, including parts of the Greater Antilles and the Lesser Antilles. It is commonly found in tropical and subtropical areas, particularly in regions with warm, humid climates. This plant thrives in coastal areas and along riverbanks, where it can access ample sunlight and moisture. It is also present in some parts of Central America and the northern regions of South America. Due to its adaptability, it can sometimes be found in disturbed habitats or human-altered environments.",
    "distribution_introduced_art_desc": "Abutilon excelsior was mainly introduced to the Pacific Northwest region of the United States. It was brought there as an ornamental plant due to its attractive, lantern-shaped flowers and its ability to thrive in moist, shady environments. The distribution of this species has expanded beyond its original range, particularly in areas with high humidity and well-drained soil. It is commonly found in gardens and along stream banks in Oregon and Washington. However, its introduction has raised concerns about its potential to become invasive in native ecosystems."
}
