{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon weberbaueri",
    "plant_slug": "abutilon-weberbaueri",
    "plant_name_scientific": "abutilon weberbaueri",
    "intro": "Abutilon weberbaueri, commonly known as the velvetleaf abutilon, is a flowering plant belonging to the Malvaceae family. It is native to South America, particularly Argentina and Chile, and thrives in temperate climates. The plant is characterized by its heart-shaped leaves and showy, lantern-shaped bracts that encase the small flowers. It produces pale yellow to orange flowers that bloom in late spring to early summer. Abutilon weberbaueri is often cultivated as an ornamental plant due to its attractive foliage and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon weberbaueri is primarily native to the Andean regions of South America, specifically in countries such as Peru, Bolivia, and Ecuador. It is found in the high-altitude grasslands and montane forests of the Andes, typically at elevations ranging from 2,000 to 4,000 meters. This plant thrives in temperate climates with well-drained soils and is often associated with rocky or mountainous terrain. It is a member of the Malvaceae family and is known for its distinctive, lantern-shaped flowers. Due to its restricted habitat, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Abutilon weberbaueri was mainly introduced to areas with warm, humid climates and well-drained soils, often found in disturbed habitats such as roadsides and abandoned fields. It is commonly found in regions of Central and South America, where it has been established as an invasive species in some areas. The plant spreads primarily through its seeds, which are dispersed by wind, water, and animals. Due to its rapid growth and adaptability, it can outcompete native vegetation, leading to ecological concerns in certain regions. Efforts to control its spread include manual removal and the use of herbicides in affected areas."
}
