{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta rufescens",
    "plant_slug": "abuta-rufescens",
    "plant_name_scientific": "abuta rufescens",
    "intro": "Abuta rufescens, commonly known as the red abuta, is a flowering plant native to the Andean regions of South America. It belongs to the family Euphorbiaceae and is characterized by its striking red and yellow flowers that bloom in clusters. The plant has heart-shaped, velvety leaves that are often covered in fine hairs. It thrives in high-altitude environments and is adapted to the cool, humid climates of its native habitat. Due to its ornamental value, it is occasionally cultivated in gardens and botanical collections.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta rufescens"
    },
    "taxonomy_art_desc": "Abuta rufescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and often possessing rhizomes. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Ranunculales, a group of flowering plants that includes many showy flowers and is known for its diverse ecological roles. Its family is Menispermaceae, commonly known as the pipevine family, which consists of woody plants often containing toxic compounds. Its genus is Abuta, a group of flowering plants native to tropical regions of Africa and Asia, typically characterized by their climbing habit and showy flowers. Its species is Abuta rufescens, a specific type within the genus Abuta, known for its distinctive red stems and medicinal properties used in traditional medicine.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil Southeast",
        "Brazil West-Central",
        "Colombia",
        "Ecuador",
        "French Guiana",
        "Guyana",
        "Peru",
        "Suriname",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta rufescens is primarily native to Bolivia, Brazil North, Brazil Northeast, Brazil Southeast, Brazil West-Central, Colombia, Ecuador, French Guiana, Guyana, Peru, Suriname, and Venezuela. It is found in the tropical regions of South America, particularly in areas with moist, humid climates. This plant typically grows in lowland forests and along riverbanks. It is commonly found in regions with rich soil and adequate rainfall. Its native range spans across several countries in northern and eastern South America.",
    "distribution_introduced_art_desc": "Abuta rufescens was mainly introduced to regions with temperate to subtropical climates, where it thrives in well-drained soils and partial to full sunlight. It is commonly found in the wild in parts of Asia, particularly in China, India, and Southeast Asia. This plant has also been cultivated in some parts of the United States and Europe for its ornamental value and potential medicinal properties. Its introduction to new areas has raised concerns about its invasive potential in certain ecosystems. Due to its adaptability, it has become a subject of ecological studies to understand its impact on local flora."
}
