{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon parvulum",
    "plant_slug": "abutilon-parvulum",
    "plant_name_scientific": "abutilon parvulum",
    "intro": "Abutilon parvulum, commonly known as the woolly abutilon, is a small, herbaceous shrub native to South America. It is characterized by its hairy, glandular leaves that give it a distinctive fuzzy appearance. The plant produces small, yellow flowers that bloom in clusters, typically during the warmer months. Its fibrous roots and soft, velvety foliage make it a unique addition to botanical gardens. Abutilon parvulum is often cultivated for its ornamental value and is relatively easy to care for in suitable growing conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon parvulum"
    },
    "taxonomy_art_desc": "Abutilon parvulum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Malvales, which consists of flowering plants that typically have showy flowers and include families such as Malvaceae. Its family is Malvaceae, commonly known as the mallow family, which includes plants with fibrous stems and often hairy leaves. Its genus is Abutilon, a group of flowering plants commonly known as \"Chinese lanterns\" due to their unique, inflated seed pods. Its species is Abutilon parvulum, a specific type of Abutilon characterized by its small size and distinctive floral and vegetative features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "California",
        "Colorado",
        "Mexico Northeast",
        "Mexico Northwest",
        "Nevada",
        "New Mexico",
        "Texas",
        "Utah"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon parvulum is primarily native to Arizona, California, Colorado, Mexico Northeast, Mexico Northwest, Nevada, New Mexico, Texas, and Utah. This plant is commonly found in arid and semi-arid regions across these areas. It thrives in rocky soils and open habitats such as desert scrub and grasslands. Abutilon parvulum is well adapted to the dry climate and can often be seen along roadsides and in disturbed areas. Its native range spans much of the southwestern United States and northern Mexico.",
    "distribution_introduced_art_desc": "Abutilon parvulum was mainly introduced to Hawaii, where it has become an invasive species. It was likely introduced through accidental means, such as being transported on ships or through the horticultural trade. The plant thrives in disturbed areas and can outcompete native vegetation. It is commonly found in coastal areas and along roadsides. Due to its rapid growth and ability to spread, it poses a significant threat to local ecosystems."
}
