{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abuta grandifolia",
    "plant_slug": "abuta-grandifolia",
    "plant_name_scientific": "abuta grandifolia",
    "intro": "Abuta grandifolia, commonly known as the African butter bean or wild cowpea, is a climbing shrub native to tropical Africa. It belongs to the Leguminosae family and is characterized by its trifoliate leaves and yellow flowers. The plant produces pod-like fruits that contain edible seeds, which are rich in protein and nutrients. Its roots are also used in traditional medicine for their purported health benefits. Abuta grandifolia thrives in moist, well-drained soils and is often found in forest understories.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Ranunculales",
        "family": "Menispermaceae",
        "genus": "Abuta",
        "species": "Abuta grandifolia"
    },
    "taxonomy_art_desc": "Abuta grandifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle and includes ferns and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Ranunculales, which consists of flowering plants with diverse forms and includes families like the buttercup family. Its family is Menispermaceae, commonly known as the birthwort family, which includes climbing plants and some medicinal species. Its genus is Abuta, a group of flowering plants native to tropical regions, often characterized by their ornamental and medicinal properties. Its species is Abuta grandifolia, a specific type within the genus Abuta, known for its large, showy flowers and potential medicinal uses.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Brazil North",
        "Brazil Northeast",
        "Brazil West-Central",
        "Colombia",
        "Ecuador",
        "French Guiana",
        "Guyana",
        "Peru",
        "Suriname",
        "Venezuela"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abuta grandifolia is primarily native to Bolivia, Brazil North, Brazil Northeast, Brazil West-Central, Colombia, Ecuador, French Guiana, Guyana, Peru, Suriname, and Venezuela. This plant is found in the tropical regions of South America, particularly in the Amazon Basin and surrounding areas. It thrives in humid, lowland environments with rich soil and ample rainfall. Abuta grandifolia is commonly found in secondary forests and along riverbanks. Its distribution spans across several countries in the northern and western parts of South America.",
    "distribution_introduced_art_desc": "Abuta grandifolia was mainly introduced to the southeastern United States, particularly in areas with moist, well-drained soils. It is commonly found in the Appalachian region, where it thrives in shaded, woodland environments. This plant is often cultivated in gardens for its attractive, bell-shaped flowers and its use in traditional medicine. Its introduction has been associated with both horticultural interest and ecological impacts in native habitats. However, its spread is limited by its specific soil and light requirements."
}
