{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon nobile",
    "plant_slug": "abutilon-nobile",
    "plant_name_scientific": "abutilon nobile",
    "intro": "Abutilon nobile, commonly known as velvetleaf or Chinese lantern plant, is a deciduous shrub native to China. It is characterized by its velvety, hairy leaves that give it a soft, fuzzy appearance. The plant produces showy, lantern-shaped flowers that range in color from red to orange, often blooming in late summer. Its ornamental value comes from both its foliage and floral display. It thrives in full sun to partial shade and is relatively drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon nobile"
    },
    "taxonomy_art_desc": "Abutilon nobile belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Malvales, which consists of flowering plants that often have showy flowers and include families like Malvaceae. Its family is Malvaceae, commonly known as the mallow family, characterized by their hairy stems, showy flowers, and capsule fruits. Its genus is Abutilon, a group of flowering plants that typically have hairy stems and flowers resembling those of the hibiscus. Its species is Abutilon nobile, a specific variety within the genus Abutilon known for its ornamental value and distinctive, lantern-shaped flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon nobile is primarily native to Queensland. It is found in the eastern part of the state, particularly in the tropical and subtropical regions. This plant thrives in moist, well-drained soils and is commonly found in rainforests and coastal areas. It is often seen growing in shaded understorey environments. Abutilon nobile is an important component of the local flora and is valued for its ornamental qualities.",
    "distribution_introduced_art_desc": "Abutilon nobile was mainly introduced to ornamental horticulture due to its attractive, lantern-shaped flowers and velvety foliage. It is commonly cultivated in gardens and as a houseplant because of its adaptability to various growing conditions. The plant thrives in warm climates and is often used in landscaping for its aesthetic appeal. It is also valued for its ability to tolerate partial shade and poor soil conditions. However, it can become invasive in some regions if not properly managed."
}
