{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon terminale var. typica",
    "plant_slug": "abutilon-terminale-var-typica",
    "plant_name_scientific": "abutilon terminale var. typica",
    "intro": "Abutilon terminale var. typica, commonly known as velvetleaf or Chinese lantern plant, is a flowering plant native to tropical and subtropical regions. It is characterized by its heart-shaped, velvety leaves that are typically green with a slight pubescence. The plant produces showy, lantern-shaped bracts that range in color from red to orange, often mistaken for flowers. It thrives in warm climates and requires well-drained soil and full sun to partial shade. This species is often cultivated for its ornamental value and is also used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon terminale var. typica is primarily native to the western coast of the United States, including California, Oregon, and Washington. It is commonly found in coastal areas, particularly in sandy or rocky soils along the shoreline. This plant thrives in temperate climates with mild winters and warm, dry summers. It is often seen growing in dunes, cliffs, and other coastal habitats. Its native range extends into parts of Baja California, Mexico.",
    "distribution_introduced_art_desc": "Abutilon terminale var. typica was mainly introduced to the Pacific Northwest region of the United States. It was introduced as an ornamental plant due to its attractive, lantern-shaped flowers and fuzzy leaves. The plant has since become naturalized in moist, disturbed habitats such as streambanks and roadside areas. It is considered a potential invasive species in some areas due to its rapid growth and ability to spread through seed dispersal. However, it is not currently listed as a noxious weed in most states."
}
