{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon aristulosum f. albiflorum",
    "plant_slug": "abutilon-aristulosum-f-albiflorum",
    "plant_name_scientific": "abutilon aristulosum f. albiflorum",
    "intro": "Abutilon aristulosum f. albiflorum, commonly known as the whiteflower velvetleaf, is a variant of the velvetleaf species native to tropical regions. It is a shrub or small tree characterized by its soft, hairy leaves and showy, white flowers. The plant produces small, capsule-like fruits that contain numerous seeds. It thrives in warm, humid climates and is often found in disturbed soils. Its botanical features make it a notable species in botanical gardens and ecological studies.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon aristulosum f. albiflorum is primarily native to the Philippines. It is found in the tropical regions of Southeast Asia, particularly in the islands of Luzon and Mindanao. This plant thrives in humid, warm climates and is commonly found in lowland areas with well-drained soil. It is often associated with secondary forests and disturbed habitats. Its distribution is limited to specific regions within the archipelago, where it grows as a shrub or small tree.",
    "distribution_introduced_art_desc": "Abutilon aristulosum f. albiflorum was mainly introduced to the Pacific Islands, particularly Hawaii, as an ornamental plant due to its attractive, lantern-shaped flowers. It was brought there during the 19th century by European settlers and horticulturalists who sought to introduce exotic plant species. The plant has since become naturalized in certain areas, thriving in the tropical climate and fertile soils of the region. It is commonly found in disturbed habitats such as roadsides, vacant lots, and coastal areas. Despite its ornamental value, it has also been classified as an invasive species in some parts of its introduced range."
}
