{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Abutilon sinense var. sinense",
    "plant_slug": "abutilon-sinense-var-sinense",
    "plant_name_scientific": "abutilon sinense var. sinense",
    "intro": "Abutilon sinense var. sinense, commonly known as Chinese velvetleaf, is a flowering plant native to Southeast Asia. It is a shrub or small tree that can grow up to 3 meters tall, characterized by its soft, fuzzy leaves and showy, lantern-shaped flowers. The plant produces yellow or orange flowers that bloom in clusters, typically during the summer months. Its leaves are alternate, ovate to heart-shaped, and covered in fine, silky hairs. The fruit is a capsule that splits open to release small, winged seeds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Malvales",
        "family": "Malvaceae",
        "genus": "Abutilon",
        "species": "Abutilon sinense"
    },
    "taxonomy_art_desc": "Abutilon sinense var. sinense belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and ferns, and is distinguished by their vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Malvales, a group of flowering plants that includes plants such as cotton and hibiscus, and is characterized by a distinctive type of flower and fruit. Its family is Malvaceae, commonly known as the mallow family, which includes plants with showy flowers and is economically significant for cotton and okra. Its genus is Abutilon, a group of flowering plants commonly known as \"Chinese lanterns\" or \"velvetleaf,\" characterized by their hairy leaves and showy flowers. Its species is Abutilon sinense, a specific variety within the genus Abutilon, known for its ornamental value and native to certain regions of Asia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "China South-Central",
        "China Southeast",
        "Thailand"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Abutilon sinense var. sinense is primarily native to China South-Central, China Southeast, and Thailand. This plant is commonly found in tropical and subtropical regions within these areas. It thrives in humid climates with well-drained soils. The species is often associated with forest edges and disturbed habitats. Its native distribution reflects its adaptation to the diverse ecosystems of Southeast Asia.",
    "distribution_introduced_art_desc": "Abutilon sinense var. sinense was mainly introduced to tropical and subtropical regions for its ornamental value due to its attractive, lantern-shaped flowers. It is commonly cultivated in gardens and as a houseplant because of its ability to thrive in warm climates. The plant prefers well-drained soil and partial to full sunlight, making it adaptable to various growing conditions. It is also used in traditional medicine in some cultures for its potential health benefits. However, it has been reported as an invasive species in certain areas where it can outcompete native flora."
}
