{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia retusa",
    "plant_slug": "acacia-retusa",
    "plant_name_scientific": "acacia retusa",
    "intro": "Acacia retusa, commonly known as the silver acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow, globular inflorescences that bloom in summer, attracting various pollinators. Its seeds are encased in hard, woody pods, which are typical of the legume family. Acacia retusa is adapted to arid and semi-arid environments, making it a resilient plant in dry regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia retusa is primarily native to the eastern and southern regions of Africa, including countries such as Kenya, Tanzania, and South Africa. It thrives in a variety of habitats, including savannas, woodlands, and rocky outcrops. This plant is commonly found in areas with a tropical or subtropical climate, often growing in well-drained soils. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia retusa is also valued for its hardy nature and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia retusa was mainly introduced to areas with a warm, dry climate, such as parts of Australia and the Mediterranean. It thrives in well-drained soils and is commonly found in coastal regions and inland dunes. This plant is often used for soil stabilization due to its deep root system and ability to withstand drought conditions. It has also been introduced as an ornamental plant because of its attractive foliage and ability to fix nitrogen. However, in some regions, it has become invasive, outcompeting native vegetation."
}
