{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polybotrya var. foliolosa",
    "plant_slug": "acacia-polybotrya-var-foliolosa",
    "plant_name_scientific": "acacia polybotrya var. foliolosa",
    "intro": "Acacia polybotrya var. foliolosa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small, narrow leaflets. The plant produces yellow flowers in globular or cylindrical clusters, which appear in spring. It thrives in well-drained soils and is often found in coastal or sandy habitats. The species is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia polybotrya var. foliolosa is primarily native to the tropical and subtropical regions of northern Australia, including the Northern Territory, Queensland, and Western Australia. It is commonly found in arid and semi-arid environments, particularly in sandy soils along riverbanks and in woodland areas. This plant thrives in regions with a warm climate and seasonal rainfall patterns. It is often associated with mulga woodlands and other open habitats. Its distribution is limited to specific ecological zones where it can tolerate low moisture and high temperatures.",
    "distribution_introduced_art_desc": "Acacia polybotrya var. foliolosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique foliage and attractive appearance. Despite its aesthetic value, it has since become invasive in certain regions, outcompeting native species for resources. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its rapid growth and ability to spread through seed dispersal have raised concerns among conservationists."
}
