{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia roycei",
    "plant_slug": "acacia-roycei",
    "plant_name_scientific": "acacia roycei",
    "intro": "Acacia roycei, commonly known as the Royal Acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and pairs of small, bean-like pods that contain seeds. The plant produces yellow flowers in clusters, which are typical of the Acacia genus. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. Acacia roycei is adapted to survive in dry environments, with deep roots and a slow growth rate.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia roycei"
    },
    "taxonomy_art_desc": "Acacia roycei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants known for their distinctive umbrella-shaped or flat-topped inflorescences and often used in traditional medicine. Its species is Acacia roycei, a specific type of acacia that is native to certain regions and is recognized for its unique morphological features and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia roycei is primarily native to Western Australia. It is found in the arid and semi-arid regions of the state, particularly in the Mid West and Pilbara regions. This plant thrives in sandy or gravelly soils and is commonly found in open woodlands and shrublands. It is well adapted to the harsh environmental conditions of the region, including high temperatures and low rainfall. Acacia roycei plays an important ecological role in its native habitat, providing food and shelter for various native animals.",
    "distribution_introduced_art_desc": "Acacia roycei was mainly introduced to the western regions of the United States, particularly in California and Nevada. It was brought in for its ornamental value due to its unique, fern-like foliage and ability to thrive in arid conditions. The plant has since become established in several areas, often in disturbed soils and along roadsides. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. However, it is currently considered a minor threat compared to other invasive species in the region."
}
