{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rivalis",
    "plant_slug": "acacia-rivalis",
    "plant_name_scientific": "acacia rivalis",
    "intro": "Acacia rivalis, commonly known as the coastal acacia, is a shrub native to the coastal regions of southern Africa. It is characterized by its slender, branched stems and small, feathery leaves that help reduce water loss in arid environments. The plant produces yellow flowers in clusters, which attract pollinators such as bees and birds. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its spread along coastal dunes. Acacia rivalis plays an important ecological role in stabilizing sandy soils and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rivalis"
    },
    "taxonomy_art_desc": "Acacia rivalis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which includes legumes and related plants, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in landscaping and traditional medicine. Its species is Acacia rivalis, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rivalis is primarily native to New South Wales and South Australia. This species is commonly found in arid and semi-arid regions within these states. It typically grows in sandy or rocky soils, often in open woodlands or shrublands. Acacia rivalis is well adapted to the harsh climatic conditions of its native range. Its distribution is largely restricted to specific ecological zones in these areas.",
    "distribution_introduced_art_desc": "Acacia rivalis was mainly introduced to South Africa, where it has since become an invasive species. It was initially brought in for its ornamental value and potential for soil stabilization. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to concerns over biodiversity loss and habitat degradation. Efforts are now being made to control its spread and manage its impact on native flora."
}
