{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia beckleri subsp. beckleri",
    "plant_slug": "acacia-beckleri-subsp-beckleri",
    "plant_name_scientific": "acacia beckleri subsp. beckleri",
    "intro": "Acacia beckleri subsp. beckleri, commonly known as the white acacia, is a shrub or small tree native to parts of southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are typically gray-green in color. The plant produces yellow flowers in clusters, which are followed by flat, leathery pods containing seeds. It thrives in arid and semi-arid environments, often growing on rocky soils. The species is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia beckleri"
    },
    "taxonomy_art_desc": "Acacia beckleri subsp. beckleri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Fabales, which includes plants with flowers that have a distinctive structure, such as those in the legume family. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia beckleri, a specific type of acacia known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia beckleri subsp. beckleri is primarily native to New South Wales and South Australia. This subspecies is commonly found in arid and semi-arid regions within these states. It typically grows in open woodlands, shrublands, and rocky areas. The plant is well adapted to the dry climate and can thrive in poor soils. Its distribution is largely restricted to the specific geographic regions mentioned.",
    "distribution_introduced_art_desc": "Acacia beckleri subsp. beckleri was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with low to moderate rainfall. It thrives in full sun and is commonly found in open woodlands, rocky outcrops, and disturbed sites. This subspecies is known for its ability to tolerate drought and poor soil conditions, making it adaptable to various environments. It is often used in reforestation and erosion control due to its hardy nature. However, its introduction has raised concerns about its potential to become invasive in non-native habitats."
}
