{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia costinervis",
    "plant_slug": "acacia-costinervis",
    "plant_name_scientific": "acacia costinervis",
    "intro": "Acacia costinervis, commonly known as the narrow-veined wattle, is a shrub or small tree native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features feathery, bipinnate leaves that are often covered in fine hairs. Its flowers are typically yellow or golden in color, arranged in cylindrical spikes. Acacia costinervis is adapted to arid and semi-arid environments, making it a resilient component of native Australian flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia costinervis is primarily native to northern Australia, specifically the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This plant thrives in open habitats such as spinifex plains and rocky outcrops. It is well adapted to the harsh conditions of the Australian Outback. Its distribution is largely restricted to these specific geographic areas within Australia.",
    "distribution_introduced_art_desc": "Acacia costinervis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in various soil conditions. It was also introduced for its potential use in soil stabilization and erosion control. However, it has since become an invasive species, outcompeting native plants and altering local ecosystems. Its rapid growth and seed dispersal have led to its spread across different regions of the country. Efforts are now being made to manage its population to prevent further ecological damage."
}
