{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flexuosa var. lasiocarpa",
    "plant_slug": "acacia-flexuosa-var-lasiocarpa",
    "plant_name_scientific": "acacia flexuosa var. lasiocarpa",
    "intro": "Acacia flexuosa var. lasiocarpa, commonly known as the silky acacia, is a shrub or small tree native to Australia. It is characterized by its slender, drooping branches and phyllodes that are narrow and covered in fine, silky hairs. The plant produces yellow globular flowerheads that appear in late winter to early spring. It thrives in well-drained soils and is often found in coastal and sandy environments. The silky hairs on its foliage give it a distinctive appearance and help reduce water loss in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flexuosa var. lasiocarpa is primarily native to northern Australia, including regions of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, particularly in sandplains and rocky outcrops. This variety is well adapted to dry climates and can thrive in soils that are low in nutrients. It is often seen growing in open woodlands and along roadsides in its native range. The plant is known for its distinctive, feathery foliage and yellow flowers that bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia flexuosa var. lasiocarpa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. The plant thrives in coastal and semi-arid environments, often growing in sandy or gravelly soils. It is used for erosion control and as a source of timber and fodder. However, its introduction has raised concerns about its potential to become invasive in local ecosystems."
}
