{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia exudans",
    "plant_slug": "acacia-exudans",
    "plant_name_scientific": "acacia exudans",
    "intro": "Acacia exudans, commonly known as the exuding acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often twisted branches and bipinnate leaves that are covered in fine hairs. The plant produces yellow flowers in spherical or cylindrical inflorescences, which are followed by flat, leathery pods containing seeds. Acacia exudans is known for its ability to exude a sticky, resinous substance from its bark, which has been used traditionally for various purposes. It plays an important role in stabilizing soil and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia exudans"
    },
    "taxonomy_art_desc": "Acacia exudans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose family. Its order is Fabales, which comprises plants that typically have compound leaves and flowers with a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia exudans, a specific type of acacia known for its unique exuding properties and its ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia exudans is primarily native to Victoria. It is found in the wetter regions of the state, particularly in the southeastern part. This species thrives in areas with adequate rainfall and well-drained soils. It is commonly seen in native vegetation such as woodlands and heathlands. Acacia exudans plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia exudans was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions with seasonal rainfall, particularly in parts of Africa and the Middle East. This plant is often used for its hardy nature and ability to withstand drought conditions. Its introduction has been associated with land rehabilitation and soil stabilization efforts. However, it can also become invasive in certain ecosystems if not managed properly."
}
