{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elatior subsp. turkanae",
    "plant_slug": "acacia-elatior-subsp-turkanae",
    "plant_name_scientific": "acacia elatior subsp. turkanae",
    "intro": "Acacia elatior subsp. turkanae, commonly known as Turkana acacia, is a shrub or small tree native to arid regions of East Africa. It is characterized by its slender, often twisted branches and phyllodes that are typically linear to narrowly elliptic. The plant produces yellow flowers in globular or cylindrical clusters, which are attractive to pollinators. It thrives in well-drained soils and is adapted to withstand drought and high temperatures. Its ecological importance includes providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia elatior subsp. turkanae is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and parts of South Africa. It is commonly found in savanna and woodland habitats, often growing in regions with a tropical or subtropical climate. This subspecies thrives in well-drained soils and is adapted to seasonal rainfall patterns. It is often found in open grasslands and along riverbanks. Its distribution is closely tied to areas with sufficient sunlight and moderate to high temperatures.",
    "distribution_introduced_art_desc": "Acacia elatior subsp. turkanae was mainly introduced to arid and semi-arid regions of East Africa, particularly in Kenya and Somalia. It is commonly found in rocky soils and along riverbanks, where it thrives in harsh environmental conditions. This subspecies is valued for its hardy nature and ability to stabilize soil in degraded landscapes. It has been used in reforestation projects and as a source of firewood and fodder. Its introduction has helped in ecological restoration efforts in regions facing desertification."
}
