{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cheelii",
    "plant_slug": "acacia-cheelii",
    "plant_name_scientific": "acacia cheelii",
    "intro": "Acacia cheelii, commonly known as the cheelii acacia, is a shrub native to the arid regions of southwestern Australia. It is characterized by its dense, thorny foliage and produces yellow flowers in late winter to early spring. The plant has small, oval-shaped leaves that are often modified into phyllodes, which help reduce water loss in its dry environment. Acacia cheelii is also noted for its ability to fix nitrogen through symbiotic relationships with rhizobia bacteria. This species is valued for its ornamental appeal and ecological importance in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cheelii"
    },
    "taxonomy_art_desc": "Acacia cheelii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which comprises plants with flowers that have a distinctive structure and includes legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their unique, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia cheelii, a specific type of acacia native to Australia, known for its ecological and horticultural significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cheelii is primarily native to New South Wales. It is commonly found in the coastal regions and sandplain areas of the state. This plant thrives in sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the dry and warm climate of the region. Acacia cheelii plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia cheelii was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It thrives in environments where temperatures range between 15°C and 30°C. This plant is often found in disturbed soils, such as along roadsides or in degraded landscapes. Its introduction has been associated with land rehabilitation and soil stabilization efforts. However, it can become invasive in certain ecosystems if not managed properly."
}
