{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia incurvaneura",
    "plant_slug": "acacia-incurvaneura",
    "plant_name_scientific": "acacia incurvaneura",
    "intro": "Acacia incurvaneura, commonly known as the warty acacia, is a shrub or small tree native to southern Africa. It belongs to the legume family, Fabaceae, and is characterized by its distinctive, warty, and often curved thorns. The plant produces yellow flowers in dense, globular clusters, which are followed by flat, leathery pods. Its leaves are bipinnate, with small, rounded leaflets that are often covered in fine hairs. Acacia incurvaneura is adapted to arid environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia incurvaneura"
    },
    "taxonomy_art_desc": "Acacia incurvaneura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with fused petals and include legumes and beans. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny foliage and showy flowers. Its species is Acacia incurvaneura, a specific type of acacia known for its unique leaf structure and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia incurvaneura is primarily native to the Northern Territory, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions within these states. It typically grows in sandy or rocky soils and is well adapted to the harsh environmental conditions of its native range. The plant is often seen in shrublands and open woodlands. Its distribution reflects its ability to thrive in the dry climates of central and western Australia.",
    "distribution_introduced_art_desc": "Acacia incurvaneura was mainly introduced to control erosion and provide shade in degraded lands. It is commonly found in arid and semi-arid regions where it establishes quickly and forms dense thickets. The plant is valued for its drought tolerance and ability to thrive in poor soil conditions. However, it can become invasive, outcompeting native vegetation in some areas. Its distribution has expanded due to human activities and climate change."
}
