{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mimula",
    "plant_slug": "acacia-mimula",
    "plant_name_scientific": "acacia mimula",
    "intro": "Acacia mimula, commonly known as the slender acacia, is a small shrub native to the arid regions of southern Africa. It is characterized by its narrow, woody stems and small, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in clusters, which are typically followed by small, woody pods containing seeds. Acacia mimula is adapted to survive in harsh, dry environments, making it a hardy species in xerophytic ecosystems. It plays a role in stabilizing soil and providing habitat for various desert organisms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mimula"
    },
    "taxonomy_art_desc": "Acacia mimula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and specialized structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and numerous stamens, and includes legumes and other related families. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like clusters of flowers and often used in traditional medicine and as sources of timber. Its species is Acacia mimula, a specific type of acacia found in certain regions, known for its ecological importance and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mimula is primarily native to the Northern Territory. It is commonly found in arid and semi-arid regions within this area. The plant thrives in sandy or rocky soils and is often seen in shrublands and woodland habitats. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distribution is closely linked to the environmental conditions of the Northern Territory.",
    "distribution_introduced_art_desc": "Acacia mimula was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Cape Province and parts of the Eastern Cape. The plant thrives in sandy soils and is often seen along roadsides and in disturbed areas. Due to its adaptability, it has spread beyond its original introduction sites. However, its impact on native ecosystems is still being studied."
}
