{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia centralis",
    "plant_slug": "acacia-centralis",
    "plant_name_scientific": "acacia centralis",
    "intro": "Acacia centralis, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stem and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in compact spikes, which are followed by flat, leathery pods containing seeds. Acacia centralis thrives in well-drained soils and is adapted to arid and semi-arid environments. It is often used in traditional medicine and has ecological significance as a source of food for various animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia centralis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in grasslands and savanna ecosystems. This species is well adapted to drought conditions and can tolerate high temperatures. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia centralis is also sometimes cultivated for its ornamental value and as a source of timber.",
    "distribution_introduced_art_desc": "Acacia centralis was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of Australia and the southwestern United States. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. Its introduction has sometimes led to competition with native species in invaded areas. Acacia centralis is also valued for its ornamental qualities and provides habitat for various wildlife species."
}
