{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia littorea",
    "plant_slug": "acacia-littorea",
    "plant_name_scientific": "acacia littorea",
    "intro": "Acacia littorea, commonly known as the coastal wattle, is a shrub native to coastal regions of southern Africa. It is characterized by its slender, often multi-branched stems and small, phyllodes that are typically linear to elliptic in shape. The plant produces yellow flowers in compact spherical or cylindrical heads, which bloom from late winter to early spring. Acacia littorea is well adapted to coastal environments, tolerating salt spray and sandy soils. Its ecological importance includes providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia littorea is primarily native to coastal regions of southern Australia, including Western Australia, South Australia, and Tasmania. It thrives in sandy or rocky soils along shores and dunes, often in areas with a temperate to Mediterranean climate. This plant is commonly found in coastal heathlands and scrub communities, where it plays a role in stabilizing dunes and preventing erosion. Its distribution is closely linked to maritime climates and is less common in inland areas. Acacia littorea is also occasionally found in New Zealand, likely through human introduction.",
    "distribution_introduced_art_desc": "Acacia littorea was mainly introduced to coastal areas and sandy soils where it can thrive in saline and well-drained conditions. It is commonly found in regions with a Mediterranean climate, such as parts of California and the Mediterranean Basin. This plant is often used for erosion control due to its ability to stabilize dunes and prevent soil erosion. However, it can become invasive in some areas, outcompeting native vegetation. Its introduction has led to both ecological benefits and management challenges in certain ecosystems."
}
