{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia latifrons",
    "plant_slug": "acacia-latifrons",
    "plant_name_scientific": "acacia latifrons",
    "intro": "Acacia latifrons, commonly known as the broad-leaved acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its thick, waxy leaves that help reduce water loss in its harsh environment. The plant produces yellow flowers in dense, globular clusters, which are an important food source for various pollinators. Its bark is often fissured and can be used in traditional medicine by local communities. Acacia latifrons is well adapted to drought and thrives in sandy or rocky soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia latifrons is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in a variety of habitats, including savannas, woodlands, and rocky outcrops. This species is commonly found in areas with a tropical or subtropical climate. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia latifrons is also known for its ability to withstand drought conditions, making it well adapted to its native environment.",
    "distribution_introduced_art_desc": "Acacia latifrons was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in harsh environmental conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its rapid growth and hardy nature make it suitable for windbreaks and afforestation efforts. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
