{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia monacantha",
    "plant_slug": "acacia-monacantha",
    "plant_name_scientific": "acacia monacantha",
    "intro": "Acacia monacantha, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant is adapted to arid and semi-arid environments, making it drought-resistant. Its wood is hard and durable, historically used by Indigenous Australians for tool-making. The species plays an important ecological role in providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia monacantha is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, often growing in sandy or rocky soils. This plant thrives in open woodlands and savannas, where it can withstand high temperatures and low rainfall. It is well adapted to the harsh environmental conditions of its native habitat. Acacia monacantha plays an important ecological role by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia monacantha was mainly introduced to New Zealand as an ornamental plant due to its attractive golden foliage and drought tolerance. It was also promoted for its ability to thrive in poor soils and its potential for erosion control. However, it has since become invasive, outcompeting native species in many areas. Its rapid growth and ability to form dense thickets have led to its classification as a noxious weed in several regions. Efforts are ongoing to manage its spread and mitigate its ecological impact."
}
