{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rhodoxylon",
    "plant_slug": "acacia-rhodoxylon",
    "plant_name_scientific": "acacia rhodoxylon",
    "intro": "Acacia rhodoxylon, commonly known as the red acacia, is a flowering plant native to tropical regions of Africa. It is characterized by its distinctive red-brown bark and bipinnate leaves that are often feathery in appearance. The plant produces yellow to orange flowers that are clustered in globular inflorescences, attracting a variety of pollinators. It is typically found in dry savanna and woodland habitats, where it plays a role in soil stabilization and provides habitat for wildlife. The wood of Acacia rhodoxylon is hard and durable, making it valuable for construction and fuel.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rhodoxylon"
    },
    "taxonomy_art_desc": "Acacia rhodoxylon belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with complex floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive leaf structures and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia rhodoxylon, a specific type of acacia known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rhodoxylon is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This species typically grows in open woodlands and heathlands. It is well adapted to the dry and sunny conditions of its native habitat. The plant is commonly seen in the northeastern parts of Queensland.",
    "distribution_introduced_art_desc": "Acacia rhodoxylon was mainly introduced to areas with sandy or rocky soils and a warm, dry climate. It is commonly found in regions of the Mediterranean, parts of southern Europe, and some areas of North Africa. This plant is often used for erosion control due to its deep root system and ability to thrive in poor soil conditions. It also serves as a source of timber and has been introduced for ornamental purposes in some regions. However, it can become invasive in certain environments if not managed properly."
}
