{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia perpusilla",
    "plant_slug": "acacia-perpusilla",
    "plant_name_scientific": "acacia perpusilla",
    "intro": "Acacia perpusilla, commonly known as the small-flowered wattle, is a small shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to arid environments, featuring small, waxy leaves to reduce water loss. It plays a role in soil stabilization and provides nectar for native pollinators. Acacia perpusilla is often used in horticulture for its ornamental value and resilience.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia perpusilla"
    },
    "taxonomy_art_desc": "Acacia perpusilla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their unique vascular systems and often ancient lineage. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants with characteristic flowers and often includes legumes that form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, known for their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their unique phyllodes and often used in traditional medicine. Its species is Acacia perpusilla, a small shrub native to Australia, characterized by its small leaves and yellow flowers, often used in horticulture for its ornamental value.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia perpusilla is primarily native to Western Australia. It is commonly found in the region's arid and semi-arid zones, particularly in the southern and central parts of the state. This small shrub thrives in sandy or gravelly soils and is often seen in coastal and inland areas. It is well adapted to the harsh climate of Western Australia, including high temperatures and low rainfall. The plant plays an important role in the local ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia perpusilla was mainly introduced to New South Wales, Australia, as part of ornamental and revegetation programs. It is commonly found in coastal and semi-arid regions, particularly in the south-western and central parts of the state. The plant thrives in well-drained soils and is often used in landscaping due to its hardy nature and attractive foliage. However, it has also become naturalized in some areas, raising concerns about its potential to spread beyond cultivated sites. Its introduction has been documented in various ecological and botanical surveys across the region."
}
