{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chrysochaeta",
    "plant_slug": "acacia-chrysochaeta",
    "plant_name_scientific": "acacia chrysochaeta",
    "intro": "Acacia chrysochaeta, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late winter to early spring. The plant thrives in well-drained soils and is adapted to arid and semi-arid environments. It is an important species in Australian ecosystems, providing habitat and food for various native animals. The golden wattle is also the national floral emblem of Australia, symbolizing the country's natural heritage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia chrysochaeta"
    },
    "taxonomy_art_desc": "Acacia chrysochaeta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and ability to thrive in arid environments. Its species is Acacia chrysochaeta, a specific type of acacia found in certain regions of Australia, known for its yellow flowers and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chrysochaeta is primarily native to Western Australia. It is commonly found in the southern and western regions of the state, particularly in areas with sandy soils. This species is often associated with coastal and inland dune environments. It thrives in arid and semi-arid conditions, making it well adapted to the local climate. Its distribution is largely confined to the southwestern and southeastern parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia chrysochaeta was mainly introduced to South Africa, where it has become an invasive species. It was originally from Australia and was brought to South Africa for ornamental purposes due to its attractive yellow flowers. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to significant ecological impacts, including soil degradation and reduced biodiversity. Efforts are being made to control its spread through mechanical removal and biological control methods."
}
