{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kamerunensis",
    "plant_slug": "acacia-kamerunensis",
    "plant_name_scientific": "acacia kamerunensis",
    "intro": "Acacia kamerunensis, commonly known as the Cameroon acacia, is a shrub or small tree native to Cameroon and adjacent regions of Central Africa. It is characterized by its bipinnate leaves, which are composed of numerous small leaflets arranged in a feathery pattern. The plant produces yellow flowers in compact globular heads, which are followed by flat, pod-like fruits containing seeds. Acacia kamerunensis is adapted to dry and semi-arid environments, making it a resilient species in tropical savanna ecosystems. It plays a role in local ecosystems and has been used traditionally for various purposes, including medicinal and construction applications.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kamerunensis is primarily native to Cameroon and the neighboring regions of Nigeria and Central African Republic. It is commonly found in savanna and woodland areas, particularly in the southern and western parts of Cameroon. This plant thrives in regions with a tropical climate and well-drained soils. It is often associated with dry forests and is adapted to seasonal rainfall patterns. Acacia kamerunensis plays an important ecological role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia kamerunensis was mainly introduced to control soil erosion and provide firewood in tropical and subtropical regions. It is commonly found in degraded lands and along roadsides where it establishes quickly. The plant thrives in poor soils and can tolerate drought conditions, making it suitable for reclamation projects. Its rapid growth and ability to fix nitrogen improve soil fertility over time. However, it may become invasive in some areas if not managed properly."
}
