{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia micracantha",
    "plant_slug": "acacia-micracantha",
    "plant_name_scientific": "acacia micracantha",
    "intro": "Acacia micracantha, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow floral spikes. The plant is adapted to arid and semi-arid environments, showcasing drought tolerance through its deep root system. Its flowers attract nectar-feeding birds and insects, contributing to its ecological significance. The wood of Acacia micracantha is hard and durable, historically used by Indigenous Australians for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia micracantha is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Mozambique, and South Africa. It is commonly found in savannas, woodlands, and rocky areas with well-drained soils. This species thrives in regions with a tropical or subtropical climate and is often associated with dry seasonal environments. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia micracantha is also valued for its hardy nature and is sometimes used in traditional medicine and land rehabilitation efforts.",
    "distribution_introduced_art_desc": "Acacia micracantha was mainly introduced to South Africa, particularly in the Eastern Cape and Western Cape provinces. It was brought there for its potential use in soil stabilization and as a source of timber and fodder. The plant thrives in dry, sandy soils and is often found in coastal and inland areas. Its introduction has led to its establishment in both natural and cultivated landscapes. However, it is considered invasive in some regions, posing a threat to native vegetation."
}
