{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cochlearis",
    "plant_slug": "acacia-cochlearis",
    "plant_name_scientific": "acacia cochlearis",
    "intro": "Acacia cochlearis, commonly known as the coastal acacia, is a shrub or small tree native to coastal regions of southern Africa. It is characterized by its slender, often multi-branched stems and small, leathery leaves that are typically arranged in pairs. The plant produces yellow flowers in compact globular heads, which are followed by seed pods that are curved and resemble a cochlea, hence its scientific name. It thrives in sandy or rocky soils and is adapted to coastal conditions with high salt exposure and strong winds. Acacia cochlearis plays an important role in stabilizing dunes and providing habitat for various coastal wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cochlearis"
    },
    "taxonomy_art_desc": "Acacia cochlearis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their primitive floral structures and diverse morphological features. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants in the legume family, known for their thorny shrubs and acacia-like appearance. Its species is Acacia cochlearis, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cochlearis is primarily native to Western Australia. It is commonly found in the dry, arid regions of the state, particularly in the southern and western parts. This plant thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. It is well adapted to the harsh climate of the region, with its small, waxy leaves helping to reduce water loss. Acacia cochlearis plays an important ecological role in its native habitat, providing shelter and food for various local wildlife species.",
    "distribution_introduced_art_desc": "Acacia cochlearis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in diverse environmental conditions. It has since spread beyond cultivated areas, becoming naturalized in various regions across the country. The plant's rapid growth and ability to colonize disturbed soils have led to its classification as a potential environmental weed. It is commonly found in coastal areas, riverbanks, and open forests, where it can outcompete native vegetation. Due to its invasive potential, management strategies are being developed to control its spread and mitigate its impact on local ecosystems."
}
