{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella goldmanii",
    "plant_slug": "acaciella-goldmanii",
    "plant_name_scientific": "acaciella goldmanii",
    "intro": "Acaciella goldmanii, commonly known as the golden acacia, is a small, evergreen shrub native to the Caribbean island of Hispaniola. It is characterized by its dense, leathery foliage and produces small, fragrant yellow flowers that bloom in clusters. The plant is adapted to coastal environments and thrives in well-drained, sandy soils. Its unique appearance and limited distribution make it a rare and ecologically significant species. Acaciella goldmanii plays an important role in the local ecosystem, providing habitat and food for various insect and bird species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella goldmanii"
    },
    "taxonomy_art_desc": "Acaciella goldmanii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and their allies, known for their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide range of morphological diversity. Its order is Fabales, which includes plants with distinctive flowers that have a single stamen and a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acaciella, a small group of shrubs or trees native to South America, known for their small, clustered flowers. Its species is Acaciella goldmanii, a specific plant within the genus Acaciella, named after the botanist who first described it, and is recognized for its unique floral structure and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella goldmanii is primarily native to Mexico Northwest and Mexico Southwest. This species is found in the arid and semi-arid regions of these areas. It typically grows in rocky soils and is adapted to dry climates. The plant is part of the legume family and is known for its small, yellow flowers. Its distribution is limited to specific ecological zones within these regions.",
    "distribution_introduced_art_desc": "Acaciella goldmanii was mainly introduced to areas with sandy soils and coastal environments, particularly in the Caribbean and parts of Central America. It thrives in warm, humid climates with moderate rainfall. This plant is often found in disturbed habitats such as roadsides and abandoned fields. Its introduction has led to its establishment in several regions where it competes with native vegetation. Due to its rapid growth and adaptability, it has become a common sight in many tropical coastal zones."
}
