{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hebeclada",
    "plant_slug": "acacia-hebeclada",
    "plant_name_scientific": "acacia hebeclada",
    "intro": "Acacia hebeclada, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, upright growth habit. The plant features bipinnate leaves that are narrow and finely divided, giving it a delicate appearance. Its yellow flowers are clustered in spherical or cylindrical heads, typical of many acacia species. Acacia hebeclada is often found in sandy soils and is adapted to arid or semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hebeclada is primarily native to the coastal regions of southern Australia, including the states of South Australia and Western Australia. It thrives in sandy or gravelly soils and is commonly found in dunes and open woodlands. This plant is well adapted to the arid and semi-arid climates of its native range. It plays an important role in stabilizing coastal dunes and providing habitat for local wildlife. Acacia hebeclada is also known for its distinctive, flat, feathery leaves and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia hebeclada was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and ability to thrive in various soil conditions. It was first brought to the country in the 19th century by European settlers who admired its hardy nature and aesthetic value. Despite its benefits, it has since become invasive in some regions, outcompeting native vegetation and altering local ecosystems. The plant is commonly found in coastal areas and disturbed sites, where it spreads rapidly through seed dispersal. Its introduction highlights the ecological risks associated with non-native species in new environments."
}
