{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia xerophila var. xerophila",
    "plant_slug": "acacia-xerophila-var-xerophila",
    "plant_name_scientific": "acacia xerophila var. xerophila",
    "intro": "Acacia xerophila var. xerophila, commonly known as the desert wattle, is a shrub native to arid regions of Australia. It is characterized by its slender, wiry stems and small, phyllode-like leaves that reduce water loss. The plant produces yellow flowers in spikes, which attract nectar-feeding birds and insects. It is well adapted to dry conditions, with deep root systems and a slow growth rate. This variety is notable for its ecological role in stabilizing soils in harsh environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia xerophila"
    },
    "taxonomy_art_desc": "Acacia xerophila var. xerophila belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their ability to perform photosynthesis and form complex structures. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often featuring primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and sepals. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and commercial contexts. Its species is Acacia xerophila, a specific variety within the Acacia genus adapted to arid environments, showcasing features that enable survival in dry conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia xerophila var. xerophila is primarily native to Western Australia. This variant of the species is found in the southern regions of the state, particularly in the coastal and sandy areas. It thrives in arid and semi-arid environments, adapting well to the harsh conditions of the region. The plant is commonly seen in heathlands and open woodlands. Its distribution is closely linked to the unique climatic and soil conditions of Western Australia.",
    "distribution_introduced_art_desc": "Acacia xerophila var. xerophila was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions with low rainfall and high temperatures, making it suitable for restoration projects in degraded landscapes. This plant has been introduced to several parts of Australia, particularly in the inland regions of Queensland and New South Wales. Its ability to fix nitrogen makes it valuable for soil stabilization and improving soil fertility. However, its rapid growth and spread can sometimes lead to competition with native species."
}
