{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia wattsiana",
    "plant_slug": "acacia-wattsiana",
    "plant_name_scientific": "acacia wattsiana",
    "intro": "Acacia wattsiana, commonly known as the watt's acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures in mature plants. The plant produces yellow to golden-green flowers in compact, globular heads, which are typically borne in clusters along the stems. It is well adapted to dry environments, with a deep root system that allows it to access water from deeper soil layers. Acacia wattsiana is also known for its ability to fix nitrogen, contributing to soil fertility in nutrient-poor areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia wattsiana"
    },
    "taxonomy_art_desc": "Acacia wattsiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of plants with flowers typically having five petals and includes legumes, which are known for their nitrogen-fixing ability. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods as fruits and often forming symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of flowering plants commonly known as wattles, which are typically shrubs or trees with phyllodes and often have a symbiotic relationship with nitrogen-fixing bacteria. Its species is Acacia wattsiana, a specific type of acacia found in certain regions, notable for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia wattsiana is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the southern and western parts. This plant typically grows in sandy soils and is often seen along roadsides and in open woodlands. It is well adapted to the harsh climatic conditions of the region. Its distribution is largely confined to the southern and western areas of South Australia.",
    "distribution_introduced_art_desc": "Acacia wattsiana was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was initially brought in for its ornamental value and potential for soil stabilization. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to concerns over biodiversity loss and habitat degradation. Efforts are now being made to control its spread and manage its impact on native flora."
}
