{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia masliniana",
    "plant_slug": "acacia-masliniana",
    "plant_name_scientific": "acacia masliniana",
    "intro": "Acacia masliniana, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and feathery, bipinnate leaves. The plant produces yellow flowers in globular or cylindrical clusters, which are typically pollinated by birds and insects. Acacia masliniana thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. It is also valued for its ornamental appeal and is sometimes used in horticulture.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia masliniana"
    },
    "taxonomy_art_desc": "Acacia masliniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique structural features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume family, which is characterized by the presence of pods as fruits and nitrogen-fixing capabilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia masliniana, a specific type of acacia native to certain regions of Australia, recognized for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia masliniana is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in dry, sandy soils and is often associated with open woodlands and shrublands. It is well adapted to the arid and semi-arid climate of its native range. Acacia masliniana plays an important ecological role in supporting local wildlife and maintaining biodiversity in its habitat.",
    "distribution_introduced_art_desc": "Acacia masliniana was mainly introduced to Australia as an ornamental plant due to its attractive appearance and adaptability to various environmental conditions. It has since spread beyond cultivated areas and is now considered a weed in several regions, particularly in coastal and disturbed soils. The plant's rapid growth and ability to thrive in poor soil conditions have contributed to its successful establishment in native ecosystems. It is commonly found in coastal dunes, roadsides, and other disturbed habitats across eastern and southern Australia. Due to its invasive potential, it is now monitored and managed in some areas to prevent further spread."
}
