{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rojasii",
    "plant_slug": "acacia-rojasii",
    "plant_name_scientific": "acacia rojasii",
    "intro": "Acacia rojasii, commonly known as the red acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its slender, often thorned branches and small, bipinnate leaves that are typically gray-green in color. The plant produces yellow flowers in dense, spherical clusters, which bloom during the rainy season. Acacia rojasii is adapted to survive in harsh, dry conditions, with deep root systems that help it access groundwater. It plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rojasii is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. It is commonly found in sandy soils and coastal dunes, where it thrives in hot and dry conditions. This species is also present in some parts of southern New Guinea, where it adapts to similar environmental conditions. Acacia rojasii is known for its distinctive yellow flowers and its ability to withstand extreme temperatures and limited water availability. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia rojasii was mainly introduced to South Africa as an ornamental plant due to its attractive appearance and drought tolerance. It has since become naturalized in several regions, particularly in the Western Cape and along the coast. The plant spreads through its serotinous seed pods, which release seeds after fires or disturbances. It is considered invasive in some areas, outcompeting native vegetation and altering local ecosystems. Management efforts are ongoing to control its spread and mitigate its ecological impact."
}
