{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia anadenia",
    "plant_slug": "acacia-anadenia",
    "plant_name_scientific": "acacia anadenia",
    "intro": "Acacia anadenia, commonly known as the red acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and its distinctive yellow flowers that appear in globular clusters. The leaves are typically small and feathery, with a pale green color. The plant produces flat, pod-like fruits that contain several seeds. It thrives in well-drained soils and is often found in arid or semi-arid regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia anadenia"
    },
    "taxonomy_art_desc": "Acacia anadenia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and other related plants. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like flower clusters and often used for timber or as ornamental plants. Its species is Acacia anadenia, a specific type of acacia found in certain regions, known for its unique morphological features and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia anadenia is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This species thrives in a variety of habitats, including open woodlands and grasslands. It is often associated with sandy or rocky soils. Acacia anadenia plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia anadenia was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and adequate sunlight. It is commonly found in parts of Australia, where it has been introduced for ornamental purposes and as a potential source of timber. The plant thrives in dry to semi-arid environments and is often used in reforestation projects due to its hardy nature. However, it can become invasive in some regions if not managed properly. Its introduction has raised concerns about its impact on native flora and ecosystems."
}
