{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dyeri",
    "plant_slug": "acacia-dyeri",
    "plant_name_scientific": "acacia dyeri",
    "intro": "Acacia dyeri, commonly known as the yellow wattle, is a shrub or small tree native to South Africa. It is characterized by its slender, zigzagging branches and bright yellow flowers that appear in clusters. The leaves are small, phyllodes, which are flattened leaf stalks that perform the function of true leaves. It thrives in well-drained soils and is often found in rocky or sandy habitats. The plant is valued for its ornamental appeal and is sometimes cultivated in gardens for its vibrant floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dyeri is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This species is adapted to withstand high temperatures and low rainfall, making it a resilient plant in its native habitat. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia dyeri is also sometimes cultivated in gardens in regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acacia dyeri was mainly introduced to the Mediterranean region, particularly in southern Europe, as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread to other parts of the world, including parts of the United States and Australia, where it has become naturalized in some areas. This plant is often found in disturbed soils and can thrive in a variety of environmental conditions. Its rapid growth and ability to establish itself in new areas have led to concerns about its potential invasiveness in certain regions. However, it is generally considered a low-risk species in most ecosystems."
}
