{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tetanophylla",
    "plant_slug": "acacia-tetanophylla",
    "plant_name_scientific": "acacia tetanophylla",
    "intro": "Acacia tetanophylla, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often zigzagging stems and small, bipinnate leaves. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in sandy or gravelly soils and is adapted to arid and semi-arid environments. Acacia tetanophylla is also valued for its ornamental appeal and its role in stabilizing soils in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tetanophylla"
    },
    "taxonomy_art_desc": "Acacia tetanophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants with distinctive flowers and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive compound leaves and often thorny structures, commonly found in arid and tropical regions. Its species is Acacia tetanophylla, a specific type of acacia native to Australia, known for its small, narrow leaves and yellow flowers, adapted to thrive in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tetanophylla is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the Cape Le Grand National Park. This species thrives in sandy soils and is often associated with coastal and near-coastal habitats. It is well adapted to the dry, Mediterranean climate of the region. Acacia tetanophylla plays an important ecological role in the local flora and is a characteristic plant of the region's unique biodiversity.",
    "distribution_introduced_art_desc": "Acacia tetanophylla was mainly introduced to South Australia and parts of Western Australia. It is commonly found in arid and semi-arid regions, often growing on rocky soils. This plant is well adapted to harsh environmental conditions, including drought and poor soil quality. It plays a role in stabilizing soil and providing habitat for local wildlife. However, it is considered a potential weed in some areas due to its aggressive growth habit."
}
