{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia furcella",
    "plant_slug": "acacia-furcella",
    "plant_name_scientific": "acacia furcella",
    "intro": "Acacia furcella, commonly known as the narrow-leaf wattle, is a shrub or small tree native to southern Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, often drooping branches and bipinnate leaves. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, cylindrical inflorescences. Acacia furcella is adapted to arid and semi-arid environments, with a deep root system that allows it to survive in poor soils. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia furcella is primarily native to eastern Australia, including Queensland, New South Wales, and the ACT. It is commonly found in coastal and sandy soils, often in heathlands and open woodlands. This species thrives in well-drained soils and is adapted to the temperate to subtropical climates of its native range. It is also present in some parts of southern New Guinea. Acacia furcella is known for its distinctive bipinnate leaves and yellow flowers, making it a notable plant in its native habitat.",
    "distribution_introduced_art_desc": "Acacia furcella was mainly introduced to control erosion and stabilize soils in disturbed areas. It is commonly used in reclamation projects due to its rapid growth and deep root system. The plant thrives in arid and semi-arid environments, making it suitable for rehabilitation of degraded lands. It has been introduced in several regions, including parts of Africa and the Middle East. However, its invasive potential requires careful management to prevent ecological disruption."
}
