{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acanthocarpa",
    "plant_slug": "acacia-acanthocarpa",
    "plant_name_scientific": "acacia acanthocarpa",
    "intro": "Acacia acanthocarpa, commonly known as the rough-bark acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its pale yellow flowers and phyllodes that are typically narrow and rough in texture. The plant has a woody, fissured bark that provides structural support and protection. It is adapted to survive in dry conditions with deep root systems and low water requirements. Acacia acanthocarpa plays a role in stabilizing soil and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acanthocarpa is primarily native to Australia, particularly in the northern and eastern regions. It is commonly found in the tropical and subtropical areas of Queensland, Northern Territory, and Western Australia. This plant thrives in dry, sandy soils and is often found in coastal dunes and open woodlands. It is well adapted to arid and semi-arid environments. Its distribution is closely associated with areas that have a warm, dry climate with seasonal rainfall.",
    "distribution_introduced_art_desc": "Acacia acanthocarpa was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the southern and western parts of the country. This plant is often used for erosion control due to its hardy nature and ability to establish quickly. It has also been introduced to other parts of the world, including some regions of Africa and the Middle East. However, its introduction has raised concerns about its potential to become invasive in non-native environments."
}
