{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia anthochaera",
    "plant_slug": "acacia-anthochaera",
    "plant_name_scientific": "acacia anthochaera",
    "intro": "Acacia anthochaera, commonly known as the silver wattle, is a shrub or small tree native to southeastern Australia. It is characterized by its slender, grey-green foliage and its distinctive yellow flower spikes that bloom in late winter to early spring. The plant has small, pod-like fruits that contain several seeds, which are dispersed by wind. Acacia anthochaera is adapted to a variety of soil types and is often found in coastal and sandy environments. It is a hardy species that thrives in full sun and is relatively drought-tolerant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia anthochaera"
    },
    "taxonomy_art_desc": "Acacia anthochaera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Fabales, which comprises plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa, Australia, and Asia, known for their sharp thorns and nitrogen-fixing capabilities. Its species is Acacia anthochaera, a specific type of acacia native to Australia, recognized for its unique ecological role and distinctive appearance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia anthochaera is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in dry, sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia anthochaera plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia anthochaera was mainly introduced to South Australia and Western Australia for its ornamental value and ability to thrive in arid conditions. It is commonly found in coastal and inland areas where it forms dense shrubs or small trees. The plant is well adapted to sandy soils and can tolerate drought, making it a popular choice for landscaping in dry regions. Its yellow flowers provide nectar for pollinators, contributing to local biodiversity. However, it has also been reported to spread into native habitats, raising concerns about its potential as an invasive species."
}
