{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustissima var. oaxacana",
    "plant_slug": "acacia-angustissima-var-oaxacana",
    "plant_name_scientific": "acacia angustissima var. oaxacana",
    "intro": "Acacia angustissima var. oaxacana, commonly known as the Oaxaca acacia, is a shrub or small tree native to Mexico. It is characterized by its narrow, linear leaves and yellow, globular flower heads. The plant is adapted to arid and semi-arid environments, showing drought tolerance. It belongs to the Fabaceae family, which includes legumes, and is known for its nitrogen-fixing ability. The species is often found in rocky soils and is used in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustissima var. oaxacana is primarily native to southern Mexico, specifically the states of Oaxaca and Chiapas. This variant of the species is found in the tropical and subtropical regions of these areas. It typically grows in dry to semi-arid environments, often in rocky or limestone soils. The plant is well adapted to the local climate and plays a role in the ecological balance of its native habitat. It is commonly found in scrublands and along the edges of forests in its range.",
    "distribution_introduced_art_desc": "Acacia angustissima var. oaxacana was mainly introduced to regions with a Mediterranean climate characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal areas and rocky slopes. This plant is often used for erosion control due to its deep root system and ability to withstand drought conditions. It has also been introduced as an ornamental plant in gardens and landscaped areas. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems."
}
