{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia neurocarpa",
    "plant_slug": "acacia-neurocarpa",
    "plant_name_scientific": "acacia neurocarpa",
    "intro": "Acacia neurocarpa, commonly known as the Natal acacia, is a shrub or small tree native to southern Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features bipinnate leaves with small, clustered leaflets, and it produces yellow flowers in spring. It is adapted to arid and semi-arid environments, often found in savannas and along riverbanks. The tree is also valued for its hard wood and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia neurocarpa"
    },
    "taxonomy_art_desc": "Acacia neurocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their spore-producing life cycle and often possessing vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and produce legume-like fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their sharp thorns and often compound leaves, with many species used for timber or as sources of gum. Its species is Acacia neurocarpa, a specific type of acacia found in certain regions, recognized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia neurocarpa is primarily native to the Northern Territory and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often associated with shrublands and woodland ecosystems. Acacia neurocarpa is well adapted to the harsh climatic conditions of its native range. It plays an important role in the local flora and is a characteristic species of the region.",
    "distribution_introduced_art_desc": "Acacia neurocarpa was mainly introduced to areas with a tropical and subtropical climate, particularly in regions with well-drained soils and adequate sunlight. It is commonly found in parts of Africa, Asia, and the Pacific Islands where it has been used for its hardy nature and multiple ecological benefits. The plant is often introduced for purposes such as soil stabilization, windbreaks, and as a source of timber and fodder. Its rapid growth and adaptability make it a popular choice for reforestation and land rehabilitation projects. However, in some regions, it has become invasive, outcompeting native species and altering local ecosystems."
}
