{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aromatica",
    "plant_slug": "acacia-aromatica",
    "plant_name_scientific": "acacia aromatica",
    "intro": "Acacia aromatica, commonly known as the sweet acacia, is a shrub or small tree native to southern Africa. It is characterized by its feathery, bipinnate leaves and yellow, spherical flower heads that bloom in spring. The plant produces a fragrant, resinous gum that has been used traditionally for its medicinal and aromatic properties. It thrives in well-drained soils and is often found in rocky or sandy habitats. Its ecological importance includes providing nectar for pollinators and serving as a food source for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aromatica is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and shrubland ecosystems. This species is well adapted to drought conditions and can tolerate high temperatures. It is often seen growing in open woodland areas and along riverbanks in its native range. Acacia aromatica plays an important ecological role by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia aromatica was mainly introduced to areas with warm, arid climates and well-drained soils, where it can thrive in full sun. It is commonly found in regions with low rainfall and high temperatures, making it suitable for dryland environments. This plant is often used in reclamation projects due to its ability to stabilize soil and prevent erosion. Its introduction has also been associated with ornamental purposes in landscaping. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
