{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia beadleana",
    "plant_slug": "acacia-beadleana",
    "plant_name_scientific": "acacia beadleana",
    "intro": "Acacia beadleana, commonly known as the silky oaks, is a deciduous tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a soft, silvery appearance. The tree produces yellow flowers in late winter to early spring, which are clustered in globular inflorescences. Its bark is smooth and grey, often exfoliating to reveal a lighter inner layer. Acacia beadleana is well adapted to dry climates and is often used in landscaping for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia beadleana"
    },
    "taxonomy_art_desc": "Acacia beadleana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that often have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive fruit pods and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their thorn-like structures and often used in traditional medicine and as sources of timber. Its species is Acacia beadleana, a specific type of acacia native to Australia, recognized for its unique morphology and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia beadleana is primarily native to New South Wales. It is commonly found in the coastal and inland regions of the state. This plant thrives in a variety of soil types but prefers well-drained soils. It is often seen in open woodlands and along riverbanks. Acacia beadleana is an important component of the local flora and supports various wildlife species.",
    "distribution_introduced_art_desc": "Acacia beadleana was mainly introduced to regions with a Mediterranean climate, characterized by dry summers and wet winters. It is commonly found in areas with well-drained soils, such as coastal dunes and rocky outcrops. This plant has been introduced to parts of California, Oregon, and New Zealand due to its ornamental value and ability to thrive in disturbed soils. However, it has also become invasive in some areas, outcompeting native vegetation. Its rapid growth and seed dispersal make it a challenging species to control in non-native environments."
}
