{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassifolia",
    "plant_slug": "acacia-crassifolia",
    "plant_name_scientific": "acacia crassifolia",
    "intro": "Acacia crassifolia, commonly known as the broadleaf acacia, is a flowering plant native to parts of Africa and the Arabian Peninsula. It is characterized by its woody shrub form and compound leaves with small, oval-shaped leaflets. The plant produces yellow flowers arranged in dense, globular inflorescences, which are often visited by insects and birds. Acacia crassifolia is adapted to arid and semi-arid environments, showing drought resistance through its thick, waxy leaves. It plays a role in local ecosystems and has been used traditionally for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassifolia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in hot and dry conditions. This species is well adapted to nutrient-poor soils and can tolerate high temperatures and low rainfall. It plays an important ecological role by providing habitat and food for various animals and insects. Acacia crassifolia is also known for its distinctive, flat, leaf-like structures that help reduce water loss.",
    "distribution_introduced_art_desc": "Acacia crassifolia was mainly introduced to areas with arid or semi-arid climates due to its adaptability to harsh environments. It thrives in regions with low rainfall and well-drained soils, making it suitable for reclamation of degraded lands. The plant is often used in afforestation and soil stabilization projects because of its deep root system and drought tolerance. Its introduction has also been associated with the spread of invasive species in some regions. However, it is generally considered a hardy and low-maintenance plant for ecological restoration efforts."
}
