{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia inceana",
    "plant_slug": "acacia-inceana",
    "plant_name_scientific": "acacia inceana",
    "intro": "Acacia inceana, commonly known as the white acacia, is a shrub native to southern Africa. It is characterized by its slender, multi-branched stems and small, feathery leaves. The plant produces yellow flowers in compact spikes, which bloom during the warmer months. Acacia inceana is adapted to arid environments and is often found in sandy soils. It plays a role in stabilizing soil and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia inceana"
    },
    "taxonomy_art_desc": "Acacia inceana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinct structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used for timber and traditional medicine. Its species is Acacia inceana, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia inceana is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This plant thrives in dry, open habitats such as heathlands and woodlands. It is well adapted to the arid and semi-arid conditions of its native range. Acacia inceana plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia inceana was mainly introduced to control soil erosion and as a source of timber and fuelwood in arid and semi-arid regions. It is commonly found in degraded lands and has been widely planted in areas with low rainfall. The plant is known for its ability to thrive in poor soils and its rapid growth rate. However, its introduction has sometimes led to the displacement of native vegetation. Despite its benefits, Acacia inceana requires careful management to prevent it from becoming invasive."
}
