{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polymorpha var. pendula",
    "plant_slug": "acacia-polymorpha-var-pendula",
    "plant_name_scientific": "acacia polymorpha var. pendula",
    "intro": "Acacia polymorpha var. pendula, commonly known as the weeping acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive drooping branches that give it a cascading appearance. The plant produces feathery, bipinnate leaves and yellow, globular flower heads that bloom in summer. It thrives in well-drained soils and full sun, making it a popular choice for ornamental gardening. Its unique form and drought tolerance make it an adaptable and visually striking plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia polymorpha var. pendula is primarily native to the arid and semi-arid regions of Southwestern Australia. This variety is commonly found in sandy soils within the states of Western Australia, particularly in the areas of the Geraldton and Shark Bay regions. It thrives in coastal and inland dunes, often forming dense shrubs that provide habitat for local wildlife. The plant is well adapted to the harsh environmental conditions, including high temperatures and low rainfall. Its distinctive pendulous branches make it a notable species in the local flora.",
    "distribution_introduced_art_desc": "Acacia polymorpha var. pendula was mainly introduced to New Zealand, where it has become a naturalized species. It is commonly found in coastal areas and disturbed sites, often forming dense thickets. The plant is known for its drooping, feathery foliage and is often used in ornamental horticulture. Its rapid growth and ability to thrive in various soil types contribute to its spread. However, it can become invasive in certain environments, outcompeting native vegetation."
}
