{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulcherrima",
    "plant_slug": "acacia-pulcherrima",
    "plant_name_scientific": "acacia pulcherrima",
    "intro": "Acacia pulcherrima, commonly known as the flame tree, is a tropical evergreen tree native to South America. It is characterized by its feathery, bipinnate leaves and its striking, fiery red to orange flowers that bloom in clusters. The plant belongs to the Fabaceae family, which includes legumes, and it has a symbiotic relationship with nitrogen-fixing bacteria. Its seeds are encased in a woody pod and are dispersed by animals. The tree is often cultivated for its ornamental value and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulcherrima is primarily native to Central America, the Caribbean, and northern South America. It is commonly found in countries such as Mexico, Belize, Guatemala, Honduras, and parts of Colombia. This plant thrives in tropical and subtropical climates, often growing in coastal areas and lowland regions. It is also known as the \"Christmas tree\" due to its bright red flowers that bloom around the holiday season. Acacia pulcherrima is a popular ornamental plant due to its striking appearance and adaptability to various growing conditions.",
    "distribution_introduced_art_desc": "Acacia pulcherrima was mainly introduced to tropical and subtropical regions for ornamental purposes due to its striking red flowers. It is commonly found in gardens and landscaped areas in countries such as Mexico, India, and parts of Southeast Asia. The plant thrives in warm climates with well-drained soil and full sun exposure. Its introduction has sometimes led to it becoming an invasive species in certain regions. Despite its beauty, it requires careful management to prevent ecological disruption."
}
