{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pyrifolia var. morrisonii",
    "plant_slug": "acacia-pyrifolia-var-morrisonii",
    "plant_name_scientific": "acacia pyrifolia var. morrisonii",
    "intro": "Acacia pyrifolia var. morrisonii, commonly known as the Morrison's flame tree, is a variant of the flame tree species native to eastern Australia. It is characterized by its striking, bright red or orange flowers that appear in long, cylindrical clusters, typically during the spring and summer seasons. The plant has bipinnate leaves that are feathery and divided into small, narrow leaflets. It thrives in well-drained soils and full sun, making it a popular ornamental tree in gardens and urban landscapes. Its rapid growth and showy blooms make it a valuable addition to both natural and cultivated environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pyrifolia"
    },
    "taxonomy_art_desc": "Acacia pyrifolia var. morrisonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall and complex vascular systems. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their floral structures and evolutionary relationships. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees native to Australia and other parts of Africa and Asia, known for their distinctive phyllodes and nitrogen-fixing abilities. Its species is Acacia pyrifolia, a specific type of acacia known for its unique leaf structure and is a variant of the species with the name morrisonii.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pyrifolia var. morrisonii is primarily native to Western Australia. It is found in the southern and central regions of the state, particularly in the areas around the Geraldton and Esperance regions. This variety thrives in sandy soils and is commonly found in coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native habitat. The plant is often seen in open woodlands and heathlands, where it contributes to the local biodiversity.",
    "distribution_introduced_art_desc": "Acacia pyrifolia var. morrisonii was mainly introduced to ornamental horticulture and ecological restoration projects due to its attractive foliage and hardy nature. It is commonly cultivated in regions with Mediterranean climates, where it thrives in well-drained soils and full sun. This variety is valued for its ability to withstand drought and its role in stabilizing soil in degraded landscapes. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns about its potential impact on local ecosystems if not managed properly."
}
