{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subpaniculata",
    "plant_slug": "acacia-subpaniculata",
    "plant_name_scientific": "acacia subpaniculata",
    "intro": "Acacia subpaniculata, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and small, narrow leaves that are typically arranged in pairs. The plant produces yellow flowers in dense, spreading clusters, which are highly attractive to pollinators such as bees and birds. Its bark is smooth and greyish, and it can grow in a variety of soil types, though it prefers well-drained conditions. Acacia subpaniculata is often used in landscaping due to its ornamental value and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subpaniculata is primarily native to northern Australia, including the Northern Territory, Western Australia, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils and along riverbanks. This species thrives in hot, dry climates and is often seen in open woodlands and shrublands. Its distribution extends into parts of New Guinea and the island of Timor. Acacia subpaniculata is well adapted to the harsh environmental conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia subpaniculata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. The plant is often used for soil stabilization due to its deep root system and ability to tolerate saline conditions. Its rapid growth and adaptability have led to its spread beyond its original introduction sites. However, it is considered a potential weed in some areas due to its invasive tendencies."
}
