{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cufodontii",
    "plant_slug": "acacia-cufodontii",
    "plant_name_scientific": "acacia cufodontii",
    "intro": "Acacia cufodontii, commonly known as the African feverfew, is a shrub native to tropical Africa. It is characterized by its slender, branching stems and small, narrow leaves. The plant produces yellow flowers in rounded, globular clusters, which bloom during the dry season. Its leaves and flowers are often used in traditional medicine for their purported health benefits. Acacia cufodontii is adapted to arid environments and is often found in savannas and woodlands.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cufodontii is primarily native to the semi-arid regions of eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and parts of South Africa. It thrives in sandy or rocky soils and is commonly found in savannah and woodland habitats. This plant is well adapted to dry climates and can tolerate periods of drought. It plays an important ecological role by providing food and shelter for various wildlife species. Its distribution is closely linked to the availability of suitable habitat in these regions.",
    "distribution_introduced_art_desc": "Acacia cufodontii was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of East Africa, including Kenya, Tanzania, and Uganda. The plant is valued for its hardy nature and ability to withstand harsh environmental conditions. It is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has helped in reclaiming degraded lands in these regions."
}
