{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ruppii",
    "plant_slug": "acacia-ruppii",
    "plant_name_scientific": "acacia ruppii",
    "intro": "Acacia ruppii, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and its distinctive yellow flowers that bloom in winter. The plant produces small, flat, green pods that contain seeds, which are dispersed by wind. Acacia ruppii is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. It is also valued for its role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ruppii"
    },
    "taxonomy_art_desc": "Acacia ruppii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their complex flower structures and diverse habitats. Its order is Fabales, which includes flowering plants that are often legumes and are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its distinctive pod fruits and often nitrogen-fixing symbiotic relationships. Its genus is Acacia, a large group of shrubs and trees known for their sharp thorns and acacia-like foliage, commonly found in arid and tropical regions. Its species is Acacia ruppii, a specific type of acacia native to certain regions of Africa, known for its ecological and potential economic significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ruppii is primarily native to New South Wales and Queensland. It is commonly found in the subtropical and tropical regions of these states. This plant typically grows in sandy or rocky soils, often in coastal or inland areas. It is well adapted to the climate and environmental conditions of these regions. Acacia ruppii plays an important role in local ecosystems and is often used in landscaping due to its hardy nature.",
    "distribution_introduced_art_desc": "Acacia ruppii was mainly introduced to areas with tropical and subtropical climates, particularly in regions where it can thrive in well-drained soils. It has been introduced to parts of Southeast Asia, including countries like Indonesia and the Philippines, where it is used for ornamental purposes and soil stabilization. The plant is also found in parts of Australia and has been introduced to some Pacific Island nations. Due to its rapid growth and adaptability, it has sometimes become invasive in local ecosystems. Its introduction has raised concerns about its impact on native flora and biodiversity in these regions."
}
