{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia perrieri",
    "plant_slug": "acacia-perrieri",
    "plant_name_scientific": "acacia perrieri",
    "intro": "Acacia perrieri, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late winter to early spring. The plant produces flat, pod-like seed pods that contain several seeds. Acacia perrieri is well adapted to arid and semi-arid environments, making it a resilient species in harsh climates. It plays an important role in local ecosystems and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia perrieri is primarily native to the island of La Réunion, which is located in the Indian Ocean. This species is found in the southern part of the island, specifically in the mountainous regions. It thrives in areas with a subtropical climate and well-drained soils. Acacia perrieri is commonly found in dry forests and rocky habitats. It is an important component of the local flora and is adapted to the unique environmental conditions of La Réunion.",
    "distribution_introduced_art_desc": "Acacia perrieri was mainly introduced to areas with well-drained soils and a warm, arid climate, typically found in regions with low rainfall and high sunlight exposure. It thrives in sandy or rocky soils and is often found in coastal or semi-arid environments. This plant is commonly used for erosion control due to its deep root system and ability to stabilize soil. It has also been introduced as an ornamental plant in gardens and landscaped areas. However, its introduction has sometimes led to ecological concerns in non-native regions."
}
