{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vera",
    "plant_slug": "acacia-vera",
    "plant_name_scientific": "acacia vera",
    "intro": "Acacia vera, commonly known as Indian gum or gum arabic, is a flowering plant native to the arid regions of Africa and the Arabian Peninsula. It is characterized by its long, slender, yellowish-green pods that contain a sticky, resinous substance called gum arabic. The plant belongs to the legume family, Fabaceae, and is known for its ability to thrive in harsh, dry environments. Its leaves are bipinnate, meaning they are divided into small, feathery leaflets, and it produces small, fragrant flowers that are typically yellow or pale green. The gum arabic extracted from its pods is widely used in food, pharmaceutical, and cosmetic industries due to its emulsifying and stabilizing properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia vera is primarily native to the arid and semi-arid regions of northern Australia. It is commonly found in the Northern Territory, Western Australia, and Queensland. This plant thrives in sandy or clay soils and is often associated with spinifex grasslands. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife. Acacia vera is also known for its medicinal properties and is used in traditional Aboriginal medicine.",
    "distribution_introduced_art_desc": "Acacia vera was mainly introduced to regions with warm climates and well-drained soils, where it can thrive and establish itself. It is commonly found in areas with low rainfall, making it adaptable to arid and semi-arid environments. The plant is often used for its medicinal properties, particularly in traditional medicine practices. Its introduction has sometimes led to it becoming invasive in certain ecosystems. However, it is also valued for its ability to stabilize soil and prevent erosion in degraded lands."
}
