{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kelloggiana",
    "plant_slug": "acacia-kelloggiana",
    "plant_name_scientific": "acacia kelloggiana",
    "intro": "Acacia kelloggiana, commonly known as the Kellogg's acacia, is a flowering plant native to the arid regions of North America. It is a shrub or small tree that typically grows in sandy or rocky soils. The plant produces yellow flowers in clusters, which are often visited by bees and other pollinators. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. Acacia kelloggiana is adapted to withstand drought and high temperatures, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kelloggiana is primarily native to the southwestern United States and northern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Texas. This plant thrives in arid and semi-arid environments, often growing in rocky soils. It is commonly associated with desert scrub and chaparral ecosystems. Acacia kelloggiana is well adapted to withstand drought and high temperatures.",
    "distribution_introduced_art_desc": "Acacia kelloggiana was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with low rainfall. It is commonly cultivated in gardens and parks due to its ornamental value and ability to thrive in dry conditions. This plant is known for its distinctive yellow flowers and thorny foliage, making it a popular choice for landscaping. It has been introduced to several parts of the world, including the United States and Australia, where it is sometimes considered an invasive species. Its distribution is largely influenced by human activity and the suitability of the local environment."
}
