{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia goeringii",
    "plant_slug": "acacia-goeringii",
    "plant_name_scientific": "acacia goeringii",
    "intro": "Acacia goeringii, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow globular flower heads that appear in spring. The plant thrives in well-drained soils and is often found in coastal and inland areas. It has been introduced to other regions, including parts of New Zealand and the United States, where it can become invasive. The acacia's ability to fix nitrogen makes it an important plant in soil enrichment and ecological restoration.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia goeringii is primarily native to southern Africa, including countries such as South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This species thrives in well-drained soils and is adapted to drought conditions. It is often seen growing in open woodlands and along riverbanks. Acacia goeringii plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia goeringii was mainly introduced to areas with a warm, dry climate and well-drained soils, typically found in regions of Australia and parts of Southeast Asia. It is often cultivated for its ornamental value due to its distinctive foliage and ability to thrive in harsh conditions. The plant is also used in reforestation projects because of its fast growth rate and nitrogen-fixing capabilities. However, it can become invasive in some environments if not managed properly. Its introduction has been associated with both ecological benefits and potential risks to native plant communities."
}
