{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hemignosta",
    "plant_slug": "acacia-hemignosta",
    "plant_name_scientific": "acacia hemignosta",
    "intro": "Acacia hemignosta, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, linear leaflets. The plant produces yellow, globular flower heads that bloom in spring, attracting pollinators such as bees and birds. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia hemignosta is also valued for its hardy nature and is often used in landscaping and for erosion control.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hemignosta"
    },
    "taxonomy_art_desc": "Acacia hemignosta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or bean family, which is distinguished by its unique fruit type, the legume, and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their distinctive umbrella-like clusters of flowers and symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia hemignosta, a specific type of acacia native to parts of Africa, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hemignosta is primarily native to the Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy or rocky soils and is well adapted to the harsh climatic conditions of its native range. The plant is often seen in shrublands and open woodlands. Its distribution reflects its ability to thrive in dry, nutrient-poor environments.",
    "distribution_introduced_art_desc": "Acacia hemignosta was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its potential use in soil stabilization and as a source of timber. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. The plant thrives in a variety of soil types and is particularly successful in disturbed areas. Its introduction has led to significant ecological concerns, prompting efforts to control its spread."
}
