{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia juncifolia var. planifolia",
    "plant_slug": "acacia-juncifolia-var-planifolia",
    "plant_name_scientific": "acacia juncifolia var. planifolia",
    "intro": "Acacia juncifolia var. planifolia, commonly known as the flat-leaf acacia, is a shrub native to parts of Southeast Asia. It is characterized by its slender, cylindrical stems and small, flat, linear leaves that are often mistaken for grass. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, open habitats. Due to its ornamental value, it is occasionally cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia juncifolia var. planifolia is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often growing in association with other drought-tolerant shrubs and grasses. This variant of Acacia juncifolia is adapted to low rainfall and high temperatures, making it well-suited for the harsh environments of the Kalahari Desert and surrounding areas. It plays an important ecological role by providing shelter and food for various wildlife species. Due to its hardy nature, it is also sometimes cultivated in regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acacia juncifolia var. planifolia was mainly introduced to urban and suburban landscapes in southern Australia for its ornamental value and ability to thrive in dry conditions. It is often used in landscaping due to its attractive foliage and tolerance to poor soil conditions. The plant has been spread through horticultural trade and accidental seeding in disturbed soils. However, it is considered a potential weed in some regions due to its aggressive growth habit. Its introduction has raised concerns about its impact on native ecosystems."
}
