{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riparia var. multijuga",
    "plant_slug": "acacia-riparia-var-multijuga",
    "plant_name_scientific": "acacia riparia var. multijuga",
    "intro": "Acacia riparia var. multijuga, commonly known as the river acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and small, feathery leaves. The plant produces yellow flowers in dense, spherical clusters, which are followed by flat, bean-like pods. It thrives in riparian zones and is adapted to seasonal flooding, making it an important component of wetland ecosystems. Its ability to fix nitrogen makes it valuable for soil enrichment and ecological restoration.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riparia var. multijuga is primarily native to southern Africa, particularly in countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in riverine habitats and along the banks of seasonal streams and floodplains. This variant thrives in arid and semi-arid environments, often growing in sandy or gravelly soils. It is well adapted to fluctuating water levels and can tolerate both drought and flooding. The plant plays an important ecological role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia riparia var. multijuga was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation and land rehabilitation projects due to its drought tolerance and rapid growth. This plant thrives in sandy or loamy soils and can withstand high temperatures and low rainfall. It is also valued for its ability to fix nitrogen, improving soil fertility over time. However, its introduction has sometimes led to competition with native species in certain ecosystems."
}
