{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tomentella f. minor",
    "plant_slug": "acacia-tomentella-f-minor",
    "plant_name_scientific": "acacia tomentella f. minor",
    "intro": "Acacia tomentella f. minor, commonly known as the silver acacia or dwarf silky acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its dense, silver-gray foliage, which is covered in fine, soft hairs, giving it a distinctive appearance. The plant produces small, yellow, globular flower heads that are typically arranged in clusters. It is well adapted to drought conditions, with a deep root system that allows it to survive in poor soils. The species is often used in landscaping for its ornamental value and ability to thrive in challenging environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tomentella f. minor is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This plant is commonly found in sandy soils and rocky outcrops, often in areas with low rainfall. It is adapted to withstand harsh environmental conditions, making it a resilient species in its native habitat. The shrub is often used as a source of browse for wildlife and has cultural significance in some local communities. Its distribution is limited to specific ecological zones where it can thrive with minimal water availability.",
    "distribution_introduced_art_desc": "Acacia tomentella f. minor was mainly introduced to urban and coastal areas for its ornamental value and ability to thrive in harsh conditions. It is commonly found in gardens, parks, and along roadsides where it provides shade and stabilizes soil. This plant is also used in reforestation projects due to its fast growth and nitrogen-fixing capabilities. However, it has been identified as an invasive species in some regions, outcompeting native vegetation. Its introduction has raised concerns about ecological impact and biodiversity loss in local ecosystems."
}
