{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kirkii var. sublaevis",
    "plant_slug": "acacia-kirkii-var-sublaevis",
    "plant_name_scientific": "acacia kirkii var. sublaevis",
    "intro": "Acacia kirkii var. sublaevis, commonly known as the smooth acacia, is a shrub or small tree native to eastern and southern Africa. It is characterized by its slender, often multi-branched structure and phyllodes that are narrowly linear and smooth to the touch. The plant produces yellow globular flowerheads in late winter to early spring, which are clustered in dense, rounded inflorescences. Its leaves are reduced to phyllodes, which are flattened and leaf-like, aiding in water conservation in arid environments. The plant is adapted to a variety of soil types but prefers well-drained soils and is often found in savanna and woodland habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kirkii var. sublaevis is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and parts of South Africa. It is commonly found in savannas, woodlands, and rocky outcrops where the climate is warm and dry. This variant is adapted to thrive in regions with seasonal rainfall and well-drained soils. It plays an important ecological role by providing habitat and food for various wildlife species. Its distribution is closely linked to areas with specific soil and climatic conditions that support its growth.",
    "distribution_introduced_art_desc": "Acacia kirkii var. sublaevis was mainly introduced to South Africa, where it has been widely used in agroforestry and soil stabilization projects. It is also found in parts of East Africa, including Kenya and Tanzania, where it has been introduced for its drought-resistant properties. This plant thrives in arid and semi-arid environments, making it suitable for reforestation and land rehabilitation efforts. Its ability to fix nitrogen in the soil makes it valuable for improving soil fertility in degraded areas. However, it is considered an invasive species in some regions, posing a threat to native vegetation."
}
