{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brunioides subsp. granitica",
    "plant_slug": "acacia-brunioides-subsp-granitica",
    "plant_name_scientific": "acacia brunioides subsp. granitica",
    "intro": "Acacia brunioides subsp. granitica, commonly known as the granite acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, feathery foliage and yellow flowers that bloom in summer. The plant thrives in rocky, well-drained soils and is adapted to arid or semi-arid conditions. Its leaves are often glandular and emit a strong, unpleasant odor when crushed. This subspecies is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia brunioides"
    },
    "taxonomy_art_desc": "Acacia brunioides subsp. granitica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of parts. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their thorn-like structures and distinctive floral morphology. Its species is Acacia brunioides, a specific type of acacia that includes the subspecies granitica, which is adapted to rocky and arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brunioides subsp. granitica is primarily native to Queensland. This subspecies is commonly found in the rocky and granitic outcrops of the southeastern part of the state. It thrives in arid and semi-arid environments, often growing on limestone or sandstone formations. The plant is well adapted to dry conditions and is often seen in open woodlands and shrublands. Its distribution is closely associated with specific soil types and topography found in Queensland's inland regions.",
    "distribution_introduced_art_desc": "Acacia brunioides subsp. granitica was mainly introduced to areas with rocky or gravelly soils, typically found in arid or semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it well-suited for dryland landscapes. This subspecies is often found in coastal and inland regions where it can establish itself on exposed rock faces or in crevices. Its introduction has been primarily for stabilizing soil and preventing erosion in degraded areas. Due to its hardy nature, it has become a common plant in restoration projects across its range."
}
