{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spectabilis",
    "plant_slug": "acacia-spectabilis",
    "plant_name_scientific": "acacia spectabilis",
    "intro": "Acacia spectabilis, commonly known as the showy acacia, is a deciduous shrub or small tree native to South Africa. It is characterized by its dense, feathery foliage and produces yellow flowers in clusters during the summer months. The plant has phyllodes, which are flattened leaf stalks that function as leaves, and it is adapted to arid and semi-arid environments. Acacia spectabilis is often used in landscaping for its ornamental value and drought tolerance. It also plays a role in supporting local wildlife, including birds and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spectabilis"
    },
    "taxonomy_art_desc": "Acacia spectabilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are often legumes and have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their thorned stems and compound leaves. Its species is Acacia spectabilis, a specific type of acacia known for its striking appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [
        "Jawa",
        "Philippines",
        "St.Helena"
    ],
    "distribution_native_art_desc": "Acacia spectabilis is primarily native to New South Wales and Queensland in Australia. This species is commonly found in dry, open habitats such as woodlands and grasslands. It thrives in regions with a warm climate and well-drained soils. The plant is well adapted to the arid and semi-arid environments of these areas. It plays an important ecological role in supporting local wildlife and stabilizing soil.",
    "distribution_introduced_art_desc": "Acacia spectabilis was mainly introduced to Jawa, Philippines, and St. Helena. It is a species of acacia that has been cultivated in these regions for various purposes, including ornamental use and ecological restoration. The plant is known for its distinctive appearance, featuring feathery foliage and yellow flowers. It has adapted well to the local climates of these areas, thriving in tropical and subtropical conditions. However, its introduction has also raised concerns regarding its potential impact on native ecosystems."
}
