{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kraussiana",
    "plant_slug": "acacia-kraussiana",
    "plant_name_scientific": "acacia kraussiana",
    "intro": "Acacia kraussiana, commonly known as the white wattle, is a flowering plant native to South Africa. It is a small to medium-sized shrub or tree that typically grows in coastal and sandy soils. The plant is characterized by its feathery, bipinnate leaves and yellow, globular flower heads that bloom in winter. It is well adapted to arid and semi-arid environments, showing drought tolerance. The plant is also valued for its ornamental appeal and is sometimes used in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kraussiana is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savanna and woodland habitats, often in areas with well-drained soils. This species thrives in regions with a tropical or subtropical climate, characterized by distinct wet and dry seasons. It is often seen growing along riverbanks and in open grasslands. Acacia kraussiana is an important component of the local flora and provides habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia kraussiana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, particularly in the Western and Eastern Cape provinces. This plant is known for its ability to thrive in harsh, arid conditions, making it a resilient species in these environments. However, its introduction has raised concerns due to its potential to become invasive in some ecosystems. Despite its ecological impact, Acacia kraussiana is valued for its ornamental qualities and role in soil stabilization."
}
