{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pyrifolia var. pyrifolia",
    "plant_slug": "acacia-pyrifolia-var-pyrifolia",
    "plant_name_scientific": "acacia pyrifolia var. pyrifolia",
    "intro": "Acacia pyrifolia var. pyrifolia, commonly known as the flame tree, is a deciduous shrub or small tree native to Australia. It is characterized by its distinctive bright orange to red flowers that appear in late winter to early spring, forming dense, fluffy clusters. The plant has feathery, bipinnate leaves that are typically grey-green in color. It thrives in full sun and well-drained soil, making it a popular ornamental plant in tropical and subtropical regions. The species is also valued for its ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pyrifolia"
    },
    "taxonomy_art_desc": "Acacia pyrifolia var. pyrifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose and magnolia families. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia pyrifolia, a specific type of acacia known for its feather-like leaves and yellow flowers, commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pyrifolia var. pyrifolia is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in sandy soils and is often associated with coastal and inland habitats. It is well adapted to the dry and arid conditions of its native range. The species is an important part of the local flora and plays a role in the ecosystem of Western Australia.",
    "distribution_introduced_art_desc": "Acacia pyrifolia var. pyrifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is known for its hardy nature and ability to withstand drought conditions, making it adaptable to various environments. It has been used in local landscapes for erosion control and as an ornamental plant. However, its introduction has raised concerns about its potential to become invasive in native ecosystems."
}
