{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elliptica",
    "plant_slug": "acacia-elliptica",
    "plant_name_scientific": "acacia elliptica",
    "intro": "Acacia elliptica, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, elliptical leaves that are often covered in a fine layer of whitish hairs. The plant produces yellow, globular flower heads that appear in spring, attracting various pollinators. Acacia elliptica is adapted to arid and semi-arid environments, making it drought-tolerant. It is also valued for its ornamental appeal and is sometimes used in landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia elliptica is primarily native to southern Australia, including the states of South Australia, Victoria, and New South Wales. It is commonly found in dry, open habitats such as grasslands, woodlands, and along riverbanks. This species thrives in regions with a Mediterranean climate, characterized by hot, dry summers and cool, wet winters. It is often associated with sandy or loamy soils and can tolerate poor soil conditions. Acacia elliptica is an important component of the local flora and provides habitat and food for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia elliptica was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and hardy nature. It was first brought to the country in the 19th century by European settlers who admired its unique appearance. Despite its ornamental value, it has since become an invasive species, outcompeting native plants in various ecosystems. Its rapid growth and ability to thrive in diverse conditions have led to its spread across several regions of New Zealand. Efforts are now being made to control its spread and protect local biodiversity."
}
