{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia baeuerlenii",
    "plant_slug": "acacia-baeuerlenii",
    "plant_name_scientific": "acacia baeuerlenii",
    "intro": "Acacia baeuerlenii, commonly known as the Baeuerlen's acacia, is a species of flowering plant in the legume family Fabaceae. It is native to the arid regions of southern Africa, particularly Namibia and South Africa. The plant is characterized by its slender, branched stems and small, bipinnate leaves. It produces yellowish-green flowers that are clustered in cylindrical inflorescences. Acacia baeuerlenii is adapted to survive in harsh, dry environments and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia baeuerlenii"
    },
    "taxonomy_art_desc": "Acacia baeuerlenii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which comprises plants with flowers typically having five petals and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and often used in traditional medicine and as sources of timber. Its species is Acacia baeuerlenii, a specific type of acacia found in certain regions, noted for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia baeuerlenii is primarily native to New South Wales and Queensland in Australia. This species is commonly found in the coastal regions and inland areas of these states. It thrives in a variety of soil types but prefers well-drained soils. The plant is often seen in open woodlands and along coastal dunes. Its distribution is closely associated with the temperate and subtropical climates of these regions.",
    "distribution_introduced_art_desc": "Acacia baeuerlenii was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and drought tolerance. It has since been reported in several countries, including Spain, Italy, and parts of southern France. The plant thrives in well-drained soils and full sun, making it suitable for arid and semi-arid environments. Its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its ornamental value, proper management is necessary to prevent its spread into native habitats."
}
