{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia virgata",
    "plant_slug": "acacia-virgata",
    "plant_name_scientific": "acacia virgata",
    "intro": "Acacia virgata, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging branches and small, yellow flowers that appear in globular clusters. The plant produces flat, feathery pods that contain seeds, which are dispersed by wind. Acacia virgata thrives in dry, sandy soils and is often found in coastal and inland regions. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia virgata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This plant is well adapted to the harsh conditions of its native habitat, showing resilience to drought and extreme temperatures. It plays an important ecological role by providing shelter and food for various animals and insects. Acacia virgata is also sometimes cultivated in other regions for its ornamental value and hardy nature.",
    "distribution_introduced_art_desc": "Acacia virgata was mainly introduced to New Zealand as a potential ornamental and for its potential use in soil stabilization. It was also considered for reforestation efforts due to its ability to thrive in various soil conditions. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems. Despite its benefits, it is now monitored to prevent unintended ecological impacts. Its distribution in New Zealand is limited to specific regions where it has been planted."
}
