{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spirocarpa var. minor",
    "plant_slug": "acacia-spirocarpa-var-minor",
    "plant_name_scientific": "acacia spirocarpa var. minor",
    "intro": "Acacia spirocarpa var. minor, commonly known as the small-flowered wattle, is a shrub native to arid and semi-arid regions of Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, wiry stems and small, yellow globular flowers. The plant has bipinnate leaves that are finely divided, and it produces small, flat, pod-like fruits. It is well adapted to harsh environments, with deep roots that enable it to survive in low-water conditions. This variety is often used in revegetation projects due to its hardiness and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spirocarpa var. minor is primarily native to the arid and semi-arid regions of Australia, particularly in the Northern Territory and Western Australia. It is commonly found in sandy soils and is adapted to the harsh, dry conditions of these environments. This variant of the species is often seen in spinifex plains and other open habitats where it contributes to the local flora. It plays an important ecological role by providing shelter and food for various native animals. Due to its resilience, it is also sometimes cultivated in regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acacia spirocarpa var. minor was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in coastal and inland areas. This plant thrives in sandy soils and is often seen along roadsides and in disturbed habitats. It is valued for its ornamental qualities and is sometimes used in landscaping. However, its spread has raised concerns about its potential impact on native vegetation."
}
