{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aneura var. brachystachya",
    "plant_slug": "acacia-aneura-var-brachystachya",
    "plant_name_scientific": "acacia aneura var. brachystachya",
    "intro": "Acacia aneura var. brachystachya, commonly known as the stumpy wattle, is a small, shrub-like acacia native to the arid regions of Australia. It is characterized by its dense, cylindrical, yellow-green foliage and its distinctive, small, globular flower heads. The plant is well adapted to harsh, dry environments, with its thick, waxy leaves reducing water loss. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife. The stumpy wattle is also valued for its ornamental appeal and is sometimes cultivated in gardens in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aneura var. brachystachya is primarily native to the arid regions of central Australia, including parts of South Australia, Western Australia, and the Northern Territory. This variant of the mulga tree is commonly found in dry, sandy soils and is well adapted to the harsh conditions of the Australian outback. It thrives in areas with low rainfall and high temperatures, often forming dense thickets that provide habitat for various wildlife. The plant is a key component of the vegetation in these ecosystems, contributing to soil stabilization and biodiversity. Its distribution is closely linked to the availability of water and the specific environmental conditions of the region.",
    "distribution_introduced_art_desc": "Acacia aneura var. brachystachya was mainly introduced to South Australia and Western Australia for its ornamental value and ability to thrive in arid conditions. It is commonly found in coastal and semi-arid regions, where it forms dense shrubs or small trees. This plant has been used in landscaping and for stabilizing soils in degraded areas. Its introduction has led to its establishment in some native ecosystems, raising concerns about its potential invasiveness. Despite its benefits, careful management is required to prevent its spread into sensitive habitats."
}
