{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bahiensis",
    "plant_slug": "acacia-bahiensis",
    "plant_name_scientific": "acacia bahiensis",
    "intro": "Acacia bahiensis, commonly known as the Brazilian acacia, is a shrub or small tree native to Brazil. It is characterized by its slender, often thorny stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow flowers that are clustered in cylindrical inflorescences, attracting pollinators such as bees and birds. Its seeds are encased in a hard, woody pod, which splits open to release the seeds. Acacia bahiensis is adapted to arid and semi-arid environments, making it a resilient species in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bahiensis is primarily native to Brazil, specifically the northeastern region of the country. It is commonly found in the states of Bahia, Pernambuco, and Piauí. This species thrives in tropical and subtropical climates, often growing in dry savannas and open woodlands. It is adapted to well-drained soils and can tolerate periods of drought. Acacia bahiensis plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia bahiensis was mainly introduced to areas with sandy or well-drained soils, particularly in coastal and inland regions of Brazil. It thrives in warm, dry climates and is often found in disturbed or degraded landscapes. This species is commonly used for soil stabilization and as a source of timber and fodder. Its introduction has been associated with both ecological benefits and potential invasiveness in certain environments. Due to its adaptability, it has become a significant component of reforestation efforts in the region."
}
