{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia skleroxyla",
    "plant_slug": "acacia-skleroxyla",
    "plant_name_scientific": "acacia skleroxyla",
    "intro": "Acacia skleroxyla, commonly known as the African wattle, is a deciduous tree native to sub-Saharan Africa. It belongs to the Fabaceae family and is characterized by its feathery, bipinnate leaves and yellow floral spikes. The plant is adapted to arid and semi-arid environments, showcasing drought resistance through its deep root system. It produces small, pod-like fruits that contain seeds dispersed by wind. The tree is also valued for its hard wood and historical use in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia skleroxyla is primarily native to the tropical regions of Africa, particularly in countries such as Sudan, South Sudan, and the Democratic Republic of the Congo. It thrives in dry savanna and woodland habitats, often found in areas with seasonal rainfall. This species is well adapted to arid and semi-arid environments, making it a common sight in these regions. It plays an important ecological role by providing food and shelter for various wildlife species. Additionally, it is sometimes used locally for its timber and as a source of fuelwood.",
    "distribution_introduced_art_desc": "Acacia skleroxyla was mainly introduced to regions with tropical and subtropical climates where it can thrive in well-drained soils. It is commonly found in areas with seasonal rainfall patterns, making it suitable for reforestation and land rehabilitation projects. The plant is valued for its hardy nature and ability to withstand drought conditions. It has been introduced to several countries in Africa and parts of Southeast Asia for its ecological and economic benefits. Its introduction has also raised concerns about its potential impact on native ecosystems."
}
