{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia clelandii",
    "plant_slug": "acacia-clelandii",
    "plant_name_scientific": "acacia clelandii",
    "intro": "Acacia clelandii, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and clusters of small, white, fluffy flowers that bloom in spring. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic organs. It is adapted to arid environments and is often found in coastal and sandy soils. The white wattle is an important component of local ecosystems and is also cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia clelandii"
    },
    "taxonomy_art_desc": "Acacia clelandii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and ability to thrive in arid environments. Its species is Acacia clelandii, a specific type of acacia native to Australia, recognized for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia clelandii is primarily native to the Northern Territory, South Australia, and Western Australia. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy soils and is often seen along roadsides and in open woodlands. Acacia clelandii is well adapted to the harsh climatic conditions of its native range. It plays an important role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia clelandii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and has spread into other parts of the country. The plant thrives in dry, sandy soils and is often seen in fynbos vegetation. Its introduction has led to concerns about its potential invasiveness in some areas. Despite its ornamental value, it requires careful management to prevent ecological disruption."
}
