{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sprengelii",
    "plant_slug": "acacia-sprengelii",
    "plant_name_scientific": "acacia sprengelii",
    "intro": "Acacia sprengelii, commonly known as the red acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are covered in fine hairs. The plant produces yellow to orange globular inflorescences, which are highly attractive to pollinators such as bees and birds. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia sprengelii is often used in landscaping due to its ornamental value and ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sprengelii is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and woodland ecosystems. This species is well adapted to hot, dry climates and can tolerate periods of drought. It is often seen growing along riverbanks and in open grasslands. Acacia sprengelii plays an important ecological role by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia sprengelii was mainly introduced to regions with dry, warm climates, particularly in parts of Australia, South Africa, and the Mediterranean. It thrives in well-drained soils and is often found in coastal areas or on rocky slopes. This plant is commonly used for erosion control due to its deep root system and ability to withstand drought. It has also been introduced as an ornamental plant in gardens and parks. However, in some areas, it has become invasive, outcompeting native vegetation."
}
