{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flexuosa var. ambigua",
    "plant_slug": "acacia-flexuosa-var-ambigua",
    "plant_name_scientific": "acacia flexuosa var. ambigua",
    "intro": "Acacia flexuosa var. ambigua, commonly known as the slender wattle, is a shrub native to southern Australia. It is characterized by its narrow, pendulous phyllodes and yellow flowers that bloom in late winter to early spring. The plant typically grows in sandy or rocky soils and is adapted to arid and semi-arid environments. Its leaves are reduced to flattened, thread-like structures called phyllodes, which help reduce water loss. The species is often used in rehabilitation projects due to its ability to stabilize soils and provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flexuosa var. ambigua is primarily native to northern Australia, including regions of Queensland and the Northern Territory. This variant is commonly found in arid and semi-arid environments, particularly in sandy soils. It thrives in open woodlands and shrublands where it can receive adequate sunlight. The plant is well adapted to the harsh conditions of the Australian outback. Its distribution is largely restricted to these specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acacia flexuosa var. ambigua was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. This plant is often used for erosion control due to its hardy nature and ability to withstand harsh environmental conditions. However, it can also pose a threat to native ecosystems by outcompeting local vegetation. Its introduction has led to its establishment in several provinces, particularly in the Western and Eastern Cape."
}
