{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia recurvata",
    "plant_slug": "acacia-recurvata",
    "plant_name_scientific": "acacia recurvata",
    "intro": "Acacia recurvata, commonly known as the slender wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping branches and phyllodes that are typically narrow and curved. The plant produces yellow flowers in globular or cylindrical heads, which appear in spring and attract various pollinators. Its leaves are modified into phyllodes, a feature common in many acacia species, reducing water loss in arid environments. Acacia recurvata is often found in sandy soils and is adapted to withstand drought and fire.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia recurvata"
    },
    "taxonomy_art_desc": "Acacia recurvata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees primarily found in arid and seasonal environments, known for their distinctive, often thorn-bearing foliage. Its species is Acacia recurvata, a specific type of acacia characterized by its recurved leaflets and is typically found in regions with a dry climate.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia recurvata is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the south-western part of the state. This species thrives in dry, temperate climates and is often seen in heathlands and open woodlands. It is well adapted to the local environmental conditions, including seasonal rainfall patterns. Acacia recurvata plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia recurvata was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts. This plant is often used for soil stabilization and as a source of timber and fodder. Its introduction has sometimes led to ecological concerns due to its potential invasiveness. It is also valued for its ability to fix nitrogen, improving soil fertility in degraded lands."
}
