{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cubensis",
    "plant_slug": "acacia-cubensis",
    "plant_name_scientific": "acacia cubensis",
    "intro": "Acacia cubensis, commonly known as the Cuban acacia, is a shrub native to the Caribbean, particularly Cuba. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces small, yellowish-green flowers that are clustered in inflorescences, followed by flat, pod-like fruits containing seeds. Acacia cubensis is adapted to coastal and sandy soils, often growing in dry, sunny environments. It plays a minor role in local ecosystems but is not widely cultivated for commercial purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cubensis is primarily native to the Caribbean islands, particularly Cuba, Hispaniola, and the Greater Antilles. It thrives in dry, tropical climates and is commonly found in coastal areas and limestone soils. This species is adapted to arid and semi-arid conditions, often growing in open woodlands and scrublands. It plays an important ecological role in its native habitat by providing food and shelter for local wildlife. Due to its limited range, Acacia cubensis is considered a rare and endemic plant in the region.",
    "distribution_introduced_art_desc": "Acacia cubensis was mainly introduced to the Caribbean and parts of Central America. It was brought there for its ornamental value and potential use in agroforestry systems. The plant thrives in tropical and subtropical climates, making it well-suited for these regions. It has been reported to naturalize in some areas, posing a potential risk to native ecosystems. Due to its adaptability, it has become a common sight in urban and rural landscapes across its introduced range."
}
