{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia strigosa var. borealis",
    "plant_slug": "acacia-strigosa-var-borealis",
    "plant_name_scientific": "acacia strigosa var. borealis",
    "intro": "Acacia strigosa var. borealis, commonly known as the northern acacia, is a shrub native to arctic and subarctic regions. It is characterized by its small, narrow leaves and yellow flowers that bloom in late summer. The plant is adapted to cold climates and grows in well-drained, sandy soils. It plays a role in stabilizing soil in its harsh environment. Its botanical features make it an important component of tundra ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia strigosa var. borealis is primarily native to the northern regions of Australia, specifically the arid and semi-arid zones of Western Australia and the Northern Territory. This variant is adapted to the harsh, dry environments characterized by low rainfall and high temperatures. It typically grows in sandy or rocky soils and is often found in open woodlands and shrublands. The plant is well-suited to the extreme conditions of its native habitat, showcasing resilience and drought tolerance. Its distribution is limited to these specific geographic areas, reflecting its ecological niche and environmental requirements.",
    "distribution_introduced_art_desc": "Acacia strigosa var. borealis was mainly introduced to areas with cooler climates and well-drained soils, often found in regions with moderate rainfall. It is typically established in disturbed sites such as roadsides, clearings, and along riverbanks. This plant prefers full sun to partial shade and is commonly found in temperate regions of Australia. Its introduction has been associated with both natural dispersal and human activities like land clearing and gardening. However, it is not considered invasive in most of its introduced ranges."
}
