{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sophorae var. montana",
    "plant_slug": "acacia-sophorae-var-montana",
    "plant_name_scientific": "acacia sophorae var. montana",
    "intro": "Acacia sophorae var. montana, commonly known as mountain acacia, is a shrub native to the mountainous regions of Central America. It is characterized by its compound leaves, which are typically bipinnate and covered in fine, silky hairs. The plant produces yellow flowers in dense, globular clusters, which are highly attractive to pollinators such as bees and birds. Its wood is hard and durable, making it valuable for traditional crafts and construction. The species is also adapted to dry and rocky environments, showcasing its resilience in challenging ecological conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sophorae var. montana is primarily native to the mountainous regions of Central America, particularly in countries such as Mexico and Guatemala. It thrives in high-altitude environments with cooler temperatures and well-drained soils. This variety is commonly found in cloud forests and other moist, shaded habitats at elevations ranging from 1,500 to 3,000 meters. It plays an important ecological role in these regions by providing habitat and food for various wildlife species. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acacia sophorae var. montana was mainly introduced to areas with well-drained soils and moderate to warm climates, typically found in regions with a Mediterranean climate. It is commonly found in disturbed sites such as roadsides, abandoned fields, and along creek banks. This plant has a spreading habit and produces yellow flowers, making it a popular choice for ornamental purposes. It is also used in ecological restoration projects due to its ability to stabilize soil and provide habitat for native wildlife. However, its invasive potential in some regions requires careful management to prevent ecological disruption."
}
