{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tonkinensis",
    "plant_slug": "acacia-tonkinensis",
    "plant_name_scientific": "acacia tonkinensis",
    "intro": "Acacia tonkinensis, commonly known as the Tonkin acacia, is a deciduous shrub or small tree native to Southeast Asia. It is characterized by its slender, often multi-branched stems and compound leaves that are usually pinnately arranged. The plant produces yellow globular flower heads, which are typical of the Acacia genus. It thrives in tropical and subtropical climates, often found in open woodlands and along riverbanks. The bark and leaves of Acacia tonkinensis have been used in traditional medicine for their purported therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tonkinensis is primarily native to Southeast Asia, specifically Vietnam and Laos. It is commonly found in lowland and hill forest areas, often growing in moist, well-drained soils. This species is also present in parts of southern China and northeastern India. It thrives in tropical and subtropical climates with high humidity. Acacia tonkinensis is often associated with secondary growth and can be found in disturbed habitats.",
    "distribution_introduced_art_desc": "Acacia tonkinensis was mainly introduced to regions with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in areas with mild winters and warm, dry summers. This plant is often cultivated for its ornamental value due to its distinctive foliage and ability to withstand drought conditions. It has been introduced to several countries in Southeast Asia, including Vietnam and Thailand. However, it is important to monitor its spread to prevent potential ecological impacts in native ecosystems."
}
