{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia inopinata",
    "plant_slug": "acacia-inopinata",
    "plant_name_scientific": "acacia inopinata",
    "intro": "Acacia inopinata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging stems and bipinnate leaves that are reduced to small, linear leaflets. The plant produces yellow globular flowers in spring, which are clustered in dense, cylindrical inflorescences. It thrives in sandy or loamy soils and is adapted to arid and semi-arid climates. Acacia inopinata is also valued for its role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia inopinata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and woodland habitats. This plant is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important role in stabilizing soil and providing habitat for various wildlife species. Its distribution is largely restricted to the specific ecological zones where it can tolerate the extreme climate.",
    "distribution_introduced_art_desc": "Acacia inopinata was mainly introduced to control soil erosion and for ornamental purposes in tropical and subtropical regions. It is commonly found in disturbed soils and along roadsides due to its rapid growth and adaptability. The plant thrives in full sun and requires well-drained soil to flourish. Its introduction has led to its establishment in several invasive plant lists in parts of Australia and Southeast Asia. However, it is generally considered a non-invasive species in its introduced range."
}
