{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia delavayi",
    "plant_slug": "acacia-delavayi",
    "plant_name_scientific": "acacia delavayi",
    "intro": "Acacia delavayi, commonly known as the Delavay's acacia, is a shrub or small tree native to China. It is characterized by its feathery, bipinnate leaves and yellow, globular flower heads. The plant is part of the legume family, Fabaceae, and is known for its ability to fix nitrogen through symbiotic bacteria in its root nodules. It thrives in temperate climates and is often found in mountainous regions. Acacia delavayi is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia delavayi is primarily native to the mountainous regions of southwestern China, particularly in Sichuan, Yunnan, and Tibet. It thrives in temperate to subtropical climates and is commonly found in forested areas and along riverbanks. This species is also present in parts of northern Vietnam and northern India. It prefers well-drained soils and is often associated with secondary growth habitats. Acacia delavayi is an important plant in the ecological systems of its native range.",
    "distribution_introduced_art_desc": "Acacia delavayi was mainly introduced to areas with temperate to subtropical climates, particularly in regions with well-drained soils and moderate rainfall. It is commonly found in open woodlands, shrublands, and along riverbanks. This plant is often used for its hardy nature and ability to thrive in poor soil conditions. Its introduction has been noted in parts of China, Europe, and the United States. However, it is important to monitor its spread due to potential ecological impacts in non-native environments."
}
