{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennata subsp. kerrii",
    "plant_slug": "acacia-pennata-subsp-kerrii",
    "plant_name_scientific": "acacia pennata subsp. kerrii",
    "intro": "Acacia pennata subsp. kerrii, commonly known as the Kerri's wattle, is a shrub or small tree native to eastern Australia. It is characterized by its narrow, linear leaves and yellow flowers that appear in spikes. The plant is adapted to dry and sandy soils, often found in coastal and heathland environments. It plays a role in stabilizing soil and providing habitat for native fauna. The subspecies is distinguished by its slender form and specific geographic distribution.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennata subsp. kerrii is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and parts of South Africa. It is commonly found in savanna woodlands and rocky outcrops, where it thrives in well-drained soils. This subspecies is often associated with dry to semi-arid environments and can be found at elevations ranging from lowland to moderate altitudes. It plays an important ecological role in its native range, providing food and habitat for various wildlife species. The plant is also valued for its hard, durable wood and has been used by local communities for traditional purposes.",
    "distribution_introduced_art_desc": "Acacia pennata subsp. kerrii was mainly introduced to areas with well-drained soils and a tropical or subtropical climate. It thrives in regions with moderate to high rainfall and full sun exposure. This subspecies is commonly found in coastal and inland regions of Southeast Asia. It is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has had both ecological and economic impacts in the regions where it is now established."
}
