{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia semiverticillata",
    "plant_slug": "acacia-semiverticillata",
    "plant_name_scientific": "acacia semiverticillata",
    "intro": "Acacia semiverticillata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its compound leaves, which are often narrow and arranged in a feather-like pattern. The plant produces yellow flowers in winter, which are clustered in spherical inflorescences. It is adapted to arid and semi-arid environments, making it a hardy species for dry climates. Acacia semiverticillata is also valued for its ornamental appeal and is sometimes used in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia semiverticillata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and woodland habitats. This plant is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role by providing food and shelter for various wildlife species. Its distribution is closely linked to the specific climatic and soil conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia semiverticillata was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its ornamental value and potential for erosion control. However, it has since spread rapidly, outcompeting native vegetation in many areas. Its introduction has led to significant ecological impacts, including the alteration of local ecosystems and the reduction of biodiversity. Efforts are ongoing to manage its spread and mitigate its negative effects on the environment."
}
