{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bulgaensis",
    "plant_slug": "acacia-bulgaensis",
    "plant_name_scientific": "acacia bulgaensis",
    "intro": "Acacia bulgaensis, commonly known as the Bulga acacia, is a shrub or small tree native to the arid regions of Australia. It is characterized by its slender, often multi-stemmed form and phyllodes that are typically straight or slightly curved. The plant produces yellow flowers in summer, which are clustered in cylindrical spikes. Its leaves are modified into phyllodes, a common adaptation in acacia species to reduce water loss. Acacia bulgaensis is well adapted to dry conditions and is often found in sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia bulgaensis"
    },
    "taxonomy_art_desc": "Acacia bulgaensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their complex floral structures and a wide range of morphological diversity. Its order is Fabales, which includes plants that are often legumes and are known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its characteristic pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive phyllodes and ability to thrive in harsh environments. Its species is Acacia bulgaensis, a specific type of acacia native to certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bulgaensis is primarily native to New South Wales. It is found in the arid and semi-arid regions of the state, particularly in the inland areas. This plant typically grows in sandy or rocky soils and is adapted to dry conditions. It is often seen in open woodlands and shrublands. Its distribution is limited to specific ecological zones within New South Wales.",
    "distribution_introduced_art_desc": "Acacia bulgaensis was mainly introduced to areas with a semi-arid to arid climate, typically found in regions with low rainfall and well-drained soils. It thrives in environments with moderate temperatures and is often found in rocky or sandy soils. This plant is commonly used for erosion control due to its deep root system and ability to fix nitrogen. It has been introduced to several regions outside its native range, including parts of Australia and the Mediterranean. Its introduction has sometimes led to concerns about its potential invasiveness in non-native habitats."
}
