{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia constricta var. vernicosa",
    "plant_slug": "acacia-constricta-var-vernicosa",
    "plant_name_scientific": "acacia constricta var. vernicosa",
    "intro": "Acacia constricta var. vernicosa, commonly known as the smooth wattle, is a shrub native to eastern Australia. It is characterized by its slender, often spindly stems and small, rounded leaves that are typically covered in a fine, waxy coating. The plant produces yellow flowers in late summer, which are clustered in cylindrical inflorescences. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. The species is also valued for its ornamental appeal and its ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia constricta var. vernicosa is primarily native to the arid and semi-arid regions of Southwestern United States and Northwestern Mexico. It is commonly found in areas such as Arizona, New Mexico, and parts of Texas. This plant thrives in rocky soils and is often associated with desert scrub and chaparral habitats. It is well adapted to dry climates and can tolerate high temperatures and low rainfall. Its distribution is largely restricted to specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acacia constricta var. vernicosa was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its drought tolerance and ability to thrive in poor soils. This plant has been introduced in several parts of Australia and the southwestern United States. Its rapid growth and nitrogen-fixing capability make it valuable for land restoration efforts. However, it can become invasive in certain environments if not managed properly."
}
