{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia baueri",
    "plant_slug": "acacia-baueri",
    "plant_name_scientific": "acacia baueri",
    "intro": "Acacia baueri, commonly known as the silver acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, grey-green branches and bipinnate leaves that are finely divided. The plant produces yellow globular flowers, which are clustered in dense heads, and it is often used for ornamental purposes due to its attractive appearance. Acacia baueri is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid regions. It also has a symbiotic relationship with nitrogen-fixing bacteria, enhancing soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia baueri"
    },
    "taxonomy_art_desc": "Acacia baueri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their characteristic acacia-like leaves and often used in traditional medicine. Its species is Acacia baueri, a specific type of acacia found in certain regions, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia baueri is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, sandy soils across these regions. This species thrives in arid and semi-arid environments. It is often seen in open woodlands and along river systems. Its distribution reflects its adaptability to the harsh climatic conditions of the Australian interior.",
    "distribution_introduced_art_desc": "Acacia baueri was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has helped in restoring degraded lands across parts of Africa and Australia. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
