{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oreophila",
    "plant_slug": "acacia-oreophila",
    "plant_name_scientific": "acacia oreophila",
    "intro": "Acacia oreophila, commonly known as the mountain acacia, is a species of flowering plant native to the highland regions of East Africa. It is characterized by its slender, upright growth habit and compound leaves that are often covered in fine, silky hairs. The plant produces yellow, spherical flower heads that bloom in clusters, attracting various pollinators such as bees and birds. Acacia oreophila thrives in well-drained soils and is adapted to the cooler, more humid conditions of its mountainous habitat. Its ecological importance includes providing shelter and food for local wildlife and contributing to the biodiversity of its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oreophila is primarily native to the mountainous regions of eastern Africa, specifically Kenya and Tanzania. It is commonly found in high-altitude grasslands and rocky habitats within these areas. The plant thrives in regions with cool temperatures and moderate rainfall. It is often associated with montane forests and open slopes at elevations ranging from 1,500 to 3,000 meters. Due to its specific habitat requirements, Acacia oreophila is relatively rare and localized within its native range.",
    "distribution_introduced_art_desc": "Acacia oreophila was mainly introduced to areas with high elevation and rocky soils, where it thrives in semi-arid to arid conditions. It is commonly found in mountainous regions with well-drained soil and moderate to high sunlight exposure. This plant is often used for soil stabilization due to its deep root system and ability to withstand drought. It has been introduced to several regions in Africa and parts of the Middle East for ecological restoration projects. Its introduction has also been linked to ornamental gardening due to its unique appearance and hardiness."
}
