{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia thomasii",
    "plant_slug": "acacia-thomasii",
    "plant_name_scientific": "acacia thomasii",
    "intro": "Acacia thomasii, commonly known as Thomas's acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, multi-branched stems and small, bipinnate leaves that reduce water loss in its harsh environment. The plant produces yellow flowers arranged in dense, globular clusters, which attract pollinators such as bees and birds. Its seeds are encased in hard pods that split open when mature, dispersing the seeds by wind. Acacia thomasii is well adapted to drought and is often found in sandy or rocky soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia thomasii is primarily native to the southwestern United States and northern Mexico. It is commonly found in regions such as Arizona, New Mexico, and parts of Texas. This plant thrives in arid and semi-arid environments, often growing in rocky soils and open woodlands. It is well adapted to the harsh climate conditions of its native range. Acacia thomasii plays an important ecological role in its habitat by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia thomasii was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with low to moderate rainfall. It thrives in full sun and is commonly found in disturbed soils such as roadsides, abandoned fields, and along riverbanks. This plant is often used for soil stabilization due to its extensive root system and ability to tolerate drought conditions. It has been introduced to several regions outside its native range, including parts of the United States and Australia. However, its invasive potential varies depending on local environmental conditions and management practices."
}
