{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stipulata",
    "plant_slug": "acacia-stipulata",
    "plant_name_scientific": "acacia stipulata",
    "intro": "Acacia stipulata, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features bipinnate leaves with small, needle-like leaflets, and it produces yellow globular flowers in late winter to early spring. Acacia stipulata is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid regions. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stipulata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, rocky outcrops, and along riverbanks in these areas. The plant thrives in well-drained soils and is adapted to withstand drought conditions. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia stipulata is also known for its distinctive yellow flowers and thorny stems.",
    "distribution_introduced_art_desc": "Acacia stipulata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread beyond cultivated areas and is now considered a potential weed in certain regions. The plant thrives in a range of climates, including temperate and sub-tropical environments, which contributes to its successful establishment. Its rapid growth and ability to colonize disturbed sites have led to concerns about its impact on native ecosystems. Management strategies are being developed to control its spread and mitigate its ecological effects."
}
