{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia petrensis",
    "plant_slug": "acacia-petrensis",
    "plant_name_scientific": "acacia petrensis",
    "intro": "Acacia petrensis, commonly known as the coastal acacia, is a shrub or small tree native to the coastal regions of southern Africa. It is characterized by its slender, multi-branched structure and bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in dense, globular clusters, which are followed by flat, leathery pods containing seeds. It is adapted to sandy soils and coastal conditions, often thriving in areas with high salinity and strong winds. Acacia petrensis plays an important role in stabilizing dunes and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia petrensis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry and hot climates. This species is well adapted to low rainfall and high temperatures, making it a resilient component of the local ecosystem. It plays an important role in stabilizing soil and providing habitat for various wildlife species. Acacia petrensis is also sometimes cultivated in regions with similar environmental conditions for its ornamental and ecological value.",
    "distribution_introduced_art_desc": "Acacia petrensis was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the western and northern parts of the country. This plant is often used for soil stabilization due to its deep root system and ability to fix nitrogen. It has also been introduced to other parts of the world for ornamental purposes and as a potential source of timber. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
