{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia platycarpa",
    "plant_slug": "acacia-platycarpa",
    "plant_name_scientific": "acacia platycarpa",
    "intro": "Acacia platycarpa, commonly known as the broad-fruited wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow globular flower heads that bloom in spring. The plant produces woody pods containing flattened, leathery seeds. It thrives in well-drained soils and is often found in coastal and sandy regions. Acacia platycarpa is also valued for its ornamental appeal and ability to fix nitrogen in the soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia platycarpa"
    },
    "taxonomy_art_desc": "Acacia platycarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often with compound leaves and pods as fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive fruit type and nitrogen-fixing ability. Its genus is Acacia, a group of shrubs and trees known for their acicular leaves and often yellow flowers, commonly found in arid regions. Its species is Acacia platycarpa, a specific type of acacia known for its unique morphology and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia platycarpa is primarily native to the Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions within these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia platycarpa was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly used in reforestation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped restore biodiversity in arid and semi-arid regions. However, it requires careful management to prevent it from becoming invasive in non-target areas."
}
