{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dillwynifolia",
    "plant_slug": "acacia-dillwynifolia",
    "plant_name_scientific": "acacia dillwynifolia",
    "intro": "Acacia dillwynifolia, commonly known as the narrow-leaf wattle, is a flowering plant native to southern Australia. It is a shrub or small tree that typically grows in dry, sandy soils. The plant produces yellow flowers in globular heads, which are arranged in clusters along the branches. Its leaves are narrow and feathery, giving it a distinctive appearance. Acacia dillwynifolia is well adapted to arid environments and is often used in landscaping for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dillwynifolia is primarily native to southern Africa, specifically South Africa. It is found in the Eastern Cape, Western Cape, and parts of the Free State province. This species thrives in sandy or rocky soils and is commonly found in coastal and inland fynbos vegetation. It is well adapted to the Mediterranean climate of the region, with dry summers and wet winters. Acacia dillwynifolia is often seen growing in open woodlands and along riverbanks in its native range.",
    "distribution_introduced_art_desc": "Acacia dillwynifolia was mainly introduced to areas with warm, dry climates and well-drained soils, often as an ornamental plant or for erosion control. It is commonly found in regions of Australia, particularly in the southern and western parts, where it has become naturalized. The plant thrives in full sun and is relatively drought-tolerant, making it suitable for xeriscaping and landscaping in arid environments. However, its rapid growth and ability to spread through seeds can lead to it becoming invasive in some ecosystems. Despite its benefits, land managers must monitor its spread to prevent ecological imbalances."
}
