{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verticillata subsp. ovoidea",
    "plant_slug": "acacia-verticillata-subsp-ovoidea",
    "plant_name_scientific": "acacia verticillata subsp. ovoidea",
    "intro": "Acacia verticillata subsp. ovoidea, commonly known as the narrow-leaf wattle, is a shrub native to southeastern Australia. It is characterized by its slender, zigzagging stems and small, oval-shaped leaves arranged in a whorl-like pattern. The plant produces yellow flowers in spikes, which bloom from late autumn to early spring. It thrives in well-drained soils and is often found in coastal and sandy environments. This subspecies is valued for its ornamental appeal and its role in stabilizing dunes and preventing erosion.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia verticillata"
    },
    "taxonomy_art_desc": "Acacia verticillata subsp. ovoidea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which comprises plants with flowers typically having five petals and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in arid regions, known for their distinctive foliage and symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia verticillata, a specific type within the Acacia genus, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verticillata subsp. ovoidea is primarily native to South Australia, Tasmania, and Victoria. This subspecies is commonly found in dry, open habitats such as grasslands, woodlands, and sandy soils. It is well adapted to the arid and semi-arid climates of these regions. The plant often grows in colonies and can form dense thickets. It is an important component of the local flora and provides habitat and food for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia verticillata subsp. ovoidea was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often growing in disturbed or urban environments. The plant is valued for its ability to thrive in arid conditions and its ornamental value due to its unique foliage. It has been used in landscaping and for erosion control in some parts of the country. However, its spread has raised concerns about its potential impact on native plant communities."
}
