{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lacustris",
    "plant_slug": "acacia-lacustris",
    "plant_name_scientific": "acacia lacustris",
    "intro": "Acacia lacustris, commonly known as the lake acacia, is a shrub or small tree native to southern Africa. It is characterized by its compound leaves, which are typically arranged in pairs along the stems. The plant produces yellow flowers in globular or cylindrical clusters, which bloom during the warmer months. Its bark is smooth and grayish, often exuding a milky sap when damaged. Acacia lacustris is adapted to arid and semi-arid environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lacustris is primarily native to the eastern regions of Africa, specifically found in countries such as Kenya, Tanzania, and Uganda. It thrives in savanna and woodland habitats, often growing in areas with well-drained soils. This species is commonly associated with lake fringes and riverine forests, where it forms part of the local vegetation. It plays an important ecological role in these ecosystems by providing habitat and food for various wildlife species. Due to its specific habitat requirements, Acacia lacustris is considered a keystone species in its native range.",
    "distribution_introduced_art_desc": "Acacia lacustris was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant has also been introduced for its ornamental value, as it produces attractive yellow flowers. It is found in several countries across Africa and the Middle East where it has been successfully established. However, in some areas, it has shown invasive tendencies, raising concerns about its ecological impact."
}
