{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata var. plana",
    "plant_slug": "acacia-armata-var-plana",
    "plant_name_scientific": "acacia armata var. plana",
    "intro": "Acacia armata var. plana, commonly known as the flat-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and its distinctive, flat, bipinnate leaves. The plant produces yellow flowers in late winter to early spring, which are arranged in dense, cylindrical spikes. It is well adapted to arid and semi-arid environments, showing drought tolerance and a capacity for regeneration after fire. The species is also valued for its ornamental appeal and its role in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata var. plana is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant of Acacia armata is commonly found in sandy soils and along coastal dunes. It thrives in harsh environments with low rainfall and high temperatures. The plant is well adapted to survive in nutrient-poor soils and can tolerate extreme drought conditions. It plays an important role in stabilizing sandy landscapes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia armata var. plana was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and adaptability to various climates. It has since spread beyond its original cultivation areas, becoming naturalized in several regions across the country. The plant's ability to thrive in arid and semi-arid environments has contributed to its rapid establishment in new habitats. However, its invasive potential has raised concerns among conservationists and land managers. Despite its aesthetic value, efforts are being made to control its spread to prevent ecological disruption."
}
