{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia divergens var. hirsuta",
    "plant_slug": "acacia-divergens-var-hirsuta",
    "plant_name_scientific": "acacia divergens var. hirsuta",
    "intro": "Acacia divergens var. hirsuta, commonly known as the hairy acacia, is a shrub native to southern Africa. It is characterized by its distinctive, flat, bipinnate leaves that are covered in fine, hairy glands. The plant produces yellow flowers in dense, globular clusters, which are typically followed by flat, leathery pods. It thrives in arid and semi-arid environments, often growing on rocky soils. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia divergens var. hirsuta is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Mozambique. It is commonly found in arid and semi-arid regions, particularly in rocky outcrops and dry savannas. This variant is known for its distinctive hairy foliage and ability to thrive in harsh, dry environments. It plays an important ecological role in stabilizing soil and providing habitat for various wildlife species. The plant is also valued for its hardiness and is sometimes used in local landscaping and traditional practices.",
    "distribution_introduced_art_desc": "Acacia divergens var. hirsuta was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coast and in inland areas with a Mediterranean climate. This plant is often used for erosion control due to its ability to thrive in harsh environmental conditions. It has also been introduced to other parts of the world, including some areas of Australia and the Mediterranean. However, its spread is limited by its specific climatic requirements and soil preferences."
}
