{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flacata var. minor",
    "plant_slug": "acacia-flacata-var-minor",
    "plant_name_scientific": "acacia flacata var. minor",
    "intro": "Acacia flacata var. minor, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its slender, weeping branches and small, yellow flowers that appear in winter. The plant has phyllodes, which are modified leaf stalks that function as leaves, and these are typically narrow and linear. It thrives in well-drained soils and is often found in coastal and sandy areas. The slender wattle is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flacata var. minor is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy soils and is commonly found in savanna and shrubland ecosystems. This variety is well adapted to drought conditions and can withstand high temperatures. It is often seen growing along roadsides and in open grasslands. Its distribution is limited to specific ecological zones where it can receive adequate sunlight and minimal water.",
    "distribution_introduced_art_desc": "Acacia flacata var. minor was mainly introduced to control soil erosion and for ornamental purposes in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, it has shown invasive tendencies in some areas, leading to concerns about its ecological impact. Its introduction has been both beneficial and problematic, depending on the region and management practices."
}
