{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia minniritchi",
    "plant_slug": "acacia-minniritchi",
    "plant_name_scientific": "acacia minniritchi",
    "intro": "Acacia minniritchi, commonly known as the Desert Wattle, is a shrub native to arid regions of Australia. It is characterized by its slender, woody stems and small, yellow flowers that bloom in late winter to early spring. The plant has phyllodes, which are flattened leaf stalks that perform the function of true leaves. It is well adapted to drought conditions, with deep roots and a waxy coating to reduce water loss. Acacia minniritchi plays an important role in stabilizing sandy soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia minniritchi"
    },
    "taxonomy_art_desc": "Acacia minniritchi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that typically have separate male and female flowers. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia minniritchi, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia minniritchi is primarily native to Western Australia. It is found in the southern regions of the state, particularly in the area known as the Geraldton area. This species typically grows in sandy soils and is often associated with coastal or semi-arid environments. It is part of the larger Acacia genus, which is well-represented in the flora of Western Australia. The plant is adapted to the local climate and plays a role in the ecological systems of its native habitat.",
    "distribution_introduced_art_desc": "Acacia minniritchi was mainly introduced to control soil erosion and provide shade in arid regions. It is commonly found in areas with low rainfall and poor soil conditions. This plant is known for its ability to thrive in harsh environments, making it a valuable species for land rehabilitation. Its introduction has helped in stabilizing soils and supporting local wildlife. However, it requires careful management to prevent it from becoming invasive in non-target areas."
}
