{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia retinervis",
    "plant_slug": "acacia-retinervis",
    "plant_name_scientific": "acacia retinervis",
    "intro": "Acacia retinervis, commonly known as the narrow-veined acacia, is a shrub or small tree native to southern Africa. It is characterized by its feathery, bipinnate leaves that are finely divided and give it a delicate appearance. The plant produces yellow flowers in compact, globular clusters, which are followed by flat, pod-like fruits. Acacia retinervis is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. It is often used in traditional medicine and is also valued for its ornamental qualities in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia retinervis"
    },
    "taxonomy_art_desc": "Acacia retinervis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns, horsetails, and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of flowering plants commonly known as wattles, which are mostly native to Australia and have compound leaves and pod fruits. Its species is Acacia retinervis, a specific type of acacia known for its delicate, finely veined leaves and is often found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia retinervis is primarily native to Western Australia. It is commonly found in the southern and western regions of the state, particularly in areas with sandy or gravelly soils. This species thrives in arid and semi-arid environments, often growing in open woodlands or shrublands. It is well adapted to the dry climate and can tolerate poor soil conditions. Acacia retinervis plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia retinervis was mainly introduced to areas with a warm climate and well-drained soils, often in regions where it is used for erosion control or as an ornamental plant. It thrives in full sun and is commonly found in coastal and inland areas with moderate rainfall. The plant is known for its distinctive, fern-like leaves and yellow flowers, which attract pollinators such as bees and birds. Due to its rapid growth and adaptability, it has been introduced to several countries in the Mediterranean, South Africa, and parts of the United States. However, its invasive potential in some regions has raised concerns about its impact on native ecosystems."
}
