{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia grandis",
    "plant_slug": "acacia-grandis",
    "plant_name_scientific": "acacia grandis",
    "intro": "Acacia grandis, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow, globular flower heads that are highly attractive to pollinators such as bees and birds. Its wood is valued for its durability and is used in construction and furniture-making. Acacia grandis thrives in well-drained soils and is often found in savanna and woodland habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia grandis is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in tropical and subtropical regions, particularly in areas with well-drained soils. This species thrives in open woodlands and savannas, often growing along watercourses or in disturbed areas. It is well adapted to the hot and dry conditions of its native habitat. Acacia grandis is also known for its ability to fix nitrogen, making it an important plant in ecological restoration efforts.",
    "distribution_introduced_art_desc": "Acacia grandis was mainly introduced to Australia for its potential in soil stabilization and as a source of timber. It is commonly found in the eastern and southern regions of the country, particularly in areas with sandy or loamy soils. The plant is often used in reforestation projects due to its rapid growth and adaptability to various environmental conditions. However, it has also been reported to spread beyond its intended areas, raising concerns about its impact on native ecosystems. Its introduction has led to both ecological benefits and challenges in certain regions."
}
