{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. prostrata",
    "plant_slug": "acacia-longifolia-var-prostrata",
    "plant_name_scientific": "acacia longifolia var. prostrata",
    "intro": "Acacia longifolia var. prostrata, commonly known as the coastal wattle, is a low-growing shrub native to southern Australia. It features small, yellow globular flowers that bloom in spring, attracting various pollinators. The plant has slender, wiry stems that often lie close to the ground, forming a dense mat. Its leaves are phyllodes, which are flattened leaf stalks that perform the function of true leaves. It is well adapted to coastal environments, tolerating salt spray and sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. prostrata is primarily native to southern Australia, including the states of Western Australia, South Australia, and Victoria. It is commonly found in coastal regions and sandy soils, particularly in areas with a Mediterranean climate. This variety is known for its low-growing, spreading habit and is often used in coastal stabilization and landscaping. It thrives in well-drained soils and is adapted to tolerate salt spray and drought conditions. Its native range extends along the southern coastline of Australia, where it plays an important ecological role in coastal ecosystems.",
    "distribution_introduced_art_desc": "Acacia longifolia var. prostrata was mainly introduced to stabilize sand dunes and prevent erosion in coastal areas. It is commonly found in regions with sandy soils and a temperate climate. This plant is often used in ecological restoration projects due to its rapid growth and ability to thrive in harsh conditions. However, it can become invasive in some environments, outcompeting native vegetation. Its introduction has had both beneficial and problematic impacts on local ecosystems."
}
