{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia silvicola",
    "plant_slug": "acacia-silvicola",
    "plant_name_scientific": "acacia silvicola",
    "intro": "Acacia silvicola, commonly known as the forest acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It belongs to the legume family, Fabaceae, and is characterized by its slender, often thorned stems and bipinnate leaves. The plant produces yellow or pale green flowers arranged in spherical or cylindrical clusters, which are followed by flat, leathery pods containing seeds. Acacia silvicola is adapted to poor soils and can thrive in arid or semi-arid environments, making it an important component of degraded or secondary forests. Its ability to fix nitrogen through symbiotic bacteria in its root nodules contributes to soil fertility in nutrient-poor ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia silvicola is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in savanna and woodland habitats, often found in areas with well-drained soils. This species is commonly associated with dry to semi-arid environments and is often seen growing along roadsides and in degraded landscapes. Its distribution is also reported in parts of southern Arabia and the Horn of Africa. Acacia silvicola plays an important ecological role in stabilizing soils and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia silvicola was mainly introduced to restore degraded lands and provide forage for livestock in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil conditions due to its drought tolerance and ability to fix nitrogen. The plant has been widely used in reforestation projects and soil stabilization efforts. However, its introduction has sometimes led to the displacement of native vegetation. Its rapid growth and adaptability make it a valuable but potentially invasive species in certain ecosystems."
}
