{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia seclusa",
    "plant_slug": "acacia-seclusa",
    "plant_name_scientific": "acacia seclusa",
    "intro": "Acacia seclusa, commonly known as the narrow-leaf wattle, is a shrub native to Western Australia. It is characterized by its slender, zigzagging stems and small, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical heads. Acacia seclusa is adapted to arid and semi-arid environments, with a deep root system that allows it to survive in dry conditions. It is also known for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia seclusa"
    },
    "taxonomy_art_desc": "Acacia seclusa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises ferns, horsetails, and their relatives, known for their vascular systems and often ancient evolutionary origins. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing capabilities through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often compound leaves. Its genus is Acacia, a large group of shrubs and trees found primarily in arid and semi-arid regions, known for their thorn-like stems and showy flowers. Its species is Acacia seclusa, a specific type of acacia that is likely adapted to particular environmental conditions, though detailed information on its distribution and ecological role may be limited.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia seclusa is primarily native to Western Australia. It is found in the arid and semi-arid regions of the state, particularly in the southern and central parts. This species is commonly associated with sandy soils and is often found in shrublands and open woodlands. It is well adapted to the harsh climatic conditions of its native habitat. The plant plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native range.",
    "distribution_introduced_art_desc": "Acacia seclusa was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was first recorded in the 1960s and has since spread across various regions, particularly in the North Island. The plant thrives in a variety of soil types and is tolerant of both full sun and partial shade. Its rapid growth and ability to colonize disturbed areas have led to its classification as an environmental weed in some regions. Despite its ornamental value, its invasive potential has raised concerns among conservationists."
}
