{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia discolor var. glabra",
    "plant_slug": "acacia-discolor-var-glabra",
    "plant_name_scientific": "acacia discolor var. glabra",
    "intro": "Acacia discolor var. glabra, commonly known as the smooth acacia, is a shrub native to parts of Australia. It is characterized by its slender, erect stems and small, yellow flowers that appear in globular clusters. The leaves are simple, alternate, and often have a glabrous (smooth) surface, giving the plant its varietal name. It thrives in well-drained soils and is adapted to dry, arid environments. This plant is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia discolor var. glabra is primarily native to parts of eastern and southern Africa, including countries such as Kenya, Tanzania, and Mozambique. It is commonly found in savanna and woodland habitats, often growing in well-drained soils. This variety is adapted to tropical and subtropical climates, thriving in areas with distinct wet and dry seasons. It is often seen in open grasslands and along riverbanks, where it plays a role in stabilizing soil and providing habitat for wildlife. Its distribution is also influenced by human activity, as it is sometimes cultivated for its hardy nature and ornamental value.",
    "distribution_introduced_art_desc": "Acacia discolor var. glabra was mainly introduced to South Africa, where it has become established in certain regions. It is often found in coastal areas and on sandy soils, particularly in the Western Cape. The plant is considered an invasive species in some parts of its range due to its rapid growth and ability to outcompete native vegetation. It has also been reported in other parts of southern Africa, including Namibia and Botswana. Its introduction is largely attributed to human activities such as landscaping and accidental seed dispersal."
}
