{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia unifissilis",
    "plant_slug": "acacia-unifissilis",
    "plant_name_scientific": "acacia unifissilis",
    "intro": "Acacia unifissilis, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow, pea-like flowers that bloom in spring, attracting nectar-feeding birds and insects. Its seed pods are slender and contain several seeds, which are dispersed by wind. Acacia unifissilis is adapted to arid and semi-arid environments, making it a resilient component of native Australian flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia unifissilis"
    },
    "taxonomy_art_desc": "Acacia unifissilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which comprises flowering plants with distinctive flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia unifissilis, a specific type of acacia known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia unifissilis is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area known as the Fitzgerald River National Park. This species thrives in sandy soils and is commonly found in coastal and inland areas. It is well adapted to the arid and semi-arid climates of its native habitat. The plant plays an important ecological role in the local environment.",
    "distribution_introduced_art_desc": "Acacia unifissilis was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. It has also been introduced to other parts of the world, including some regions of the United States and Africa, for similar ecological purposes. However, its introduction has raised concerns about potential invasiveness in non-native environments."
}
