{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rigida",
    "plant_slug": "acacia-rigida",
    "plant_name_scientific": "acacia rigida",
    "intro": "Acacia rigida, commonly known as the rigid acacia, is a shrub native to arid regions of Australia. It is characterized by its dense, thorny stems and small, greenish-yellow flowers that bloom in late winter to early spring. The plant produces flat, bean-like pods that contain edible seeds, which are often used in traditional Aboriginal diets. Acacia rigida is well adapted to drought conditions, with deep roots that help it survive in nutrient-poor soils. Its ability to fix nitrogen makes it an important plant in stabilizing degraded lands.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rigida is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the northern and central parts of the country, including the Northern Territory, Queensland, and Western Australia. This plant thrives in sandy or loamy soils and is often seen in open woodlands and shrublands. It is well adapted to the harsh climate with its deep root system and ability to withstand drought. Acacia rigida plays an important ecological role by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia rigida was mainly introduced to new environments for its ornamental value and potential for soil stabilization. It is commonly found in arid and semi-arid regions where it thrives in well-drained soils. The plant has been introduced to several countries in Africa, the Middle East, and parts of Australia. Due to its rapid growth and adaptability, it has sometimes become invasive in these areas. Proper management is necessary to prevent its spread into native ecosystems."
}
