{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heteroclita subsp. valida",
    "plant_slug": "acacia-heteroclita-subsp-valida",
    "plant_name_scientific": "acacia heteroclita subsp. valida",
    "intro": "Acacia heteroclita subsp. valida, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often serpentine branches and phyllodes that are narrow, linear, and covered in fine hairs. The plant produces yellow globular flowers in summer, which are clustered in dense, cylindrical inflorescences. Its leaves are modified into phyllodes, a common adaptation in acacia species to reduce water loss. It thrives in well-drained soils and is often found in savanna and woodland habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia heteroclita"
    },
    "taxonomy_art_desc": "Acacia heteroclita subsp. valida belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants with compound leaves and flowers typically arranged in clusters, including legumes and vetches. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in horticulture and for their nitrogen-fixing properties. Its species is Acacia heteroclita, a specific type within the Acacia genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heteroclita subsp. valida is primarily native to Western Australia. This subspecies is found in the southern regions of the state, particularly in the Geraldton area. It typically grows in sandy soils and is often associated with coastal and inland habitats. The plant is well adapted to the dry and arid conditions of its native range. It plays an important role in the local ecosystem and is a characteristic component of the vegetation in its distribution area.",
    "distribution_introduced_art_desc": "Acacia heteroclita subsp. valida was mainly introduced to New Zealand. It was introduced as an ornamental plant due to its attractive yellow flowers and hardy nature. The species has since become naturalized in certain regions, particularly in the North Island. It is commonly found in coastal and lowland areas where it thrives in well-drained soils. However, it is not considered invasive and has minimal impact on native ecosystems."
}
