{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hippuroides",
    "plant_slug": "acacia-hippuroides",
    "plant_name_scientific": "acacia hippuroides",
    "intro": "Acacia hippuroides, commonly known as the honeywood tree, is a flowering plant native to southern Africa. It is a small to medium-sized tree or shrub that typically grows in coastal and sandy soils. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits. Its leaves are bipinnate, meaning they are divided into small, feathery leaflets. Acacia hippuroides is valued for its ornamental appeal and its ability to provide habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hippuroides"
    },
    "taxonomy_art_desc": "Acacia hippuroides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia hippuroides, a specific type of acacia found in certain regions, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hippuroides is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the coastal and inland areas. This plant typically grows in sandy soils and is often associated with open woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native range. Acacia hippuroides plays an important ecological role in its habitat by providing food and shelter for various native animals.",
    "distribution_introduced_art_desc": "Acacia hippuroides was mainly introduced to South Africa, particularly in the Western Cape region, as part of early colonial agricultural efforts. It was valued for its hardy nature and ability to thrive in arid and semi-arid conditions. The plant was also introduced to other parts of southern Africa, including Namibia and parts of Zimbabwe, for similar reasons. Its introduction has led to its establishment in naturalized populations, sometimes becoming invasive in certain areas. Despite its ornamental value, it is now considered a potential weed in some ecosystems."
}
