{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia incrassata",
    "plant_slug": "acacia-incrassata",
    "plant_name_scientific": "acacia incrassata",
    "intro": "Acacia incrassata, commonly known as the thick-leaved acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, dark green foliage and its ability to thrive in arid and semi-arid environments. The plant produces yellow, globular flowers that bloom in summer, attracting various pollinators. Its wood is hard and durable, making it useful for construction and fuel. Acacia incrassata also plays a role in preventing soil erosion due to its extensive root system.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia incrassata"
    },
    "taxonomy_art_desc": "Acacia incrassata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their ability to fix nitrogen. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in tropical and subtropical regions, known for their distinctive seed pods and often thorny structures. Its species is Acacia incrassata, a specific type of acacia found in certain regions of Africa, characterized by its growth habits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia incrassata is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in dry, sandy soils and is adapted to arid and semi-arid environments. It is often seen in open woodlands and shrublands. Its distribution is largely confined to the coastal and inland areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia incrassata was mainly introduced to Australia as a potential soil stabilizer and for its ability to thrive in arid conditions. It was commonly planted along roadsides and in degraded landscapes to prevent erosion. However, its rapid growth and adaptability have led to it becoming an invasive species in some regions. Despite its ecological impact, it is still used in certain areas for its nitrogen-fixing properties. Its introduction highlights the challenges of managing non-native plants in new environments."
}
