{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pachyphylla",
    "plant_slug": "acacia-pachyphylla",
    "plant_name_scientific": "acacia pachyphylla",
    "intro": "Acacia pachyphylla, commonly known as the thick-leaved acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its dense, woody structure and small, clustered leaves that are thick and fleshy, adapted to conserve water. The plant produces yellow flowers in summer, which are arranged in globular inflorescences. Its thick, fleshy leaves are a key adaptation to its harsh, dry environment. Acacia pachyphylla is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pachyphylla"
    },
    "taxonomy_art_desc": "Acacia pachyphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their distinct morphological features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod-like fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found primarily in arid and tropical regions, known for their phyllodes and often used in traditional medicine. Its species is Acacia pachyphylla, a specific type of acacia native to southern Africa, characterized by its thick, waxy leaves and ability to thrive in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pachyphylla is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the Nullarbor Plain and surrounding areas. This plant thrives in sandy soils and is well adapted to the harsh, dry climate of its native habitat. It is an important component of the local vegetation and plays a role in stabilizing the soil in these environments. Due to its resilience, it is often used in rehabilitation projects in degraded landscapes.",
    "distribution_introduced_art_desc": "Acacia pachyphylla was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the central and western parts of the country. This plant is often used for soil stabilization and as a source of fuelwood due to its hardy nature. Its introduction has also been noted in some parts of the United States and South Africa. However, its spread is limited by its specific environmental requirements and lack of adaptability to more humid conditions."
}
