{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia daviesiifolia",
    "plant_slug": "acacia-daviesiifolia",
    "plant_name_scientific": "acacia daviesiifolia",
    "intro": "Acacia daviesiifolia, commonly known as the silky acacia, is a shrub or small tree native to eastern Australia. It is characterized by its slender, often pendulous stems and bipinnate leaves that are finely divided, giving it a feathery appearance. The plant produces yellow globular inflorescences, which are highly attractive to nectar-feeding birds and insects. Its flowers are followed by flat, leathery pods that contain several seeds. Acacia daviesiifolia is adapted to dry, well-drained soils and is often found in coastal and heathland environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia daviesiifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in savanna and grassland ecosystems, often growing on rocky outcrops and sandy soils. This species is well adapted to dry climates and can thrive in areas with low rainfall. It is often seen in association with other drought-tolerant plants in these environments. Its distribution is limited to specific ecological niches within the region.",
    "distribution_introduced_art_desc": "Acacia daviesiifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or loamy soils. The plant is known for its distinctive foliage, with narrow, feather-like leaves that give it a unique appearance. It is often used in ornamental landscaping due to its hardiness and drought tolerance. However, it has also been reported to spread aggressively in some areas, raising concerns about its potential invasiveness."
}
