{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia explanata",
    "plant_slug": "acacia-explanata",
    "plant_name_scientific": "acacia explanata",
    "intro": "Acacia explanata, commonly known as the slender wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in dry, sandy soils and is often found in coastal and inland regions. Acacia explanata is well adapted to arid conditions and is an important component of native vegetation in its habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia explanata is primarily native to eastern Australia, including parts of Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry, open habitats such as grasslands, woodlands, and heathlands. This plant thrives in well-drained soils and is often associated with sandy or rocky substrates. It is well adapted to the arid and semi-arid climates of its native range. Acacia explanata plays an important role in local ecosystems by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia explanata was mainly introduced to stabilize soil and prevent erosion in areas with degraded land. It is commonly used in reclamation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped restore vegetation in arid and semi-arid regions. However, it requires careful management to prevent it from becoming invasive in non-target environments."
}
