{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gigantea",
    "plant_slug": "acacia-gigantea",
    "plant_name_scientific": "acacia gigantea",
    "intro": "Acacia gigantea, commonly known as the giant acacia, is a tall, woody shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its long, slender, bipinnate leaves that are often reduced to spines, which help reduce water loss in its harsh environment. The plant produces yellow to golden-green flowers in dense, globular clusters, which are an important food source for various pollinators. Its seeds are encased in thick, woody pods that split open when mature, releasing the seeds to the wind. Acacia gigantea is also known for its ability to thrive in poor soils and its role in preventing soil erosion in its native habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gigantea is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the inland parts of Western Australia, South Australia, and the Northern Territory. This species thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. It plays an important ecological role by providing habitat and food for various native animals. Its ability to withstand drought makes it well adapted to the harsh conditions of its native environment.",
    "distribution_introduced_art_desc": "Acacia gigantea was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was originally from Australia and was introduced for its ornamental value and potential for erosion control. However, its rapid growth and ability to outcompete native vegetation have led to ecological concerns. The plant thrives in a variety of soil types and can tolerate drought, contributing to its invasive spread. Efforts are being made to manage its population to protect local biodiversity."
}
