{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia patens",
    "plant_slug": "acacia-patens",
    "plant_name_scientific": "acacia patens",
    "intro": "Acacia patens, commonly known as the weeping acacia, is a shrub or small tree native to southern Africa. It is characterized by its drooping, feathery foliage and yellow flowers that bloom in summer. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic organs. It thrives in well-drained soils and is often found in coastal areas and sandy soils. Acacia patens is well adapted to arid and semi-arid environments, making it a resilient and drought-tolerant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia patens is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It is commonly found in savannas, grasslands, and woodland areas where it thrives in well-drained soils. This species is also present in parts of the Arabian Peninsula and the Indian subcontinent, though its main range remains in Africa. It is often seen growing along roadsides, riverbanks, and in disturbed habitats. Acacia patens is an important component of the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia patens was mainly introduced to stabilize soil and prevent erosion in degraded lands. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and capacity to provide shade and habitat for wildlife. Its introduction has helped in restoring ecological balance in arid and semi-arid regions. However, it requires careful management to prevent it from becoming invasive in non-target areas."
}
