{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennata var. pluricapitata",
    "plant_slug": "acacia-pennata-var-pluricapitata",
    "plant_name_scientific": "acacia pennata var. pluricapitata",
    "intro": "Acacia pennata var. pluricapitata, commonly known as the many-headed wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and its distinctive yellow flowers arranged in dense, globular clusters. The leaves are bipinnate, with numerous small, feather-like leaflets that give the plant a delicate appearance. It thrives in well-drained soils and is often found in dry, open habitats such as woodlands and grasslands. The plant is valued for its ornamental appeal and its role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennata var. pluricapitata is primarily native to eastern Australia, including regions of Queensland, New South Wales, and the Australian Capital Territory. It thrives in a variety of habitats, such as rocky outcrops, dry forests, and open woodlands. This variety is known for its distinctive appearance, featuring multiple heads on its branches and small, yellow flowers. It is commonly found in areas with well-drained soils and a Mediterranean climate. Acacia pennata var. pluricapitata plays an important ecological role in its native range, providing habitat and food for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia pennata var. pluricapitata was mainly introduced to areas with a warm, temperate climate and well-drained soils, particularly in regions of Australia and parts of Southeast Asia. It is commonly found in coastal and inland regions where it thrives in full sun and moderate rainfall. This plant is often used in landscaping due to its ornamental value and ability to tolerate poor soil conditions. However, it can become invasive in certain environments if not managed properly. Its distribution is largely limited by human activity and climate suitability."
}
