{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia guadalupensis",
    "plant_slug": "acacia-guadalupensis",
    "plant_name_scientific": "acacia guadalupensis",
    "intro": "Acacia guadalupensis, commonly known as the Guadalupe acacia, is a shrub or small tree native to the arid regions of the southwestern United States and northern Mexico. It is characterized by its woody, branching structure and feathery, bipinnate leaves that are often reduced to small, scale-like structures in mature plants. The plant produces yellowish-green to golden yellow flowers in dense, cylindrical clusters, which bloom in late spring to early summer. Acacia guadalupensis is adapted to drought conditions, with deep root systems that allow it to survive in sandy or rocky soils. It plays an important role in providing habitat and forage for local wildlife in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia guadalupensis is primarily native to the southwestern United States and northern Mexico. It is found in regions such as Arizona, New Mexico, and parts of Texas. This plant typically grows in arid and semi-arid environments, including rocky soils and desert landscapes. It is commonly associated with the Chihuahuan and Sonoran Deserts. Acacia guadalupensis plays an important ecological role in these regions by providing habitat and forage for local wildlife.",
    "distribution_introduced_art_desc": "Acacia guadalupensis was mainly introduced to the southwestern United States, particularly in Texas and New Mexico. It has been found growing in disturbed soils and along roadsides, often in arid or semi-arid environments. The plant is well adapted to drought conditions and can thrive in poor soil conditions. Its introduction has led to concerns about its potential invasiveness in native ecosystems. It is commonly found in areas with low precipitation and high solar exposure."
}
