{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia juniperina",
    "plant_slug": "acacia-juniperina",
    "plant_name_scientific": "acacia juniperina",
    "intro": "Acacia juniperina, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, fern-like appearance. The plant produces yellow flowers in globular clusters, which are typically visited by nectar-feeding insects and birds. Acacia juniperina is adapted to dry, sandy soils and is often found in coastal and inland regions. It plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia juniperina is primarily native to the arid and semi-arid regions of southwestern Australia. It is commonly found in the states of Western Australia and South Australia. This plant thrives in sandy or gravelly soils and is adapted to low rainfall conditions. It is often seen in coastal dunes and inland shrublands. Acacia juniperina plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia juniperina was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It has been commonly planted in parts of Australia, particularly in Queensland and New South Wales, for its ornamental value and ability to stabilize soil. The plant is also used in reforestation projects due to its resilience to drought and poor soil conditions. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
