{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia arabica",
    "plant_slug": "acacia-arabica",
    "plant_name_scientific": "acacia arabica",
    "intro": "Acacia arabica, commonly known as the frankincense tree, is a flowering plant native to the Arabian Peninsula. It is characterized by its woody, thorny stems and compound leaves that are often covered in fine hairs. The plant produces small, yellowish-green flowers that bloom in spring, followed by the formation of resinous gum, which is harvested for its aromatic properties. Acacia arabica thrives in arid and semi-arid environments, adapting to harsh conditions with deep root systems. Its ecological and cultural significance has made it a valuable species in traditional medicine and incense production.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia arabica is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It thrives in arid and semi-arid environments, often found in coastal areas and dry mountain regions. This species is well adapted to the hot, dry climate with low rainfall typical of its native habitat. It is commonly found in coastal dunes, rocky slopes, and along the edges of deserts. Acacia arabica plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia arabica was mainly introduced to regions with arid or semi-arid climates where it can thrive in poor soils. It is commonly found in areas of the Middle East, North Africa, and parts of southern Europe. The plant is valued for its hardy nature and ability to prevent soil erosion. It also has cultural and medicinal significance in many of these regions. Its introduction has helped stabilize ecosystems in areas prone to desertification."
}
