{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sphacelata subsp. recurva",
    "plant_slug": "acacia-sphacelata-subsp-recurva",
    "plant_name_scientific": "acacia sphacelata subsp. recurva",
    "intro": "Acacia sphacelata subsp. recurva, commonly known as the narrow-leaf wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often zigzagging stems and narrow, feathery leaves. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in rocky or sandy habitats. This subspecies is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sphacelata"
    },
    "taxonomy_art_desc": "Acacia sphacelata subsp. recurva belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often with compound leaves and pods as fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their phyllodes and often for their ability to thrive in arid environments. Its species is Acacia sphacelata, a specific type within the Acacia genus, which includes several subspecies, with subsp. recurva being one that exhibits particular morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sphacelata subsp. recurva is primarily native to Western Australia. This subspecies is found in the southwestern region of the state, particularly in the areas of the Geraldton and Esperance regions. It typically grows in sandy soils and is commonly found in coastal and inland areas. The plant is well adapted to the dry and arid conditions of its native habitat. It is an important component of the local flora and plays a role in the ecological balance of the region.",
    "distribution_introduced_art_desc": "Acacia sphacelata subsp. recurva was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, particularly in the Western and Eastern Cape provinces. This subspecies is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has led to some ecological concerns due to its potential to invade native vegetation. It is also valued for its ability to thrive in arid and semi-arid environments."
}
