{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia repens",
    "plant_slug": "acacia-repens",
    "plant_name_scientific": "acacia repens",
    "intro": "Acacia repens, commonly known as the creeping wattle, is a low-growing shrub native to Australia. It features slender, prostrate stems that root at the nodes, allowing it to spread across the ground. The plant produces small, yellow flowers arranged in compact clusters, typical of the Acacia genus. Its leaves are bipinnate, consisting of multiple pairs of tiny, feathery leaflets. Acacia repens is well adapted to arid and semi-arid environments, making it a hardy and resilient species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia repens"
    },
    "taxonomy_art_desc": "Acacia repens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Fabales, which comprises plants with distinctive flowers that have a pea-like shape and are often associated with nitrogen-fixing symbiotic relationships. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities through root nodules. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often for their ability to thrive in arid environments. Its species is Acacia repens, a specific type of acacia known for its creeping growth habit and small, compound leaves, commonly found in sandy soils of arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia repens is primarily native to Northern Territory, Western Australia. It is commonly found in arid and semi-arid regions across these areas. This plant thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of its native range. Acacia repens plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia repens was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its rapid growth and hardy nature make it suitable for reclamation of degraded lands. However, it can become invasive in some areas if not managed properly."
}
