{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica var. indica",
    "plant_slug": "acacia-nilotica-var-indica",
    "plant_name_scientific": "acacia nilotica var. indica",
    "intro": "Acacia nilotica var. indica, commonly known as the Indian acacia or khair, is a deciduous tree native to the Indian subcontinent. It is characterized by its slender, often thorned branches and bipinnate leaves that are compound and feathery in appearance. The plant produces yellow, fragrant flowers that bloom in clusters, followed by long, flat pods containing hard, angular seeds. It is well adapted to arid and semi-arid climates, making it a resilient species in tropical and subtropical regions. The tree has been traditionally used for its timber, gum, and medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica var. indica is primarily native to the Indian subcontinent, including countries such as India, Pakistan, and Bangladesh. It is commonly found in arid and semi-arid regions, particularly in the Thar Desert and other parts of western India. This variety thrives in dry, hot climates and is often found in open woodlands and along riverbanks. It is well adapted to poor soils and can tolerate high temperatures and low rainfall. The plant is also known for its use in traditional medicine and as a source of gum arabic.",
    "distribution_introduced_art_desc": "Acacia nilotica var. indica was mainly introduced to areas with warm, dry climates and well-drained soils, particularly in regions of southern Africa, the Middle East, and parts of South Asia. It is commonly found in savannas, woodland edges, and along riverbanks where it can thrive with minimal water. This plant is often used for its hardy nature, providing shade and serving as a source of timber and fodder. Its introduction has sometimes led to ecological impacts, including competition with native species in invaded areas. Despite its benefits, careful management is necessary to prevent it from becoming invasive in new environments."
}
