{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ashbyae",
    "plant_slug": "acacia-ashbyae",
    "plant_name_scientific": "acacia ashbyae",
    "intro": "Acacia ashbyae, commonly known as Ashby's wattle, is a small shrub native to the arid regions of Western Australia. It is characterized by its delicate yellow flowers that bloom in late summer, attracting pollinators such as bees and birds. The plant has phyllodes, which are flattened leaf-like structures that reduce water loss in its harsh environment. Its root system is deep and extensive, allowing it to access groundwater in dry conditions. Acacia ashbyae plays an important ecological role in stabilizing sandy soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ashbyae"
    },
    "taxonomy_art_desc": "Acacia ashbyae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pods as fruits and often has symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and their ability to thrive in arid environments. Its species is Acacia ashbyae, a specific type of acacia native to Australia, known for its unique ecological role and specific habitat requirements.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ashbyae is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area around the town of Geraldton. This plant typically grows in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native range. Acacia ashbyae is an important component of the local flora and plays a role in the ecological balance of its habitat.",
    "distribution_introduced_art_desc": "Acacia ashbyae was mainly introduced to the western regions of South Africa, particularly in the Free State and Lesotho. It was introduced as a potential source of timber and for its ability to thrive in arid conditions. The plant has since spread beyond its original introduction sites, becoming established in various semi-arid environments. Its introduction has led to concerns about its impact on native vegetation due to its competitive nature. Despite its invasive tendencies, it is sometimes used in reforestation projects due to its hardiness."
}
