{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia simsii var. multisiliqua",
    "plant_slug": "acacia-simsii-var-multisiliqua",
    "plant_name_scientific": "acacia simsii var. multisiliqua",
    "intro": "Acacia simsii var. multisiliqua, commonly known as the multibract acacia, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its slender, often branched stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow flowers in compact, globular inflorescences, which are often surrounded by specialized bracts. Its root system is highly adapted to drought, allowing it to thrive in nutrient-poor soils. The species is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia simsii var. multisiliqua is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and Angola. This variant is commonly found in rocky outcrops and sandy soils within these areas. It thrives in environments with low rainfall and high temperatures. The plant is well adapted to the harsh conditions of its native habitat. It plays an important ecological role in stabilizing soil and providing shelter for local wildlife.",
    "distribution_introduced_art_desc": "Acacia simsii var. multisiliqua was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It has since spread beyond cultivation and is now considered a potential environmental weed in certain regions. The plant thrives in a variety of soil types and is drought-tolerant, which contributes to its invasive potential. It is often found in coastal and disturbed areas, where it can outcompete native vegetation. Management efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
