{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia williamsiana",
    "plant_slug": "acacia-williamsiana",
    "plant_name_scientific": "acacia williamsiana",
    "intro": "Acacia williamsiana, commonly known as Williams' acacia, is a shrub native to Australia. It is characterized by its slender, wiry branches and small, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers arranged in cylindrical spikes, which are typically borne in the axils of the leaves. Its seed pods are elongated and woody, containing numerous small, flattened seeds. Acacia williamsiana is adapted to arid environments and is often found in sandy soils across the arid and semi-arid regions of Australia.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia williamsiana"
    },
    "taxonomy_art_desc": "Acacia williamsiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological characteristics. Its order is Fabales, which consists of flowering plants that are typically legumes, often with compound leaves and flowers in racemose inflorescences. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in horticulture and traditional medicine. Its species is Acacia williamsiana, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia williamsiana is primarily native to New South Wales. It is commonly found in the coastal and inland regions of the state, particularly in areas with sandy soils. This species thrives in dry, open habitats such as woodlands, heathlands, and dunes. It is well adapted to the climate of New South Wales, which includes warm summers and mild winters. The plant plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia williamsiana was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and hardy nature. However, it has since become invasive, outcompeting native species in certain areas. The plant spreads rapidly through seed dispersal by animals and wind. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
