{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cassioides",
    "plant_slug": "acacia-cassioides",
    "plant_name_scientific": "acacia cassioides",
    "intro": "Acacia cassioides, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and bipinnate leaves composed of small, needle-like leaflets. The plant produces yellow globular flowers in clusters, which are typically visited by a variety of pollinators. Acacia cassioides is adapted to arid and semi-arid environments, showing drought tolerance and resilience. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cassioides is primarily native to eastern Australia, including regions such as Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry sclerophyll forests and woodland areas. This plant thrives in well-drained soils and is often associated with rocky or sandy habitats. It is well adapted to the climate of its native range, which includes a temperate to subtropical climate with distinct dry seasons. Acacia cassioides is an important component of the local flora and plays a role in supporting native wildlife.",
    "distribution_introduced_art_desc": "Acacia cassioides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is known for its ability to tolerate drought and high salinity, making it adaptable to various environmental conditions. It has been used for soil stabilization and as a source of timber and fuelwood. However, its invasive potential has raised concerns in some ecosystems where it may outcompete native vegetation."
}
