{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia neurocarpa var. glabrata",
    "plant_slug": "acacia-neurocarpa-var-glabrata",
    "plant_name_scientific": "acacia neurocarpa var. glabrata",
    "intro": "Acacia neurocarpa var. glabrata, commonly known as the smooth acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellowish-green flowers in spherical inflorescences, which are followed by woody pods containing flat, lens-shaped seeds. It thrives in dry, sandy soils and is adapted to arid and semi-arid environments. This species is often used in traditional medicine and as a source of fodder for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia neurocarpa var. glabrata is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Botswana, and South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and woodland ecosystems. This variety is known for its ability to withstand drought conditions, making it well adapted to the harsh environments of its native range. It plays an important ecological role by providing habitat and food for various wildlife species. The plant is also sometimes used in traditional medicine by local communities.",
    "distribution_introduced_art_desc": "Acacia neurocarpa var. glabrata was mainly introduced to South Africa, particularly in the Eastern Cape and Western Cape provinces. It was brought in for its potential use in soil stabilization and as a source of timber and fuelwood. This variety is known for its drought tolerance and ability to thrive in poor soils, making it suitable for reforestation projects. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems. It is now considered a potential weed in some areas where it has established itself outside of controlled environments."
}
