{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dempsteri",
    "plant_slug": "acacia-dempsteri",
    "plant_name_scientific": "acacia dempsteri",
    "intro": "Acacia dempsteri, commonly known as the dwarf black wattle, is a shrub native to eastern Australia. It is characterized by its slender, wiry branches and small, dark green leaves that are alternate and pinnately compound. The plant produces yellow flowers in globular clusters, which are followed by flat, leathery pods. Acacia dempsteri is well adapted to dry, sandy soils and is often found in coastal and inland regions. It is a hardy, low-growing plant that is popular in landscaping due to its drought tolerance and ornamental appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dempsteri"
    },
    "taxonomy_art_desc": "Acacia dempsteri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia dempsteri, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dempsteri is primarily native to Western Australia. It is found in the coastal regions and surrounding areas of the state. This species thrives in sandy soils and is commonly associated with coastal heathlands. It is a small shrub that contributes to the biodiversity of its native habitat. Acacia dempsteri is well adapted to the climatic conditions of Western Australia.",
    "distribution_introduced_art_desc": "Acacia dempsteri was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is known for its ability to tolerate drought and saline conditions, making it adaptable to various environments. It is often used for erosion control due to its extensive root system and rapid growth. However, its spread has raised concerns about potential invasiveness in some local ecosystems."
}
