{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia f. latifolia",
    "plant_slug": "acacia-longifolia-f-latifolia",
    "plant_name_scientific": "acacia longifolia f. latifolia",
    "intro": "Acacia longifolia f. latifolia, commonly known as the broad-leaved golden wattle, is a shrub native to southern Australia. It is characterized by its broad, sickle-shaped leaves and yellow flowers that bloom in winter. The plant is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. It thrives in coastal and sandy soils and is often used in landscaping for its ornamental value. The variety f. latifolia is distinguished by its wider leaves compared to the typical form of Acacia longifolia.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia f. latifolia is primarily native to southern Australia, including the states of Western Australia, South Australia, and Victoria. This subspecies is commonly found in coastal regions and sandy soils along the southern coastline. It thrives in dry, Mediterranean-type climates with mild, wet winters and warm, dry summers. The plant is often seen in open woodlands and heathlands, where it forms dense thickets. Its wide distribution in these areas reflects its adaptability to the local environmental conditions.",
    "distribution_introduced_art_desc": "Acacia longifolia f. latifolia was mainly introduced to control erosion and for ornamental purposes in coastal and sandy areas. It is commonly found in regions with sandy soils and full sun exposure. This plant is often used in revegetation projects due to its rapid growth and ability to stabilize dunes. However, it can become invasive in some areas, outcompeting native vegetation. Its introduction has led to both ecological benefits and management challenges in certain environments."
}
