{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bynoeana",
    "plant_slug": "acacia-bynoeana",
    "plant_name_scientific": "acacia bynoeana",
    "intro": "Acacia bynoeana, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its yellow flowers, which are clustered in spherical heads, and its bipinnate leaves that are compound and feathery. The plant is well adapted to arid and semi-arid environments, thriving in sandy or gravelly soils. It plays an important role in the ecosystem, providing food and habitat for various native animals. The golden wattle is also the national floral emblem of Australia, symbolizing the country's natural heritage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia bynoeana"
    },
    "taxonomy_art_desc": "Acacia bynoeana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and ability to thrive in arid environments. Its species is Acacia bynoeana, a specific type of acacia native to certain regions of Australia, recognized for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bynoeana is primarily native to New South Wales. It is commonly found in the coastal regions and sand dunes of the state. This plant thrives in sandy soils and is often seen in dry, open habitats. It plays an important role in stabilizing coastal dunes and providing habitat for local wildlife. Its distribution is largely restricted to the eastern coastal areas of New South Wales.",
    "distribution_introduced_art_desc": "Acacia bynoeana was mainly introduced to Australia as part of ecological restoration and land rehabilitation efforts. It is commonly used in revegetation projects due to its ability to thrive in harsh, arid environments. The plant is also valued for its rapid growth and capacity to stabilize soil, making it useful in preventing erosion. However, its introduction has raised concerns about its potential to become invasive in certain regions. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
