{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rugata var. genuina",
    "plant_slug": "acacia-rugata-var-genuina",
    "plant_name_scientific": "acacia rugata var. genuina",
    "intro": "Acacia rugata var. genuina, commonly known as the rough wattle, is a shrub native to southern Australia. It is characterized by its dense, woody growth and yellow flowers that appear in globular clusters. The leaves are phyllodes, which are flattened leaf stalks that reduce water loss in arid conditions. It thrives in well-drained soils and is often found in coastal and inland regions. This plant is valued for its ornamental appeal and its role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rugata var. genuina is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the southwestern part of the state, particularly in the Geraldton and Esperance regions. This variety thrives in sandy soils and is often associated with coastal and inland dunes. It is well adapted to the harsh conditions of the region, including high temperatures and low rainfall. The plant plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia rugata var. genuina was mainly introduced to South Australia and the Riverland region of New South Wales. It was introduced as a hardy, drought-tolerant plant suitable for windbreaks and soil stabilization. The distribution includes areas with sandy or loamy soils and a temperate to sub-tropical climate. It is commonly found in agricultural landscapes and along roadsides. Its introduction has been part of efforts to manage land degradation and provide habitat for native wildlife."
}
