{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia carneorum",
    "plant_slug": "acacia-carneorum",
    "plant_name_scientific": "acacia carneorum",
    "intro": "Acacia carneorum, commonly known as the red acacia, is a shrub native to the arid regions of Australia. It is characterized by its distinctive red or orange flower spikes that appear during the warmer months. The plant has bipinnate leaves that are often covered in fine hairs, which help reduce water loss in its harsh environment. Acacia carneorum produces small, pod-like fruits that contain seeds dispersed by wind. It is an important plant in its ecosystem, providing nectar for various pollinators and habitat for small animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia carneorum"
    },
    "taxonomy_art_desc": "Acacia carneorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient evolutionary lineage. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species such as roses and citrus. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often spiny foliage and symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia carneorum, a specific type of acacia native to certain regions, distinguished by its unique morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia carneorum is primarily native to New South Wales and South Australia. This species is commonly found in arid and semi-arid regions within these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. Its distribution is limited to specific areas within New South Wales and South Australia.",
    "distribution_introduced_art_desc": "Acacia carneorum was mainly introduced to regions with dry climates and well-drained soils, where it can thrive in arid and semi-arid environments. It is commonly found in areas with low rainfall and high temperatures, making it suitable for reclamation projects in degraded landscapes. This plant is valued for its ability to fix nitrogen and improve soil fertility, which makes it beneficial for ecological restoration. Its introduction has also been used to prevent soil erosion and provide habitat for local wildlife. However, it requires careful management to avoid becoming invasive in non-native ecosystems."
}
