{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia atrox subsp. planiticola",
    "plant_slug": "acacia-atrox-subsp-planiticola",
    "plant_name_scientific": "acacia atrox subsp. planiticola",
    "intro": "Acacia atrox subsp. planiticola, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It is characterized by its slender, erect growth habit and narrow, linear leaves. The plant produces yellow floral spikes that are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, open habitats. Due to its hardy nature, it is sometimes cultivated for ornamental purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia atrox"
    },
    "taxonomy_art_desc": "Acacia atrox subsp. planiticola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex cell structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is distinguished by its distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in arid regions, known for their acicular leaves and often used in traditional medicine. Its species is Acacia atrox, a specific type within the Acacia genus, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia atrox subsp. planiticola is primarily native to New South Wales. This subspecies is found in the southern regions of the state, particularly in the Riverina and Murrumbidgee areas. It typically grows in dry, open habitats such as grasslands and woodland edges. The plant is well adapted to the local climate and soil conditions of these regions. Its distribution is limited to specific areas within New South Wales due to its particular ecological requirements.",
    "distribution_introduced_art_desc": "Acacia atrox subsp. planiticola was mainly introduced to areas with well-drained soils and a temperate climate, typically found in regions with moderate rainfall. It thrives in open landscapes such as grasslands and disturbed sites where it can establish quickly. This subspecies is often found in association with other introduced plant species, contributing to the alteration of local ecosystems. Its introduction has led to changes in soil structure and competition with native flora. Due to its rapid growth and adaptability, it is considered a potential invasive species in certain regions."
}
