{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia splendens",
    "plant_slug": "acacia-splendens",
    "plant_name_scientific": "acacia splendens",
    "intro": "Acacia splendens, commonly known as the flame acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and its striking, bright yellow flowers that appear in clusters. The leaves are bipinnate, meaning they are divided into small, feather-like leaflets, which give the plant a delicate appearance. Its flowers are not only ornamental but also attract a variety of pollinators, including bees and birds. Acacia splendens is drought-tolerant and thrives in well-drained soils, making it a popular choice for gardens in arid regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia splendens"
    },
    "taxonomy_art_desc": "Acacia splendens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some ferns, known for their primitive features and spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse flower structures and vascular systems. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa and Australia, known for their distinctive, often thorned appearance and ability to thrive in arid conditions. Its species is Acacia splendens, a specific type of acacia known for its ornamental value and ability to grow in various environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia splendens is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in dry, sandy soils and is often seen in coastal and inland areas. It is well adapted to the arid and semi-arid climates of its native range. Acacia splendens plays an important ecological role in the local flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia splendens was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, particularly in the Eastern and Western Cape provinces. The plant thrives in well-drained soils and full sun, making it adaptable to various environmental conditions. Its rapid growth and ability to spread through both seeds and vegetative propagation have contributed to its establishment in new habitats. However, it is considered invasive in some areas, posing a threat to native vegetation."
}
