{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia curvinervia",
    "plant_slug": "acacia-curvinervia",
    "plant_name_scientific": "acacia curvinervia",
    "intro": "Acacia curvinervia, commonly known as the narrow-veined wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves. The plant produces yellow flowers in cylindrical spikes, which are typically arranged in clusters at the ends of the branches. It thrives in well-drained soils and is often found in coastal and inland regions. Acacia curvinervia is valued for its ornamental appeal and is also used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia curvinervia is primarily native to eastern and southern Africa, including countries such as South Africa, Kenya, Tanzania, and Mozambique. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in well-drained soils. This species is adapted to tropical and subtropical climates and can tolerate periods of drought. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia curvinervia is also sometimes cultivated for its ornamental value due to its distinctive foliage and ability to withstand harsh environmental conditions.",
    "distribution_introduced_art_desc": "Acacia curvinervia was mainly introduced to areas with dry to semi-arid climates, particularly in regions with well-drained soils. It is commonly found in disturbed sites such as roadsides, degraded lands, and agricultural fields. This plant has a high tolerance for drought and can thrive in poor soil conditions. Its rapid growth and ability to fix nitrogen make it a successful invader in many ecosystems. However, it can outcompete native vegetation and is often considered a weed in some regions."
}
