{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata",
    "plant_slug": "acacia-armata",
    "plant_name_scientific": "acacia armata",
    "intro": "Acacia armata, commonly known as the black wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and small, yellow flowers that appear in globular clusters. The plant produces long, flat pods that contain seeds covered in a fibrous, woody material. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acacia armata is well adapted to arid and semi-arid environments, showing resilience to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata is primarily native to southern Africa, including countries such as Namibia, Botswana, South Africa, and parts of Mozambique. It is commonly found in arid and semi-arid regions, particularly in the Karoo and Kalahari Desert areas. This plant thrives in sandy or rocky soils and is often seen growing along riverbanks and in open savannas. It is well adapted to dry conditions and can survive with minimal rainfall. Acacia armata is also known as the manyana or camel thorn tree, and it plays an important role in local ecosystems.",
    "distribution_introduced_art_desc": "Acacia armata was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing capabilities, which improve soil fertility over time. Its dense foliage provides habitat and shelter for various wildlife species. However, it can become invasive in some areas if not managed properly."
}
