{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verniciflua var. latifolia",
    "plant_slug": "acacia-verniciflua-var-latifolia",
    "plant_name_scientific": "acacia verniciflua var. latifolia",
    "intro": "Acacia verniciflua var. latifolia, commonly known as the broad-leaved gum acacia, is a shrub or small tree native to Australia. It is characterized by its broad, flat, leathery leaves that are arranged in pairs along the stems. The plant produces yellow flowers in globular clusters, which are followed by long, cylindrical pods containing seeds. It is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for coastal and sandy soils. The species is also valued for its historical use in producing a resin used for varnishes and traditional medicines.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verniciflua var. latifolia is primarily native to southern Africa, specifically South Africa. It is commonly found in the Eastern Cape and Western Cape provinces. This variety thrives in coastal and sandy soils, often in areas with a Mediterranean climate. It is typically found in open woodlands and along the edges of fynbos vegetation. The plant is well adapted to the dry summer conditions typical of its native range.",
    "distribution_introduced_art_desc": "Acacia verniciflua var. latifolia was mainly introduced to regions with a warm, arid climate, particularly in parts of Australia and the Mediterranean. It is often cultivated for its ornamental value due to its distinctive foliage and ability to thrive in poor soil conditions. This plant is also valued for its hardiness and capacity to prevent soil erosion in degraded landscapes. Its introduction has been primarily for horticultural and landscaping purposes. However, it can sometimes become invasive in non-native environments if not managed properly."
}
