{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella tequilana",
    "plant_slug": "acaciella-tequilana",
    "plant_name_scientific": "acaciella tequilana",
    "intro": "Acaciella tequilana, commonly known as the tequila acacia, is a flowering plant native to Mexico. It is characterized by its slender, branching stems and small, pale green leaves. The plant produces yellowish-white flowers that bloom in clusters, typically during the spring and summer seasons. It is often found in arid and semi-arid regions, thriving in well-drained soils. Due to its unique appearance and habitat, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella tequilana"
    },
    "taxonomy_art_desc": "Acaciella tequilana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in temperate regions. Its order is Fabales, which includes plants with compound leaves and flowers that have a distinctive structure with a single carpel. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acaciella, a group of flowering plants native to Mexico, often found in arid environments. Its species is Acaciella tequilana, a specific type of plant known for its unique adaptations to its native habitat in Mexico.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella tequilana is primarily native to Mexico Central, Mexico Northeast, Mexico Northwest, and Mexico Southwest. This species is commonly found in the dry and semi-arid regions of these areas. It thrives in rocky soils and is often associated with limestone formations. The plant is well adapted to the local climate and is an important part of the native vegetation. It is also known for its ornamental value and is sometimes cultivated in gardens.",
    "distribution_introduced_art_desc": "Acaciella tequilana was mainly introduced to the southern United States, particularly in Texas and New Mexico, as well as parts of California. It was brought in for its ornamental value due to its unique foliage and ability to thrive in arid conditions. The plant is commonly found in xeriscaped gardens and along roadsides in these regions. It has also been introduced to some areas of Arizona and southern Nevada. Despite its aesthetic appeal, it is considered an invasive species in certain locations, outcompeting native vegetation."
}
