{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia araneosa",
    "plant_slug": "acacia-araneosa",
    "plant_name_scientific": "acacia araneosa",
    "intro": "Acacia araneosa, commonly known as the spider acacia, is a shrub native to southern Africa. It is characterized by its slender, spindly branches that resemble spider legs, giving it its common name. The plant produces small, yellow flowers arranged in dense, globular clusters, which are highly attractive to pollinators. Its leaves are bipinnate, consisting of numerous small leaflets, and it has a woody, thorny structure. Acacia araneosa is often used in traditional medicine and is also valued for its ornamental appeal in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia araneosa"
    },
    "taxonomy_art_desc": "Acacia araneosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have leaves with stipules and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive thorny stems and acacia-like leaves. Its species is Acacia araneosa, a specific type of acacia known for its unique appearance and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia araneosa is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy soils and is often seen in open woodlands and scrublands. It is well adapted to the harsh climatic conditions of the region. Acacia araneosa plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia araneosa was mainly introduced to control soil erosion and for its ability to fix nitrogen, making it useful in reclamation projects. It is commonly found in disturbed sites such as roadsides, abandoned fields, and degraded lands. The plant thrives in arid and semi-arid environments, preferring well-drained soils. Its rapid growth and dense foliage make it an effective pioneer species in ecological restoration. However, it can become invasive in some regions if not managed properly."
}
