{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia isoneura subsp. nimia",
    "plant_slug": "acacia-isoneura-subsp-nimia",
    "plant_name_scientific": "acacia isoneura subsp. nimia",
    "intro": "Acacia isoneura subsp. nimia, commonly known as the slender acacia, is a shrub native to arid and semi-arid regions of Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow to golden yellow flowers in globular or cylindrical inflorescences, which are visited by various pollinators. It is adapted to withstand drought and high temperatures, making it a resilient species in harsh environments. The wood of Acacia isoneura subsp. nimia is hard and durable, historically used by local communities for construction and tool-making.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia isoneura"
    },
    "taxonomy_art_desc": "Acacia isoneura subsp. nimia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which comprises plants with flowers that typically have two sets of petals and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, characterized by pods and the ability to fix nitrogen through root nodules. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and as timber. Its species is Acacia isoneura, a specific type of acacia that includes the subspecies nimia, which is adapted to specific environmental conditions and is found in particular geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia isoneura subsp. nimia is primarily native to Western Australia. This subspecies is found in the arid and semi-arid regions of the state. It typically grows in sandy or rocky soils along the edges of salt lakes and dry creek beds. The plant is well adapted to the harsh climatic conditions of the region. It plays an important ecological role in stabilizing soil and providing habitat for local fauna.",
    "distribution_introduced_art_desc": "Acacia isoneura subsp. nimia was mainly introduced to areas with arid or semi-arid climates, particularly in regions of Australia and parts of Southeast Asia. It thrives in well-drained soils and is often found in coastal dunes and sandy plains. This subspecies is valued for its hardy nature and ability to stabilize soils in degraded environments. It has been introduced for purposes such as land reclamation and as a source of timber and fodder. However, its spread can sometimes lead to ecological impacts in non-native regions."
}
