{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia suaresensis",
    "plant_slug": "acacia-suaresensis",
    "plant_name_scientific": "acacia suaresensis",
    "intro": "Acacia suaresensis, commonly known as the Suarese acacia, is a species of flowering plant in the legume family Fabaceae. It is native to the tropical regions of South America, particularly Brazil and Paraguay. The plant is characterized by its slender, branching stems and bipinnate leaves that are often covered in fine hairs. Its yellow flowers are clustered in cylindrical spikes, and it produces small, flat pods that contain seeds. Acacia suaresensis is adapted to grow in dry, sandy soils and is often found in savanna and woodland habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia suaresensis is primarily native to the island of Socotra, which is located in the Arabian Sea off the coast of Yemen. This unique plant is found in the arid and semi-arid regions of Socotra, where it thrives in rocky and coastal habitats. It is well adapted to the harsh environmental conditions of the island, including high temperatures and limited rainfall. The species is part of the diverse flora that makes Socotra a hotspot for endemic plant species. Due to its restricted distribution, Acacia suaresensis is considered a rare and vulnerable plant.",
    "distribution_introduced_art_desc": "Acacia suaresensis was mainly introduced to tropical and subtropical regions of Australia, particularly in Queensland and the Northern Territory. It is commonly found in open woodlands, grasslands, and along watercourses. The plant is adapted to well-drained soils and can tolerate seasonal droughts. It is often used in reforestation and land rehabilitation projects due to its hardiness and rapid growth. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation."
}
