{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hereroensis",
    "plant_slug": "acacia-hereroensis",
    "plant_name_scientific": "acacia hereroensis",
    "intro": "Acacia hereroensis, commonly known as the Herero acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive bipinnate leaves, which are divided into small, thread-like segments. The plant produces yellow flowers that are clustered in cylindrical spikes, often appearing in late winter or early spring. Its seed pods are elongated and woody, containing several seeds that are dispersed by wind. Acacia hereroensis is adapted to arid and semi-arid environments, making it a resilient component of savanna ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hereroensis is primarily native to southern Africa, including countries such as Namibia, Botswana, Zimbabwe, and parts of South Africa. It is commonly found in grassland and savanna regions, often growing in well-drained soils. This species is particularly adapted to arid and semi-arid environments, making it a common sight in the Kalahari Desert and surrounding areas. It plays an important ecological role by providing shelter and food for various wildlife species. The plant is also known for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "distribution_introduced_art_desc": "Acacia hereroensis was mainly introduced to regions with semi-arid to arid climates, particularly in parts of Africa such as Namibia, Botswana, and Angola. It thrives in well-drained soils and is commonly found in savanna and woodland ecosystems. This plant is often used for its timber, which is valued for its durability and resistance to termites. It also plays a role in preventing soil erosion and providing habitat for various wildlife species. Due to its adaptability, it has been introduced to other areas outside its native range for ecological and economic purposes."
}
