{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia distachya",
    "plant_slug": "acacia-distachya",
    "plant_name_scientific": "acacia distachya",
    "intro": "Acacia distachya, commonly known as the slender acacia, is a shrub native to southern Africa. It is characterized by its slender, often branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in compact spikes, which are followed by long, straight pods containing seeds. It thrives in arid and semi-arid environments, showing adaptability to drought conditions. Acacia distachya is often used in traditional medicine and for its ornamental value in landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia distachya is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It thrives in dry, sandy soils and is commonly found in savannas and grasslands. This species is well adapted to arid and semi-arid environments, often growing along riverbanks and in rocky outcrops. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia distachya is also known for its distinctive yellow flowers and its ability to fix nitrogen, which enriches the soil.",
    "distribution_introduced_art_desc": "Acacia distachya was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, agricultural fields, and degraded lands. It thrives in regions with a warm climate and moderate to low rainfall. This plant is often found in the Mediterranean climate zones and parts of Africa. Its rapid growth and ability to colonize new areas make it a potential invasive species in some regions. It is commonly used for soil stabilization and as a source of browse for livestock."
}
