{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia senegal var. typica",
    "plant_slug": "acacia-senegal-var-typica",
    "plant_name_scientific": "acacia senegal var. typica",
    "intro": "Acacia senegal var. typica, commonly known as the gum arabic acacia, is a small, thorny shrub native to the Sahelian regions of Africa. It is characterized by its bipinnate leaves and yellowish-green flowers that bloom in spring. The plant is particularly noted for producing a valuable gum, known as gum arabic, which is harvested from its bark. This gum is widely used in food, pharmaceutical, and industrial applications due to its emulsifying and stabilizing properties. It thrives in arid and semi-arid climates, making it an important species in desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia senegal var. typica is primarily native to the Sahel region of Africa, including countries such as Sudan, Chad, Niger, and Mali. It thrives in semi-arid and arid environments, often found in sandy soils and along riverbanks. This plant is well adapted to harsh climatic conditions and is commonly used for gum production. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is closely linked to areas with seasonal rainfall patterns.",
    "distribution_introduced_art_desc": "Acacia senegal var. typica was mainly introduced to regions in Africa, particularly the Sahel and parts of the Arabian Peninsula, for its gum arabic production. It thrives in semi-arid to arid environments, making it suitable for areas with low rainfall and poor soil conditions. The plant is often cultivated for its economic value, as its gum is used in food, pharmaceuticals, and industrial applications. Its introduction has helped support local economies and provided livelihoods for communities in these regions. However, it requires careful management to prevent over-exploitation and maintain ecological balance."
}
