{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassiuscula var. latifolia",
    "plant_slug": "acacia-crassiuscula-var-latifolia",
    "plant_name_scientific": "acacia crassiuscula var. latifolia",
    "intro": "Acacia crassiuscula var. latifolia, commonly known as the broad-leaved acacia, is a shrub or small tree native to Australia. It features compound leaves with broad, flat leaflets that are often pale green in color. The plant produces yellow globular flowers that bloom in late winter to early spring. It is drought-tolerant and thrives in well-drained soils. This variety is valued for its ornamental appeal and ability to provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassiuscula var. latifolia is primarily native to northern Australia, including the Northern Territory, Queensland, and Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This variant is known for its broad, flat leaves and is often seen in shrublands and open woodlands. It thrives in regions with low rainfall and is well adapted to the harsh climate of its native habitat. The plant plays an important ecological role in stabilizing soil and providing shelter for local wildlife.",
    "distribution_introduced_art_desc": "Acacia crassiuscula var. latifolia was mainly introduced to New Zealand. It was brought there for ornamental purposes due to its attractive foliage and ability to thrive in various soil conditions. This plant has since become naturalized in several regions, often growing along roadsides and in disturbed areas. Its introduction has raised concerns about its potential to outcompete native species in certain ecosystems. Despite its beauty, it is considered a potential weed in some areas of New Zealand."
}
