{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia translucens var. oblonga",
    "plant_slug": "acacia-translucens-var-oblonga",
    "plant_name_scientific": "acacia translucens var. oblonga",
    "intro": "Acacia translucens var. oblonga, commonly known as the translucent wattle, is a shrub native to Australia. It is characterized by its slender, wiry stems and small, rounded leaves that are often covered in fine hairs. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in sandy or rocky habitats. Due to its ornamental value and hardy nature, it is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia translucens var. oblonga is primarily native to southern Africa, specifically South Africa. It is found in the eastern and western parts of the country, including the regions of KwaZulu-Natal and the Western Cape. This plant thrives in sandy or rocky soils and is commonly found in coastal and inland areas. It is often associated with fynbos vegetation, which is characteristic of the region's Mediterranean climate. The species is well adapted to the dry summers and wet winters typical of its native habitat.",
    "distribution_introduced_art_desc": "Acacia translucens var. oblonga was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with low rainfall and full sun exposure. This plant is often used in landscaping due to its drought tolerance and ornamental value. It has been introduced to several parts of the United States, including California and Texas. However, it is considered invasive in some areas where it outcompetes native vegetation."
}
