{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pedicellata",
    "plant_slug": "acacia-pedicellata",
    "plant_name_scientific": "acacia pedicellata",
    "intro": "Acacia pedicellata, commonly known as the slender acacia, is a shrub or small tree native to southern Africa. It belongs to the Fabaceae family, which is characterized by its pod-bearing fruits and nitrogen-fixing capabilities. The plant produces small, yellow flowers arranged in dense, globular inflorescences, which are often visited by bees and other pollinators. Its leaves are bipinnate, consisting of multiple pairs of small, narrow leaflets. Acacia pedicellata is adapted to arid and semi-arid environments, making it a resilient species in dry regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pedicellata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savannas and grasslands. This species thrives in well-drained soils and is often seen growing along riverbanks and in rocky outcrops. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia pedicellata is also valued for its hardy nature and is sometimes used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia pedicellata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in coastal and inland areas. This plant is often associated with disturbed soils and can be found along roadsides and in agricultural landscapes. Its introduction has led to its spread beyond its original range, sometimes becoming invasive in local ecosystems. Due to its adaptability, it is now considered a weed in some areas of the country."
}
