{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mucronata subsp. dependens",
    "plant_slug": "acacia-mucronata-subsp-dependens",
    "plant_name_scientific": "acacia mucronata subsp. dependens",
    "intro": "Acacia mucronata subsp. dependens, commonly known as the slender wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, elongated phyllodes that are often curved and covered in fine hairs. The plant produces yellow flowers in globular inflorescences, which appear during the warmer months. It thrives in well-drained soils and is adapted to dry, arid environments. The subspecies is notable for its distinctive appearance and is often used in horticulture for its ornamental value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mucronata"
    },
    "taxonomy_art_desc": "Acacia mucronata subsp. dependens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which comprises plants with distinctive flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their characteristic acicular leaves and often used in traditional medicine. Its species is Acacia mucronata, a specific type of acacia with a subspecies dependens, typically found in specific ecological regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tasmania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mucronata subsp. dependens is primarily native to Tasmania. This subspecies is found in various regions across the island state, including the central and southern areas. It typically grows in dry, open habitats such as grasslands and heathlands. The plant is well adapted to the local climate and soil conditions of Tasmania. Its distribution is largely confined to the native flora of the state.",
    "distribution_introduced_art_desc": "Acacia mucronata subsp. dependens was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, often spreading through seed dispersal by wind and animals. The plant is adapted to coastal and sandy soils, making it a common sight in the Western Cape and along the Eastern Cape. Its introduction has led to some ecological concerns due to its potential to invade native vegetation. However, it is also valued for its hardy nature and ability to stabilize dunes."
}
