{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sentis",
    "plant_slug": "acacia-sentis",
    "plant_name_scientific": "acacia sentis",
    "intro": "Acacia sentis, commonly known as the silky acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves that give it a delicate appearance. The plant produces yellow to golden-orange flowers that bloom in clusters, attracting pollinators such as bees and birds. Its seeds are encased in hard pods, which are typical of the legume family to which acacia belongs. Acacia sentis is adapted to arid and semi-arid environments, making it a resilient plant in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sentis is primarily native to eastern Australia, including regions of New South Wales and Queensland. It thrives in a variety of habitats such as dry forests, woodlands, and rocky outcrops. This plant is commonly found in areas with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is well adapted to nutrient-poor soils and can withstand periods of drought. Acacia sentis plays an important role in local ecosystems by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia sentis was mainly introduced to areas with warm, arid climates and well-drained soils, where it can thrive in full sun. It is commonly found in regions with low rainfall and high temperatures, such as parts of Australia, South Africa, and the southwestern United States. This plant has been introduced to various ecological zones for its ornamental value and ability to stabilize soil in degraded landscapes. It is often used in reforestation projects due to its rapid growth and hardy nature. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
