{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia marginata",
    "plant_slug": "acacia-marginata",
    "plant_name_scientific": "acacia marginata",
    "intro": "Acacia marginata, commonly known as the coastal wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and feathery, bipinnate leaves. The plant produces yellow globular flower heads that appear in clusters, typically during the warmer months. Acacia marginata thrives in coastal and sandy soils, often found in dune environments. It is well adapted to salt spray and can tolerate drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia marginata is primarily native to northern Australia, including regions of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, particularly in sand plains and sandy soils. This species is well adapted to drought conditions and thrives in areas with low rainfall. It is often seen along roadsides and in open woodlands. Its distinctive appearance and hardy nature make it a recognizable feature of the Australian landscape.",
    "distribution_introduced_art_desc": "Acacia marginata was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil conditions. The plant has been widely planted along roadsides and in degraded landscapes for its hardy nature. Its rapid growth and ability to thrive in harsh environments make it a valuable species for land rehabilitation. However, it can sometimes become invasive if not managed properly."
}
