{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pteridifolia",
    "plant_slug": "acacia-pteridifolia",
    "plant_name_scientific": "acacia pteridifolia",
    "intro": "Acacia pteridifolia, commonly known as the fern-leaf acacia, is a species of flowering plant in the legume family. It is native to southern Africa and is characterized by its delicate, fern-like leaves that give it its common name. The plant produces small, yellow flowers arranged in dense, globular clusters. Acacia pteridifolia is often found in rocky or sandy soils and is adapted to arid or semi-arid environments. It is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pteridifolia is primarily native to northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It thrives in arid and semi-arid environments, often found in sandy soils and open woodlands. This species is commonly associated with coastal and inland regions where it forms part of the local flora. It is well adapted to the hot and dry climate of its native range. The plant is known for its distinctive fern-like leaves and yellow flowers, which attract various pollinators.",
    "distribution_introduced_art_desc": "Acacia pteridifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. The plant is known for its feathery foliage and yellow flowers, making it a popular ornamental species. However, it has also been reported to spread into native vegetation, raising concerns about its ecological impact. Its introduction is largely attributed to horticultural purposes and its ability to withstand harsh environmental conditions."
}
