{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia granitica",
    "plant_slug": "acacia-granitica",
    "plant_name_scientific": "acacia granitica",
    "intro": "Acacia granitica, commonly known as the granite acacia, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its woody, thorny stems and compound leaves that are often covered in fine hairs. The plant produces small, yellow flowers that bloom in clusters, followed by flat, pod-like fruits containing seeds. It is adapted to survive in nutrient-poor, rocky soils and can withstand prolonged droughts. Acacia granitica plays a role in stabilizing soil and providing habitat for various desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia granitica"
    },
    "taxonomy_art_desc": "Acacia granitica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are often legumes and have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in various applications. Its species is Acacia granitica, a specific type of acacia that is adapted to rocky or granitic soils and is found in specific geographic regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia granitica is primarily native to New South Wales and Queensland in Australia. This species is commonly found in rocky and gravelly soils, often in dry and semi-arid environments. It is typically associated with granite outcrops and sandstone formations across these regions. The plant is well adapted to the harsh conditions of the inland areas of eastern Australia. Its distribution reflects its preference for well-drained, nutrient-poor soils.",
    "distribution_introduced_art_desc": "Acacia granitica was mainly introduced to specific regions with rocky and well-drained soils, particularly in arid and semi-arid environments. It is commonly found in areas with low rainfall and high temperatures, where it thrives in nutrient-poor soils. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It has also been introduced to some parts of Australia and the southwestern United States for landscaping and ecological restoration. However, its introduction has raised concerns about potential invasiveness in non-native habitats."
}
