{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lemmonii",
    "plant_slug": "acacia-lemmonii",
    "plant_name_scientific": "acacia lemmonii",
    "intro": "Acacia lemmonii, commonly known as the desert wisteria, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its slender, branching stems and clusters of small, yellow, pea-like flowers. The plant produces flat, narrow leaflets that are often covered in fine hairs, and it has a deep root system adapted to arid environments. Acacia lemmonii is drought-tolerant and thrives in sandy or rocky soils. Its flowers attract pollinators such as bees and butterflies, contributing to its ecological importance in desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lemmonii is primarily native to the southwestern United States and northwestern Mexico. It is found in regions such as Arizona, New Mexico, and parts of California. This plant thrives in arid and semi-arid environments, often growing in rocky soils and canyons. It is commonly associated with desert landscapes and is well adapted to drought conditions. Acacia lemmonii is also known as the Lemmon's acacia and is a characteristic species of the Sonoran Desert.",
    "distribution_introduced_art_desc": "Acacia lemmonii was mainly introduced to areas with well-drained soils and moderate to high rainfall, typically found in Mediterranean climates. It thrives in regions with full sun exposure and is commonly found in coastal and inland valleys. This plant is often used in landscaping due to its drought tolerance and ornamental value. It has been introduced to several regions outside its native range, including parts of California and the Mediterranean. However, its introduction has raised concerns due to its potential to become invasive in certain environments."
}
