{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia truncata",
    "plant_slug": "acacia-truncata",
    "plant_name_scientific": "acacia truncata",
    "intro": "Acacia truncata, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia truncata is also known for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia truncata"
    },
    "taxonomy_art_desc": "Acacia truncata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient evolutionary traits. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia truncata, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia truncata is primarily native to Western Australia. It is found in various regions across the state, including the coastal areas and inland regions. This plant typically grows in sandy soils and is commonly found in shrublands and coastal heath. It is well adapted to the arid and semi-arid climates of the region. Acacia truncata plays an important role in the local ecosystem and is a characteristic species of the Western Australian flora.",
    "distribution_introduced_art_desc": "Acacia truncata was mainly introduced to India for its ornamental value and potential use in reforestation projects. It is commonly found in coastal and semi-arid regions where it thrives in well-drained soils. The plant has been cultivated in gardens and green spaces across the country due to its hardy nature and attractive foliage. However, it requires careful management to prevent it from becoming invasive in local ecosystems. Its introduction has also been linked to efforts in soil stabilization and erosion control in certain parts of India."
}
