{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptoneura var. pungens",
    "plant_slug": "acacia-leptoneura-var-pungens",
    "plant_name_scientific": "acacia leptoneura var. pungens",
    "intro": "Acacia leptoneura var. pungens, commonly known as the spiny wattle, is a shrub native to the arid regions of Australia. It is characterized by its slender, spiny stems and bipinnate leaves composed of small, oval-shaped leaflets. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, spherical inflorescences. It is well adapted to dry conditions, with a deep root system that allows it to survive in nutrient-poor soils. The plant is often used in ecological restoration projects due to its hardiness and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptoneura var. pungens is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the Northern Territory, Queensland, and Western Australia. This variety thrives in sandy soils and is often associated with coastal and inland dunes. It is well adapted to the harsh climate with its deep root system and drought-resistant characteristics. The plant plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia leptoneura var. pungens was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in degraded lands and is used for its fast growth and hardy nature. This variety is particularly valued for its ability to thrive in poor soil conditions and withstand drought. It has been widely planted in rehabilitation projects across Australia and parts of Southeast Asia. However, its spread can sometimes lead to ecological concerns if not managed properly."
}
