{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia podalyriifolia",
    "plant_slug": "acacia-podalyriifolia",
    "plant_name_scientific": "acacia podalyriifolia",
    "intro": "Acacia podalyriifolia, commonly known as the silver wattle, is a small shrub native to Western Australia. It is characterized by its delicate, feathery foliage and yellow flowers that bloom in late winter to early spring. The plant produces distinctive pod-like fruits that contain seeds, which are dispersed by wind. It thrives in well-drained soils and full sun, making it a popular choice for coastal gardens. Due to its ornamental value and hardiness, it is often cultivated in arid and semi-arid regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia podalyriifolia"
    },
    "taxonomy_art_desc": "Acacia podalyriifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pods as fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia podalyriifolia, a specific type of acacia known for its unique leaf structure and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [
        "Assam",
        "Bolivia",
        "Brazil Southeast",
        "DR Congo",
        "Eswatini",
        "Ethiopia",
        "India",
        "Jawa",
        "Kenya",
        "KwaZulu-Natal",
        "Malawi",
        "Malaya",
        "Mauritius",
        "New Caledonia",
        "Northern Provinces",
        "Puerto Rico",
        "Rwanda",
        "Réunion",
        "South Australia",
        "Sri Lanka",
        "Tanzania",
        "Uganda",
        "Venezuela",
        "Western Australia",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acacia podalyriifolia is primarily native to New South Wales and Queensland in Australia. This species is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands and grasslands. The plant is well adapted to the climate of these areas, with features that help it conserve water. It plays an important role in the local ecosystem and is a characteristic feature of the native flora in these states.",
    "distribution_introduced_art_desc": "Acacia podalyriifolia was mainly introduced to Assam, Bolivia, Brazil Southeast, DR Congo, Eswatini, Ethiopia, India, Jawa, Kenya, KwaZulu-Natal, Malawi, Malaya, Mauritius, New Caledonia, Northern Provinces, Puerto Rico, Rwanda, Réunion, South Australia, Sri Lanka, Tanzania, Uganda, Venezuela, Western Australia, and Zimbabwe. It has been widely distributed across these regions, often as an ornamental or for its hardy characteristics. The plant is commonly found in tropical and subtropical climates, thriving in well-drained soils. Its introduction has been associated with horticultural trade and ecological restoration efforts. However, in some areas, it has become invasive, outcompeting native species."
}
