{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hunteriana",
    "plant_slug": "acacia-hunteriana",
    "plant_name_scientific": "acacia hunteriana",
    "intro": "Acacia hunteriana, commonly known as the Hunter's acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to arid environments, with a deep root system that allows it to access groundwater. Its pods contain seeds that are dispersed by wind, contributing to its wide distribution. Acacia hunteriana also plays a role in soil stabilization and provides habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hunteriana is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia, Angola, and parts of Botswana. It thrives in sandy soils and is commonly found in shrublands and grasslands. This species is well adapted to hot, dry climates and can tolerate poor soil conditions. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia hunteriana is also sometimes cultivated for its ornamental value due to its distinctive foliage and resilience.",
    "distribution_introduced_art_desc": "Acacia hunteriana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in sandy soils and coastal areas. This plant is often used for erosion control due to its ability to stabilize soils with its deep root system. However, it can also become invasive in some ecosystems, outcompeting native vegetation. Its introduction has raised concerns among conservationists regarding its ecological impact."
}
