{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trachyphloia",
    "plant_slug": "acacia-trachyphloia",
    "plant_name_scientific": "acacia trachyphloia",
    "intro": "Acacia trachyphloia, commonly known as the rough-barked acacia, is a shrub or small tree native to Australia. It is characterized by its distinctive rough, fissured bark that gives it its scientific name. The plant produces yellow flowers in globular clusters, which appear during the warmer months. Its leaves are phyllodes, which are flattened leaf stalks that function as leaves. Acacia trachyphloia is adapted to dry, sandy soils and is often found in open woodlands and heathlands.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia trachyphloia"
    },
    "taxonomy_art_desc": "Acacia trachyphloia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and produce legume-like fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their compound leaves and often thorny structures, with many species used for timber and traditional medicine. Its species is Acacia trachyphloia, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trachyphloia is primarily native to New South Wales. It is commonly found in the coastal and tableland regions of the state. This plant thrives in sandy soils and is often associated with heathlands and open forests. It is well adapted to the temperate climate of New South Wales. The species plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia trachyphloia was mainly introduced to control soil erosion and as a source of timber and fuelwood in arid and semi-arid regions. It is commonly planted in degraded lands to stabilize soil and prevent further degradation. The plant thrives in dry climates with well-drained soils and is often used in reforestation projects. However, its rapid growth and ability to form dense thickets can lead to competition with native species. Despite its ecological benefits, it requires careful management to avoid becoming invasive in certain environments."
}
