{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stereophylla var. stereophylla",
    "plant_slug": "acacia-stereophylla-var-stereophylla",
    "plant_name_scientific": "acacia stereophylla var. stereophylla",
    "intro": "Acacia stereophylla var. stereophylla, commonly known as the white wattle, is a small to medium-sized shrub native to Western Australia. It is characterized by its narrow, upright growth habit and its distinctive white to pale yellow flowers that appear in dense, cylindrical clusters. The leaves are compound, consisting of multiple linear leaflets, and the plant produces small, woody pods that contain flat, edible seeds. It thrives in well-drained soils and is often found in coastal and sandy habitats. This species is valued for its ornamental appeal and its ability to provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stereophylla"
    },
    "taxonomy_art_desc": "Acacia stereophylla var. stereophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which comprises plants with characteristic flowers and includes legumes and related families. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia stereophylla, a specific variety within the Acacia genus, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stereophylla var. stereophylla is primarily native to Western Australia. It is found in the southern regions of the state, particularly in the coastal and near-coastal areas. This variety thrives in sandy soils and is commonly associated with heathlands and shrublands. It is well adapted to the dry and Mediterranean climate of the region. The plant is an important component of the local flora and supports a variety of wildlife.",
    "distribution_introduced_art_desc": "Acacia stereophylla var. stereophylla was mainly introduced to areas with a Mediterranean climate, characterized by dry summers and wet winters. It thrives in well-drained soils and is commonly found in coastal regions and rocky habitats. This plant is often cultivated for its ornamental value due to its distinctive foliage and ability to withstand drought conditions. It has been introduced to several parts of California and the western United States. However, it is considered invasive in some regions where it outcompetes native vegetation."
}
