{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fragilis",
    "plant_slug": "acacia-fragilis",
    "plant_name_scientific": "acacia fragilis",
    "intro": "Acacia fragilis, commonly known as the brittle wattle, is a small, shrub-like plant native to Western Australia. It is characterized by its slender, often branched stems and small, feathery leaves that are typically alternate and bipinnate. The plant produces yellow flowers in clusters, which bloom from late autumn to early spring. Acacia fragilis is adapted to arid and semi-arid environments, showing drought tolerance and a preference for well-drained soils. Its ecological role includes providing food and habitat for various native animals and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia fragilis"
    },
    "taxonomy_art_desc": "Acacia fragilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes green algae and land plants, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group of vascular plants that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are often legumes, characterized by their distinctive flowers and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their unique leaf structures and often used in traditional medicine and as sources of timber. Its species is Acacia fragilis, a specific type of acacia known for its delicate structure and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fragilis is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the wheatbelt and Swan Coastal Plain areas. This plant typically grows in sandy or gravelly soils and is often associated with open woodlands and shrublands. It is well adapted to the dry and temperate climate of the region. Acacia fragilis plays an important ecological role in supporting local wildlife and maintaining soil stability.",
    "distribution_introduced_art_desc": "Acacia fragilis was mainly introduced to New Zealand. It was brought there during the 19th century as part of the introduction of exotic plant species for ornamental and agricultural purposes. The plant has since become naturalized in several regions of the country. It is commonly found in coastal areas and on disturbed soils. However, it is considered a potential weed in some parts of New Zealand due to its rapid growth and ability to spread easily."
}
