{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bonariensis",
    "plant_slug": "acacia-bonariensis",
    "plant_name_scientific": "acacia bonariensis",
    "intro": "Acacia bonariensis, commonly known as the Chilean acacia, is a shrub or small tree native to South America, particularly Chile and Argentina. It is characterized by its slender, branching stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow, globular flower heads that are clustered in dense, spherical inflorescences. It thrives in dry, well-drained soils and is adapted to arid and semi-arid environments. Acacia bonariensis is also valued for its ornamental appeal and is sometimes used in landscaping due to its drought tolerance and attractive foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bonariensis is primarily native to South America, particularly Argentina and Uruguay. It is commonly found in the temperate regions of these countries, growing in open woodlands and grasslands. This species thrives in well-drained soils and is often associated with disturbed or secondary vegetation. It is also occasionally found in parts of southern Brazil and Paraguay. The plant plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia bonariensis was mainly introduced to South Africa, where it has become an invasive species. It was originally from South America, specifically Argentina and Uruguay. The plant was introduced for its ornamental value and as a potential source of timber. However, it has since spread rapidly, outcompeting native vegetation. Its introduction has led to ecological concerns due to its aggressive growth and ability to alter local ecosystems."
}
