{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia strigosa var. brevifolia",
    "plant_slug": "acacia-strigosa-var-brevifolia",
    "plant_name_scientific": "acacia strigosa var. brevifolia",
    "intro": "Acacia strigosa var. brevifolia, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features small, yellow flowers that bloom in summer, attracting pollinators like bees and birds. Its leaves are narrow and linear, with a distinctive greyish-green color and a rough texture. It is often used in gardens for its ornamental value and is adapted to dry, sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia strigosa var. brevifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. This variant is commonly found in sandy soils and rocky outcrops, thriving in environments with low rainfall. It is often associated with savanna and woodland ecosystems where it plays a role in stabilizing soil and providing habitat for local wildlife. The plant is well adapted to drought conditions, showcasing its resilience in harsh climates. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acacia strigosa var. brevifolia was mainly introduced to areas with well-drained soils and a temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland areas where it can establish itself easily. Its rapid growth and adaptability make it a popular choice for erosion control and landscaping. However, it can become invasive in certain environments if not managed properly."
}
