{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia caven var. microcarpa",
    "plant_slug": "acacia-caven-var-microcarpa",
    "plant_name_scientific": "acacia caven var. microcarpa",
    "intro": "Acacia caven var. microcarpa, commonly known as the dwarf acacia, is a shrub native to South America, particularly found in Argentina and Chile. It is characterized by its small, narrow leaves that are often clustered at the ends of the branches. The plant produces yellow flowers in compact, spherical clusters, which are followed by small, woody pods containing seeds. It is adapted to arid and semi-arid environments, making it resilient to drought conditions. Due to its ornamental value and hardy nature, it is sometimes cultivated in gardens in regions with suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia caven var. microcarpa is primarily native to Argentina, specifically in the central and southern regions of the country. It is commonly found in the provinces of Buenos Aires, La Pampa, and San Luis. This plant thrives in dry, open habitats such as grasslands and shrublands. It is well adapted to the semi-arid climate of these areas. Its distribution is also extended into parts of Uruguay and southern Brazil.",
    "distribution_introduced_art_desc": "Acacia caven var. microcarpa was mainly introduced to South America, particularly in regions with warm, dry climates. It has been widely planted for its ability to thrive in degraded soils and its use in livestock forage. The plant is also valued for its rapid growth and nitrogen-fixing properties, which aid in soil rehabilitation. However, its introduction has led to concerns about its potential to become invasive in certain areas. Its distribution is largely associated with human activities such as reforestation and land restoration projects."
}
