{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia yunnanensis",
    "plant_slug": "acacia-yunnanensis",
    "plant_name_scientific": "acacia yunnanensis",
    "intro": "Acacia yunnanensis, commonly known as Yunnan acacia, is a deciduous shrub or small tree native to China. It belongs to the legume family, Fabaceae, and is characterized by its bipinnate leaves and yellow flowers. The plant is adapted to arid and semi-arid environments, making it resilient to drought conditions. It plays a role in preventing soil erosion and is sometimes used in traditional medicine. Its ecological importance makes it a valuable species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia yunnanensis is primarily native to Yunnan Province in China. It is found in the mountainous regions of this southwestern province. The plant thrives in areas with a subtropical climate and is commonly found in forests and shrublands. It is also present in parts of northern Vietnam and northern Thailand. This species is well adapted to the diverse ecosystems of these regions.",
    "distribution_introduced_art_desc": "Acacia yunnanensis was mainly introduced to southern China, particularly in Yunnan Province, where it thrives in tropical and subtropical climates. It is commonly found in dry forests and shrublands, often growing on rocky slopes and limestone soils. This plant is valued for its hardy nature and ability to withstand harsh environmental conditions. It has also been introduced to parts of Southeast Asia, including Vietnam and Thailand, for ornamental and ecological purposes. Due to its adaptability, it has become an important component of local ecosystems in these regions."
}
