{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lewisii",
    "plant_slug": "acacia-lewisii",
    "plant_name_scientific": "acacia lewisii",
    "intro": "Acacia lewisii, commonly known as Lewis acacia, is a deciduous shrub native to the western United States. It belongs to the Fabaceae family, which is characterized by its compound leaves and legume fruits. The plant has feathery, bipinnate leaves that are often covered in fine hairs, and it produces yellow to golden-yellow flower clusters. It thrives in arid and semi-arid environments, often found in rocky soils and along dry streambeds. The plant is also valued for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lewisii is primarily native to the southwestern United States and northwestern Mexico. It is found in states such as Arizona, New Mexico, Texas, and California. This plant thrives in arid and semi-arid environments, including deserts and rocky slopes. It is commonly associated with the Chihuahuan and Sonoran Deserts. Acacia lewisii is well adapted to withstand drought and high temperatures.",
    "distribution_introduced_art_desc": "Acacia lewisii was mainly introduced to the western United States, particularly in California and Oregon. It is commonly found in dry, rocky habitats such as hillsides and coastal bluffs. This plant is often associated with disturbed soils and can thrive in areas with limited water availability. It has been noted for its ability to colonize areas after wildfires or other natural disturbances. Due to its hardy nature, it has become a common sight in many arid and semi-arid regions of the Pacific Northwest."
}
