{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia daviesioides",
    "plant_slug": "acacia-daviesioides",
    "plant_name_scientific": "acacia daviesioides",
    "intro": "Acacia daviesioides, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Western Australia. It is characterized by its slender, often multi-branched stems and small, bipinnate leaves that are typically narrow and yellow-green in color. The plant produces yellow globular flower heads, which are clustered in spherical or oblong inflorescences, typically appearing in spring. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia daviesioides is also valued for its ornamental appeal and is sometimes used in revegetation projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia daviesioides"
    },
    "taxonomy_art_desc": "Acacia daviesioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and association with nitrogen-fixing bacteria. Its species is Acacia daviesioides, a specific type of acacia found in certain regions, noted for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia daviesioides is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This species typically grows in dry, sandy soils and is often associated with coastal and inland habitats. It is well adapted to the arid and semi-arid environments of the region. Acacia daviesioides plays an important ecological role in local ecosystems.",
    "distribution_introduced_art_desc": "Acacia daviesioides was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and hardy nature. It has since become naturalized in several regions, particularly in the Western Cape and KwaZulu-Natal. The plant is commonly found in disturbed habitats such as roadsides, fynbos areas, and along riverbanks. Its rapid growth and ability to thrive in various soil types have contributed to its spread. However, it is considered a potential weed in some areas, raising concerns about its ecological impact."
}
