{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia usumacintensis",
    "plant_slug": "acacia-usumacintensis",
    "plant_name_scientific": "acacia usumacintensis",
    "intro": "Acacia usumacintensis, commonly known as the Usumacinta acacia, is a flowering plant native to Central America, particularly found in regions of Mexico and Guatemala. It is a deciduous shrub or small tree that typically grows in tropical and subtropical climates. The plant is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in clusters. It belongs to the Fabaceae family, which includes many legumes, and is known for its ability to fix nitrogen in the soil. Acacia usumacintensis is often used in traditional medicine and for ornamental purposes due to its attractive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia usumacintensis is primarily native to the eastern part of the Democratic Republic of the Congo. It is also found in parts of the Central African Republic and northeastern Angola. This species thrives in tropical and subtropical regions, typically in savanna and woodland habitats. It is commonly found in areas with well-drained soils and a distinct dry season. Acacia usumacintensis plays an important ecological role in its native range, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia usumacintensis was mainly introduced to tropical and subtropical regions for its ornamental value and potential use in erosion control. It is commonly found in countries such as Brazil, Colombia, and parts of Central America. The plant thrives in well-drained soils and full sun, making it adaptable to various climates. Due to its rapid growth and ability to fix nitrogen, it has been used in reforestation projects. However, it is also considered an invasive species in some areas where it outcompetes native vegetation."
}
