{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adjutrices",
    "plant_slug": "acacia-adjutrices",
    "plant_name_scientific": "acacia adjutrices",
    "intro": "Acacia adjutrices, commonly known as the white wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers in dense clusters, which are followed by flat, pod-like fruits. It has a deep root system that helps stabilize soil and prevent erosion. Acacia adjutrices is also known for its ability to fix nitrogen, making it valuable in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia adjutrices"
    },
    "taxonomy_art_desc": "Acacia adjutrices belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny foliage and symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia adjutrices, a specific type of acacia known for its ecological role and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adjutrices is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the southwest of the state. This species thrives in dry, well-drained environments typical of the region's climate. It is often seen growing in open woodlands and heathlands. Acacia adjutrices plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia adjutrices was mainly introduced to new environments for its ability to thrive in arid and semi-arid conditions, making it a valuable plant for land reclamation and soil stabilization. It has been introduced to several regions outside its native range, including parts of Africa, the Middle East, and Australia. The plant's rapid growth and adaptability have led to its use in agroforestry and as a windbreak. However, its introduction has also raised concerns due to its potential to become invasive in certain ecosystems. Despite its benefits, careful management is required to prevent ecological imbalances."
}
