{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia filicina f. hirsuta",
    "plant_slug": "acacia-filicina-f-hirsuta",
    "plant_name_scientific": "acacia filicina f. hirsuta",
    "intro": "Acacia filicina f. hirsuta, commonly known as the hairy acacia, is a shrub native to southern Africa. It is characterized by its slender, often branched stems and small, feathery leaves that are densely covered with fine, soft hairs. The plant produces yellow globular flowers that appear in spring, adding a striking visual contrast to its foliage. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid or semi-arid environments. The hairy texture of its leaves and stems is a distinguishing feature of this botanical variant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia filicina f. hirsuta is primarily native to eastern Australia, including regions such as Queensland, New South Wales, and the Australian Capital Territory. This subspecies is commonly found in dry sclerophyll forests and woodlands, often growing on rocky or sandy soils. It thrives in regions with a temperate to subtropical climate, characterized by distinct wet and dry seasons. The plant is well adapted to arid and semi-arid environments, making it a resilient species in these ecosystems. Its distribution is closely associated with areas that have a history of indigenous land management practices.",
    "distribution_introduced_art_desc": "Acacia filicina f. hirsuta was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, often growing in disturbed or urban environments. This subspecies is known for its hairy foliage and is sometimes cultivated for ornamental purposes. Its introduction has raised concerns due to its potential to become invasive in local ecosystems. Despite its ornamental value, careful management is recommended to prevent its spread into native habitats."
}
