{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia modesta var. laeta",
    "plant_slug": "acacia-modesta-var-laeta",
    "plant_name_scientific": "acacia modesta var. laeta",
    "intro": "Acacia modesta var. laeta, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging branches and small, fern-like leaves that give it a delicate appearance. The plant produces yellow globular flower heads, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in open woodlands and coastal areas. Due to its ornamental value and hardiness, it is cultivated in gardens and used in reforestation projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia modesta var. laeta is primarily native to northern Australia, including parts of Queensland and Western Australia. It is commonly found in arid and semi-arid regions, particularly in the Pilbara and Gascoyne regions. This variety thrives in sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the harsh environmental conditions of its native range. The plant is also occasionally found in southern parts of the Northern Territory.",
    "distribution_introduced_art_desc": "Acacia modesta var. laeta was mainly introduced to regions with arid or semi-arid climates, particularly in parts of Australia and the southwestern United States. It is commonly found in disturbed soils and along roadsides due to its adaptability to harsh environmental conditions. This plant has been introduced for its ornamental value, as well as for its potential use in land stabilization and soil conservation efforts. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its distribution is largely influenced by human activity and climate suitability."
}
