{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ormocarpoides",
    "plant_slug": "acacia-ormocarpoides",
    "plant_name_scientific": "acacia ormocarpoides",
    "intro": "Acacia ormocarpoides, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, often zigzagging stems and small, bipinnate leaves. The plant produces yellow flowers in compact spikes, which are followed by elongated, woody pods. It is adapted to arid and semi-arid environments, making it a hardy species suitable for rehabilitation of degraded lands. Acacia ormocarpoides is also valued for its ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ormocarpoides is primarily native to the island of Madagascar. It is found in the dry and humid forests of the island, particularly in the eastern and southern regions. This plant thrives in well-drained soils and is often found in areas with moderate to high rainfall. It is an important component of the local flora and plays a role in the ecosystem by providing habitat and food for various animals. Its distribution is largely restricted to Madagascar, making it a unique and endemic species.",
    "distribution_introduced_art_desc": "Acacia ormocarpoides was mainly introduced to control soil erosion and for its use in land rehabilitation projects. It is commonly found in degraded lands and areas with poor soil quality due to its ability to thrive in harsh conditions. The plant is valued for its nitrogen-fixing properties, which improve soil fertility over time. It has been successfully established in various regions of Australia and parts of Southeast Asia. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
