{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia frigescens",
    "plant_slug": "acacia-frigescens",
    "plant_name_scientific": "acacia frigescens",
    "intro": "Acacia frigescens, commonly known as the desert acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Middle East. It is characterized by its slender, often branched stems and bipinnate leaves that are reduced to small, scale-like structures in mature plants. The plant produces yellow, globular flower heads that are typically clustered in dense inflorescences. Acacia frigescens is well adapted to drought conditions, with deep roots and a thick cuticle to minimize water loss. It plays an important ecological role in stabilizing soils and providing habitat and food for various desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia frigescens"
    },
    "taxonomy_art_desc": "Acacia frigescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and numerous stamens. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their compound leaves and often thorned stems. Its species is Acacia frigescens, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia frigescens is primarily native to Victoria. It is found in the eastern regions of the state, particularly in the Otway Ranges and the Bellarine Peninsula. This species thrives in coastal and heathland environments. It is commonly associated with sandy soils and is often found in open woodlands. Acacia frigescens plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia frigescens was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and KwaZulu-Natal provinces. The plant thrives in coastal areas and is often seen along the edges of forests and in disturbed habitats. Due to its rapid growth and adaptability, it has spread beyond its original introduction sites. However, it is considered a potential invasive species in some areas, raising concerns about its ecological impact."
}
