{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kettlewelliae",
    "plant_slug": "acacia-kettlewelliae",
    "plant_name_scientific": "acacia kettlewelliae",
    "intro": "Acacia kettlewelliae, commonly known as the Kettlewell's wattle, is a small shrub native to the arid regions of Western Australia. It is characterized by its slender, zigzagging stems and small, phyllodes that are typically linear and glabrous. The plant produces yellow flowers in winter, which are clustered in cylindrical inflorescences. It is well adapted to dry conditions, with a deep root system that allows it to survive in nutrient-poor soils. The species is also valued for its ornamental appeal and is sometimes cultivated in gardens in suitable climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia kettlewelliae"
    },
    "taxonomy_art_desc": "Acacia kettlewelliae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as stomata and vascular tissue. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which comprises plants with characteristic flowers and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, recognized for their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their compound leaves and thorny structures. Its species is Acacia kettlewelliae, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kettlewelliae is primarily native to New South Wales and Victoria. This species is found in the temperate regions of southeastern Australia. It typically grows in dry, open habitats such as woodlands and grasslands. The plant is well adapted to the local climate and soil conditions of these areas. Its distribution is limited to specific regions within these two states.",
    "distribution_introduced_art_desc": "Acacia kettlewelliae was mainly introduced to South Australia as part of a revegetation program aimed at restoring degraded landscapes. It is commonly found in the lower north and mid-north regions of the state, where it thrives in semi-arid and arid environments. The plant is valued for its hardiness and ability to withstand drought conditions, making it a useful species for land rehabilitation. However, it is considered a potential weed in some areas due to its rapid growth and spreading habit. Its distribution is largely restricted to specific ecological zones within South Australia."
}
