{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia homaloclada",
    "plant_slug": "acacia-homaloclada",
    "plant_name_scientific": "acacia homaloclada",
    "intro": "Acacia homaloclada, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow flowers in globular or cylindrical clusters, which are typically followed by flat, pod-like seed pods. It thrives in dry, sandy soils and is often found in coastal and inland regions of southern Australia. Acacia homaloclada is valued for its ornamental appeal and is sometimes used in horticulture for erosion control.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia homaloclada"
    },
    "taxonomy_art_desc": "Acacia homaloclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped acacia pods and often used in traditional medicine. Its species is Acacia homaloclada, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia homaloclada is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This plant typically grows in open woodlands and along riverbanks. It is well adapted to the local climate and soil conditions. Its distribution is largely restricted to the eastern part of Queensland.",
    "distribution_introduced_art_desc": "Acacia homaloclada was mainly introduced to control soil erosion and for its potential use in reforestation efforts. It is commonly found in disturbed areas such as roadsides, degraded lands, and agricultural fields. The plant thrives in arid and semi-arid environments, making it suitable for rehabilitation of degraded soils. Its rapid growth and ability to fix nitrogen contribute to its success in these conditions. However, it can become invasive if not managed properly."
}
