{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella angustissima var. filicioides",
    "plant_slug": "acaciella-angustissima-var-filicioides",
    "plant_name_scientific": "acaciella angustissima var. filicioides",
    "intro": "Acaciella angustissima var. filicioides, commonly known as the slender acacia, is a shrub native to the arid regions of South America. It features small, linear leaves that resemble those of ferns, giving it its common name. The plant produces yellow flowers that are clustered in inflorescences, which are often visited by pollinators such as bees and birds. It is well adapted to dry conditions, with a deep root system that allows it to survive in nutrient-poor soils. The plant's unique morphology and ecological role make it an important species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella angustissima"
    },
    "taxonomy_art_desc": "Acaciella angustissima var. filicioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinct life cycle involving both a sporophyte and a gametophyte stage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, characterized by the formation of pods and the ability to fix nitrogen through symbiotic bacteria. Its genus is Acaciella, a group of flowering plants native to South America, often found in arid and semi-arid regions. Its species is Acaciella angustissima, a shrub-like plant known for its narrow leaves and small yellow flowers, with the varietal form filicioides exhibiting distinctive leaf shapes resembling ferns.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Bolivia",
        "Colombia",
        "Costa Rica",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Nicaragua",
        "Venezuela"
    ],
    "distribution_introduced": [
        "India",
        "Pakistan"
    ],
    "distribution_native_art_desc": "Acaciella angustissima var. filicioides is primarily native to Bolivia, Colombia, Costa Rica, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, Nicaragua, and Venezuela. This plant is commonly found in tropical and subtropical regions across these countries. It thrives in areas with warm climates and well-drained soils. The species is often associated with dry forests and savannas. Its native distribution highlights its adaptability to diverse ecological conditions in Central and South America.",
    "distribution_introduced_art_desc": "Acaciella angustissima var. filicioides was mainly introduced to India and Pakistan. It is commonly found in dry and semi-arid regions of these countries. The plant is often used for its hardy nature and ability to thrive in poor soil conditions. It has been reported in agricultural and marginal lands. Its introduction has contributed to local biodiversity in these areas."
}
