{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dictyocarpa",
    "plant_slug": "acacia-dictyocarpa",
    "plant_name_scientific": "acacia dictyocarpa",
    "intro": "Acacia dictyocarpa, commonly known as the narrow-leaf wattle, is a flowering plant native to Australia. It is a small to medium-sized shrub or tree that typically grows in arid and semi-arid regions. The plant produces yellow flowers in globular or cylindrical clusters, which are characteristic of the Acacia genus. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. The plant is well adapted to drought conditions, making it a hardy species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dictyocarpa"
    },
    "taxonomy_art_desc": "Acacia dictyocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include legumes that form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities through root nodules. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped acacia pods and often used in traditional medicine and as sources of timber. Its species is Acacia dictyocarpa, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dictyocarpa is primarily native to South Australia and Victoria. It is commonly found in the arid and semi-arid regions of these states. This plant typically grows in sandy or rocky soils along the edges of salt lakes and in open woodlands. It is well adapted to the dry and hot climate of its native range. Acacia dictyocarpa plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia dictyocarpa was mainly introduced to areas with well-drained soils and a warm, temperate climate, often in regions where it is used for soil stabilization and as a source of timber. It is commonly found in disturbed sites such as roadsides, abandoned fields, and degraded lands. The plant thrives in full sun and is relatively drought-tolerant, making it adaptable to various environmental conditions. Its introduction has led to its establishment in several regions outside its native range. However, its spread can sometimes result in ecological impacts on native vegetation."
}
