{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stephaniana",
    "plant_slug": "acacia-stephaniana",
    "plant_name_scientific": "acacia stephaniana",
    "intro": "Acacia stephaniana, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late winter to early spring. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. It plays a role in stabilizing soils and providing habitat for native wildlife. Its ornamental value makes it a popular choice for landscaping in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stephaniana is primarily native to eastern Australia, specifically the coastal regions of New South Wales and Queensland. It is commonly found in sandy soils along the eastern seaboard, often in areas with a subtropical climate. This plant thrives in open woodlands and heathlands, where it forms part of the local flora. It is well adapted to the humid and warm conditions of its native habitat. Due to its specific environmental requirements, it is not found outside of this geographic range.",
    "distribution_introduced_art_desc": "Acacia stephaniana was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and ability to fix nitrogen, improving soil fertility. It has been introduced to several countries in Africa and the Middle East as part of ecological restoration efforts. Its rapid growth and hardy nature make it a popular choice for afforestation and land rehabilitation programs."
}
