{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia plectocarpa subsp. plectocarpa",
    "plant_slug": "acacia-plectocarpa-subsp-plectocarpa",
    "plant_name_scientific": "acacia plectocarpa subsp. plectocarpa",
    "intro": "Acacia plectocarpa subsp. plectocarpa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and phyllodes that are narrow and linear. The plant produces yellow flowers in globular clusters, which are typically borne in the axils of the phyllodes. Its leaves are modified into phyllodes, which are flattened, leaf-like structures that perform photosynthesis. Acacia plectocarpa subsp. plectocarpa is well adapted to arid and semi-arid environments, showing resilience to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia plectocarpa"
    },
    "taxonomy_art_desc": "Acacia plectocarpa subsp. plectocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex cellular structures and the presence of chloroplasts. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five parts and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as sources of timber. Its species is Acacia plectocarpa, a specific type of acacia found in certain regions of Africa, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia plectocarpa subsp. plectocarpa is primarily native to the Northern Territory and Western Australia. This subspecies is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often associated with shrublands and open woodlands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local fauna.",
    "distribution_introduced_art_desc": "Acacia plectocarpa subsp. plectocarpa was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This subspecies is often used for its hardy nature and ability to provide shade and erosion control. Its introduction has been largely for ornamental and ecological purposes. However, it can become invasive in certain environments if not managed properly."
}
