{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cremiflora",
    "plant_slug": "acacia-cremiflora",
    "plant_name_scientific": "acacia cremiflora",
    "intro": "Acacia cremiflora, commonly known as the white wattle, is a flowering plant native to southern Africa. It is characterized by its slender, erect shrub form and its distinctive yellow flowers that bloom in spring. The plant produces small, woody pods that contain seeds, which are dispersed by wind. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acacia cremiflora is well adapted to arid and semi-arid environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cremiflora"
    },
    "taxonomy_art_desc": "Acacia cremiflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by its complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa and Australia, known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia cremiflora, a specific type of acacia found in certain regions of Africa, notable for its unique floral structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cremiflora is primarily native to New South Wales. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of the region. Its distribution is mainly concentrated in the western and central parts of New South Wales.",
    "distribution_introduced_art_desc": "Acacia cremiflora was mainly introduced to South Africa, where it has been cultivated for its ornamental value and its ability to thrive in arid conditions. It is commonly found in gardens and along roadsides due to its hardy nature and attractive yellow flowers. The plant is also used in traditional medicine and for soil stabilization in degraded areas. Its introduction has led to some ecological concerns due to its potential to become invasive in certain environments. Despite these issues, it remains a popular choice for landscaping in regions with a Mediterranean climate."
}
