{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia curryana",
    "plant_slug": "acacia-curryana",
    "plant_name_scientific": "acacia curryana",
    "intro": "Acacia curryana, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late winter to early spring. The plant is part of the legume family, Fabaceae, and has a deep root system that helps prevent soil erosion. Acacia curryana is well adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions. It is also valued for its ornamental appeal and ecological benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia curryana"
    },
    "taxonomy_art_desc": "Acacia curryana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns, horsetails, and other spore-producing plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, also known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia curryana, a specific type of acacia found in certain regions, known for its unique morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia curryana is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This species thrives in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to the dry and arid conditions of its native habitat. Acacia curryana plays an important ecological role in the local flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia curryana was mainly introduced to regions with a Mediterranean climate, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal areas and open woodlands. This plant is often used for soil stabilization and as a source of timber and fuel. Its introduction has sometimes led to competition with native species in certain ecosystems. Due to its hardy nature, it has become naturalized in several areas beyond its original range."
}
