{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia filiculoides",
    "plant_slug": "acacia-filiculoides",
    "plant_name_scientific": "acacia filiculoides",
    "intro": "Acacia filiculoides, commonly known as the fern-leaf acacia, is a shrub native to southern Africa. It is characterized by its finely divided, fern-like leaves that give it a distinctive appearance. The plant produces yellow flowers arranged in dense, globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, rocky habitats. Due to its ornamental value, it is sometimes cultivated in gardens, though it is not widely commercially grown.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia filiculoides is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It thrives in arid and semi-arid environments, often found in sandy soils. This species is commonly associated with coastal and inland dunes, as well as open woodlands. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife. Acacia filiculoides is well adapted to withstand drought and high temperatures.",
    "distribution_introduced_art_desc": "Acacia filiculoides was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and capacity to provide shade and forage for livestock. Its introduction has helped in restoring degraded lands across parts of Africa and the Middle East. However, it has raised concerns about potential invasiveness in some ecosystems."
}
