{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sultani",
    "plant_slug": "acacia-sultani",
    "plant_name_scientific": "acacia sultani",
    "intro": "Acacia sultani, commonly known as the Sudanese acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant is adapted to survive in harsh environments with minimal water, featuring deep root systems and waxy leaf surfaces. Its flowers are typically yellow or pale green, arranged in dense clusters, and it produces small, leathery pods containing seeds. Acacia sultani is also valued for its use in traditional medicine and as a source of timber and fodder.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sultani is primarily native to the arid and semi-arid regions of northern Africa, particularly Sudan and Eritrea. It is commonly found in sandy soils and along riverbanks in these areas. This species thrives in dry climates with low rainfall. It is often seen in savannah and steppe environments. Acacia sultani plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia sultani was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, often thriving in disturbed soils. The plant is known for its ability to tolerate drought and poor soil conditions, which contributes to its successful establishment. Its introduction has raised concerns due to its potential to invade native vegetation. However, it is also valued for its ornamental qualities and use in traditional medicine."
}
