{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia arbiana",
    "plant_slug": "acacia-arbiana",
    "plant_name_scientific": "acacia arbiana",
    "intro": "Acacia arbiana, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched structure and phyllodes that are narrow and linear. The plant produces small, yellow flowers arranged in dense, globular clusters, which are highly attractive to pollinators. Its leaves are modified into phyllodes, a common adaptation in the genus Acacia to reduce water loss. Acacia arbiana is often found in dry, sandy soils and is adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia arbiana"
    },
    "taxonomy_art_desc": "Acacia arbiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have a unique type of flower with a distinctive structure and are often associated with nitrogen-fixing symbiotic relationships. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often having nitrogen-fixing capabilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and the production of pods containing seeds. Its species is Acacia arbiana, a specific type of acacia that is likely adapted to particular environmental conditions and may have unique ecological roles.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia arbiana is primarily native to Queensland. This species is found in the tropical and subtropical regions of the state. It thrives in a variety of habitats, including open forests, savannas, and rocky outcrops. The plant is well adapted to the local climate and soil conditions of Queensland. It plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia arbiana was mainly introduced to areas with arid or semi-arid climates due to its adaptability to harsh environmental conditions. It thrives in regions with low rainfall and well-drained soils, making it suitable for rehabilitation of degraded lands. The plant is often used in reforestation projects because of its ability to fix nitrogen and improve soil fertility. Its introduction has also been associated with the control of soil erosion and the provision of forage for livestock. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
