{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustifolia",
    "plant_slug": "acacia-angustifolia",
    "plant_name_scientific": "acacia angustifolia",
    "intro": "Acacia angustifolia, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It features slender, trifoliate leaves that are often covered in fine hairs. The plant produces yellow flowers in globular clusters, which bloom in spring. It is well adapted to arid and semi-arid environments, thriving in sandy or rocky soils. Acacia angustifolia is also valued for its hardy nature and is sometimes used in ornamental gardening.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustifolia is primarily native to southern Africa, specifically South Africa. It is commonly found in the eastern and western parts of the country, particularly in the grassland and savanna regions. This plant thrives in areas with a temperate climate and well-drained soils. It is often seen in open woodlands and along riverbanks. Acacia angustifolia is well adapted to the local environmental conditions and plays an important role in the ecosystem.",
    "distribution_introduced_art_desc": "Acacia angustifolia was mainly introduced to control soil erosion and for ornamental purposes in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its rapid growth and adaptability. The plant thrives in well-drained soils and can tolerate drought conditions, making it suitable for reclamation projects. However, it has also become invasive in some areas, outcompeting native vegetation. Its introduction has had both beneficial and problematic ecological impacts depending on the region."
}
