{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glaucissima",
    "plant_slug": "acacia-glaucissima",
    "plant_name_scientific": "acacia glaucissima",
    "intro": "Acacia glaucissima, commonly known as the white wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and small, rounded phyllodes that are typically white or pale green in color. The plant produces yellow flowers in globular or cylindrical clusters, which are followed by flat, leathery pods. It thrives in arid and semi-arid environments, showing adaptability to poor soil conditions. Acacia glaucissima is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia glaucissima"
    },
    "taxonomy_art_desc": "Acacia glaucissima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall and complex vascular systems. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their primitive floral structures. Its order is Fabales, which consists of flowering plants with distinctive flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic acacia-like foliage and often used in traditional medicine and as a source of timber. Its species is Acacia glaucissima, a specific type of acacia known for its glaucous leaves and typically found in arid or semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glaucissima is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in dry, sandy soils and is often seen in coastal and inland areas. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia glaucissima plays an important ecological role in the local flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia glaucissima was mainly introduced to Australia as an ornamental plant due to its attractive foliage and drought tolerance. It has since become naturalized in several regions, particularly in Queensland and New South Wales. The plant is commonly found in disturbed soils and along roadsides, where it can spread aggressively. Its introduction has raised concerns due to its potential to invade native vegetation. Despite its ornamental value, management efforts are needed to control its spread in sensitive ecosystems."
}
