{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia humboldtii",
    "plant_slug": "acacia-humboldtii",
    "plant_name_scientific": "acacia humboldtii",
    "intro": "Acacia humboldtii, commonly known as the desert acacia, is a shrub or small tree native to arid regions of the Americas. It is characterized by its slender, often spiny stems and bipinnate leaves that reduce water loss in hot, dry climates. The plant produces yellowish-white flowers in compact clusters, which bloom in spring and attract pollinators like bees and birds. Its seeds are enclosed in pod-like fruits that split open to release the seeds. Acacia humboldtii is well adapted to survive in nutrient-poor soils and can endure extreme temperature fluctuations.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia humboldtii is primarily native to the western coast of South America, particularly in countries such as Peru, Chile, and Ecuador. It thrives in coastal regions, often growing in sandy or rocky soils along the shoreline. This species is commonly found in arid and semi-arid environments, where it adapts well to the harsh coastal climate. It plays an important role in stabilizing dunes and providing habitat for local wildlife. Acacia humboldtii is also known for its ability to tolerate salt spray and strong winds typical of coastal areas.",
    "distribution_introduced_art_desc": "Acacia humboldtii was mainly introduced to the Mediterranean region for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides where it provides shade and erosion control. The plant's rapid growth and adaptability have led to its spread into natural habitats, sometimes becoming invasive. It prefers well-drained soils and full sun, making it suitable for a variety of climates. However, its introduction has raised concerns due to its potential to outcompete native vegetation in certain areas."
}
