{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gunnii var. hirsutior",
    "plant_slug": "acacia-gunnii-var-hirsutior",
    "plant_name_scientific": "acacia gunnii var. hirsutior",
    "intro": "Acacia gunnii var. hirsutior, commonly known as the hairy acacia, is a shrub or small tree native to Australia. It is characterized by its dense, thorny branches and small, oval-shaped leaves that are covered in fine, hairy hairs. The plant produces yellow flowers in spikes, which are often followed by flat, pod-like fruits containing seeds. It thrives in well-drained soils and is adapted to arid and semi-arid environments. This variety is valued for its ornamental appeal and ability to stabilize soil in degraded areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gunnii var. hirsutior is primarily native to eastern Australia, specifically the coastal regions of New South Wales and Queensland. This variety is commonly found in sandy soils along the eastern coastline, including areas such as the Gold Coast and the Sunshine Coast. It thrives in coastal dunes and heathlands, where it is adapted to salty and well-drained conditions. The plant is also occasionally found in inland areas with similar environmental conditions. Its distribution is closely linked to the unique ecological characteristics of the eastern Australian coast.",
    "distribution_introduced_art_desc": "Acacia gunnii var. hirsutior was mainly introduced to New Zealand. It was brought there as part of early botanical introductions during the 19th century. The plant is commonly found in coastal and lowland areas, particularly in the North Island. It has adapted well to the local climate and is now considered naturalized in several regions. However, it is not widely cultivated or used for commercial purposes."
}
