{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia awestoniana",
    "plant_slug": "acacia-awestoniana",
    "plant_name_scientific": "acacia awestoniana",
    "intro": "Acacia awestoniana, commonly known as the Weston's acacia, is a species of flowering plant in the legume family Fabaceae. It is native to southern Africa, particularly South Africa, where it thrives in arid and semi-arid regions. The plant is characterized by its slender, branching stems and bipinnate leaves that are often covered in fine hairs. Its yellow flowers are clustered in spherical heads, and the plant produces flat, woody pods that contain seeds. Acacia awestoniana is adapted to drought conditions and plays a role in stabilizing sandy soils in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia awestoniana"
    },
    "taxonomy_art_desc": "Acacia awestoniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures and evolutionary relationships. Its order is Fabales, which includes plants such as legumes and vetches, and is notable for the presence of symbiotic nitrogen-fixing bacteria in their root systems. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities through root nodules. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are native to Australia and are known for their distinctive leaf structures and often thorn-like stems. Its species is Acacia awestoniana, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia awestoniana is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the Geraldton area. This species is typically associated with sandy soils and is often found in coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native habitat. The plant plays an important ecological role in the local flora and fauna of Western Australia.",
    "distribution_introduced_art_desc": "Acacia awestoniana was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential for soil stabilization. It is commonly found in coastal regions and along roadsides, thriving in well-drained soils. The plant is known for its hardy nature and ability to withstand drought conditions, making it suitable for arid and semi-arid environments. However, it has also been reported to spread into natural ecosystems, raising concerns about its potential invasive behavior. Its introduction has been primarily for landscaping and ecological restoration purposes."
}
