{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia permixta",
    "plant_slug": "acacia-permixta",
    "plant_name_scientific": "acacia permixta",
    "intro": "Acacia permixta, commonly known as the coastal acacia, is a shrub or small tree native to coastal regions of southern Africa. It is characterized by its compound leaves, which are typically feather-like and arranged in pairs. The plant produces yellow flowers in compact, spherical clusters, which bloom from late winter to early spring. Acacia permixta thrives in sandy, well-drained soils and is often found in dune environments. It plays an important role in stabilizing coastal dunes and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia permixta is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in coastal and inland regions, particularly in sandy soils. This plant thrives in open woodlands, heathlands, and along the edges of forests. It is well adapted to the temperate to subtropical climates of these areas. Acacia permixta is often seen growing in dry, well-drained environments with full sun exposure.",
    "distribution_introduced_art_desc": "Acacia permixta was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with moderate rainfall and full sun exposure. This plant is often used in landscaping due to its hardy nature and attractive foliage. It has been successfully established in several parts of the United States and Australia. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
