{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ciliata var. brevifolia",
    "plant_slug": "acacia-ciliata-var-brevifolia",
    "plant_name_scientific": "acacia ciliata var. brevifolia",
    "intro": "Acacia ciliata var. brevifolia, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It is characterized by its slender, feathery foliage and produces bright yellow flowers in late winter to early spring. The plant has small, stipulate leaves that are often covered in fine hairs. It is adapted to arid and semi-arid environments, making it drought-tolerant. The species is valued for its ornamental appeal and ecological benefits in native landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ciliata var. brevifolia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, South Africa, and parts of Zimbabwe. This plant thrives in sandy or gravelly soils and is commonly found in savannas and shrublands. It is well adapted to the hot and dry climate of its native habitat. The species is often used for its hardy nature and is sometimes cultivated for ornamental purposes. Its distribution is closely associated with the Kalahari Desert and surrounding areas.",
    "distribution_introduced_art_desc": "Acacia ciliata var. brevifolia was mainly introduced to regions with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soils. It is commonly found in areas of Australia, particularly in the arid interior, where it serves as a valuable source of food for wildlife and livestock. This plant has been introduced to parts of Africa and the Middle East as part of ecological restoration and land rehabilitation efforts. Its rapid growth and nitrogen-fixing ability make it useful for soil stabilization and preventing erosion. However, its invasive potential in some environments requires careful management to avoid ecological disruption."
}
