{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia diadenia",
    "plant_slug": "acacia-diadenia",
    "plant_name_scientific": "acacia diadenia",
    "intro": "Acacia diadenia, commonly known as the narrow-leaf wattle, is a small shrub native to Australia. It is characterized by its slender, feathery leaves and yellow flowers that bloom in spring. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil. Acacia diadenia thrives in well-drained soils and is often found in coastal and sandy habitats. Its ecological importance includes providing nectar for pollinators and habitat for small fauna.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia diadenia is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It is commonly found in savanna and woodland habitats, often growing in well-drained soils. This species is adapted to dry and semi-arid environments, making it a common sight in these regions. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia diadenia is also known for its distinctive bipinnate leaves and yellow flower heads.",
    "distribution_introduced_art_desc": "Acacia diadenia was mainly introduced to areas with warm, dry climates and well-drained soils, often as an ornamental plant or for its nitrogen-fixing properties. It is commonly found in regions of Australia, parts of Southeast Asia, and the Mediterranean. The plant thrives in full sun and is relatively drought-tolerant, making it suitable for xeriscaping and erosion control. Due to its rapid growth and ability to spread, it has become an invasive species in some regions. Its introduction has led to ecological concerns, as it can outcompete native flora in disturbed habitats."
}
