{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pinnata",
    "plant_slug": "acacia-pinnata",
    "plant_name_scientific": "acacia pinnata",
    "intro": "Acacia pinnata, commonly known as the slender acacia, is a flowering plant native to parts of Africa and the Arabian Peninsula. It is a shrub or small tree that typically grows in arid and semi-arid environments. The plant features bipinnate leaves, which are finely divided and give it a feathery appearance. Its yellow flowers are clustered in cylindrical spikes and bloom during the dry season. Acacia pinnata is also valued for its hard, durable wood and has been used traditionally for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pinnata is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, Malawi, Zambia, and Zimbabwe. It thrives in a variety of habitats, including savannas, grasslands, and woodland areas. This species is commonly found in regions with a tropical or subtropical climate. It is well adapted to dry and semi-arid conditions, often growing along riverbanks or in disturbed soils. Acacia pinnata plays an important ecological role, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia pinnata was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate rainfall. It is commonly found in disturbed habitats such as roadsides, clearings, and agricultural fields. The plant has been introduced to several countries in Southeast Asia, including Indonesia, Malaysia, and the Philippines. Its rapid growth and ability to thrive in poor soil conditions have made it a successful invader in many ecosystems. However, its spread can sometimes lead to ecological imbalances by outcompeting native plant species."
}
