{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia",
    "plant_slug": "acacia-longifolia",
    "plant_name_scientific": "acacia longifolia",
    "intro": "Acacia longifolia, commonly known as the coastal acacia, is a shrub or small tree native to southern Australia. It is characterized by its slender, often spiny stems and compound leaves that are typically feathery in appearance. The plant produces yellow flowers in dense, globular clusters, which bloom during the spring and summer months. Acacia longifolia thrives in coastal and sandy soils, often growing in dunes or along the coastline. It is well adapted to dry conditions and is an important component of coastal ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia longifolia"
    },
    "taxonomy_art_desc": "Acacia longifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are primarily found in Australia and are known for their distinctive, often feathery foliage. Its species is Acacia longifolia, a specific type of acacia known for its long, slender leaves and yellow flowers, commonly found in coastal regions of southern Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [
        "Argentina Northeast",
        "Ascension",
        "Assam",
        "Bangladesh",
        "Brazil South",
        "Brazil Southeast",
        "California",
        "Cape Provinces",
        "Colombia",
        "Dominican Republic",
        "Eswatini",
        "Haiti",
        "Honduras",
        "India",
        "Italy",
        "Jawa",
        "Kenya",
        "KwaZulu-Natal",
        "Madeira",
        "Mauritius",
        "Morocco",
        "Myanmar",
        "New Zealand North",
        "New Zealand South",
        "Palestine",
        "Portugal",
        "Réunion",
        "Spain",
        "Sri Lanka",
        "St.Helena",
        "Uruguay",
        "Western Australia"
    ],
    "distribution_native_art_desc": "Acacia longifolia is primarily native to New South Wales, South Australia, Tasmania, and Victoria. It is commonly found in coastal areas and sandy soils across these regions. This plant thrives in temperate climates and is often associated with shrublands and coastal heath. Its distribution is largely restricted to the southern parts of Australia. It plays an important ecological role in the native flora of these areas.",
    "distribution_introduced_art_desc": "Acacia longifolia was mainly introduced to Argentina Northeast, Ascension, Assam, Bangladesh, Brazil South, Brazil Southeast, California, Cape Provinces, Colombia, Dominican Republic, Eswatini, Haiti, Honduras, India, Italy, Jawa, Kenya, KwaZulu-Natal, Madeira, Mauritius, Morocco, Myanmar, New Zealand North, New Zealand South, Palestine, Portugal, Réunion, Spain, Sri Lanka, St. Helena, Uruguay, and Western Australia. It has been widely established in these regions, often as an ornamental or for soil stabilization. The plant is known for its ability to thrive in a variety of climates and soils, contributing to its successful introduction and spread. However, it can become invasive in some areas, outcompeting native vegetation. Its introduction has had both ecological and economic impacts depending on the region."
}
