{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heteroneura var. prolixa",
    "plant_slug": "acacia-heteroneura-var-prolixa",
    "plant_name_scientific": "acacia heteroneura var. prolixa",
    "intro": "Acacia heteroneura var. prolixa, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its narrow, linear phyllodes that are often covered with a fine layer of white to greyish pubescence. The plant produces yellow globular flower heads that appear in late winter to early spring. It typically grows in sandy or rocky soils and is adapted to arid and semi-arid environments. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its distinctive foliage.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia heteroneura"
    },
    "taxonomy_art_desc": "Acacia heteroneura var. prolixa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some primitive vascular plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and legume-like fruits. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are predominantly found in Australia and have various ecological and economic importance. Its species is Acacia heteroneura, a specific type of acacia that has a particular morphology and distribution, with the varietal form prolixa indicating a distinct variation within this species.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heteroneura var. prolixa is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This variety of acacia thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the climate conditions of the region, including high temperatures and low rainfall. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia heteroneura var. prolixa was mainly introduced to New Zealand as part of ornamental horticulture due to its unique appearance and hardy nature. It was initially cultivated for its attractive foliage and ability to thrive in a variety of soil conditions. However, it has since become naturalized in certain regions, raising concerns about its potential impact on native ecosystems. The plant's spread has been limited by its preference for specific microhabitats and climatic conditions. Despite its ornamental value, ongoing monitoring is recommended to assess its ecological effects."
}
