{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia clavata",
    "plant_slug": "acacia-clavata",
    "plant_name_scientific": "acacia clavata",
    "intro": "Acacia clavata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging stems and feathery, bipinnate leaves. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Acacia clavata is adapted to arid and semi-arid environments, showing drought tolerance and some resistance to salt. It plays a role in stabilizing soils and provides habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia clavata is primarily native to South Australia and the southern part of Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species is often associated with open woodlands and shrublands. It is well adapted to the harsh conditions of the Australian desert environment. Acacia clavata plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia clavata was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in arid and semi-arid regions where it thrives in poor soils. The plant is valued for its ability to fix nitrogen, improving soil fertility over time. However, its rapid growth and spreading habit have led to concerns about its potential invasiveness in some areas. Despite its benefits, careful management is necessary to prevent it from outcompeting native vegetation."
}
