{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia neurophylla",
    "plant_slug": "acacia-neurophylla",
    "plant_name_scientific": "acacia neurophylla",
    "intro": "Acacia neurophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and phyllodes that are narrow and linear. The plant produces yellow flowers in globular clusters, which bloom in late winter to early spring. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia neurophylla is also valued for its hardy nature and is often used in landscaping and for soil stabilization.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia neurophylla"
    },
    "taxonomy_art_desc": "Acacia neurophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with fused petals and include legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid and tropical regions, known for their unique phyllodes and nitrogen-fixing abilities. Its species is Acacia neurophylla, a specific type of acacia native to Australia, recognized for its distinctive leaf structure and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia neurophylla is primarily native to Western Australia. It is commonly found in the southern and western regions of the state, including the Swan Coastal Plain and the Jarrahdale area. This plant typically grows in sandy soils and is often associated with coastal and inland habitats. It is well adapted to the dry and arid conditions of its native range. Acacia neurophylla plays an important role in the local ecosystem and is a characteristic species of the region's vegetation.",
    "distribution_introduced_art_desc": "Acacia neurophylla was mainly introduced to areas with a Mediterranean climate, characterized by mild, wet winters and hot, dry summers. It thrives in well-drained soils and is commonly found in coastal regions and inland valleys. This plant is often used in landscaping due to its drought tolerance and ornamental value. It has also been introduced to other parts of the world for erosion control and as a source of timber. However, its introduction has sometimes led to ecological concerns in non-native environments."
}
