{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pycnocephala",
    "plant_slug": "acacia-pycnocephala",
    "plant_name_scientific": "acacia pycnocephala",
    "intro": "Acacia pycnocephala, commonly known as the narrow-leaved acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Middle East. It is characterized by its dense, thorny stems and bipinnate leaves that are narrow and often covered in fine hairs. The plant produces yellow flowers in globular clusters, which are followed by flat, pod-like fruits containing several seeds. It is well adapted to drought conditions, with deep roots that allow it to access water from deeper soil layers. Acacia pycnocephala is also known for its role in providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pycnocephala"
    },
    "taxonomy_art_desc": "Acacia pycnocephala belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures like roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their distinctive umbrella-shaped acorns and nitrogen-fixing properties. Its species is Acacia pycnocephala, a specific type of acacia native to parts of Africa, recognized by its dense, spherical crown and adapted to harsh environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pycnocephala is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the area known as the Geraldton area. This plant thrives in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native range. Acacia pycnocephala plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia pycnocephala was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of the Middle East, North Africa, and parts of southern Europe. The plant is often used for soil stabilization and as a source of timber and fodder. Its introduction has sometimes led to ecological concerns due to its aggressive growth in native habitats. It is also valued for its ability to fix nitrogen, improving soil fertility in degraded lands."
}
