{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia linophylla",
    "plant_slug": "acacia-linophylla",
    "plant_name_scientific": "acacia linophylla",
    "intro": "Acacia linophylla, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow flowers in globular or cylindrical clusters, which are followed by woody pods containing flat, kidney-shaped seeds. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia linophylla is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia linophylla is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It thrives in arid and semi-arid regions, often found in sandy soils and open woodlands. This species is commonly associated with coastal and inland dune systems, where it plays a key role in stabilizing sand dunes. It is also found in some parts of New Guinea and nearby islands. Acacia linophylla is well adapted to hot, dry climates and can tolerate salt spray in coastal areas.",
    "distribution_introduced_art_desc": "Acacia linophylla was mainly introduced to stabilize sand dunes and prevent soil erosion in coastal and semi-arid regions. It is commonly found in areas with low rainfall and well-drained soils. The plant is valued for its ability to thrive in harsh environmental conditions. Its introduction has helped in restoring degraded land and supporting local ecosystems. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
