{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia asperulacea",
    "plant_slug": "acacia-asperulacea",
    "plant_name_scientific": "acacia asperulacea",
    "intro": "Acacia asperulacea, commonly known as the rough acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often thornless branches and bipinnate leaves that are feathery in appearance. The plant produces yellow flowers in dense, globular clusters, which are typically visited by bees and other pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia asperulacea is often found in dry, open woodlands and is valued for its ornamental appeal and ecological role.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia asperulacea"
    },
    "taxonomy_art_desc": "Acacia asperulacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by their floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acorn-like seed pods and often used in traditional medicine and as sources of timber. Its species is Acacia asperulacea, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia asperulacea is primarily native to the Northern Territory, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. Acacia asperulacea is well adapted to the harsh climatic conditions of its native range. Its distribution is largely restricted to the northern and central parts of Australia.",
    "distribution_introduced_art_desc": "Acacia asperulacea was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is often found in regions with low rainfall and high temperatures, making it suitable for restoration projects in degraded landscapes. The plant's ability to fix nitrogen makes it valuable for soil improvement and land rehabilitation. It is also used in traditional medicine and as a source of timber and fuelwood in some regions. However, its introduction has raised concerns about its potential invasiveness in non-native environments."
}
