{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia clavigera subsp. usambarensis",
    "plant_slug": "acacia-clavigera-subsp-usambarensis",
    "plant_name_scientific": "acacia clavigera subsp. usambarensis",
    "intro": "Acacia clavigera subsp. usambarensis, commonly known as the Usambarensis acacia, is a shrub native to eastern Africa. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow globular flowers that are clustered in dense inflorescences. It thrives in dry, rocky habitats and is adapted to arid and semi-arid environments. The subspecies is notable for its ecological role in providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia clavigera subsp. usambarensis is primarily native to the Eastern Arc Mountains of Tanzania and parts of southern Kenya. This subspecies is found in the coastal and lowland regions of these areas, where it thrives in humid, tropical climates. It is commonly found in forested areas, riverine vegetation, and along the edges of swampy habitats. The plant is adapted to the unique ecological conditions of the Eastern Arc Mountains, which are known for their high biodiversity. Its distribution is limited to these specific regions due to its particular habitat requirements.",
    "distribution_introduced_art_desc": "Acacia clavigera subsp. usambarensis was mainly introduced to regions with a tropical and subtropical climate, where it thrives in well-drained soils and full sunlight. It is commonly found in areas with seasonal rainfall, making it adaptable to both arid and semi-arid environments. This subspecies has been introduced to parts of Australia, particularly in the northern and western regions, where it has established itself in native vegetation. Its introduction has sometimes led to its spread beyond cultivated areas, raising concerns about its potential impact on local ecosystems. Due to its hardy nature and rapid growth, it is often used in reforestation and land stabilization projects."
}
