{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pubifolia",
    "plant_slug": "acacia-pubifolia",
    "plant_name_scientific": "acacia pubifolia",
    "intro": "Acacia pubifolia, commonly known as the woolly acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, pale green foliage and distinctive, soft, fuzzy leaves. The plant produces yellow flowers in clusters, which are followed by elongated, flat pods containing seeds. Acacia pubifolia thrives in arid and semi-arid environments, often growing on rocky soils. It is valued for its hardiness and is sometimes used in landscaping due to its ornamental appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pubifolia"
    },
    "taxonomy_art_desc": "Acacia pubifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes that form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are native to Australia and have distinctive, often thorny, shrubs. Its species is Acacia pubifolia, a specific type of acacia characterized by its pubescent leaves and typically found in specific habitats within its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pubifolia is primarily native to New South Wales and Queensland. This species is commonly found in the arid and semi-arid regions of these states. It typically grows in sandy soils and is often seen in open woodlands and grasslands. The plant is well adapted to the dry climate of its native range. It plays an important role in the local ecosystem and is a characteristic feature of the landscape in these areas.",
    "distribution_introduced_art_desc": "Acacia pubifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since spread beyond cultivated areas and is now considered a potential weed in some regions. The plant thrives in a variety of soil types and is adapted to both full sun and partial shade. Its rapid growth and ability to reproduce through both seeds and vegetative propagation contribute to its invasive potential. Management efforts are ongoing to control its spread and prevent ecological impact."
}
