{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oligophleba",
    "plant_slug": "acacia-oligophleba",
    "plant_name_scientific": "acacia oligophleba",
    "intro": "Acacia oligophleba, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its bipinnate leaves and yellow flowers. The plant is adapted to arid and semi-arid environments, showcasing drought resistance through its deep root system. Its flowers attract a variety of pollinators, including bees and birds, contributing to ecological balance. Acacia oligophleba is also valued for its hardy nature and use in revegetation projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oligophleba is primarily native to northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species is often associated with spinifex plains and other open habitats. It is well adapted to drought and high temperatures, making it a resilient component of the local flora. Acacia oligophleba plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia oligophleba was mainly introduced to South Africa, where it has been established in various regions, particularly in the eastern and western parts of the country. It is commonly found in grassland and savanna ecosystems, often growing along roadsides and in disturbed areas. The plant is known for its ability to thrive in dry and semi-arid conditions, making it adaptable to a range of environmental conditions. It plays a role in soil stabilization and provides habitat for local wildlife. However, its introduction has raised concerns about its potential impact on native plant communities."
}
