{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia constricta",
    "plant_slug": "acacia-constricta",
    "plant_name_scientific": "acacia constricta",
    "intro": "Acacia constricta, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, phyllodes that are narrow and often curved. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical inflorescences. Acacia constricta is adapted to arid and semi-arid environments, making it drought-tolerant. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia constricta is primarily native to the western United States, particularly in California and parts of Nevada. It is commonly found in arid and semi-arid regions, growing in rocky soils and open woodlands. This species thrives in environments with low precipitation and high sunlight exposure. It is often associated with chaparral and sagebrush habitats. Due to its hardy nature, it is well adapted to the harsh conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia constricta was mainly introduced to control soil erosion and stabilize sandy soils in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its rapid growth and ability to provide shade and fodder for livestock. However, it can become invasive in some areas if not managed properly. Its introduction has had both beneficial and problematic ecological impacts depending on the environment."
}
