{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sphaerostachya var. angustior",
    "plant_slug": "acacia-sphaerostachya-var-angustior",
    "plant_name_scientific": "acacia sphaerostachya var. angustior",
    "intro": "Acacia sphaerostachya var. angustior, commonly known as the narrow-leaved wattle, is a shrub native to Western Australia. It features slender, often spiny stems and compound leaves with small, narrow leaflets. The plant produces yellow globular flower heads, which are characteristic of the Acacia genus. It thrives in well-drained soils and is adapted to arid and semi-arid environments. This variety is notable for its ecological role in supporting local wildlife and its use in landscaping due to its drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sphaerostachya var. angustior is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and parts of KwaZulu-Natal. This plant typically grows in dry, rocky, or sandy soils in shrublands and grasslands. It is adapted to arid and semi-arid climates, often thriving in areas with low rainfall. Its distribution is limited to specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acacia sphaerostachya var. angustior was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the coastal areas, thriving in sandy soils and coastal environments. The plant is often used in ornamental horticulture due to its attractive foliage and ability to withstand drought conditions. However, it has also been identified as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
