{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia grahamii",
    "plant_slug": "acacia-grahamii",
    "plant_name_scientific": "acacia grahamii",
    "intro": "Acacia grahamii, commonly known as the Graham's acacia, is a shrub or small tree native to arid regions of Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in globular or cylindrical inflorescences, which are followed by flat, leathery pods containing seeds. Acacia grahamii is adapted to survive in harsh, dry environments with low rainfall. It plays an important ecological role in stabilizing soils and providing food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia grahamii is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often in association with other drought-tolerant plant species. This plant thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of its native habitat. It is an important component of the local flora, providing habitat and forage for various wildlife species. Acacia grahamii is also known for its ability to fix nitrogen, contributing to soil fertility in nutrient-poor areas.",
    "distribution_introduced_art_desc": "Acacia grahamii was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with low to moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland areas where it forms dense shrubs or small trees. Its introduction has led to its establishment in several regions outside its native range. However, it is considered invasive in some areas due to its rapid growth and ability to outcompete native vegetation."
}
