{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustissima var. frutescens",
    "plant_slug": "acacia-angustissima-var-frutescens",
    "plant_name_scientific": "acacia angustissima var. frutescens",
    "intro": "Acacia angustissima var. frutescens, commonly known as the narrowleaf wattle, is a shrub native to arid and semi-arid regions of Australia. It features small, bright yellow flowers arranged in cylindrical clusters, which bloom during the warmer months. The plant has slender, often branched stems and narrow, feather-like leaves that reduce water loss. It is well adapted to dry climates and can thrive in poor soils. This variety is valued for its ornamental appeal and role in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustissima var. frutescens is primarily native to southern Africa, particularly South Africa. It is found in regions such as the Western Cape, Eastern Cape, and parts of KwaZulu-Natal. This variety thrives in sandy or rocky soils and is commonly found in coastal and mountainous areas. It is often seen in fynbos vegetation, which is characteristic of the region's unique biodiversity. The plant is well adapted to the Mediterranean climate of the area, with dry summers and wet winters.",
    "distribution_introduced_art_desc": "Acacia angustissima var. frutescens was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, particularly in South Africa, Namibia, and Botswana. This plant is often used for its hardy nature and ability to withstand drought conditions. It has been introduced to some parts of Australia and the southwestern United States for erosion control and as an ornamental plant. However, its introduction has raised concerns about its potential to become invasive in non-native environments."
}
