{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia erinacea",
    "plant_slug": "acacia-erinacea",
    "plant_name_scientific": "acacia erinacea",
    "intro": "Acacia erinacea, commonly known as the hairy acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, thorny stems and small, yellow flowers that appear in clusters. The leaves are compound, consisting of several pairs of small, oval-shaped leaflets. It thrives in arid and semi-arid environments, often found in savannas and rocky areas. The plant is well adapted to drought conditions, with deep root systems that help it survive in nutrient-poor soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia erinacea"
    },
    "taxonomy_art_desc": "Acacia erinacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorny appearance and their ability to thrive in arid environments. Its species is Acacia erinacea, a specific type of acacia characterized by its unique morphology and ecological adaptations, often found in regions with dry climates.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia erinacea is primarily native to South Australia and Western Australia. It is commonly found in arid and semi-arid regions within these states. This species thrives in sandy soils and is often associated with shrublands and open woodlands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. Its distribution is limited to specific areas within the two mentioned Australian states.",
    "distribution_introduced_art_desc": "Acacia erinacea was mainly introduced to control soil erosion and as a source of timber and fuelwood in semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its adaptability to poor soil conditions. The plant thrives in warm, dry climates and can tolerate drought conditions. It has been widely planted in countries such as Australia, South Africa, and parts of Asia. However, its rapid growth and spread have led to concerns about its potential to become invasive in some ecosystems."
}
