{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia quadrangularis",
    "plant_slug": "acacia-quadrangularis",
    "plant_name_scientific": "acacia quadrangularis",
    "intro": "Acacia quadrangularis, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, angular, and often twisted stems, which are covered in small, spiny projections. The plant produces yellow flowers in globular clusters, typically in spring, which are followed by flat, pod-like fruits. Its leaves are bipinnate, consisting of multiple pairs of small, narrow leaflets. Acacia quadrangularis is well adapted to arid and semi-arid environments, showing resilience to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia quadrangularis is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the northern parts of the country, including Western Australia, Northern Territory, and Queensland. This species thrives in sandy soils and is often seen in coastal dunes and inland shrublands. It is well adapted to the harsh climate with its ability to withstand drought and high temperatures. Acacia quadrangularis plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia quadrangularis was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, parts of Southeast Asia, and the Indian subcontinent. This plant is often used for its hardy nature and ability to withstand drought conditions. It has been introduced for purposes such as land stabilization and as an ornamental species. However, in some regions, it has become invasive, outcompeting native vegetation."
}
