{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia octandra",
    "plant_slug": "acacia-octandra",
    "plant_name_scientific": "acacia octandra",
    "intro": "Acacia octandra, commonly known as the African milkwood tree, is a deciduous shrub or small tree native to southern Africa. It is characterized by its straight, often thornless trunk and compound leaves that are pinnately arranged. The plant produces yellow flowers in spikes, which are followed by flat, pod-like fruits containing seeds. Acacia octandra is adapted to arid and semi-arid environments, making it a hardy species in dry climates. It is also known for its latex sap, which has been used traditionally for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia octandra is primarily native to India. It is found in various regions across the country, including the western and southern states. This plant thrives in dry and semi-arid environments, often growing in open woodlands and scrublands. It is commonly seen in areas with well-drained soils and is adapted to the local climate conditions. Acacia octandra plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia octandra was mainly introduced to regions with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in savannas, woodlands, and along riverbanks. This plant is often used for its hardy nature and ability to fix nitrogen, making it valuable for soil enrichment. Its introduction has also been associated with land rehabilitation projects in degraded areas. However, in some regions, it has become invasive, outcompeting native vegetation."
}
