{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hernandezii",
    "plant_slug": "acacia-hernandezii",
    "plant_name_scientific": "acacia hernandezii",
    "intro": "Acacia hernandezii, commonly known as the Mexican mimosa, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its feathery, bipinnate leaves that resemble the structure of a fern. The plant produces yellow globular flowers that bloom in spring, attracting pollinators such as bees and butterflies. Its seeds are encased in a pod-like structure and are dispersed by wind. Acacia hernandezii is adapted to arid environments and is often used in xeriscaping due to its drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hernandezii is primarily native to the southwestern United States and northwestern Mexico. It is found in states such as Arizona, New Mexico, and Texas, as well as in parts of Sonora and Sinaloa in Mexico. This plant typically grows in desert and semi-arid environments, often along rocky soils and in areas with low rainfall. It is well adapted to the harsh conditions of its native habitat. Acacia hernandezii is commonly referred to as the \"Hernandez acacia\" and is an important component of local ecosystems.",
    "distribution_introduced_art_desc": "Acacia hernandezii was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in dry, rocky habitats such as canyons and mesas. This plant is often used for erosion control due to its deep root system. It has become naturalized in several areas, sometimes outcompeting native vegetation. Its introduction has raised concerns about its impact on local ecosystems."
}
