{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia callosa",
    "plant_slug": "acacia-callosa",
    "plant_name_scientific": "acacia callosa",
    "intro": "Acacia callosa, commonly known as the rough wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, yellow flowers that appear in early spring. The leaves are compound, with thread-like phyllodes that are rough to the touch, giving the plant its common name. It thrives in well-drained soils and is often found in dry, open habitats. This plant is valued for its ornamental appeal and is sometimes cultivated in gardens for its distinctive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia callosa is primarily native to eastern Australia, including regions such as New South Wales, Victoria, and South Australia. It is commonly found in dry sclerophyll forests and open woodlands. This species thrives in well-drained soils and is often associated with rocky or sandy habitats. It plays an important ecological role by providing food and shelter for native wildlife. Acacia callosa is well adapted to the arid and semi-arid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia callosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces. The plant thrives in sandy soils and is often seen in coastal and inland areas. Due to its rapid growth and ability to spread, it has become a potential invasive species in some parts of its introduced range. It is sometimes used in landscaping for its ornamental value."
}
