{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riparioides",
    "plant_slug": "acacia-riparioides",
    "plant_name_scientific": "acacia riparioides",
    "intro": "Acacia riparioides, commonly known as the river acacia, is a small to medium-sized shrub or tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are feather-like in appearance. The plant produces yellow, globular flower heads that are typical of the Acacia genus, and it is often found growing along riverbanks and in moist, sandy soils. Acacia riparioides is adapted to seasonal rainfall and can tolerate periods of drought, making it a hardy species in its native habitat. Its ecological importance includes providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riparioides is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Mozambique. It is commonly found in riverine habitats and along the edges of seasonal watercourses. This plant thrives in sandy or gravelly soils and is often associated with floodplain environments. It is well adapted to the region's climate, which includes hot, dry periods and wet seasons. Acacia riparioides plays an important ecological role in stabilizing riverbanks and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia riparioides was mainly introduced to stabilize riverbanks and prevent erosion in areas with sandy or alluvial soils. It is commonly found in riparian zones along rivers and streams in Australia. This plant thrives in full sun and requires moderate water availability. Its rapid growth and extensive root system make it effective for soil reinforcement. However, it can become invasive in certain environments if not managed properly."
}
