{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trulliformis",
    "plant_slug": "acacia-trulliformis",
    "plant_name_scientific": "acacia trulliformis",
    "intro": "Acacia trulliformis, commonly known as the umbrella acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive umbrella-like crown formed by a dense cluster of branches. The plant has feathery, bipinnate leaves that are often used in traditional medicine. Its yellow flowers are produced in dense, globular clusters and are an important nectar source for pollinators. Acacia trulliformis is adapted to arid and semi-arid environments, making it a resilient plant in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia trulliformis"
    },
    "taxonomy_art_desc": "Acacia trulliformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and ability to thrive in arid environments. Its species is Acacia trulliformis, a specific type of acacia known for its unique, tree-like structure and adapted to grow in harsh, dry conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trulliformis is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This plant thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is well adapted to the hot and dry climate of its native habitat. Acacia trulliformis is an important component of the local flora and plays a role in stabilizing the soil in these regions.",
    "distribution_introduced_art_desc": "Acacia trulliformis was mainly introduced to South Africa, where it has been cultivated for its ornamental value and hardy nature. It is commonly found in gardens and along roadsides due to its ability to thrive in various soil types and climatic conditions. The plant is also used in erosion control because of its deep root system that stabilizes the soil. However, it has shown potential to become invasive in some areas if not managed properly. Its introduction has raised concerns about its impact on native plant species and ecosystems."
}
