{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia megaphylla",
    "plant_slug": "acacia-megaphylla",
    "plant_name_scientific": "acacia megaphylla",
    "intro": "Acacia megaphylla, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Its seeds are enclosed in flat, leathery pods that split open when mature. Acacia megaphylla is well adapted to arid and semi-arid environments, making it a resilient component of native Australian flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia megaphylla is primarily native to south-western Australia. It is found in the states of Western Australia and South Australia. This plant thrives in dry, sandy soils and is commonly found in shrublands and woodlands. It is adapted to the arid and semi-arid climates of its native range. Acacia megaphylla is an important component of the local flora and is often used in ecological restoration projects.",
    "distribution_introduced_art_desc": "Acacia megaphylla was mainly introduced to areas with well-drained soils and a temperate to warm climate, particularly in regions of Australia. It is commonly found in open woodlands and on rocky outcrops where it thrives in full sun. This plant is often used in landscaping due to its drought tolerance and ability to fix nitrogen in the soil. Its introduction has also helped in stabilizing soils in degraded areas. However, it can become invasive in certain environments if not managed properly."
}
