{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cornigera var. americana",
    "plant_slug": "acacia-cornigera-var-americana",
    "plant_name_scientific": "acacia cornigera var. americana",
    "intro": "Acacia cornigera var. americana, commonly known as the American acacia, is a shrub native to the southern United States. It features slender, thorned stems and bipinnate leaves composed of numerous small, oval leaflets. The plant produces yellow, globular inflorescences that attract pollinators such as bees and birds. Its seeds are encased in a fibrous pod, and the plant is adapted to arid and semi-arid environments. It is often used in xeriscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cornigera var. americana is primarily native to the southeastern United States, including states such as Florida, Georgia, and South Carolina. It is commonly found in coastal areas, sandy soils, and disturbed sites along the Atlantic and Gulf coasts. This variety is often associated with maritime hammocks and dunes, where it thrives in well-drained, sandy conditions. It is an important component of the local flora in these regions, contributing to the ecological diversity of the coastal ecosystems. Due to its adaptability, it can also be found in some inland areas with similar environmental conditions.",
    "distribution_introduced_art_desc": "Acacia cornigera var. americana was mainly introduced to the United States as an ornamental plant due to its unique appearance and adaptability to various climates. It is commonly found in southern states where it thrives in well-drained soils and full sun. This plant has also been introduced to parts of Europe and Australia for similar ornamental purposes. However, it is important to note that it can become invasive in certain regions if not properly managed. Its spread has raised concerns among ecologists due to its potential to outcompete native vegetation."
}
