{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia webbii",
    "plant_slug": "acacia-webbii",
    "plant_name_scientific": "acacia webbii",
    "intro": "Acacia webbii, commonly known as the Sudanese acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its slender, often spiny branches and compound leaves that are typically reduced to small, scale-like structures. The plant produces yellow, pea-like flowers that are clustered in dense inflorescences, followed by long, thin pods containing seeds. Acacia webbii is well adapted to drought conditions, with deep roots and a thick, waxy cuticle to minimize water loss. It plays an important ecological role in stabilizing soils and providing habitat for various desert species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia webbii"
    },
    "taxonomy_art_desc": "Acacia webbii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single carpel and include legumes and other related families. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive thorned stems and bipinnate leaves. Its species is Acacia webbii, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia webbii is primarily native to Queensland. It is found in the tropical and subtropical regions of the state, particularly in areas with well-drained soils. This plant typically grows in open woodlands, grasslands, and along riverbanks. It is well adapted to the local climate and soil conditions of Queensland. Acacia webbii plays an important role in the local ecosystem and is often used in landscaping due to its hardy nature.",
    "distribution_introduced_art_desc": "Acacia webbii was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was originally native to Australia but was introduced to South Africa for ornamental purposes and as a potential source of timber. Due to its rapid growth and ability to outcompete native vegetation, it has spread to several areas, particularly in the Eastern and Western Cape provinces. The plant thrives in disturbed soils and can colonize a variety of habitats, including grasslands and coastal areas. Its introduction has led to ecological concerns, prompting efforts to control its spread and mitigate its impact on local biodiversity."
}
