{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia minuta subsp. densiflora",
    "plant_slug": "acacia-minuta-subsp-densiflora",
    "plant_name_scientific": "acacia minuta subsp. densiflora",
    "intro": "Acacia minuta subsp. densiflora, commonly known as the denseflower acacia, is a small, shrub-like plant native to southern Africa. It is characterized by its narrow, linear leaves and clusters of small, yellow flowers that bloom in spring. The plant produces oblong, woody pods that contain several seeds. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its compact size and ornamental flowers, it is occasionally cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia minuta subsp. densiflora is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This subspecies thrives in open woodlands and shrublands, often in areas with low rainfall. It is well adapted to the harsh environmental conditions of its native habitat. Its distribution is largely restricted to the northern parts of the continent where it plays a significant ecological role.",
    "distribution_introduced_art_desc": "Acacia minuta subsp. densiflora was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, thriving in coastal and mountainous areas. This subspecies is often associated with sandy soils and is frequently used in ornamental horticulture due to its attractive foliage. Its introduction has led to some ecological concerns, as it can compete with native vegetation. Despite its invasive potential, it remains a popular plant in local gardens and landscapes."
}
