{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ericifolia var. typica",
    "plant_slug": "acacia-ericifolia-var-typica",
    "plant_name_scientific": "acacia ericifolia var. typica",
    "intro": "Acacia ericifolia var. typica, commonly known as the coastal acacia, is a shrub native to the coastal regions of southern Africa. It is characterized by its small, dense foliage and yellow flowers that bloom in spring. The plant has a woody stem with thorn-like structures, which help it survive in harsh, saline environments. Its leaves are small and leathery, reducing water loss in arid conditions. This species is often used in coastal stabilization due to its hardy nature and ability to thrive in sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ericifolia var. typica is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Angola, and parts of South Africa. It is commonly found in sandy soils and coastal areas, often growing in association with other drought-tolerant shrubs. This plant is well adapted to hot, dry climates and can thrive in areas with low rainfall. It plays an important ecological role by providing habitat and food for various local wildlife species. Its distribution is largely confined to the southwestern and southern regions of the African continent.",
    "distribution_introduced_art_desc": "Acacia ericifolia var. typica was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its hardy nature and ability to thrive in poor soil conditions. This plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has been particularly beneficial in areas prone to desertification. However, it requires careful management to prevent it from becoming invasive in non-target environments."
}
