{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lumholtzii",
    "plant_slug": "acacia-lumholtzii",
    "plant_name_scientific": "acacia lumholtzii",
    "intro": "Acacia lumholtzii, commonly known as the Texas acacia, is a shrub or small tree native to the southern United States and northern Mexico. It is characterized by its slender, branching stems and feathery, bipinnate leaves that are often covered in fine hairs. The plant produces yellow, globular inflorescences that bloom in late spring, attracting pollinators such as bees and butterflies. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its ability to thrive in arid environments. Acacia lumholtzii is well adapted to drought and is often found in rocky soils and open woodlands.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lumholtzii"
    },
    "taxonomy_art_desc": "Acacia lumholtzii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants known for their diverse floral structures and evolutionary relationships. Its order is Fabales, which includes plants with characteristic flowers and often nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume family, known for their distinctive pod fruits and nitrogen-fixing symbiosis with bacteria. Its genus is Acacia, a large genus of shrubs and trees characterized by their phyllodes and often used in traditional medicine. Its species is Acacia lumholtzii, a specific type of acacia found in certain regions, known for its ecological and potential medicinal importance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lumholtzii is primarily native to Queensland. It is found in the southern and central regions of the state, particularly in areas with dry, sandy soils. This species is commonly associated with tropical and subtropical climates, often growing in open woodlands and grasslands. It plays an important ecological role in its native habitat, providing food and shelter for various wildlife species. Acacia lumholtzii is well adapted to the environmental conditions of Queensland, including periods of drought and high temperatures.",
    "distribution_introduced_art_desc": "Acacia lumholtzii was mainly introduced to areas with sandy soils and dry climates, particularly in the southwestern United States and northern Mexico. It thrives in environments with low rainfall and high temperatures, making it well-suited for arid and semi-arid regions. The plant is often found in open woodlands and along coastal dunes, where it plays a role in stabilizing sand dunes and preventing erosion. Its introduction has been associated with both natural dispersal and human activities, including landscaping and restoration projects. However, it is considered an invasive species in some regions, outcompeting native vegetation and altering local ecosystems."
}
