{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gracilis",
    "plant_slug": "acacia-gracilis",
    "plant_name_scientific": "acacia gracilis",
    "intro": "Acacia gracilis, commonly known as slender wattle, is a shrub native to Australia. It is characterized by its slender, wiry stems and bipinnate leaves that are covered in fine hairs. The plant produces yellow globular flowers in summer, which are arranged in compact clusters. It thrives in well-drained soils and is often found in coastal and sandy regions. Acacia gracilis is valued for its ornamental appeal and its role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gracilis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often in shrubland and savanna ecosystems. This species thrives in regions with low rainfall and high temperatures, adapting well to harsh environmental conditions. It plays an important role in local ecosystems by providing habitat and food for various wildlife species. Acacia gracilis is also sometimes cultivated for its ornamental value and its ability to stabilize soil in degraded areas.",
    "distribution_introduced_art_desc": "Acacia gracilis was mainly introduced to areas with well-drained soils and a temperate climate, particularly in regions where it can thrive in full sun. It is commonly found in disturbed soils and along roadsides, where it establishes quickly due to its adaptability. This plant is often used for soil stabilization and as a source of browse for livestock. Its introduction has led to its naturalization in several regions outside its native range. However, it is considered a potential invasive species in some areas due to its rapid growth and competitive nature."
}
