{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia harpophylla",
    "plant_slug": "acacia-harpophylla",
    "plant_name_scientific": "acacia harpophylla",
    "intro": "Acacia harpophylla, commonly known as the coastal acacia, is a shrub or small tree native to coastal regions of southern Australia. It is characterized by its slender, often multi-stemmed form and its distinctive, fern-like phyllodes that are typically pale green to grey-green in color. The plant produces yellow globular flowerheads that appear in late winter to early spring, attracting a variety of pollinators. It is well adapted to coastal conditions, tolerating salt spray and sandy soils. The acacia has small, hard, ribbed pods that contain seeds, which are dispersed by wind and animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia harpophylla"
    },
    "taxonomy_art_desc": "Acacia harpophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternation of generations. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with simple flower structures. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive leaf structures and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia harpophylla, a specific type of acacia found in Australia, known for its unique leaf morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia harpophylla is primarily native to New South Wales and Queensland. This species is commonly found in the arid and semi-arid regions of these states. It thrives in sandy or loamy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the dry climate and can tolerate periods of drought. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia harpophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in sandy soils and coastal environments. The plant is often used for dune stabilization due to its deep root system and ability to withstand harsh conditions. However, its spread has raised concerns about its potential invasiveness in local ecosystems. Despite its ecological benefits, management strategies are being developed to control its spread in sensitive areas."
}
