{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia effusifolia",
    "plant_slug": "acacia-effusifolia",
    "plant_name_scientific": "acacia effusifolia",
    "intro": "Acacia effusifolia, commonly known as the soft-haired acacia, is a shrub native to southern Africa. It is characterized by its slender, often sparsely branched stems and small, feathery leaves that are covered in fine, soft hairs. The plant produces yellow flowers in globular inflorescences, which are typically visited by various pollinators. Its seeds are enclosed in woody pods and are dispersed by wind. Acacia effusifolia is adapted to arid and semi-arid environments, making it a resilient component of its native ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia effusifolia"
    },
    "taxonomy_art_desc": "Acacia effusifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns, horsetails, and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their thorned stems and distinctive foliage. Its species is Acacia effusifolia, a specific type of acacia found in certain regions, distinguished by its unique leaf and flower structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia effusifolia is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the state. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of the region. The plant plays an important role in the local ecosystem and is a characteristic feature of the landscape in Western Australia.",
    "distribution_introduced_art_desc": "Acacia effusifolia was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of timber and fuel. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. It is also valued for its ability to provide habitat for native wildlife."
}
