{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia wickhamii",
    "plant_slug": "acacia-wickhamii",
    "plant_name_scientific": "acacia wickhamii",
    "intro": "Acacia wickhamii, commonly known as the narrow-leaf wickham acacia, is a flowering plant native to the arid regions of Western Australia. It is a shrub or small tree that typically grows to a height of 1 to 3 meters. The plant features narrow, linear leaves that are often covered in fine hairs, and it produces yellow globular flowers in summer. Acacia wickhamii is adapted to drought and poor soil conditions, making it a resilient species in its native habitat. Its botanical characteristics make it an important part of the local flora and ecosystem.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia wickhamii"
    },
    "taxonomy_art_desc": "Acacia wickhamii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that often have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like flower heads and often used in traditional medicine. Its species is Acacia wickhamii, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia wickhamii is primarily native to the Northern Territory, Queensland, and Western Australia. It is commonly found in arid and semi-arid regions within these states. This plant typically grows in sandy or rocky soils and is often seen in open woodlands and shrublands. It is well adapted to the dry climate and can survive in areas with low rainfall. Acacia wickhamii plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia wickhamii was mainly introduced to South Australia as a potential ornamental and for its ability to thrive in arid conditions. It was introduced in the late 19th century during the colonial expansion and settlement efforts. The plant was favored for its hardy nature and ability to stabilize soils in dry environments. However, it has since become naturalized in some areas, raising concerns about its impact on native ecosystems. Its introduction highlights the historical use of exotic plants for ecological and agricultural purposes."
}
