{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia continua",
    "plant_slug": "acacia-continua",
    "plant_name_scientific": "acacia continua",
    "intro": "Acacia continua, commonly known as the African milk tree, is a shrub or small tree native to southern Africa. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is known for its milky sap, which can be toxic if ingested. It thrives in arid and semi-arid environments, often found in savannas and rocky areas. Acacia continua plays an important ecological role by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia continua"
    },
    "taxonomy_art_desc": "Acacia continua belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive aculeate (spiny) stems and compound leaves. Its species is Acacia continua, a specific type of acacia that is native to certain regions and is characterized by its unique morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia continua is primarily native to New South Wales and South Australia. This shrub or small tree is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands or along riverbanks. The plant is well adapted to the climate of these areas, with its deep root system allowing it to access water from deeper underground. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia continua was mainly introduced to India. It is commonly found in the tropical and subtropical regions of the country. The plant is often cultivated for its ornamental value and its ability to thrive in arid conditions. It has been reported in several states, including Tamil Nadu, Kerala, and Andhra Pradesh. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
