{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia malacocephala",
    "plant_slug": "acacia-malacocephala",
    "plant_name_scientific": "acacia malacocephala",
    "intro": "Acacia malacocephala, commonly known as the narrow-leaved wattle, is a flowering plant native to Australia. It is characterized by its slender, yellow flowers that bloom in compact clusters, typically during the spring and summer seasons. The plant has bipinnate leaves that are finely divided, giving it a feathery appearance. It thrives in well-drained soils and is often found in coastal and sandy habitats. Acacia malacocephala is also valued for its hardy nature and is sometimes cultivated as an ornamental plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia malacocephala is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in a variety of habitats, including savannas, grasslands, and rocky outcrops. This species is commonly found in regions with a tropical or subtropical climate. It plays an important ecological role by providing habitat and food for various wildlife species. The plant is also known for its hardy nature and ability to withstand drought conditions.",
    "distribution_introduced_art_desc": "Acacia malacocephala was mainly introduced to areas with tropical and subtropical climates, particularly in regions where it can thrive in well-drained soils. It is commonly found in disturbed habitats such as roadsides, open woodlands, and degraded lands. The plant is often used for erosion control due to its rapid growth and ability to establish itself quickly. It has also been introduced as an ornamental plant in some parts of the world. However, its spread can sometimes lead to ecological impacts in non-native environments."
}
