{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia undulata",
    "plant_slug": "acacia-undulata",
    "plant_name_scientific": "acacia undulata",
    "intro": "Acacia undulata, commonly known as the wavy acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often zigzagging branches and small, compound leaves that are typically covered in a fine layer of white or pale-colored hairs. The plant produces yellow flowers in dense, globular clusters, which are followed by long, slender pods containing flat, kidney-shaped seeds. It thrives in arid and semi-arid environments, often growing on rocky soils and in open woodlands. Acacia undulata is adapted to withstand drought and has a deep root system that allows it to access water from deeper underground.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia undulata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, often growing in sandy or rocky soils. This species is well adapted to dry climates and can thrive in areas with low rainfall. It is often seen in savanna and woodland habitats. Acacia undulata plays an important ecological role in providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia undulata was mainly introduced to stabilize sand dunes and prevent soil erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in harsh environmental conditions. The plant is well adapted to low rainfall and high temperatures, making it suitable for restoration in degraded landscapes. Its deep root system helps bind the soil, reducing wind erosion. This species is also valued for its potential in agroforestry and as a source of timber and forage."
}
