{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cymbispina",
    "plant_slug": "acacia-cymbispina",
    "plant_name_scientific": "acacia cymbispina",
    "intro": "Acacia cymbispina, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, twisted branches and small, bipinnate leaves that are often covered in fine hairs. The plant produces yellow globular flowers in late winter to early spring, which are arranged in dense clusters. Its seeds are encased in woody pods and are adapted for dispersal by animals. Acacia cymbispina is well-suited to arid and semi-arid environments, making it a resilient component of native Australian flora.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cymbispina is primarily native to northern Australia, including parts of Queensland, the Northern Territory, and Western Australia. It thrives in arid and semi-arid environments, often found in open woodlands and shrublands. This species is well adapted to the harsh climatic conditions of the region, including high temperatures and low rainfall. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife. Acacia cymbispina is also known for its distinctive bipinnate leaves and yellow floral spikes.",
    "distribution_introduced_art_desc": "Acacia cymbispina was mainly introduced to New Zealand. It was brought there for its ornamental value and potential for soil stabilization. The plant has since spread beyond its original planting sites. It is now considered a weed in certain areas due to its aggressive growth. Its distribution is primarily in the North Island, particularly in coastal and lowland regions."
}
