{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia anserina",
    "plant_slug": "acacia-anserina",
    "plant_name_scientific": "acacia anserina",
    "intro": "Acacia anserina, commonly known as the white acacia, is a small, deciduous shrub native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in late summer, which are clustered in cylindrical inflorescences. Acacia anserina is adapted to arid environments and is often found in rocky soils. It is also known for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia anserina"
    },
    "taxonomy_art_desc": "Acacia anserina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female flowers and are often found in tropical and temperate regions. Its order is Fabales, which includes legumes and other plants that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acorn-like seed pods and often used in traditional medicine. Its species is Acacia anserina, a specific type of acacia native to South Africa, known for its distinctive leaf structure and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia anserina is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the southwestern part of the state. This species thrives in dry, well-drained environments and is often seen in heathlands and woodlands. It plays an important ecological role in supporting local wildlife and stabilizing soil. Its distribution is largely restricted to the specific climatic and soil conditions of Western Australia.",
    "distribution_introduced_art_desc": "Acacia anserina was mainly introduced to stabilize soils and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in harsh environmental conditions. The plant is also valued for its rapid growth and adaptability to poor soil quality. It has been introduced to several countries in Africa, the Middle East, and parts of Asia. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation."
}
