{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riparia f. intermedia",
    "plant_slug": "acacia-riparia-f-intermedia",
    "plant_name_scientific": "acacia riparia f. intermedia",
    "intro": "Acacia riparia f. intermedia, commonly known as the river acacia or slender wattle, is a shrub native to Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow globular flowers in late winter to early spring, which are followed by long, slender pods. It thrives in sandy or gravelly soils along riverbanks and is often used in ecological restoration projects. This form is distinguished by its more delicate foliage and smaller flowers compared to other acacia species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riparia f. intermedia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This subspecies is commonly found in riverine and floodplain environments, where it thrives in sandy or gravelly soils. It is well adapted to harsh climatic conditions, including high temperatures and low rainfall. The plant plays an important ecological role in stabilizing soil and providing habitat for various wildlife species. Its distribution is closely associated with water sources in these dry regions.",
    "distribution_introduced_art_desc": "Acacia riparia f. intermedia was mainly introduced to areas with sandy or gravelly soils along riverbanks and floodplains. It thrives in semi-arid and arid environments where it can tolerate periodic flooding and drought. This plant is often used for erosion control due to its extensive root system and ability to stabilize soil. It has also been introduced as an ornamental plant in some regions for its attractive foliage and flowering. However, its spread can sometimes lead to ecological impacts in non-native habitats."
}
