{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens var. mollissima",
    "plant_slug": "acacia-decurrens-var-mollissima",
    "plant_name_scientific": "acacia decurrens var. mollissima",
    "intro": "Acacia decurrens var. mollissima, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves that give it a delicate appearance. The plant produces yellow or pale yellow flowers in dense, globular clusters, which are highly attractive to pollinators such as bees and birds. Its bark is smooth and grayish, and it has a reputation for being drought-tolerant and adaptable to various soil types. The species is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decurrens var. mollissima is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variant is commonly found in savannas and rocky outcrops where it thrives in well-drained soils. It is well adapted to the harsh climatic conditions of its native habitat, including high temperatures and low rainfall. The plant is often used as a source of timber and forage by local communities. Its distribution is largely restricted to the southwestern part of the African continent.",
    "distribution_introduced_art_desc": "Acacia decurrens var. mollissima was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation and land rehabilitation projects due to its hardy nature and ability to thrive in poor soil conditions. This plant is also valued for its nitrogen-fixing capabilities, which improve soil fertility over time. Its introduction has been particularly beneficial in areas affected by desertification and land degradation. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
