{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia doratoxylon",
    "plant_slug": "acacia-doratoxylon",
    "plant_name_scientific": "acacia doratoxylon",
    "intro": "Acacia doratoxylon, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its yellow flowers, which appear in globular clusters and bloom in spring. The plant has phyllodes, which are flattened leaf stalks that perform the function of true leaves. It thrives in well-drained soils and is often found in dry, open habitats. Acacia doratoxylon is also noted for its hard, dense wood, which is used in various applications.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia doratoxylon"
    },
    "taxonomy_art_desc": "Acacia doratoxylon belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have leaves with a single vein and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often fragrant flowers. Its species is Acacia doratoxylon, a specific type of acacia native to certain regions of Australia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia doratoxylon is primarily native to New South Wales and Victoria. It is commonly found in the dry, sandy soils of these regions. This species thrives in arid and semi-arid environments. It is often seen in open woodlands and along riverbanks. Its distribution is limited to specific ecological zones within these states.",
    "distribution_introduced_art_desc": "Acacia doratoxylon was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used for afforestation and land rehabilitation projects due to its hardy nature. The plant thrives in well-drained soils and can tolerate drought conditions. It is also valued for its timber and as a source of fodder for livestock. Its introduction has helped in restoring degraded lands in several parts of Africa and Australia."
}
