{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kinionge",
    "plant_slug": "acacia-kinionge",
    "plant_name_scientific": "acacia kinionge",
    "intro": "Acacia kinionge, commonly known as the Kenya acacia, is a shrub or small tree native to East Africa. It is characterized by its slender, thorned branches and bipinnate leaves that are divided into numerous small leaflets. The plant produces yellow flowers in globular clusters, which are followed by flat, pod-like fruits containing seeds. Acacia kinionge is adapted to arid and semi-arid environments, making it a resilient species in dry regions. It plays a role in local ecosystems and has traditional uses in some communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kinionge is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It is commonly found in savanna and woodland habitats, often growing in areas with well-drained soils. This plant thrives in regions with a tropical or subtropical climate and is adapted to seasonal rainfall patterns. It plays an important role in local ecosystems by providing food and shelter for various wildlife species. Acacia kinionge is also sometimes used in traditional medicine by indigenous communities in these regions.",
    "distribution_introduced_art_desc": "Acacia kinionge was mainly introduced to South Africa as a potential source of timber and for its ability to thrive in arid conditions. It was initially planted in regions with poor soil quality to stabilize the land and prevent erosion. However, its rapid growth and invasive tendencies led to concerns about its impact on native ecosystems. Despite its benefits, it is now considered a problematic species in some areas due to its competitive nature. The distribution of Acacia kinionge has been limited to specific regions where it has been managed to minimize ecological disruption."
}
