{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cunninghamii var. tropica",
    "plant_slug": "acacia-cunninghamii-var-tropica",
    "plant_name_scientific": "acacia cunninghamii var. tropica",
    "intro": "Acacia cunninghamii var. tropica, commonly known as the tropical wattle, is a shrub or small tree native to northern Australia. It is characterized by its feathery, bipinnate leaves and yellow, globular flower heads that appear in spring. The plant thrives in tropical and subtropical climates, often growing in coastal areas and sandy soils. Its rapid growth and hardy nature make it suitable for erosion control and ornamental planting. The species is also valued for its ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cunninghamii var. tropica is primarily native to northern Australia, particularly in the regions of Queensland and the Northern Territory. This variant thrives in tropical and subtropical climates, often found in coastal areas and sandy soils. It is commonly associated with rainforest margins and coastal heathlands. The plant is well adapted to the humid and warm conditions of its native range. Its distribution is limited to specific ecological zones within northern Australia.",
    "distribution_introduced_art_desc": "Acacia cunninghamii var. tropica was mainly introduced to coastal and sandy areas of eastern Australia, particularly in New South Wales and Queensland. It is commonly found in dune systems and on the edges of saltwater swamps. This plant is adapted to saline and well-drained soils, making it a hardy species for coastal environments. It has been used in coastal stabilisation projects due to its ability to tolerate wind and salt spray. However, its spread can sometimes lead to ecological impacts in native habitats."
}
