{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acellerata",
    "plant_slug": "acacia-acellerata",
    "plant_name_scientific": "acacia acellerata",
    "intro": "Acacia acellerata, commonly known as the slender acacia, is a shrub native to southern Africa. It features small, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in globular clusters, which are followed by long, slender pods. It is adapted to arid and semi-arid environments, making it a resilient species. Acacia acellerata plays a role in local ecosystems by providing food and shelter for various wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia acellerata"
    },
    "taxonomy_art_desc": "Acacia acellerata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes vascular plants with a wide range of morphological diversity, including ferns and some gymnosperms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, vetches, and other related plants. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia acellerata, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acellerata is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the southwestern part of the state. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the local climate, with its small leaves and deep root system helping it survive in dry conditions. The plant plays an important role in the local ecosystem, providing food and habitat for various native animals.",
    "distribution_introduced_art_desc": "Acacia acellerata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in sandy soils and coastal areas. The plant is often used for its hardy nature and ability to withstand harsh environmental conditions. It has been introduced for purposes such as erosion control and as an ornamental plant. However, its spread has raised concerns due to its potential to become invasive in certain ecosystems."
}
