{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stictophylla",
    "plant_slug": "acacia-stictophylla",
    "plant_name_scientific": "acacia stictophylla",
    "intro": "Acacia stictophylla, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features narrow, linear leaves that are often covered in a fine layer of white to grey hairs. Acacia stictophylla is well adapted to arid and semi-arid environments, showing resilience to drought conditions. It produces small yellow flowers in spring, which are followed by flat, ribbed pods containing seeds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stictophylla"
    },
    "taxonomy_art_desc": "Acacia stictophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often primitive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing capabilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a group of flowering plants commonly known as wattles, which are typically shrubs or trees with phyllodes instead of leaves. Its species is Acacia stictophylla, a specific type of acacia that is characterized by its unique leaf structure and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stictophylla is primarily native to Victoria. It is found in the eastern regions of the state, particularly in areas with sandy soils and open habitats. This species is commonly observed in coastal dunes and heathlands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. Its distribution is limited to specific ecological zones within Victoria.",
    "distribution_introduced_art_desc": "Acacia stictophylla was mainly introduced to control soil erosion and for its ability to thrive in arid environments. It is commonly found in regions with poor soil quality and low rainfall. This plant has been used in rehabilitation projects to stabilize degraded lands. Its introduction has also provided habitat for certain wildlife species. However, it requires careful management to prevent it from becoming invasive in new areas."
}
