{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennatula subsp. parvicephala",
    "plant_slug": "acacia-pennatula-subsp-parvicephala",
    "plant_name_scientific": "acacia pennatula subsp. parvicephala",
    "intro": "Acacia pennatula subsp. parvicephala, commonly known as the narrow-headed wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that appear in cylindrical or cylindrical-like inflorescences. The plant typically grows in sandy or gravelly soils in arid or semi-arid regions. It is well adapted to drought conditions and can thrive in full sun. The species is often used in landscaping for its ornamental value and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennatula subsp. parvicephala is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, particularly in the Kalahari Desert and surrounding areas. This subspecies is well adapted to drought conditions and can thrive in low-nutrient environments. It plays an important ecological role by providing habitat and food for various animals. Its distribution is closely linked to the specific climatic and soil conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia pennatula subsp. parvicephala was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Western and Eastern Cape provinces. This subspecies is often associated with sandy soils and can thrive in both full sun and partial shade conditions. It is valued for its hardy nature and ability to withstand drought, making it a popular choice for landscaping. However, it is also considered a potential invasive species in some areas due to its rapid growth and competitive nature."
}
