{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia langsdorffii var. armata",
    "plant_slug": "acacia-langsdorffii-var-armata",
    "plant_name_scientific": "acacia langsdorffii var. armata",
    "intro": "Acacia langsdorffii var. armata, commonly known as the rough-barked acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, thorny branches and phyllodes that are narrow and slightly curved. The plant produces yellow flowers in globular or cylindrical inflorescences, which appear during the warmer months. Its bark is rough and fissured, providing a distinctive texture. It is adapted to arid and semi-arid environments, making it a resilient species in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia langsdorffii var. armata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This variant thrives in well-drained soils and is often associated with shrubland and woodland ecosystems. It is well adapted to the harsh climatic conditions of its native range, including high temperatures and low rainfall. The plant plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia langsdorffii var. armata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and ability to thrive in various environmental conditions. However, it has since become invasive, outcompeting native species and altering local ecosystems. The plant's rapid growth and seed dispersal have made it a significant ecological concern. Efforts are ongoing to control its spread and mitigate its impact on native biodiversity."
}
