{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mangium var. holosericea",
    "plant_slug": "acacia-mangium-var-holosericea",
    "plant_name_scientific": "acacia mangium var. holosericea",
    "intro": "Acacia mangium var. holosericea, commonly known as the silky acacia, is a deciduous tree native to Southeast Asia. It is characterized by its slender, straight trunk and bipinnate leaves that are finely divided. The plant produces yellowish-white inflorescences that bloom in clusters, attracting various pollinators. Its seeds are encased in thin, fibrous pods, which are dispersed by wind. This species is valued for its rapid growth and is often used in reforestation and as a source of timber and charcoal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mangium var. holosericea is primarily native to Southeast Asia, including countries such as Indonesia, Malaysia, and Thailand. It is commonly found in tropical and subtropical regions, particularly in lowland and hill areas with well-drained soils. This variant is often associated with secondary forests and is sometimes cultivated for its timber and other economic uses. It thrives in areas with high rainfall and warm temperatures. Its natural range extends into parts of the Philippines and Brunei as well.",
    "distribution_introduced_art_desc": "Acacia mangium var. holosericea was mainly introduced to tropical and subtropical regions for its fast growth and valuable timber properties. It is commonly cultivated in countries such as Indonesia, Malaysia, and Thailand for commercial forestry and agroforestry purposes. The plant's ability to thrive in degraded soils makes it an important species for reforestation and land rehabilitation projects. However, its introduction has also raised concerns about potential invasiveness in non-native environments. Despite its ecological and economic benefits, careful management is required to prevent unintended spread and impact on local ecosystems."
}
