{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia visciflua",
    "plant_slug": "acacia-visciflua",
    "plant_name_scientific": "acacia visciflua",
    "intro": "Acacia visciflua, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its long, slender, and silky-haired stipules, which give it its common name. The plant produces yellow flowers in dense, cylindrical clusters, which are typically visited by various pollinators. Its leaves are bipinnate, consisting of multiple pairs of small, oval-shaped leaflets. Acacia visciflua is adapted to arid and semi-arid environments, making it a resilient plant in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia visciflua is primarily native to Australia, specifically the southern regions of Western Australia and South Australia. It is commonly found in arid and semi-arid environments, including sandy soils and open woodlands. This species thrives in areas with low rainfall and is often associated with shrublands and grasslands. It is well adapted to the harsh climatic conditions of its native range. The plant plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia visciflua was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in various soil conditions. It has since become naturalized in several regions, particularly in the North Island, where it spreads through seed dispersal by birds and wind. The plant is considered invasive in some areas because of its rapid growth and competitive nature, which can outcompete native species. Its introduction has raised concerns among conservationists due to its potential to alter local ecosystems. Efforts are ongoing to monitor and manage its spread to protect native biodiversity."
}
