{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia giraffae var. espinosa",
    "plant_slug": "acacia-giraffae-var-espinosa",
    "plant_name_scientific": "acacia giraffae var. espinosa",
    "intro": "Acacia giraffae var. espinosa, commonly known as the spineless acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its slender, often thornless branches and feathery, bipinnate leaves that are adapted to reduce water loss. The plant produces yellow flowers in cylindrical spikes, which are often visited by bees and other pollinators. Its seeds are enclosed in flat, woody pods that split open when mature. This species is well-suited to harsh environments and is sometimes used for soil stabilization and as a source of browse for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia giraffae var. espinosa is primarily native to southern Africa, specifically countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in arid and semi-arid regions, including the Kalahari Desert and surrounding areas. This variant is adapted to harsh environmental conditions, thriving in well-drained soils and full sun exposure. It is often seen growing along roadsides, in savannas, and on rocky outcrops. Due to its hardy nature, it plays an important role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia giraffae var. espinosa was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its hardy nature and ability to thrive in poor soil conditions. This plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped in restoring degraded lands across parts of Africa and Australia. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
