{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leioclada",
    "plant_slug": "acacia-leioclada",
    "plant_name_scientific": "acacia leioclada",
    "intro": "Acacia leioclada, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often thornless stems and bipinnate leaves that are light green and feathery in appearance. The plant produces yellowish-green flowers in compact, globular inflorescences, which are typically borne in the axils of the leaves. Acacia leioclada is adapted to arid and semi-arid environments, making it a hardy plant in regions with low rainfall. It is also valued for its use in traditional medicine and as a source of fodder for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leioclada is primarily native to northern Australia, including parts of Western Australia, Northern Territory, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species is well adapted to dry climates and can thrive in areas with low rainfall. It often grows in open woodlands and shrublands, forming dense thickets. Acacia leioclada is an important component of the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia leioclada was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was originally from Australia and was likely introduced for its potential use in erosion control or as an ornamental plant. The plant thrives in coastal and sandy soils, which has allowed it to spread rapidly in new environments. Its ability to form dense thickets has led to competition with native vegetation, impacting local biodiversity. Conservation efforts are now underway to manage its spread and mitigate its ecological impact."
}
