{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia limbata",
    "plant_slug": "acacia-limbata",
    "plant_name_scientific": "acacia limbata",
    "intro": "Acacia limbata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging stems and feathery, bipinnate leaves that are narrow and often twisted. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Acacia limbata is adapted to arid and semi-arid environments, showing resilience to drought and poor soil conditions. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia limbata"
    },
    "taxonomy_art_desc": "Acacia limbata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often exhibiting primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure, including legumes. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and the production of legume-like pods. Its species is Acacia limbata, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia limbata is primarily native to Northern Territory, Queensland, and Western Australia. This shrub or small tree is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in open woodlands and coastal dunes. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia limbata was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and hardy nature. It has since spread beyond cultivation and is now found in various habitats, including coastal dunes and disturbed soils. The plant's ability to thrive in a range of environmental conditions has contributed to its successful establishment. However, its invasive potential has raised concerns among conservationists. Efforts are ongoing to monitor and manage its spread to protect native ecosystems."
}
