{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fimbriata var. perangusta",
    "plant_slug": "acacia-fimbriata-var-perangusta",
    "plant_name_scientific": "acacia fimbriata var. perangusta",
    "intro": "Acacia fimbriata var. perangusta, commonly known as the narrow-leaf wattle, is a shrub native to Western Australia. It features narrow, feathery leaves that are often covered in fine hairs, giving it a distinctive silvery appearance. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It is well adapted to arid and semi-arid environments, thriving in well-drained soils. The species is valued for its ornamental appeal and is often used in landscaping due to its hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fimbriata var. perangusta is primarily native to the arid and semi-arid regions of Western Australia. This variety is commonly found in the coastal dunes and sandy soils of the Perth region. It thrives in coastal environments where it is adapted to salt spray and sandy substrates. The plant is also present in parts of South Australia and the northern regions of Western Australia. It plays an important ecological role in stabilizing dunes and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia fimbriata var. perangusta was mainly introduced to South Australia for its ornamental value and hardy nature. It is commonly found in coastal and sandy soils, thriving in well-drained conditions. This variety is often used in landscaping due to its attractive foliage and ability to withstand drought. However, it has also been reported to spread beyond cultivated areas, potentially impacting native vegetation. Its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
