{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella painteri var. painteri",
    "plant_slug": "acaciella-painteri-var-painteri",
    "plant_name_scientific": "acaciella painteri var. painteri",
    "intro": "Acaciella painteri var. painteri, commonly known as the Painted Acacia, is a shrub native to the arid regions of South America. It features small, bright yellow flowers that are clustered in dense inflorescences, adding a striking visual contrast to its foliage. The leaves are bipinnate, consisting of multiple pairs of tiny leaflets, which help reduce water loss in its dry habitat. It thrives in well-drained soils and requires full sun exposure to flourish. This plant is often cultivated for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella painteri"
    },
    "taxonomy_art_desc": "Acaciella painteri var. painteri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which includes ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Fabales, which consists of flowering plants with distinctive flowers and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acaciella, a group of flowering plants typically found in arid environments, with small, often spiny leaves and yellow or white flowers. Its species is Acaciella painteri, a specific variety known for its unique morphological features and ecological adaptations to its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella painteri var. painteri is primarily native to Mexico Central, Mexico Northeast, Mexico Northwest, Mexico Southeast, and Mexico Southwest. This species is commonly found in the arid and semi-arid regions of these areas. It thrives in rocky soils and open habitats, often growing in scrublands and along rocky outcrops. The plant is well adapted to the dry climate and can survive with minimal water. It plays an important ecological role in its native range by providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acaciella painteri var. painteri was mainly introduced to South Africa, particularly in the coastal regions of the Eastern Cape. It is commonly found in areas with sandy soils and a subtropical climate. This plant is often cultivated in gardens and as a ornamental species due to its unique appearance. It has also been reported in some parts of Australia and New Zealand. However, its introduction to these regions has raised concerns about its potential impact on local ecosystems."
}
