{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia baileyana var. aurea",
    "plant_slug": "acacia-baileyana-var-aurea",
    "plant_name_scientific": "acacia baileyana var. aurea",
    "intro": "Acacia baileyana var. aurea, commonly known as the golden wattle, is a shrub native to Australia. It is characterized by its feathery, yellowish-green foliage and its iconic yellow flowers that bloom in winter. The plant has compound leaves with small, oval-shaped leaflets and produces small, pod-like fruits that contain seeds. It is well adapted to various soil types and is drought-tolerant once established. The golden wattle is also a symbol of Australia and is widely cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia baileyana var. aurea is primarily native to eastern Australia, specifically the coastal regions of New South Wales and southern Queensland. This variety is commonly found in sandy soils along the coastline, where it thrives in full sun. It is often seen in coastal dunes and open woodlands, adapting well to the salty and windy conditions of its native habitat. The plant is known for its golden foliage, which makes it a popular ornamental species. However, it is important to note that it is not native to any other region outside of this specific area in Australia.",
    "distribution_introduced_art_desc": "Acacia baileyana var. aurea was mainly introduced to ornamental horticulture and landscaping due to its attractive golden foliage and hardy nature. It is commonly used in gardens and public spaces for its aesthetic value and ability to thrive in various soil conditions. This variety is particularly popular in regions with mild climates where it can be grown as a decorative plant. Its introduction has expanded its range beyond its native habitat, making it a widely cultivated species. However, in some areas, it has been classified as an invasive species due to its rapid spread and ecological impact."
}
