{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oerfota var. erythraea",
    "plant_slug": "acacia-oerfota-var-erythraea",
    "plant_name_scientific": "acacia oerfota var. erythraea",
    "intro": "Acacia oerfota var. erythraea, commonly known as the Red Acacia, is a flowering plant native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often multi-branched shrub form and produces small, yellow, globular flowers. The plant has bipinnate leaves composed of numerous small leaflets, and it is adapted to arid environments. It is often used in traditional medicine and is also valued for its ornamental appeal. The species is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oerfota var. erythraea is primarily native to the Arabian Peninsula, particularly Saudi Arabia and Yemen. It is commonly found in arid and semi-arid regions, growing in rocky soils and coastal areas. This variety is adapted to hot, dry climates and can tolerate high salinity levels. It is often seen in coastal dunes and along the edges of deserts. The plant plays an important ecological role in stabilizing sandy soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia oerfota var. erythraea was mainly introduced to areas with dry, sandy soils and warm climates, typically found in coastal regions and arid zones. It is commonly found in parts of southern Africa, including South Africa, Namibia, and Botswana. This plant is often used for soil stabilization due to its deep root system and ability to thrive in poor soil conditions. It is also valued for its ornamental qualities, with its distinctive yellow flowers attracting pollinators. However, it has been noted to spread aggressively in some environments, raising concerns about its potential invasiveness."
}
