{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella suffrutescens",
    "plant_slug": "acaciella-suffrutescens",
    "plant_name_scientific": "acaciella suffrutescens",
    "intro": "Acaciella suffrutescens, commonly known as the red acacia, is a small shrub native to southern Africa. It is characterized by its dense, thorny stems and small, compound leaves that are often covered in a fine, white powder. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits containing several seeds. It thrives in arid and semi-arid environments, making it well adapted to drought conditions. Due to its hardy nature, it is often used in erosion control and as a source of fuelwood in its native region.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella suffrutescens is primarily native to southern Africa, specifically South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, including savannas and rocky outcrops. This plant thrives in well-drained soils and is adapted to withstand drought conditions. It is often seen growing along roadsides and in open woodlands. Its distribution is closely linked to the ecological zones characterized by low rainfall and high temperatures.",
    "distribution_introduced_art_desc": "Acaciella suffrutescens was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is commonly found in disturbed areas such as roadsides, farmlands, and along riverbanks. The plant spreads rapidly through its seeds, which are dispersed by wind, water, and animals. Its introduction has led to competition with native vegetation, affecting local biodiversity. Efforts are being made to control its spread through manual removal and herbicide application."
}
