{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia excelsa subsp. angusta",
    "plant_slug": "acacia-excelsa-subsp-angusta",
    "plant_name_scientific": "acacia excelsa subsp. angusta",
    "intro": "Acacia excelsa subsp. angusta, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, angular stems and narrow, feathery leaves that are typically grey-green in color. The plant produces yellow flowers in late winter to early spring, which are arranged in cylindrical spikes. It is adapted to arid and semi-arid environments, showing drought tolerance and resilience to poor soil conditions. The species is often used in revegetation projects due to its hardiness and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia excelsa"
    },
    "taxonomy_art_desc": "Acacia excelsa subsp. angusta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a distinct vascular system and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures and pollen types. Its order is Fabales, which consists of flowering plants that typically have legumes as fruits and are often nitrogen-fixing through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or bean family, which includes a wide variety of plants that are important for agriculture and ecological systems. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and horticulture. Its species is Acacia excelsa, a specific type of acacia that includes the subspecies angusta, which is characterized by its narrow leaves and specific geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia excelsa subsp. angusta is primarily native to New South Wales and Queensland. This subspecies is found in the eastern part of Australia, particularly in regions with a subtropical to temperate climate. It typically grows in open woodlands, dry sclerophyll forests, and along riverbanks. The plant is well adapted to the local environmental conditions of these areas. It plays an important role in the ecological balance of its native habitat.",
    "distribution_introduced_art_desc": "Acacia excelsa subsp. angusta was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the eastern and southern parts of the country. The plant thrives in sandy soils and is often seen along roadsides and in disturbed habitats. Its introduction has led to its spread beyond its original range, contributing to local vegetation changes. It is valued for its ornamental qualities and is sometimes used in reforestation projects."
}
