{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cuneiformis",
    "plant_slug": "acacia-cuneiformis",
    "plant_name_scientific": "acacia cuneiformis",
    "intro": "Acacia cuneiformis, commonly known as the narrow-leaf wattle, is a species of flowering plant in the legume family Fabaceae. It is native to Australia and is characterized by its slender, lance-shaped leaves and yellow flowers that bloom in spring. The plant is typically shrub-like, with a woody structure and thorny branches. It thrives in sandy or gravelly soils and is often found in coastal areas and dry regions. Acacia cuneiformis is valued for its ornamental appeal and its ability to fix nitrogen in the soil, making it beneficial for soil enrichment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cuneiformis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savannas and shrublands. This plant is well adapted to dry climates and can tolerate high temperatures and low rainfall. It plays an important ecological role by providing habitat and food for local wildlife. Its distribution is largely restricted to the southwestern and central parts of the continent.",
    "distribution_introduced_art_desc": "Acacia cuneiformis was mainly introduced to control soil erosion and as a source of fodder in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil conditions. The plant thrives in disturbed soils and is often used for land rehabilitation projects. Its introduction has helped stabilize degraded lands and improve soil structure. However, it is important to monitor its spread to prevent potential ecological imbalances."
}
