{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia joachimii",
    "plant_slug": "acacia-joachimii",
    "plant_name_scientific": "acacia joachimii",
    "intro": "Acacia joachimii, commonly known as the Joachim's wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow globular flower heads that bloom in spring, attracting pollinators such as bees and birds. It is adapted to arid and semi-arid environments, making it a resilient species in harsh conditions. Acacia joachimii is often used in ecological restoration due to its ability to fix nitrogen in the soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia joachimii is primarily native to northern Australia, particularly in the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions, growing in sandy soils and rocky outcrops. This species is well adapted to the harsh climatic conditions of the Australian outback. It is often seen in mulga woodlands and shrublands. Due to its resilience, it plays an important ecological role in these environments.",
    "distribution_introduced_art_desc": "Acacia joachimii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils along the eastern and southern coasts. The plant is often used for erosion control due to its hardy nature and ability to thrive in harsh conditions. However, it has also been reported to spread aggressively in some areas, raising concerns about its potential invasiveness. Despite its benefits, its distribution remains limited compared to other acacia species in the region."
}
