{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pallida",
    "plant_slug": "acacia-pallida",
    "plant_name_scientific": "acacia pallida",
    "intro": "Acacia pallida, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, wiry stems and delicate, feathery leaves that are often covered in a fine, silvery down. The plant produces yellow flowers in globular clusters, which bloom in late winter to early spring. Acacia pallida is adapted to arid and semi-arid environments, making it resilient to drought conditions. It plays an important ecological role by providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pallida is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the states of Western Australia, South Australia, and the Northern Territory. This plant thrives in sandy soils and is often associated with shrublands and open woodlands. It is well adapted to drought and high temperatures, making it a resilient species in its native habitat. Acacia pallida plays an important ecological role by providing shelter and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia pallida was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of timber and fuel. Its introduction has sometimes led to ecological concerns due to its ability to outcompete native species. Despite this, it remains an important component of certain ecosystems in its introduced range."
}
