{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia terminalis",
    "plant_slug": "acacia-terminalis",
    "plant_name_scientific": "acacia terminalis",
    "intro": "Acacia terminalis, commonly known as the coastal acacia, is a shrub or small tree native to coastal regions of southern Africa. It is characterized by its slender, often multi-branched stems and small, bipinnate leaves that are typically covered in a dense layer of fine hairs. The plant produces yellow globular flowers that bloom in late summer, followed by small, woody pods containing flat, brown seeds. It is well adapted to sandy soils and salt spray, making it a hardy species found in coastal dunes and sandy plains. Acacia terminalis plays a role in stabilizing dune ecosystems and provides habitat for various insects and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia terminalis"
    },
    "taxonomy_art_desc": "Acacia terminalis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive leaf structures and often used for timber or as ornamental plants. Its species is Acacia terminalis, a specific type of acacia found in certain regions, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [
        "Cape Provinces",
        "India",
        "Northern Provinces"
    ],
    "distribution_native_art_desc": "Acacia terminalis is primarily native to New South Wales, Tasmania, and Victoria. This species is commonly found in various habitats across these regions, including dry sclerophyll forests and grasslands. It thrives in areas with well-drained soils and is often seen in coastal and inland regions. The plant is known for its distinctive yellow flowers and is an important component of local ecosystems. Its distribution reflects its adaptability to the diverse climates and landscapes of southeastern Australia.",
    "distribution_introduced_art_desc": "Acacia terminalis was mainly introduced to the Cape Provinces, India, and Northern Provinces. It was likely brought in for its ornamental value and potential for soil stabilization. The plant thrives in arid and semi-arid environments, making it suitable for the climates of these regions. Its introduction has contributed to the biodiversity of these areas, though it requires careful management to prevent ecological imbalances. This distribution highlights its adaptability and utility in different geographical contexts."
}
