{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dura",
    "plant_slug": "acacia-dura",
    "plant_name_scientific": "acacia dura",
    "intro": "Acacia dura, commonly known as the hard acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its dense, thorny foliage and small, greenish-yellow flowers that bloom in clusters. The plant has small, elongated leaves that are often reduced to spines, which help reduce water loss in harsh environments. Its wood is hard and durable, making it valuable for construction and fuel. Acacia dura also plays a role in providing habitat and forage for wildlife in its native ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dura"
    },
    "taxonomy_art_desc": "Acacia dura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive bipinnate leaves and thorn-like structures. Its species is Acacia dura, a specific type of acacia known for its hardy nature and ability to thrive in arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dura is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the southern and central areas. This plant thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. It is well adapted to the hot and dry climate of its native habitat. Acacia dura plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia dura was mainly introduced to regions where it is used for its hard, durable wood and as a source of food for livestock. It is commonly found in arid and semi-arid areas, particularly in parts of Australia, Africa, and the Middle East. The plant has been introduced to new environments for agricultural and ecological purposes, often as a means of stabilizing soils and preventing erosion. However, its introduction has sometimes led to invasive growth, outcompeting native vegetation in certain areas. Despite its benefits, careful management is required to prevent ecological imbalances caused by its spread."
}
