{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bidentata var. pubescens",
    "plant_slug": "acacia-bidentata-var-pubescens",
    "plant_name_scientific": "acacia bidentata var. pubescens",
    "intro": "Acacia bidentata var. pubescens, commonly known as the silky acacia, is a shrub native to southern Africa. It is characterized by its slender, often multi-branched stems covered in fine, soft hairs. The leaves are bipinnate, with small, oval leaflets that give the plant a feathery appearance. It produces yellow, globular flowers that bloom in late winter to early spring. The plant is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bidentata var. pubescens is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in arid and semi-arid regions, often found in savannas and rocky outcrops. This variant is adapted to withstand drought and high temperatures, making it a resilient species in its native habitat. It is commonly found in open woodlands and along riverbanks in these regions. The plant plays an important ecological role by providing food and shelter for local wildlife.",
    "distribution_introduced_art_desc": "Acacia bidentata var. pubescens was mainly introduced to South Africa, where it has been widely cultivated for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides, particularly in the Western and Eastern Cape provinces. The plant is well adapted to sandy soils and can tolerate drought, making it a popular choice for landscaping in semi-arid regions. Its distinctive bipinnate leaves and yellow flowers add aesthetic appeal, contributing to its popularity among horticulturists. However, it is important to monitor its spread to prevent potential invasiveness in native ecosystems."
}
