{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia umbellifera",
    "plant_slug": "acacia-umbellifera",
    "plant_name_scientific": "acacia umbellifera",
    "intro": "Acacia umbellifera, commonly known as the umbrella acacia, is a flowering plant native to Australia. It is characterized by its distinctive umbrella-like arrangement of small, yellowish flowers. The plant produces flat, compound leaves that are often covered in fine hairs. It thrives in arid and semi-arid environments, adapting well to drought conditions. Acacia umbellifera plays an important role in its ecosystem, providing food and shelter for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia umbellifera is primarily native to the eastern regions of Australia, including Queensland, New South Wales, and the Australian Capital Territory. It thrives in a variety of habitats such as forests, woodlands, and open grasslands. This species is commonly found in areas with well-drained soils and a temperate to subtropical climate. It plays an important ecological role by providing food and shelter for native wildlife. However, it is not widely distributed across the entire continent and is more localized in its natural range.",
    "distribution_introduced_art_desc": "Acacia umbellifera was mainly introduced to control erosion and for its ornamental value in certain regions. It is commonly found in disturbed soils and along roadsides where it thrives in sunny, dry conditions. However, its rapid growth and ability to form dense thickets have led to concerns about its invasiveness in some areas. The plant's introduction has had mixed ecological impacts, with some regions experiencing increased biodiversity while others face habitat displacement. Proper management is essential to balance its benefits and potential risks."
}
