{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ampliata",
    "plant_slug": "acacia-ampliata",
    "plant_name_scientific": "acacia ampliata",
    "intro": "Acacia ampliata, commonly known as the broadleaf acacia, is a shrub or small tree native to the arid and semi-arid regions of southern Africa. It is characterized by its compound leaves, which are often bipinnate and covered in fine hairs, providing a silvery appearance. The plant produces yellow to golden flowers arranged in dense, globular clusters, which are highly attractive to pollinators such as bees and birds. Its seeds are encased in pods that split open to release the seeds, aiding in its dispersal. Acacia ampliata is well adapted to drought conditions, making it a resilient species in harsh environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ampliata"
    },
    "taxonomy_art_desc": "Acacia ampliata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient lineages with diverse morphological adaptations. Its order is Fabales, which comprises plants with characteristic flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, recognized for their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees found primarily in Africa and Australia, known for their acicular leaves and often used for timber or in traditional medicine. Its species is Acacia ampliata, a specific type of acacia characterized by its broad leaves and yellow flowers, typically found in arid or semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ampliata is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the Stirling Range. This plant thrives in sandy soils and is often associated with open woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia ampliata plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia ampliata was mainly introduced to areas with warm, dry climates and well-drained soils, often as an ornamental or for soil stabilization. It thrives in regions with full sun exposure and is commonly found in coastal and inland arid environments. The plant has been introduced to several parts of the world, including the Mediterranean, South Africa, and parts of Australia. Its rapid growth and adaptability have led to its spread in some non-native regions. However, it is considered invasive in certain areas where it outcompetes native vegetation."
}
