{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella salvadorensis",
    "plant_slug": "acaciella-salvadorensis",
    "plant_name_scientific": "acaciella salvadorensis",
    "intro": "Acaciella salvadorensis, commonly known as the Salvadoran acacia, is a small shrub native to El Salvador. It belongs to the Fabaceae family, which includes legumes and is characterized by its compound leaves and pod fruits. The plant typically grows in dry, rocky soils and is adapted to arid and semi-arid environments. It produces small, yellow flowers that attract pollinators such as bees and butterflies. Due to its limited distribution and habitat specificity, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella salvadorensis is primarily native to El Salvador. It is found in the dry, tropical regions of the country, particularly in the central and western areas. This plant thrives in rocky and sandy soils, often growing in dry forests and scrublands. Its distribution is limited to specific microhabitats within El Salvador. It is an endemic species, meaning it is not found naturally anywhere else in the world.",
    "distribution_introduced_art_desc": "Acaciella salvadorensis was mainly introduced to areas with disturbed soils and degraded habitats, particularly in Central America. It is commonly found in dry, open forests and along roadsides where it can establish quickly. This plant is often used for soil stabilization due to its rapid growth and deep root system. However, its introduction has led to concerns about its potential invasiveness in some regions. It is important to monitor its spread to prevent ecological disruption."
}
