{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sclerophylla var. longifolia",
    "plant_slug": "acacia-sclerophylla-var-longifolia",
    "plant_name_scientific": "acacia sclerophylla var. longifolia",
    "intro": "Acacia sclerophylla var. longifolia, commonly known as the long-leaved wattle, is a shrub native to the coastal regions of southern Australia. It is characterized by its narrow, linear leaves that are often covered in fine hairs, giving it a silvery appearance. The plant produces yellow flowers in winter, which are clustered in cylindrical inflorescences. It is adapted to sandy soils and can tolerate salt spray, making it well-suited for coastal environments. Its ecological importance includes providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sclerophylla var. longifolia is primarily native to the southwestern regions of Western Australia. It is commonly found in the areas of the Geraldton and Shark Bay regions. This plant typically grows in sandy soils and is adapted to the arid and semi-arid environments of its native range. It is often found in coastal dunes and open woodlands. Its distribution is limited to specific ecological zones within its native habitat.",
    "distribution_introduced_art_desc": "Acacia sclerophylla var. longifolia was mainly introduced to regions with Mediterranean climates characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is often found in coastal areas and disturbed sites. This plant is commonly used in horticulture for its ornamental value and drought tolerance. It has been introduced to parts of California, Oregon, and the Pacific Northwest in the United States. However, it can become invasive in certain environments if not managed properly."
}
