{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia welwitschii subsp. delagoensis",
    "plant_slug": "acacia-welwitschii-subsp-delagoensis",
    "plant_name_scientific": "acacia welwitschii subsp. delagoensis",
    "intro": "Acacia welwitschii subsp. delagoensis, commonly known as the Delagoa acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are typically reduced to small, scale-like structures. The plant produces yellow to orange spherical pods that contain several seeds. It is well adapted to arid and semi-arid environments, showing drought tolerance and deep root systems. This subspecies is also valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia welwitschii subsp. delagoensis is primarily native to southern Africa, specifically countries such as Angola, Namibia, Botswana, and parts of Zimbabwe. It thrives in arid and semi-arid regions, often found in savannas and rocky outcrops. This subspecies is well adapted to dry climates and can tolerate poor soil conditions. It is commonly found in woodland areas and along riverbanks in its native range. The plant plays an important ecological role in its habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia welwitschii subsp. delagoensis was mainly introduced to South Africa, where it has been widely planted for its hardy nature and ornamental value. It is commonly found in urban landscapes, along roadsides, and in agricultural areas due to its ability to thrive in poor soils. The plant is also used for erosion control and as a source of firewood in some regions. However, its introduction has led to concerns about its potential invasiveness in certain ecosystems. Despite its benefits, careful management is recommended to prevent unintended environmental impacts."
}
