{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ornithophora",
    "plant_slug": "acacia-ornithophora",
    "plant_name_scientific": "acacia ornithophora",
    "intro": "Acacia ornithophora, commonly known as the black wattle, is a shrub or small tree native to eastern Australia. It is characterized by its dark, fissured bark and compound leaves that are alternate and pinnate. The plant produces yellow flowers in globular clusters, which are followed by woody pods containing flattened seeds. It thrives in a variety of soil types but prefers well-drained conditions. Acacia ornithophora is often used in horticulture for its ornamental value and is also valued for its historical use in the production of tannin.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ornithophora is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in arid and semi-arid regions, often found in savannas and woodland areas. This species is well adapted to dry climates and can tolerate poor soil conditions. It is commonly seen growing along roadsides and in open habitats. Acacia ornithophora plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia ornithophora was mainly introduced to stabilize soil and prevent erosion in degraded lands. It is commonly found in arid and semi-arid regions where it thrives in poor soils. The plant is also valued for its ability to provide shade and forage for livestock. Its introduction has helped in restoring ecological balance in certain areas. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
