{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia calcarata",
    "plant_slug": "acacia-calcarata",
    "plant_name_scientific": "acacia calcarata",
    "intro": "Acacia calcarata, commonly known as the sand acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive yellow flowers and bipinnate leaves that are often covered in fine hairs. The plant thrives in arid and semi-arid environments, making it well adapted to dry conditions. It has small, spiny stipules that help protect the plant from herbivores. Acacia calcarata is also known for its ability to fix nitrogen, which improves soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia calcarata"
    },
    "taxonomy_art_desc": "Acacia calcarata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with a single carpel and include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their unique phyllodes and often used in traditional medicine and land restoration. Its species is Acacia calcarata, a specific type of acacia found in certain regions, recognized by its distinctive morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia calcarata is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the southern and western parts of the state. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the dry climate and can withstand periods of drought. Acacia calcarata plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia calcarata was mainly introduced to stabilize soil and prevent erosion in areas with poor soil quality. It is commonly used in reforestation projects due to its ability to thrive in harsh environmental conditions. This plant has been introduced to several regions in Australia, including Western Australia and South Australia. Its rapid growth and deep root system make it an effective choice for land rehabilitation. However, it can become invasive if not managed properly."
}
