{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica subsp. tomentosa",
    "plant_slug": "acacia-nilotica-subsp-tomentosa",
    "plant_name_scientific": "acacia nilotica subsp. tomentosa",
    "intro": "Acacia nilotica subsp. tomentosa, commonly known as the white acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its pale yellow to white flowers, which appear in compact globular clusters. The plant has phyllodes, which are flattened, modified leaf stems that perform the function of leaves. It thrives in arid and semi-arid environments, often growing in sandy or rocky soils. The plant is also valued for its timber and has traditional uses in various cultural practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica subsp. tomentosa is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of the Arabian Peninsula, particularly in Yemen and Oman. This subspecies thrives in arid and semi-arid regions, often growing in rocky soils and along riverbanks. It is commonly found in savannas and woodland areas where it plays a significant ecological role. Its distribution extends into northern parts of Sudan and southern regions of Saudi Arabia.",
    "distribution_introduced_art_desc": "Acacia nilotica subsp. tomentosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in semi-arid and arid areas, particularly in the western and northern parts of the country. The plant is often associated with disturbed habitats such as roadsides, agricultural fields, and riverbanks. Due to its rapid growth and ability to thrive in poor soil conditions, it has spread beyond its original introduction sites. However, its invasive potential remains a concern in some ecological contexts."
}
