{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia daemon",
    "plant_slug": "acacia-daemon",
    "plant_name_scientific": "acacia daemon",
    "intro": "Acacia daemon, commonly known as the black wattle, is a species of acacia native to Australia. It is characterized by its dark, woody pods and compound leaves with small, pointed leaflets. The plant produces yellow flowers that bloom in late winter to early spring. It thrives in a variety of soil types but prefers well-drained soils. Acacia daemon is often used in horticulture and is also valued for its hard, durable wood.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia daemon is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as South Africa, Namibia, and Botswana. It thrives in sandy or rocky soils and is commonly found in savannas and shrublands. This plant is well adapted to dry climates and can survive with minimal rainfall. It plays an important ecological role by providing habitat and food for various local wildlife species. Its distribution is largely restricted to these specific geographic areas due to its environmental requirements.",
    "distribution_introduced_art_desc": "Acacia daemon was mainly introduced to areas with a warm, temperate climate and well-drained soils, where it can thrive and spread rapidly. It is often found in regions with low rainfall, making it a common invasive species in disturbed or degraded habitats. The plant's ability to fix nitrogen in the soil gives it a competitive advantage over native vegetation. Its introduction has led to the displacement of native flora in several ecosystems across Australia and parts of Southeast Asia. Due to its rapid growth and seed dispersal mechanisms, it poses a significant threat to biodiversity and land management efforts."
}
