{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pendula var. glabrata",
    "plant_slug": "acacia-pendula-var-glabrata",
    "plant_name_scientific": "acacia pendula var. glabrata",
    "intro": "Acacia pendula var. glabrata, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, drooping branches and small, feathery leaves that are often covered in fine, silky hairs. The plant produces yellow flowers in globular clusters, which are highly attractive to bees and other pollinators. Its wood is lightweight and has been used traditionally for making tools and crafts. The species is also valued in horticulture for its ornamental appeal and ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pendula var. glabrata is primarily native to the semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy or gravelly soils and is commonly found in open woodlands and shrublands. This variety is adapted to hot, dry climates and can tolerate periods of drought. It is often seen growing along riverbanks and in coastal areas where it benefits from slightly more moisture. Its distribution is closely linked to the availability of well-drained soils and sufficient sunlight.",
    "distribution_introduced_art_desc": "Acacia pendula var. glabrata was mainly introduced to stabilize sand dunes and prevent soil erosion in coastal and arid regions. It is commonly used in reclamation projects due to its ability to thrive in harsh environmental conditions. This plant is also valued for its rapid growth and ability to provide shade and habitat for local wildlife. Its introduction has helped in restoring degraded lands along the coasts of Australia and parts of Southeast Asia. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
