{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dermatophylla",
    "plant_slug": "acacia-dermatophylla",
    "plant_name_scientific": "acacia dermatophylla",
    "intro": "Acacia dermatophylla, commonly known as the narrow-leaf wattle, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its slender, often twisted stems and small, narrow leaves that are typically covered in a fine layer of white hair. The plant produces yellow flowers in globular clusters, which are highly attractive to nectar-feeding birds and insects. Acacia dermatophylla is well adapted to drought conditions, with deep root systems that allow it to survive in poor soil and low rainfall environments. Its ecological importance includes providing habitat and food for various native fauna.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dermatophylla"
    },
    "taxonomy_art_desc": "Acacia dermatophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, often exhibiting primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, characterized by their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic phyllodes and often used in various ecological and commercial contexts. Its species is Acacia dermatophylla, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dermatophylla is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy soils and is often seen in coastal and inland areas. It is well adapted to the dry and arid conditions of its native habitat. Acacia dermatophylla is an important component of the local flora in Western Australia.",
    "distribution_introduced_art_desc": "Acacia dermatophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, thriving in sandy soils and coastal areas. This plant is often used for erosion control due to its hardy nature and ability to withstand harsh environmental conditions. However, its invasive potential has raised concerns among local conservationists. Its distribution highlights the ecological impact of introduced species in native ecosystems."
}
