{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia patagiata",
    "plant_slug": "acacia-patagiata",
    "plant_name_scientific": "acacia patagiata",
    "intro": "Acacia patagiata, commonly known as the narrow-leaf acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its slender, often twisted branches and narrow, phyllodes that are typically gray-green in color. The plant produces small yellow flowers clustered in globular inflorescences, which are followed by flat, pod-like fruits containing seeds. Acacia patagiata is well adapted to drought conditions, with deep root systems and a capacity for resprouting after fire or grazing. It plays an important role in stabilizing soils and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia patagiata"
    },
    "taxonomy_art_desc": "Acacia patagiata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive umbrella-like acorn-shaped pods and often used in traditional medicine. Its species is Acacia patagiata, a specific type of acacia found in certain regions, adapted to its local environment with specific morphological and physiological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia patagiata is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in arid and semi-arid environments, often growing in sandy soils. It is a hardy shrub that is well adapted to the harsh climate of the region. Acacia patagiata plays an important role in the local ecosystem and is often used in ecological restoration projects.",
    "distribution_introduced_art_desc": "Acacia patagiata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and sandy areas, particularly in the Western and Eastern Cape provinces. The plant is often used for soil stabilization due to its deep root system and ability to thrive in poor soils. It has also been introduced to other parts of the world, including Australia and some islands in the Pacific. However, its spread is limited by its specific environmental requirements and climatic conditions."
}
