{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obscura",
    "plant_slug": "acacia-obscura",
    "plant_name_scientific": "acacia obscura",
    "intro": "Acacia obscura, commonly known as the black wattle, is a shrub or small tree native to Australia. It is characterized by its dark, fissured bark and small, leathery leaves. The plant produces yellow flowers in spikes, which are followed by flat, pod-like fruits. Acacia obscura is adapted to arid and semi-arid environments, showing resilience to drought. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obscura is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savannas and shrublands. This species is well adapted to drought conditions and can tolerate high temperatures. It plays an important ecological role by providing habitat and food for various animals. Acacia obscura is also known for its ability to fix nitrogen, which helps improve soil fertility in its native environment.",
    "distribution_introduced_art_desc": "Acacia obscura was mainly introduced to areas with dry, arid climates where it can thrive in poor soils. It is commonly found in regions with low rainfall and high temperatures, such as parts of Australia and the southwestern United States. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It also serves as a valuable source of browse for livestock and wildlife. However, its introduction has sometimes led to competition with native plant species in certain ecosystems."
}
