{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia meisneri var. angustifolia",
    "plant_slug": "acacia-meisneri-var-angustifolia",
    "plant_name_scientific": "acacia meisneri var. angustifolia",
    "intro": "Acacia meisneri var. angustifolia, commonly known as the narrow-leaf wattle, is a species of flowering plant in the legume family. It is native to Australia and is characterized by its slender, narrow leaves and yellow flowers. The plant is typically shrub-like, with a woody structure and bipinnate leaves. It thrives in well-drained soils and is often found in dry, open habitats. Acacia meisneri var. angustifolia is valued for its ornamental appeal and its ability to fix nitrogen in the soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia meisneri var. angustifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. This variety is commonly found in sandy soils and rocky outcrops, thriving in environments with low rainfall and high temperatures. It is often associated with savanna and shrubland habitats, where it plays a role in stabilizing soil and providing habitat for local wildlife. The plant is well adapted to drought conditions, making it a resilient species in its native range. Due to its hardy nature, it is sometimes cultivated in other regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acacia meisneri var. angustifolia was mainly introduced to ornamental horticulture and reforestation projects due to its attractive foliage and adaptability to various soil conditions. It is commonly found in regions with mild climates, where it serves as a decorative plant in gardens and parks. This variety is also valued for its ability to thrive in poor soils, making it useful for land stabilization and erosion control. However, its introduction has raised concerns about potential invasiveness in non-native environments. Despite these concerns, it remains a popular choice for landscaping and ecological restoration efforts."
}
