{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cyclops",
    "plant_slug": "acacia-cyclops",
    "plant_name_scientific": "acacia cyclops",
    "intro": "Acacia cyclops, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its distinctive silver-gray foliage, which consists of small, rounded phyllodes that are often covered in fine hairs. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, spherical inflorescences. Acacia cyclops is well adapted to arid and semi-arid environments, thriving in well-drained soils. It is also valued for its ornamental appeal and is sometimes used in landscaping due to its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cyclops"
    },
    "taxonomy_art_desc": "Acacia cyclops belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, which is characterized by the presence of pods as fruits and often forms symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and the production of legume-like pods. Its species is Acacia cyclops, a specific type of acacia known for its unique morphology and ecological adaptations, commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [
        "Azores",
        "California",
        "Canary Is.",
        "Cape Provinces",
        "Cyprus",
        "Ethiopia",
        "Morocco",
        "Namibia",
        "Northern Provinces",
        "Palestine",
        "Portugal",
        "Sicilia",
        "Spain",
        "St.Helena"
    ],
    "distribution_native_art_desc": "Acacia cyclops is primarily native to South Australia and Western Australia. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy soils and is often seen in coastal and inland areas. Acacia cyclops is well adapted to the harsh climate of these regions. It plays an important role in the local ecosystem and is a characteristic feature of the native vegetation in these areas.",
    "distribution_introduced_art_desc": "Acacia cyclops was mainly introduced to the Azores, California, Canary Is., Cape Provinces, Cyprus, Ethiopia, Morocco, Namibia, Northern Provinces, Palestine, Portugal, Sicilia, Spain, St. Helena. It has been widely established in these regions, often as an ornamental plant or for erosion control. The species is well adapted to arid and semi-arid environments, which explains its success in these diverse locations. However, it can become invasive in some areas, outcompeting native vegetation. Its distribution highlights its ecological flexibility and human-mediated spread across multiple continents."
}
