{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia quadrisulcata",
    "plant_slug": "acacia-quadrisulcata",
    "plant_name_scientific": "acacia quadrisulcata",
    "intro": "Acacia quadrisulcata, commonly known as the four-groove acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, multi-branched stems and bipinnate leaves that are finely divided. The plant produces small, yellowish-white flowers arranged in dense, cylindrical spikes. Its seed pods are slender and ribbed, containing numerous flattened seeds. Acacia quadrisulcata is adapted to arid and semi-arid environments, making it a resilient component of local flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia quadrisulcata"
    },
    "taxonomy_art_desc": "Acacia quadrisulcata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia quadrisulcata, a specific type of acacia known for its unique features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia quadrisulcata is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the northern and central parts. This species is often associated with sandy soils and is part of the diverse flora of the Australian desert ecosystems. It plays an important role in stabilizing soil and providing habitat for local wildlife. The plant is well adapted to the harsh climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia quadrisulcata was mainly introduced to control soil erosion and for its potential use in reforestation projects. It is commonly found in degraded lands and sandy soils where it can establish quickly. The plant is valued for its ability to thrive in harsh environments with minimal water requirements. It has been successfully introduced in several regions of Africa and parts of Asia. However, its invasive potential requires careful management to prevent ecological disruption."
}
