{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia redolens",
    "plant_slug": "acacia-redolens",
    "plant_name_scientific": "acacia redolens",
    "intro": "Acacia redolens, commonly known as the sweet acacia, is a species of flowering plant native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, multi-branched stems and feathery, bipinnate leaves. The plant produces yellow flowers in compact globular clusters, which are often visited by bees and other pollinators. Its wood is valued for its durability and is used in construction and furniture-making. Acacia redolens also has a long history of use in traditional medicine for its purported health benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia redolens"
    },
    "taxonomy_art_desc": "Acacia redolens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their acicular leaves and often globular or spiny fruit pods. Its species is Acacia redolens, a particular type of acacia known for its aromatic properties and its native habitat in certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [
        "Arizona",
        "California"
    ],
    "distribution_native_art_desc": "Acacia redolens is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in dry, sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia redolens plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia redolens was mainly introduced to Arizona and California. It was likely introduced for its ornamental value due to its attractive foliage and ability to thrive in arid conditions. The plant has since become naturalized in these regions, spreading through both seed dispersal and human activity. It is commonly found in disturbed soils and along roadsides. However, its introduction has raised concerns about its potential impact on native plant communities."
}
