{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lebbeck",
    "plant_slug": "acacia-lebbeck",
    "plant_name_scientific": "acacia lebbeck",
    "intro": "Acacia lebbeck, commonly known as the black acacia, is a deciduous tree native to South and Southeast Asia. It belongs to the Fabaceae family and is characterized by its compound leaves and yellow flowers. The tree produces flat, pod-like fruits that contain seeds surrounded by a fibrous pulp. It is often found in dry, tropical, and semi-arid regions, and it plays a significant role in soil stabilization and traditional medicine. Acacia lebbeck is also valued for its hard, durable wood and its ability to fix nitrogen, making it an important plant in ecological restoration.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lebbeck is primarily native to tropical and subtropical regions of Asia, including India, Sri Lanka, Bangladesh, and parts of Southeast Asia. It is commonly found in dry, semi-arid, and seasonally flooded areas, often growing in open woodlands and scrublands. This species thrives in regions with well-drained soils and is often associated with degraded or disturbed habitats. It plays an important ecological role by providing food and shelter for various wildlife species. Additionally, it is widely used in agroforestry and soil stabilization due to its hardy nature and rapid growth.",
    "distribution_introduced_art_desc": "Acacia lebbeck was mainly introduced to South Asia, Africa, and parts of the Pacific Islands. It was brought in for its rapid growth, which makes it useful for afforestation and soil stabilization. The plant is also valued for its hard wood and nitrogen-fixing ability, which benefits agricultural land. However, it has become invasive in some regions, outcompeting native species and altering local ecosystems. Its distribution is now widespread in tropical and subtropical areas where it thrives in disturbed soils."
}
