{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longispicata subsp. velutina",
    "plant_slug": "acacia-longispicata-subsp-velutina",
    "plant_name_scientific": "acacia longispicata subsp. velutina",
    "intro": "Acacia longispicata subsp. velutina, commonly known as the velvet acacia, is a shrub native to southern Africa. It is characterized by its dense, glandular foliage that gives it a velvety texture. The plant produces yellow flowers in globular or cylindrical inflorescences, which attract a variety of pollinators. Its seed pods are woody and contain edible seeds that are used in traditional cuisine. The species is adapted to arid and semi-arid environments, making it a resilient component of its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longispicata subsp. velutina is primarily native to southern Australia, including the states of South Australia, Victoria, and Western Australia. It is commonly found in dry sclerophyll forests and open woodlands. This subspecies thrives in regions with a Mediterranean climate, characterized by hot, dry summers and cool, wet winters. It is often associated with sandy or loamy soils and is well adapted to arid and semi-arid environments. The plant is an important component of the local flora and provides habitat and food for various native fauna.",
    "distribution_introduced_art_desc": "Acacia longispicata subsp. velutina was mainly introduced to South Australia for its ornamental value and ability to thrive in arid conditions. It is commonly found in coastal and semi-arid regions, where it forms dense shrubs or small trees. The subspecies is known for its distinctive yellow flowers and feathery foliage, making it a popular choice for landscaping. However, it has also been reported to naturalize in some areas, raising concerns about its potential impact on native vegetation. Its introduction has led to increased interest in its ecological role and management in invaded habitats."
}
