{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mooreana",
    "plant_slug": "acacia-mooreana",
    "plant_name_scientific": "acacia mooreana",
    "intro": "Acacia mooreana, commonly known as the Moore's wattle, is a shrub or small tree native to South Africa. It is characterized by its compound leaves, which are typically pinnate with small, oval-shaped leaflets. The plant produces yellow flowers in clusters, which are often visited by bees and other pollinators. Acacia mooreana is adapted to arid and semi-arid environments, making it drought-tolerant. It is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mooreana"
    },
    "taxonomy_art_desc": "Acacia mooreana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive umbrella-shaped flower heads. Its species is Acacia mooreana, a specific type of acacia found in southern Africa, known for its ecological importance and use in traditional medicine.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mooreana is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the areas around the Fitzgerald River National Park and the Augusta-Russell National Park. This plant typically grows in sandy or gravelly soils and is commonly found in open woodlands and heathlands. It is well adapted to the dry and often harsh conditions of its native habitat. Acacia mooreana plays an important role in the local ecosystem by providing food and shelter for various native animals.",
    "distribution_introduced_art_desc": "Acacia mooreana was mainly introduced to South Africa, where it has been widely planted for its ornamental value and ability to thrive in arid conditions. It is commonly found in gardens and along roadsides, particularly in the Western and Northern Cape provinces. The plant is well adapted to the local climate and requires minimal water, making it a popular choice for landscaping. However, its rapid growth and invasive potential have raised concerns about its impact on native vegetation. Despite these concerns, it remains a significant part of the introduced flora in the region."
}
