{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nivea",
    "plant_slug": "acacia-nivea",
    "plant_name_scientific": "acacia nivea",
    "intro": "Acacia nivea, commonly known as the snow acacia, is a flowering plant native to the mountainous regions of South America. It is characterized by its slender, branched stems and small, pale yellow to white flowers that bloom in clusters. The plant produces flat, globular pods that contain several seeds, which are dispersed by wind. Acacia nivea thrives in high-altitude environments with cool, moist conditions. Its foliage consists of bipinnate leaves, which are finely divided and give the plant a delicate appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia nivea"
    },
    "taxonomy_art_desc": "Acacia nivea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their acicular leaves and often used in traditional medicine. Its species is Acacia nivea, a specific type of acacia characterized by its white flowers and is typically found in specific habitats within its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nivea is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This species thrives in sandy soils and is often associated with coastal and inland dune environments. It plays an important ecological role in these habitats by providing shelter and food for native wildlife. Acacia nivea is well adapted to the arid and semi-arid conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia nivea was mainly introduced to New Zealand as part of ornamental horticulture due to its attractive white flowers and unique foliage. It has since spread beyond cultivated areas, establishing itself in native ecosystems, particularly in coastal and subalpine regions. The plant's rapid growth and ability to thrive in diverse soil conditions have contributed to its successful establishment. However, its introduction has raised concerns due to its potential to outcompete native flora in certain environments. Despite its aesthetic value, management strategies are being developed to control its spread and minimize ecological impacts."
}
