{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia melanochaetes",
    "plant_slug": "acacia-melanochaetes",
    "plant_name_scientific": "acacia melanochaetes",
    "intro": "Acacia melanochaetes, commonly known as the black wattle, is a shrub or small tree native to Australia. It is characterized by its dark, fissured bark and compound leaves with small, needle-like phyllodes. The plant produces yellow globular flowers that bloom in spring, followed by flat, woody pods. It thrives in a variety of soil types but prefers well-drained conditions. Acacia melanochaetes is often used in horticulture for its ornamental value and has historical significance in Australian ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia melanochaetes is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Mozambique. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This species thrives in well-drained soils and is often seen along roadsides and in open woodlands. It plays an important ecological role by providing habitat and food for various animals. Its distinctive yellow flowers make it a notable plant in its native environment.",
    "distribution_introduced_art_desc": "Acacia melanochaetes was mainly introduced to control soil erosion and for its potential use in land rehabilitation. It is commonly found in disturbed sites such as roadsides, mine spoils, and degraded soils. The plant is known for its rapid growth and ability to thrive in arid and semi-arid conditions. It has been used in reforestation projects due to its hardy nature and nitrogen-fixing capabilities. However, its introduction has also raised concerns about its potential to become invasive in certain ecosystems."
}
