{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia roemeriana",
    "plant_slug": "acacia-roemeriana",
    "plant_name_scientific": "acacia roemeriana",
    "intro": "Acacia roemeriana, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branched stems and bipinnate leaves composed of numerous small, oval leaflets. The plant produces yellow to orange globular inflorescences, which are highly attractive to pollinators such as bees and birds. Its seeds are enclosed in woody pods and are often used in traditional medicine. Acacia roemeriana is adapted to arid and semi-arid environments, making it a resilient component of local ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia roemeriana is primarily native to southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in arid and semi-arid regions, particularly in rocky outcrops and sandy soils. This plant thrives in environments with low rainfall and high temperatures, making it well adapted to the harsh conditions of its native habitat. It is often seen growing along roadsides, in savannas, and on mountain slopes. Due to its resilience, it plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia roemeriana was mainly introduced to stabilize soil and prevent erosion in degraded lands, particularly in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions and withstand drought. The plant is also valued for its nitrogen-fixing properties, which enhance soil fertility for other crops. Its rapid growth and dense foliage make it an effective choice for windbreaks and afforestation efforts. However, its introduction has sometimes led to ecological concerns due to its potential to become invasive in certain environments."
}
