{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia genistifolia subsp. attenuata",
    "plant_slug": "acacia-genistifolia-subsp-attenuata",
    "plant_name_scientific": "acacia genistifolia subsp. attenuata",
    "intro": "Acacia genistifolia subsp. attenuata, commonly known as the slender acacia, is a shrub native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often branching stems and small, yellow, globular flowers that appear in clusters. The leaves are bipinnate, consisting of numerous tiny, thread-like leaflets. It thrives in arid and semi-arid environments, often growing on rocky soils. The plant is valued for its ornamental appeal and has traditional uses in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia genistifolia"
    },
    "taxonomy_art_desc": "Acacia genistifolia subsp. attenuata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes, including many important agricultural crops. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in tropical and subtropical regions, known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia genistifolia, a specific type within the Acacia genus, which is further divided into subspecies like attenuata, and is characterized by its specific morphological traits and geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia genistifolia subsp. attenuata is primarily native to New South Wales and Victoria. This subspecies is commonly found in the southern regions of Australia, particularly in areas with dry to semi-arid climates. It thrives in sandy or loamy soils and is often seen in open woodlands and grasslands. The plant is well adapted to the local environmental conditions of these regions. It plays an important role in the local ecosystem by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia genistifolia subsp. attenuata was mainly introduced to areas with dry, sandy soils and a warm, arid climate. It is commonly found in regions of Australia, particularly in the southern and western parts of the country. This subspecies is often used for erosion control due to its hardy nature and ability to thrive in poor soil conditions. It has also been introduced to parts of Southeast Asia and the Mediterranean for ornamental and ecological purposes. However, its spread is limited by its specific environmental requirements and lack of widespread cultivation."
}
