{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cyperophylla var. cyperophylla",
    "plant_slug": "acacia-cyperophylla-var-cyperophylla",
    "plant_name_scientific": "acacia cyperophylla var. cyperophylla",
    "intro": "Acacia cyperophylla var. cyperophylla, commonly known as the coastal acacia, is a shrub native to southern Australia. It is characterized by its narrow, dark green leaves and yellow flowers that bloom in spring. The plant thrives in coastal and sandy soils, often growing in dunes or on rocky outcrops. It has a woody stem and is adapted to withstand salt spray and strong winds. This species is also known for its ability to fix nitrogen, making it beneficial for soil enrichment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cyperophylla"
    },
    "taxonomy_art_desc": "Acacia cyperophylla var. cyperophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and their ability to thrive in arid environments. Its species is Acacia cyperophylla, a specific variety within the Acacia genus that is notable for its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cyperophylla var. cyperophylla is primarily native to Northern Territory, Queensland, South Australia, and Western Australia. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. The species is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in supporting local wildlife and maintaining soil stability.",
    "distribution_introduced_art_desc": "Acacia cyperophylla var. cyperophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the western and southern parts of the country, particularly in the Western Cape and Overberg areas. This plant thrives in sandy soils and is often associated with fynbos vegetation. It is considered an invasive species in some areas due to its rapid growth and ability to outcompete native flora. Its introduction has raised concerns among conservationists due to its potential impact on local ecosystems."
}
