{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catechuoides",
    "plant_slug": "acacia-catechuoides",
    "plant_name_scientific": "acacia catechuoides",
    "intro": "Acacia catechuoides, commonly known as the Indian blackwood, is a small to medium-sized deciduous tree native to parts of India and Southeast Asia. It belongs to the Fabaceae family and is characterized by its slender, often thorned stems and bipinnate leaves. The plant produces small, yellowish-green flowers that are followed by elongated, pod-like fruits containing several seeds. Acacia catechuoides is valued for its hard, dark wood, which is used in traditional crafts and as a source of tannins. Its ecological role includes providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catechuoides is primarily native to the Indian subcontinent, including countries such as India, Nepal, Bhutan, and parts of Southeast Asia. It thrives in tropical and subtropical regions, often found in dry, open habitats like scrublands and forest edges. This species is commonly associated with dry deciduous forests and is well adapted to arid and semi-arid climates. It is also found in some areas of southern China and the Andaman Islands. The plant is known for its hardy nature and ability to withstand drought conditions.",
    "distribution_introduced_art_desc": "Acacia catechuoides was mainly introduced to areas with warm, dry climates and well-drained soils, often as a source of timber and traditional medicine. It is commonly found in regions of Southeast Asia, including parts of India, Thailand, and Indonesia. The plant thrives in tropical and subtropical environments, making it suitable for reforestation and agroforestry projects. Its introduction has sometimes led to ecological impacts due to its rapid growth and ability to outcompete native species. However, it remains an important economic and ecological resource in many regions."
}
