{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia detinens",
    "plant_slug": "acacia-detinens",
    "plant_name_scientific": "acacia detinens",
    "intro": "Acacia detinens, commonly known as the slender acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, multi-branched structure and small, paired leaves that are often covered in fine hairs. The plant produces yellow flowers in globular or cylindrical clusters, which are followed by long, slender pods containing seeds. Acacia detinens is well adapted to drought conditions, with deep roots and a waxy coating on its leaves to reduce water loss. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia detinens is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the states of Western Australia, South Australia, and Northern Territory. This species thrives in sandy soils and is often seen in mulga woodlands and shrublands. It is well adapted to the harsh climatic conditions of its native habitat. Acacia detinens plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia detinens was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the eastern coast, growing in sandy soils and coastal areas. This plant is often used for its hardy nature and ability to thrive in harsh environments. Its introduction has led to its spread beyond its original cultivation areas. However, it is not considered invasive in most regions where it is established."
}
