{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nefasia",
    "plant_slug": "acacia-nefasia",
    "plant_name_scientific": "acacia nefasia",
    "intro": "Acacia nefasia, commonly known as the desert wattle, is a shrub native to arid regions of Australia. It is characterized by its slender, often multi-branched stems and compound leaves that are reduced to small, needle-like phyllodes. The plant produces yellow, globular flower heads that bloom in spring, attracting pollinators such as bees and birds. Acacia nefasia is well adapted to harsh, dry environments, with deep root systems and a high tolerance for drought. Its ecological role includes providing habitat and food for native wildlife in its native range.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nefasia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and woodland habitats. This species is well adapted to dry climates and can withstand periods of drought. It plays an important ecological role by providing shelter and food for various animals. Acacia nefasia is also known for its distinctive yellow flowers and its ability to fix nitrogen in the soil.",
    "distribution_introduced_art_desc": "Acacia nefasia was mainly introduced to areas with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soil conditions. It is commonly found in regions of Australia, particularly in the southern and western parts of the continent. This plant has been introduced to various parts of the world, including parts of Africa and the Middle East, for its potential use in land rehabilitation and as a source of timber. Its rapid growth and adaptability make it a popular choice for reforestation projects in degraded landscapes. However, it can become invasive in some environments if not properly managed."
}
