{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia luederitzii",
    "plant_slug": "acacia-luederitzii",
    "plant_name_scientific": "acacia luederitzii",
    "intro": "Acacia luederitzii, commonly known as the Luederitz acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its slender, often thornless stems and bipinnate leaves that are feathery in appearance. The plant produces yellow globular flowers in late summer, which are followed by flat, pod-like fruits containing seeds. It thrives in arid and semi-arid environments, often found in rocky soils and along riverbanks. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia luederitzii is primarily native to southern Africa, specifically Namibia and South Africa. It is commonly found in the arid and semi-arid regions of these countries. This plant thrives in sandy soils and is often associated with the Namib Desert and other dry landscapes. It is well adapted to harsh environmental conditions, including high temperatures and low rainfall. Acacia luederitzii plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia luederitzii was mainly introduced to South Africa, particularly in the arid and semi-arid regions of the Northern Cape and Western Cape provinces. It is commonly found in rocky outcrops, sand dunes, and along riverbanks, where it thrives in well-drained soils. This plant is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays a significant role in stabilizing soils and providing habitat for various wildlife species. Due to its resilience, it has become an important component of the local vegetation in these regions."
}
