{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ramosissima",
    "plant_slug": "acacia-ramosissima",
    "plant_name_scientific": "acacia ramosissima",
    "intro": "Acacia ramosissima, commonly known as the screwpod acacia, is a shrub or small tree native to Australia. It is characterized by its dense, branching structure and phyllodes that are often twisted or coiled, giving it its common name. The plant produces yellow flowers in late winter to early spring, followed by distinctive pod-like fruits that are spiral-shaped. It is adapted to arid and semi-arid environments, making it a resilient species in harsh conditions. Acacia ramosissima is also known for its ability to fix nitrogen, which enriches the soil and supports other plant life.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ramosissima is primarily native to the arid and semi-arid regions of North America, particularly in the southwestern United States and northwestern Mexico. It is commonly found in areas with well-drained soils, such as plains, valleys, and rocky slopes. This plant thrives in environments with low precipitation and high temperatures, making it well adapted to desert and steppe ecosystems. It is often seen growing along roadsides, in open woodlands, and on disturbed sites. Due to its hardy nature, it plays an important ecological role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia ramosissima was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the eastern coast, thriving in coastal and sandy soils. The plant is often cultivated for its ornamental value and is used in landscaping due to its hardy nature. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasive behavior. Its introduction has led to discussions about ecological impacts in local ecosystems."
}
