{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rufobrunnea",
    "plant_slug": "acacia-rufobrunnea",
    "plant_name_scientific": "acacia rufobrunnea",
    "intro": "Acacia rufobrunnea, commonly known as the red-brown acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and small, yellowish-green leaves that are usually clustered at the ends of the stems. The plant produces yellow flowers in globular inflorescences, which are followed by long, flat, woody pods. Acacia rufobrunnea is adapted to arid and semi-arid environments, making it a hardy species often found in savannas and rocky areas. It is also valued for its role in traditional medicine and as a source of timber and fodder.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rufobrunnea is primarily native to eastern and southern Africa, including countries such as Tanzania, Kenya, Uganda, and South Africa. It is commonly found in savannas, woodlands, and along riverbanks in these regions. This species thrives in areas with well-drained soils and a tropical or subtropical climate. It is often associated with dry and semi-arid environments, where it plays an important ecological role. Acacia rufobrunnea is also known for its hardy nature and ability to withstand drought conditions.",
    "distribution_introduced_art_desc": "Acacia rufobrunnea was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in dry, sandy soils across arid and semi-arid regions. The plant is valued for its hardy nature and ability to thrive in poor soil conditions. It has been introduced in several countries for land rehabilitation and as an ornamental species. However, its spread can sometimes lead to the displacement of native vegetation if not managed properly."
}
