{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lebbekoides",
    "plant_slug": "acacia-lebbekoides",
    "plant_name_scientific": "acacia lebbekoides",
    "intro": "Acacia lebbekoides, commonly known as the narrow-leaf acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It features slender, often thornless stems and compound leaves with small, oval-shaped leaflets. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits containing seeds. Acacia lebbekoides is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. It is often used in traditional medicine and for its hard, durable wood.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lebbekoides is primarily native to the tropical regions of Africa, particularly in countries such as Sudan, South Sudan, and parts of the Democratic Republic of the Congo. It thrives in dry, savanna-like environments and is commonly found in areas with seasonal rainfall. This species is well adapted to arid and semi-arid climates, often growing in open woodlands and along riverbanks. It plays an important ecological role by providing habitat and food for various wildlife species. Due to its hardy nature, it is also sometimes cultivated in regions with similar climatic conditions.",
    "distribution_introduced_art_desc": "Acacia lebbekoides was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and adequate sunlight. It has been widely planted in parts of Africa, Asia, and the Pacific for its hardy nature and ability to thrive in degraded soils. This species is often used for agroforestry, erosion control, and as a source of timber and fodder. However, its rapid growth and invasive potential have raised concerns in some regions where it outcompetes native vegetation. Despite its benefits, careful management is required to prevent ecological imbalances."
}
