{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sieberiana f. nefasia",
    "plant_slug": "acacia-sieberiana-f-nefasia",
    "plant_name_scientific": "acacia sieberiana f. nefasia",
    "intro": "Acacia sieberiana f. nefasia, commonly known as the slender acacia, is a shrub or small tree native to tropical Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow to orange spherical pods that contain flattened, winged seeds. It thrives in well-drained soils and is often found in savanna and woodland habitats. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sieberiana f. nefasia is primarily native to the savannas and woodland areas of sub-Saharan Africa. It is found in countries such as Sudan, South Sudan, Ethiopia, and parts of the Democratic Republic of the Congo. This subspecies thrives in regions with a tropical or subtropical climate and well-drained soils. It is commonly associated with dry and semi-arid environments. Its distribution is closely linked to the natural vegetation patterns of the African savanna ecosystem.",
    "distribution_introduced_art_desc": "Acacia sieberiana f. nefasia was mainly introduced to areas with a tropical or subtropical climate, characterized by warm temperatures and seasonal rainfall. It thrives in well-drained soils and is commonly found in savannas and open woodlands. This plant is often used for its hardy nature and ability to stabilize soil, making it valuable in reforestation efforts. Its introduction has also been associated with ornamental purposes due to its distinctive foliage. However, it can become invasive in certain regions if not managed properly."
}
