{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia uliginosa",
    "plant_slug": "acacia-uliginosa",
    "plant_name_scientific": "acacia uliginosa",
    "intro": "Acacia uliginosa, commonly known as the swamp acacia, is a shrub native to wetland habitats in Australia. It is characterized by its dense, spiny foliage and small, yellow flowers that appear in clusters. The plant thrives in poorly drained soils and is often found in swampy or seasonally flooded areas. Its leaves are typically narrow and have a leathery texture, while its bark is rough and fissured. Acacia uliginosa plays an important role in stabilizing soil and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia uliginosa"
    },
    "taxonomy_art_desc": "Acacia uliginosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and showy petals, often associated with nitrogen-fixing symbiosis. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive umbrella-like acacia flowers and often used in traditional medicine. Its species is Acacia uliginosa, a specific type of acacia that is adapted to wetland environments and is found in various parts of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia uliginosa is primarily native to Western Australia. It is commonly found in swampy and wetland areas within the region. This plant thrives in moist, poorly drained soils, often near rivers or in coastal zones. It is an important component of the local flora in these environments. Its distribution is largely restricted to the western part of the state.",
    "distribution_introduced_art_desc": "Acacia uliginosa was mainly introduced to wetland and swamp areas where it can thrive in moist, poorly drained soils. It is commonly found in regions with high humidity and frequent waterlogging. This plant has been introduced to several parts of the world, including North America and Europe, often as an ornamental or for erosion control. However, it can become invasive in some environments, outcompeting native vegetation. Its distribution is largely influenced by its ability to tolerate waterlogged conditions and its rapid growth rate."
}
