{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennata subsp. hainanensis",
    "plant_slug": "acacia-pennata-subsp-hainanensis",
    "plant_name_scientific": "acacia pennata subsp. hainanensis",
    "intro": "Acacia pennata subsp. hainanensis, commonly known as Hainan acacia, is a shrub or small tree native to southern China. It is characterized by its slender, branching structure and phyllodes that are typically straight or slightly curved. The plant produces yellow flowers in globular or cylindrical inflorescences, which bloom during the summer months. Its leaves are modified into phyllodes, a common feature in the genus Acacia, reducing water loss in arid environments. This subspecies is adapted to tropical and subtropical climates and is often found in open forests or along coastal areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennata subsp. hainanensis is primarily native to southern China, specifically the island of Hainan. It is found in the tropical and subtropical regions of this area, particularly in lowland and hill forests. This subspecies thrives in humid climates with well-drained soils. It is commonly found in secondary growth forests and along riverbanks. Its native distribution is largely restricted to Hainan, where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acacia pennata subsp. hainanensis was mainly introduced to China, particularly in the southern provinces such as Hainan, Guangdong, and Guangxi. It is commonly found in lowland areas with well-drained soils and is often used for ornamental purposes due to its attractive foliage and ability to thrive in tropical and subtropical climates. This subspecies is also valued for its role in soil stabilization and as a source of timber. It has been introduced to various ecological restoration projects to enhance biodiversity and prevent soil erosion. However, its introduction has raised concerns about potential invasiveness in non-native environments."
}
