{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macmurphyi",
    "plant_slug": "acacia-macmurphyi",
    "plant_name_scientific": "acacia macmurphyi",
    "intro": "Acacia macmurphyi, commonly known as the MacMurphy's acacia, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, woody stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense inflorescences. Its seeds are encased in tough, pod-like structures that release them when dried. Acacia macmurphyi is adapted to survive in harsh, dry conditions with minimal water availability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macmurphyi is primarily native to the eastern and southern regions of Australia. It is commonly found in arid and semi-arid environments, particularly in the states of Queensland, New South Wales, and South Australia. This species thrives in sandy soils and is often associated with shrublands and woodlands. It is well adapted to dry conditions and can tolerate periods of drought. Acacia macmurphyi plays an important ecological role in stabilizing soil and providing habitat for native fauna.",
    "distribution_introduced_art_desc": "Acacia macmurphyi was mainly introduced to the data as a rare and unique species with specific ecological preferences. It is characterized by its distinctive foliage and ability to thrive in arid environments. The plant's introduction is noted for its potential role in soil stabilization and biodiversity enhancement. However, its distribution remains limited due to specific habitat requirements. This data highlights the importance of conserving such species in their native ecosystems."
}
