{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia retivenea subsp. clandestina",
    "plant_slug": "acacia-retivenea-subsp-clandestina",
    "plant_name_scientific": "acacia retivenea subsp. clandestina",
    "intro": "Acacia retivenea subsp. clandestina, commonly known as the secret acacia, is a shrub native to parts of southern Africa. It is characterized by its narrow, elongated leaves and yellow flowers that appear in clusters. The plant is adapted to arid environments, with a deep root system that allows it to survive in dry conditions. Its small, pod-like fruits contain seeds that are dispersed by wind. Due to its limited distribution and habitat specificity, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia retivenea"
    },
    "taxonomy_art_desc": "Acacia retivenea subsp. clandestina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a group of shrubs and trees known for their characteristic thorned stems and compound leaves. Its species is Acacia retivenea, a specific type of acacia that is further divided into subspecies, with subsp. clandestina being a lesser-known variant.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia retivenea subsp. clandestina is primarily native to Western Australia. This subspecies is typically found in the southern and western regions of the state. It grows in arid and semi-arid environments, often in sandy or rocky soils. The plant is well adapted to the harsh climatic conditions of its native range. It is commonly found in shrublands and open woodlands.",
    "distribution_introduced_art_desc": "Acacia retivenea subsp. clandestina was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, particularly in areas with sandy soils and coastal conditions. This subspecies is often associated with disturbed habitats, including roadsides and abandoned farmlands. Its introduction has raised concerns due to its potential for invasiveness in native ecosystems. Despite its ornamental value, it is important to monitor its spread to prevent ecological disruption."
}
