{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia areolata",
    "plant_slug": "acacia-areolata",
    "plant_name_scientific": "acacia areolata",
    "intro": "Acacia areolata, commonly known as the woolly acacia, is a shrub native to arid regions of Australia. It is characterized by its dense, feathery foliage and yellow flowers that bloom in winter. The plant has small, pod-like fruits that contain seeds, which are dispersed by wind. Its leaves are covered in fine, white hairs, giving it a woolly appearance. Acacia areolata is adapted to survive in harsh, dry environments with low rainfall.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia areolata"
    },
    "taxonomy_art_desc": "Acacia areolata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia areolata, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia areolata is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the Geraldton and Shark Bay areas. This plant typically grows in sandy soils and is often found in coastal and inland regions. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia areolata plays an important role in the local ecosystems by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia areolata was mainly introduced to areas with arid and semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of fodder for livestock. Its introduction has also been noted in some parts of Southeast Asia and the Middle East. Due to its adaptability, it has become an important component of ecological restoration projects in these regions."
}
