{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia puccioniana",
    "plant_slug": "acacia-puccioniana",
    "plant_name_scientific": "acacia puccioniana",
    "intro": "Acacia puccioniana, commonly known as the red acacia, is a small evergreen shrub native to the Mediterranean region. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant is adapted to dry, sunny environments and is often found in rocky soils. Its seeds are encased in a hard pod, which splits open to release the seeds when mature. Acacia puccioniana is valued for its ornamental appeal and ability to thrive in coastal and arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia puccioniana is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. It thrives in sandy soils and is commonly found in coastal dunes and inland sandplains. This species is well adapted to hot, dry climates and can withstand periods of drought. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. Acacia puccioniana is also sometimes cultivated in other parts of the world for its ornamental value and hardy nature.",
    "distribution_introduced_art_desc": "Acacia puccioniana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and has spread to other parts of the country. The plant thrives in coastal areas and is often seen along the shores of False Bay. It is known for its ability to tolerate saline and sandy soils, making it adaptable to coastal environments. However, its invasive potential has raised concerns among local conservationists."
}
