{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia insularis",
    "plant_slug": "acacia-insularis",
    "plant_name_scientific": "acacia insularis",
    "intro": "Acacia insularis, commonly known as the Socotra acacia, is a unique flowering plant native to the island of Socotra. It is characterized by its distinctive, umbrella-shaped crown and feathery, bipinnate leaves. The plant produces small, yellow, globular flowers that bloom in clusters. Acacia insularis is adapted to the arid climate of its native habitat, with deep roots that help it survive in dry conditions. It is also notable for its role in the local ecosystem and its historical significance in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia insularis is primarily native to the island of Socotra, located in the Arabian Sea. It is found in the arid and semi-arid regions of the island, particularly in rocky and coastal areas. This plant thrives in the unique climate of Socotra, which is characterized by high temperatures and low rainfall. It is an endemic species, meaning it is not found anywhere else in the world. Due to its limited distribution, it is considered a rare and vulnerable plant.",
    "distribution_introduced_art_desc": "Acacia insularis was mainly introduced to stabilize soil and prevent erosion in coastal areas. It is commonly found in sandy and gravelly soils along the shores of islands. This plant has been introduced to several Pacific islands, including Hawaii and the Mariana Islands. Its rapid growth and ability to thrive in harsh conditions make it a popular choice for land rehabilitation. However, it is considered an invasive species in some regions, outcompeting native vegetation."
}
