{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tavaresorum",
    "plant_slug": "acacia-tavaresorum",
    "plant_name_scientific": "acacia tavaresorum",
    "intro": "Acacia tavaresorum, commonly known as Tavares' acacia, is a flowering plant native to the arid regions of South America. It belongs to the Fabaceae family, which includes legumes and is characterized by its pod fruits and nitrogen-fixing abilities. The plant is known for its slender, erect stems and small, bipinnate leaves that reduce water loss in its harsh environment. Its yellow flowers are clustered in dense, globular inflorescences, making it visually striking. Due to its ecological importance and limited distribution, it is considered a species of conservation concern.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tavaresorum is primarily native to the arid and semi-arid regions of southern Africa, particularly in Namibia and Angola. It is commonly found in sandy soils and rocky outcrops within these areas. This plant is well adapted to the harsh, dry climate and can thrive in low-nutrient environments. It plays an important role in stabilizing soils and providing habitat for local wildlife. Due to its limited distribution, it is considered a rare and endemic species in its native range.",
    "distribution_introduced_art_desc": "Acacia tavaresorum was mainly introduced to control soil erosion and provide shade in degraded areas. It is commonly found in semi-arid regions where it establishes quickly and forms dense thickets. The plant is valued for its ability to fix nitrogen and improve soil fertility. However, it can become invasive in some ecosystems if not managed properly. Its distribution has expanded due to human activities such as land clearing and reforestation efforts."
}
