{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gentlei",
    "plant_slug": "acacia-gentlei",
    "plant_name_scientific": "acacia gentlei",
    "intro": "Acacia gentlei, commonly known as the gentle acacia, is a shrub native to the arid regions of southwestern Australia. It is characterized by its slender, branching structure and its distinctive, feathery leaves that are adapted to reduce water loss in hot, dry climates. The plant produces yellowish-white flowers in clusters, which bloom during the cooler months, attracting various pollinators. Its seeds are encased in hard, woody pods that split open when mature, dispersing the seeds through the environment. Acacia gentlei is often used in restoration projects due to its ability to stabilize soil and thrive in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gentlei is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops within these areas. This species is well adapted to the harsh climate and can thrive in low rainfall conditions. It plays an important role in the local ecosystem by providing shelter and food for various wildlife species. Acacia gentlei is also known for its distinctive, feathery leaves and yellow flowers that bloom during the rainy season.",
    "distribution_introduced_art_desc": "Acacia gentlei was mainly introduced to regions with a Mediterranean climate, characterized by dry summers and wet winters. It thrives in well-drained soils and is often found in coastal areas and open woodlands. This plant is known for its ability to tolerate drought and poor soil conditions, making it adaptable to various environments. Its introduction has sometimes led to ecological concerns due to its potential for invasiveness. It is commonly used in landscaping and for erosion control in suitable climates."
}
