{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia whitei",
    "plant_slug": "acacia-whitei",
    "plant_name_scientific": "acacia whitei",
    "intro": "Acacia whitei, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched structure and produces small, yellow flowers arranged in compact, globular clusters. The leaves are typically bipinnate, consisting of numerous tiny leaflets, and the plant is adapted to arid and semi-arid environments. It is often found in rocky soils and can thrive in regions with limited rainfall. The plant is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia whitei"
    },
    "taxonomy_art_desc": "Acacia whitei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid and tropical regions, known for their phyllodes and often used for timber and medicinal purposes. Its species is Acacia whitei, a specific type of acacia found in certain regions of Africa, recognized for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia whitei is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This plant typically grows in open woodlands and along riverbanks. It thrives in well-drained soils and is often seen in areas with moderate rainfall. Its distribution is largely restricted to the eastern parts of Queensland.",
    "distribution_introduced_art_desc": "Acacia whitei was mainly introduced to areas with well-drained soils and a temperate to subtropical climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in open woodlands and along coastal areas. It has been introduced to several regions outside its native range for ornamental and ecological purposes. However, its spread is often limited by its specific environmental requirements."
}
