{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rostellifera",
    "plant_slug": "acacia-rostellifera",
    "plant_name_scientific": "acacia rostellifera",
    "intro": "Acacia rostellifera, commonly known as the narrow-leaf wattle, is a shrub native to southern Africa. It is characterized by its slender, often zigzagging stems and small, bipinnate leaves. The plant produces yellow flowers in cylindrical spikes, which bloom during the warmer months. Acacia rostellifera is adapted to arid and semi-arid environments, showing drought tolerance. It is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rostellifera"
    },
    "taxonomy_art_desc": "Acacia rostellifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive characteristics and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often used for timber or as ornamental plants. Its species is Acacia rostellifera, a specific type of acacia native to certain regions of Australia, recognized by its unique floral and vegetative features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rostellifera is primarily native to Western Australia. It is commonly found in the coastal regions and surrounding areas of the state. This species thrives in sandy soils and is often seen in open habitats such as dunes and coastal heathlands. It plays an important role in the local ecosystem by providing food and shelter for various wildlife species. The plant is well adapted to the dry and warm climate of its native region.",
    "distribution_introduced_art_desc": "Acacia rostellifera was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soil conditions. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for its hardy nature and ability to provide shade and erosion control. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. It is also valued for its timber and as a source of animal forage."
}
