{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cyclocarpa",
    "plant_slug": "acacia-cyclocarpa",
    "plant_name_scientific": "acacia cyclocarpa",
    "intro": "Acacia cyclocarpa, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in late winter to early spring. The plant produces woody pods that contain seeds, and it is well adapted to dry, sandy soils. Acacia cyclocarpa is also known for its ability to fix nitrogen, making it an important plant in soil enrichment. Its ecological and cultural significance makes it a notable species in Australian flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cyclocarpa"
    },
    "taxonomy_art_desc": "Acacia cyclocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with two petals and include legumes that form nitrogen-fixing symbioses with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and land restoration. Its species is Acacia cyclocarpa, a specific type of acacia found in arid regions, known for its unique seed structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cyclocarpa is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy soils and is often seen in coastal and inland areas. It thrives in dry, temperate climates and is well adapted to the local environmental conditions. Acacia cyclocarpa is an important component of the native vegetation in these regions.",
    "distribution_introduced_art_desc": "Acacia cyclocarpa was mainly introduced to Australia, where it has become naturalized in certain regions. It is commonly found in the southern parts of the country, particularly in New South Wales and South Australia. This plant thrives in dry, sandy soils and is often seen along roadsides and in disturbed areas. Its ability to withstand drought and poor soil conditions has contributed to its spread. However, it is considered a potential weed in some areas due to its rapid growth and competitive nature."
}
