{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia yalwalensis",
    "plant_slug": "acacia-yalwalensis",
    "plant_name_scientific": "acacia yalwalensis",
    "intro": "Acacia yalwalensis, commonly known as the Yalwal wattle, is a shrub or small tree native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant typically grows in sandy or rocky soils and is found in arid and semi-arid regions. Its yellow flowers are often clustered in cylindrical spikes, adding ornamental value. Acacia yalwalensis is also valued for its ecological role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia yalwalensis"
    },
    "taxonomy_art_desc": "Acacia yalwalensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia yalwalensis, a specific type of acacia found in certain regions of Australia, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia yalwalensis is primarily native to New South Wales. It is found in the coastal regions of the state, particularly in the northern and central areas. This species thrives in sandy soils and is commonly associated with coastal heathlands and sand dunes. It is an important component of the local flora and plays a role in stabilizing coastal ecosystems. Due to its limited range, it is considered a rare and endangered plant species in New South Wales.",
    "distribution_introduced_art_desc": "Acacia yalwalensis was mainly introduced to specific regions in Australia, particularly in New South Wales and Queensland, where it has been planted for its ornamental value and potential for soil stabilization. It is commonly found in disturbed sites, along roadsides, and in agricultural areas due to its adaptability to various soil types. This plant thrives in full sun and is drought-tolerant, making it suitable for rehabilitation projects in arid and semi-arid environments. However, it has also become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its distribution is now expanding beyond its original introduction sites, raising concerns about its ecological impact."
}
