{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amaliae",
    "plant_slug": "acacia-amaliae",
    "plant_name_scientific": "acacia amaliae",
    "intro": "Acacia amaliae, commonly known as the Amalia's acacia, is a shrub native to the island of Socotra. It is characterized by its distinctive, flat, paddle-shaped leaves and produces small, yellow flowers that bloom in clusters. The plant is adapted to arid environments and thrives in well-drained soils. It plays a role in the local ecosystem by providing food and shelter for various insects and birds. Due to its unique appearance and limited distribution, it is considered a rare and ecologically significant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amaliae is primarily native to the highlands of Central America, specifically in countries such as Guatemala, Belize, and parts of southern Mexico. It thrives in tropical and subtropical climates, often found in cloud forests and moist mountainous regions. This species is adapted to well-drained soils and requires a humid environment with moderate temperatures. It is commonly found at elevations ranging from 1,000 to 2,500 meters above sea level. Due to its restricted habitat, Acacia amaliae is considered a rare and endemic plant in these regions.",
    "distribution_introduced_art_desc": "Acacia amaliae was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and adequate sunlight. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This species has been introduced to several countries in Central and South America, as well as parts of the Caribbean. Its rapid growth and ability to thrive in poor soil conditions have led to its establishment in native ecosystems. However, its introduction has raised concerns about its potential impact on local biodiversity."
}
