{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pachyceras",
    "plant_slug": "acacia-pachyceras",
    "plant_name_scientific": "acacia pachyceras",
    "intro": "Acacia pachyceras, commonly known as the broad-leaved wattle, is a shrub or small tree native to southern Africa. It is characterized by its thick, woody stems and bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. The plant is also valued for its ornamental appeal and has been introduced to other regions for landscaping purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pachyceras is primarily native to parts of southern Africa, including South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, particularly in savannas and shrublands. This plant thrives in well-drained soils and is adapted to withstand high temperatures and low rainfall. It is often seen growing along roadsides, in open woodlands, and on rocky outcrops. Its distribution is closely linked to the availability of suitable habitat in these dry environments.",
    "distribution_introduced_art_desc": "Acacia pachyceras was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and central parts of the country. The plant has also been introduced to parts of Southeast Asia and the Pacific Islands for its hardy nature and ornamental value. Due to its ability to tolerate drought and poor soil conditions, it has become an invasive species in some regions. Its introduction has led to ecological concerns as it can outcompete native vegetation in certain environments."
}
