{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fisheri",
    "plant_slug": "acacia-fisheri",
    "plant_name_scientific": "acacia fisheri",
    "intro": "Acacia fisheri, commonly known as the Fisher's acacia, is a species of flowering plant in the legume family. It is native to the arid regions of southern Africa, particularly Namibia and South Africa. The plant is characterized by its slender, spiny stems and small, yellowish-green leaves. Its flowers are typically pale yellow and occur in clusters, attracting various pollinators. Acacia fisheri is adapted to survive in harsh, dry environments, showcasing resilience through its deep root system and water-storing tissues.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fisheri is primarily native to the arid and semi-arid regions of southern Africa, particularly in Namibia and Angola. It thrives in sandy soils and is commonly found in shrubland and grassland habitats. This species is well adapted to the harsh climatic conditions of its native range, including high temperatures and low rainfall. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Acacia fisheri is also known for its distinctive yellow flowers, which bloom during the rainy season.",
    "distribution_introduced_art_desc": "Acacia fisheri was mainly introduced to areas with dry, sandy soils and a warm climate, typically in regions with low rainfall. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant has become invasive in some regions due to its rapid growth and ability to thrive in poor soil conditions. Its introduction has led to competition with native plant species, affecting local ecosystems. It is often spread through seeds carried by wind, water, or human activity."
}
