{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia donaldsonii",
    "plant_slug": "acacia-donaldsonii",
    "plant_name_scientific": "acacia donaldsonii",
    "intro": "Acacia donaldsonii, commonly known as the Christmas Champa, is a small, evergreen shrub native to the coastal regions of southern Australia. It is characterized by its dense, fragrant foliage composed of small, narrow leaves that are often covered in fine hairs. The plant produces yellow flowers in clusters during the winter months, which are highly aromatic and attract a variety of pollinators. Its growth habit is compact, making it suitable for use in gardens and as a ornamental plant. Acacia donaldsonii is also valued for its hardiness and ability to thrive in coastal environments with well-drained soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia donaldsonii"
    },
    "taxonomy_art_desc": "Acacia donaldsonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and ability to thrive in arid environments. Its species is Acacia donaldsonii, a specific type of acacia found in certain regions of Australia, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia donaldsonii is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area known as the Fitzgerald River National Park. This plant typically grows in sandy soils and is adapted to the Mediterranean climate of the region. It is often found in open woodlands and along coastal areas. Its distribution is limited to specific habitats within Western Australia.",
    "distribution_introduced_art_desc": "Acacia donaldsonii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, thriving in coastal and inland areas with well-drained soils. This plant is often seen growing along roadsides and in disturbed habitats due to its adaptability. It has also been reported in parts of Australia, where it has been introduced for ornamental purposes. However, its spread is limited compared to other invasive acacia species."
}
