{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brevipes",
    "plant_slug": "acacia-brevipes",
    "plant_name_scientific": "acacia brevipes",
    "intro": "Acacia brevipes, commonly known as the dwarf acacia or the yellow-wood acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its small, dense foliage and yellow flowers that bloom in clusters during the rainy season. The plant has phyllodes, which are flattened, leaf-like stems that perform the function of leaves, adapting to the harsh, dry environment. Acacia brevipes is well-suited for xeriscaping due to its drought tolerance and low maintenance requirements. It also provides habitat and food for various native wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brevipes is primarily native to the arid regions of southern Africa, particularly Namibia, Botswana, and South Africa. It is commonly found in the Kalahari Desert and surrounding areas where the climate is dry and the soil is sandy. This plant thrives in harsh environments and is often seen growing along roadsides and in open plains. It is well adapted to low rainfall and can survive in areas with extreme temperature fluctuations. Acacia brevipes plays an important ecological role by providing habitat and food for various desert animals.",
    "distribution_introduced_art_desc": "Acacia brevipes was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for erosion control due to its extensive root system and ability to grow in harsh conditions. It also provides habitat and food for various native animals. However, its introduction has sometimes led to competition with native species in certain ecosystems."
}
