{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bilaura",
    "plant_slug": "acacia-bilaura",
    "plant_name_scientific": "acacia bilaura",
    "intro": "Acacia bilaura, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant features slender, often zigzagging stems and small, bipinnate leaves that are typically green with a slight bluish tinge. Its yellow flowers are clustered in spherical heads, attracting various pollinators such as bees and birds. Acacia bilaura is adapted to arid and semi-arid environments, making it a hardy species in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bilaura is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in savanna and woodland habitats, often found in areas with well-drained soils. This species is also present in parts of the Middle East and southern Arabia. It is commonly associated with dry climates and can tolerate seasonal droughts. Acacia bilaura plays an important ecological role in its native range, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia bilaura was mainly introduced to South Africa, where it has become an invasive species. It was originally native to Australia and was brought over for its ornamental value and potential for soil stabilization. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to concerns about biodiversity loss and habitat degradation. Efforts are ongoing to control its spread through mechanical removal and biological control methods."
}
