{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cyclophylla",
    "plant_slug": "acacia-cyclophylla",
    "plant_name_scientific": "acacia cyclophylla",
    "intro": "Acacia cyclophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and narrow, feather-like leaves. The plant produces yellow flowers in globular clusters, which appear in spring and attract various pollinators. It is well adapted to arid and semi-arid environments, showcasing drought tolerance and deep root systems. Acacia cyclophylla is also valued for its role in soil stabilization and as a source of timber and fuel.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cyclophylla is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the states of Western Australia, South Australia, and Queensland. This plant thrives in sandy or gravelly soils and is often seen in shrublands and open woodlands. It is well adapted to the harsh climate with its deep root system and water-storing capabilities. Acacia cyclophylla plays an important ecological role by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia cyclophylla was mainly introduced to Australia as a potential source of timber and for its ability to stabilize soils in arid regions. It was also considered for use in reforestation projects due to its fast growth rate and drought tolerance. However, its introduction has led to concerns about its potential to become invasive in certain ecosystems. Despite its benefits, management strategies are needed to prevent it from outcompeting native plant species. The plant's distribution is now widespread in parts of southern Australia, particularly in Queensland and New South Wales."
}
