{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia abrupta",
    "plant_slug": "acacia-abrupta",
    "plant_name_scientific": "acacia abrupta",
    "intro": "Acacia abrupta, commonly known as the narrow-leaf wattle, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its narrow, linear leaves that are often covered in a fine layer of white to greyish powder, which helps reduce water loss in dry conditions. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. Acacia abrupta is well adapted to harsh environments, with a deep root system that allows it to access water from deeper soil layers. It plays an important ecological role by providing habitat and food for various native animals and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia abrupta"
    },
    "taxonomy_art_desc": "Acacia abrupta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a distinctive structure and includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and are often legumes. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of flowering plants commonly known as wattles, which are native to Australia and other parts of the world. Its species is Acacia abrupta, a specific type of acacia that is found in certain regions and is distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia abrupta is primarily native to the Northern Territory and Western Australia. This shrub is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. Its distribution is largely restricted to the specific ecological zones of the Northern Territory and Western Australia.",
    "distribution_introduced_art_desc": "Acacia abrupta was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was initially brought in for its potential use in erosion control and as a source of timber. However, its rapid growth and ability to outcompete native vegetation have led to ecological concerns. The plant thrives in disturbed soils and can spread quickly through seed dispersal by animals and wind. Its introduction has had significant impacts on local biodiversity and land management practices."
}
