{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dissoneura",
    "plant_slug": "acacia-dissoneura",
    "plant_name_scientific": "acacia dissoneura",
    "intro": "Acacia dissoneura, commonly known as the slender acacia, is a shrub or small tree native to southern Africa. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant has slender, often spiny stems and bipinnate leaves that are small and delicate. Its yellow flowers are arranged in cylindrical spikes and bloom during the warmer months. Acacia dissoneura is adapted to arid and semi-arid environments, making it a hardy and resilient species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dissoneura is primarily native to eastern Australia, specifically Queensland and New South Wales. It is commonly found in dry, open woodlands and heathlands. This species thrives in well-drained soils and is adapted to the semi-arid climate of its native range. It plays an important ecological role by providing habitat and food for various native animals. Acacia dissoneura is also known for its distinctive yellow flowers that bloom in spring.",
    "distribution_introduced_art_desc": "Acacia dissoneura was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in arid and semi-arid regions where it establishes quickly and forms dense thickets. The plant's rapid growth and adaptability make it a popular choice for rehabilitation projects. However, its aggressive spread can lead to the displacement of native vegetation. Due to these characteristics, it is often used in ecological restoration but requires careful management to prevent overgrowth."
}
