{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis var. flava",
    "plant_slug": "acacia-tortilis-var-flava",
    "plant_name_scientific": "acacia tortilis var. flava",
    "intro": "Acacia tortilis var. flava, commonly known as the yellow acacia, is a shrub or small tree native to the arid regions of Africa. It is characterized by its slender, twisted branches and yellowish-green phyllodes, which are modified leaves adapted for reducing water loss. The plant produces yellow globular flower heads that bloom during the rainy season, attracting pollinators such as bees and birds. Its roots form associations with nitrogen-fixing bacteria, enhancing soil fertility in nutrient-poor environments. The wood and foliage have been traditionally used for fuel, construction, and medicinal purposes by local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis var. flava is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It also extends its range into parts of the Arabian Peninsula, particularly in southern Saudi Arabia and Yemen. This plant thrives in arid and semi-arid environments, often found in savannas and rocky hillsides. It is well adapted to withstand high temperatures and low rainfall. Its distribution is closely associated with regions that have a tropical or subtropical climate with distinct dry seasons.",
    "distribution_introduced_art_desc": "Acacia tortilis var. flava was mainly introduced to areas with semi-arid to arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, the Middle East, and parts of India. This plant is often used for its timber, fodder, and its ability to stabilize soil in degraded landscapes. Its introduction has been both intentional for ecological and economic purposes and unintentional through human activity. However, in some regions, it has become invasive, outcompeting native vegetation."
}
