{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ericifolia var. tenuis",
    "plant_slug": "acacia-ericifolia-var-tenuis",
    "plant_name_scientific": "acacia ericifolia var. tenuis",
    "intro": "Acacia ericifolia var. tenuis, commonly known as the narrow-leaved acacia, is a shrub native to southern Africa. It is characterized by its slender, lance-shaped leaves that are often covered in fine, soft hairs. The plant produces small, yellow globular flowers that appear in late winter or early spring. It thrives in well-drained soils and is adapted to arid or semi-arid environments. This variety is often used in landscaping for its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ericifolia var. tenuis is primarily native to the arid and semi-arid regions of southern Africa, particularly in Namibia, Angola, and parts of South Africa. This plant thrives in sandy or rocky soils and is commonly found in shrublands and grasslands. It is well adapted to dry climates and can tolerate high temperatures and low rainfall. The variety is known for its small, dense foliage and ability to withstand harsh environmental conditions. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia ericifolia var. tenuis was mainly introduced to stabilize soils and prevent erosion in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and capacity to provide shade and forage for livestock. Its introduction has helped in restoring degraded landscapes in parts of Australia and other dry regions. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
