{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sennii",
    "plant_slug": "acacia-sennii",
    "plant_name_scientific": "acacia sennii",
    "intro": "Acacia sennii, commonly known as the white acacia, is a flowering plant native to parts of Africa and the Arabian Peninsula. It is a small to medium-sized shrub that typically grows in arid and semi-arid environments. The plant produces yellow flowers that are clustered in cylindrical inflorescences, which are often used in traditional medicine. Its leaves are bipinnate, consisting of numerous small, feather-like leaflets. Acacia sennii is also valued for its role in soil stabilization and as a source of timber and fodder.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sennii is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savannas and shrublands. This plant is well adapted to dry climates and can survive with minimal rainfall. It plays an important ecological role by providing habitat and food for various desert animals. Acacia sennii is also sometimes cultivated in other parts of the world for its ornamental value.",
    "distribution_introduced_art_desc": "Acacia sennii was mainly introduced to regions with a warm, dry climate and well-drained soils, particularly in parts of Australia and the Mediterranean. It is often found in coastal areas and disturbed sites where it can establish quickly due to its adaptability. The plant has been introduced to several countries as an ornamental species because of its attractive foliage and ability to thrive in harsh conditions. However, in some areas, it has become invasive, outcompeting native vegetation and altering local ecosystems. Its distribution is largely limited by its preference for specific soil types and climatic conditions."
}
