{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bequaertii",
    "plant_slug": "acacia-bequaertii",
    "plant_name_scientific": "acacia bequaertii",
    "intro": "Acacia bequaertii, commonly known as the Bequaert's acacia, is a species of flowering plant in the legume family, Fabaceae. It is native to arid and semi-arid regions of southern Africa, particularly in Namibia and Angola. The plant is characterized by its slender, upright shrub form and its compound leaves, which are often covered in fine hairs. Its small, yellow flowers are clustered in spherical inflorescences, and it produces small, hard pods that contain seeds. Acacia bequaertii is adapted to survive in harsh, dry environments, making it an important component of its native ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bequaertii is primarily native to the arid regions of southwestern Australia. It is found in the states of Western Australia and South Australia. This plant thrives in sandy or rocky soils and is adapted to dry, hot climates. It is commonly found in open woodlands and shrublands. Its distribution is limited to specific ecological zones within these regions.",
    "distribution_introduced_art_desc": "Acacia bequaertii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, particularly in Namibia and South Africa. This plant is often used for its hardy nature and ability to withstand drought conditions. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. It is valued for its ornamental appeal and as a source of timber and fodder."
}
