{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia graffiana",
    "plant_slug": "acacia-graffiana",
    "plant_name_scientific": "acacia graffiana",
    "intro": "Acacia graffiana, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often thornless branches and bipinnate leaves that are divided into numerous small, needle-like leaflets. The plant produces yellowish-green globular flower heads, which are clustered in dense, upright spikes. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia graffiana is often used in ornamental gardening due to its attractive foliage and unique floral structure.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia graffiana is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in grassland and savanna habitats, often growing along riverbanks and in open woodlands. This species thrives in regions with a warm, dry climate and well-drained soils. It is an important component of the local ecosystem, providing food and shelter for various wildlife species. Acacia graffiana is also known for its distinctive yellow flowers and thorny structure.",
    "distribution_introduced_art_desc": "Acacia graffiana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often growing in disturbed habitats. The plant is valued for its hardiness and ability to thrive in arid conditions. It has been used in reforestation projects due to its fast growth and nitrogen-fixing capabilities. However, it can also pose a threat to native ecosystems if it spreads uncontrollably."
}
