{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia argyrotricha",
    "plant_slug": "acacia-argyrotricha",
    "plant_name_scientific": "acacia argyrotricha",
    "intro": "Acacia argyrotricha, commonly known as the silver-haired wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, feathery leaves that give it a delicate appearance. The plant produces yellow flowers in spring, which are clustered in cylindrical inflorescences. Its leaves are covered in a fine layer of white hairs, contributing to its distinctive silver hue. Acacia argyrotricha is well adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia argyrotricha"
    },
    "taxonomy_art_desc": "Acacia argyrotricha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and citrus. Its order is Fabales, which consists of flowering plants that typically have legumes as fruits and include well-known families like the Fabaceae. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their thorned stems and small, often fragrant flowers. Its species is Acacia argyrotricha, a specific type of acacia that is native to certain regions of Australia and is recognized for its unique ecological and morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia argyrotricha is primarily native to Queensland. It is commonly found in the eastern regions of the state, particularly in areas with sandy or rocky soils. This species thrives in dry, open habitats such as woodlands and grasslands. It is well adapted to the semi-arid climate of Queensland. The plant is often seen along roadsides and in disturbed areas due to its hardy nature.",
    "distribution_introduced_art_desc": "Acacia argyrotricha was mainly introduced to areas with well-drained soils and a temperate to subtropical climate, often for its ornamental value and potential for soil stabilization. It is commonly found in regions with moderate rainfall and full sun exposure, making it suitable for landscaping in dry environments. This plant has been introduced to parts of the United States, particularly in the southwestern states, where it thrives in arid and semi-arid conditions. Its rapid growth and drought tolerance make it a popular choice for erosion control and ornamental planting. However, its invasive potential in some regions requires careful management to prevent ecological disruption."
}
