{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rigidula",
    "plant_slug": "acacia-rigidula",
    "plant_name_scientific": "acacia rigidula",
    "intro": "Acacia rigidula, commonly known as the rigid wattle, is a shrub native to Australia. It is characterized by its slender, erect stems and small, yellow flowers that appear in late winter to early spring. The plant has phyllodes, which are flattened leaf stalks that function as leaves, and it produces pods that contain seeds. Acacia rigidula is adapted to arid environments and is often found in sandy soils. It plays a role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rigidula is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in sandy soils and along riverbanks. This plant thrives in environments with low rainfall and high temperatures. It is often seen in shrubland and savanna ecosystems. Acacia rigidula is well adapted to the harsh conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia rigidula was mainly introduced to control erosion and stabilize soil in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant has been introduced in several countries across Africa, the Middle East, and parts of Asia. However, it has also become invasive in some areas, outcompeting native vegetation. Its rapid growth and seed dispersal make it both useful and problematic in different ecological contexts."
}
