{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brosigii",
    "plant_slug": "acacia-brosigii",
    "plant_name_scientific": "acacia brosigii",
    "intro": "Acacia brosigii, commonly known as the yellow acacia, is a shrub or small tree native to southern Africa. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in globular clusters. The plant produces long, slender pods that contain seeds surrounded by a fibrous, spongy material. It thrives in well-drained soils and is often found in savanna and woodland habitats. Acacia brosigii is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brosigii is primarily native to the arid regions of southern Africa, specifically Namibia and Angola. It thrives in sandy soils and is commonly found in grassland and savanna habitats. This species is well adapted to dry climates and can tolerate high temperatures and low rainfall. It plays an important ecological role by providing shelter and food for local wildlife. Due to its resilience, it is often used in reforestation and land stabilization projects in its native range.",
    "distribution_introduced_art_desc": "Acacia brosigii was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with low rainfall and high sunlight exposure. This plant is often used in landscaping due to its drought tolerance and ornamental value. It has been introduced to several parts of the United States, particularly in the southwestern states. However, it can become invasive in some environments if not properly managed."
}
