{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia galioides",
    "plant_slug": "acacia-galioides",
    "plant_name_scientific": "acacia galioides",
    "intro": "Acacia galioides, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, yellow flowers and bipinnate leaves. The plant is adapted to arid environments, with deep roots that help it survive in dry conditions. It plays an important role in stabilizing soil and providing habitat for native wildlife. Acacia galioides is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia galioides"
    },
    "taxonomy_art_desc": "Acacia galioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing capabilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped flower clusters and often used in traditional medicine. Its species is Acacia galioides, a specific type of acacia found in certain regions, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia galioides is primarily native to Northern Territory, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy or loamy soils and is often seen in open woodlands and shrublands. Acacia galioides is well adapted to the hot and dry climate of its native range. It plays an important role in the local ecosystem by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia galioides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, particularly in the Western Cape. The plant is known for its ability to thrive in arid and semi-arid environments. It has been introduced for ornamental purposes due to its attractive foliage and yellow flowers. However, it is considered a potential invasive species in some areas where it can outcompete native vegetation."
}
