{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulverulenta",
    "plant_slug": "acacia-pulverulenta",
    "plant_name_scientific": "acacia pulverulenta",
    "intro": "Acacia pulverulenta, commonly known as the ghost gum, is a small to medium-sized tree native to Australia. It is characterized by its slender, pale grey bark that peels away in thin layers, giving it a distinctive, almost ghostly appearance. The plant has compound leaves composed of several narrow, linear leaflets, and it produces yellow flowers in spherical clusters. Acacia pulverulenta is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for landscaping in dry regions. It plays an important ecological role by providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulverulenta is primarily native to southern Africa, particularly in countries such as South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, growing in rocky soils and open woodlands. This species is well adapted to dry conditions and can tolerate high temperatures and low rainfall. It often thrives in areas with good drainage and is sometimes found near coastal regions. Acacia pulverulenta is an important plant in local ecosystems, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia pulverulenta was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and drought tolerance. It is commonly found in gardens and along roadsides, where it thrives in well-drained soils. Despite its aesthetic value, it has shown invasive tendencies in some regions, outcompeting native vegetation. The plant's rapid growth and ability to spread through seed dispersal have raised concerns among conservationists. Efforts are being made to monitor and manage its spread to protect local ecosystems."
}
