{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cibaria",
    "plant_slug": "acacia-cibaria",
    "plant_name_scientific": "acacia cibaria",
    "intro": "Acacia cibaria, commonly known as the silky acacia, is a shrub or small tree native to tropical and subtropical regions of Africa and the Middle East. It is characterized by its feathery, bipinnate leaves that give it a delicate, silky appearance. The plant produces yellow or golden flowers in dense, spherical clusters, which bloom during the dry season. Its pods are elongated, woody, and contain several flat, edible seeds. Acacia cibaria is often used for ornamental purposes and has traditional uses in some cultures for food and medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cibaria is primarily native to Central America, the Caribbean, and northern South America. It is commonly found in countries such as Mexico, Belize, Guatemala, Honduras, and parts of Colombia. This species thrives in tropical and subtropical regions, often growing in dry to semi-arid environments. It is typically found in open woodlands, savannas, and along roadsides. Acacia cibaria is known for its ability to adapt to poor soils and withstand drought conditions.",
    "distribution_introduced_art_desc": "Acacia cibaria was mainly introduced to control soil erosion and as a source of fuel and timber in tropical regions. It is commonly found in disturbed sites such as roadsides, clearings, and degraded forests. The plant thrives in areas with moderate to high rainfall and well-drained soils. Due to its rapid growth and adaptability, it has become invasive in some regions, outcompeting native vegetation. Its introduction has had both beneficial and problematic ecological impacts depending on the environment."
}
