{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cuspidata",
    "plant_slug": "acacia-cuspidata",
    "plant_name_scientific": "acacia cuspidata",
    "intro": "Acacia cuspidata, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers in cylindrical spikes, which appear in spring. It is adapted to arid and semi-arid environments, making it drought-tolerant. Its roots form nodules with nitrogen-fixing bacteria, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cuspidata is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in a variety of habitats, including savannas, woodlands, and rocky outcrops. The plant is well adapted to the region's climate, which is typically dry with distinct wet and dry seasons. It plays an important ecological role by providing shelter and food for local wildlife. Its distribution is also influenced by soil type and availability of water.",
    "distribution_introduced_art_desc": "Acacia cuspidata was mainly introduced to areas with Mediterranean climates, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is often found in coastal regions and inland valleys. This plant is commonly used for erosion control due to its extensive root system and rapid growth. It has been introduced to several countries in Europe, including Spain, Italy, and Greece. However, its invasive potential in some regions has raised concerns about its impact on native flora."
}
