{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia melanoceroides",
    "plant_slug": "acacia-melanoceroides",
    "plant_name_scientific": "acacia melanoceroides",
    "intro": "Acacia melanoceroides, commonly known as the black wattle, is a species of acacia native to eastern Australia. It is a tall, spreading shrub or small tree that can grow up to 10 meters in height. The plant is characterized by its dark, fissured bark and compound leaves with multiple small, linear leaflets. Its flowers are yellow and appear in globular clusters, followed by long, flat pods that contain the seeds. Acacia melanoceroides is adapted to a variety of soil types and is often found in coastal and inland areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia melanoceroides is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It is commonly found in savannas, woodlands, and along riverbanks. This plant thrives in regions with a tropical or subtropical climate and well-drained soils. It is often seen in open habitats with scattered trees. Acacia melanoceroides is an important component of the local flora and plays a role in supporting biodiversity in its native range.",
    "distribution_introduced_art_desc": "Acacia melanoceroides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often forming dense thickets. This plant is known for its ability to thrive in harsh environmental conditions, including high salinity and poor soil quality. It has been used in reforestation projects due to its fast growth and nitrogen-fixing capabilities. However, its invasive nature has led to concerns about its impact on native ecosystems."
}
