{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vestita",
    "plant_slug": "acacia-vestita",
    "plant_name_scientific": "acacia vestita",
    "intro": "Acacia vestita, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging stems and small, rounded leaves that are covered in a fine, silvery-white bloom. The plant produces yellow, globular flower heads that bloom in late spring to early summer. Acacia vestita is well adapted to arid and semi-arid environments, exhibiting drought tolerance and a deep root system. It is often used in landscaping for its ornamental value and ability to thrive in challenging conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia vestita"
    },
    "taxonomy_art_desc": "Acacia vestita belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissues. Its class is Equisetopsida, a group that includes ferns, horsetails, and flowering plants, known for their diverse forms and adaptations. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as ornamental plants. Its species is Acacia vestita, a specific type of acacia found in certain regions, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [
        "California",
        "Kenya",
        "Western Australia"
    ],
    "distribution_native_art_desc": "Acacia vestita is primarily native to New South Wales. It is commonly found in the semi-arid and arid regions of the state, particularly in the western and central parts. This plant typically grows in sandy or rocky soils and is often seen in open woodlands and shrublands. It is well adapted to the dry climate and can survive with minimal rainfall. Acacia vestita plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia vestita was mainly introduced to California, Kenya, and Western Australia. It was likely brought there for its ornamental value or for use in land rehabilitation. The plant thrives in arid and semi-arid environments, making it well-suited to the climates of these regions. However, its introduction has raised concerns about its potential to become an invasive species. Its distribution highlights the global interest in acacia species for ecological and agricultural purposes."
}
