{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia habbas",
    "plant_slug": "acacia-habbas",
    "plant_name_scientific": "acacia habbas",
    "intro": "Acacia habbas, commonly known as the white acacia, is a shrub native to the arid and semi-arid regions of Africa. It is characterized by its slender, branching stems and small, feathery leaves that reduce water loss. The plant produces yellow flowers in spring, which are clustered in spikes and attract pollinators such as bees and birds. Its seeds are enclosed in pods and can remain viable for several years, aiding in its survival in harsh environments. Acacia habbas is often used in traditional medicine and as a source of firewood due to its hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia habbas is primarily native to the arid and semi-arid regions of northern Australia. It is commonly found in the Northern Territory, Western Australia, and parts of South Australia. This plant thrives in sandy soils and is often associated with spinifex plains and other dry landscapes. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife. Acacia habbas is well adapted to the harsh climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia habbas was mainly introduced to specific regions of Australia for its potential use in soil stabilization and as a source of timber. It was also introduced to some parts of Southeast Asia for ornamental purposes due to its attractive foliage and drought tolerance. However, its spread has raised concerns due to its invasive nature in certain ecosystems. The plant is known to thrive in arid and semi-arid environments, making it a challenge to control once established. Its introduction has led to increased research on effective management strategies to prevent ecological harm."
}
