{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cooleyi",
    "plant_slug": "acacia-cooleyi",
    "plant_name_scientific": "acacia cooleyi",
    "intro": "Acacia cooleyi, commonly known as the coastal acacia, is a shrub or small tree native to the coastal regions of southern Australia. It is characterized by its slender, often twisted branches and feathery, bipinnate leaves that are typically reduced to small, scale-like structures. The plant produces yellow flowers in compact, globular spikes, which bloom in spring and attract a variety of pollinators. Acacia cooleyi is well adapted to coastal conditions, tolerating salt spray and sandy soils. It plays an important ecological role in stabilizing dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cooleyi is primarily native to eastern Australia, specifically the coastal regions of New South Wales and eastern Victoria. It is commonly found in sandy soils along the coast, often in heathlands and open woodlands. This plant thrives in temperate climates with mild winters and warm, dry summers. It is well adapted to coastal conditions, including salt spray and strong winds. Acacia cooleyi plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia cooleyi was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, particularly in the Western and Eastern Cape provinces. The plant thrives in sandy or well-drained soils and is often associated with disturbed habitats. It is considered an invasive species in some areas due to its rapid growth and ability to outcompete native vegetation. Its introduction has raised concerns about its impact on local ecosystems and biodiversity."
}
