{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vicioides",
    "plant_slug": "acacia-vicioides",
    "plant_name_scientific": "acacia vicioides",
    "intro": "Acacia vicioides, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often zigzagging stems and small, bipinnate leaves that give it a feathery appearance. The plant produces yellow flowers in winter, which are clustered in cylindrical inflorescences. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia vicioides is also valued for its ornamental appeal and is used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia vicioides is primarily native to southeastern Australia, including regions of New South Wales, Victoria, and South Australia. It is commonly found in dry sclerophyll forests and open woodlands. This species thrives in well-drained soils and is often associated with rocky or sandy substrates. It is also known to occur in parts of Tasmania. Acacia vicioides is an important component of the local flora and provides habitat and food for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia vicioides was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since spread beyond cultivated areas and is now found in various regions across the country. The plant's rapid growth and adaptability have led to its classification as an invasive species in some parts of its range. It competes with native vegetation, potentially altering local ecosystems and reducing biodiversity. Management efforts are ongoing to control its spread and mitigate its environmental impact."
}
