{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata var. typica",
    "plant_slug": "acacia-armata-var-typica",
    "plant_name_scientific": "acacia armata var. typica",
    "intro": "Acacia armata var. typica, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and produces yellow flowers in late winter to early spring. The plant is well adapted to arid and semi-arid environments, with a deep root system that helps it survive in dry conditions. It is also known for its ability to fix nitrogen in the soil, making it valuable for soil rehabilitation. The golden wattle is the national floral emblem of Australia and holds cultural significance in Indigenous communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata var. typica is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Angola, and South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and woodland habitats. This variant is well adapted to withstand drought conditions and high temperatures. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is closely tied to the specific environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia armata var. typica was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape provinces. This plant thrives in sandy or gravelly soils and is often seen along roadsides and in open habitats. Its introduction has led to concerns about its potential invasiveness in some ecosystems. Despite its ornamental value, it requires careful management to prevent spread into native vegetation areas."
}
