{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bidwillii var. major",
    "plant_slug": "acacia-bidwillii-var-major",
    "plant_name_scientific": "acacia bidwillii var. major",
    "intro": "Acacia bidwillii var. major, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often branched stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow globular flowers that are clustered in spikes, typically blooming in late winter to early spring. It thrives in well-drained soils and is often found in coastal and inland regions. The species is valued for its ornamental appeal and is sometimes cultivated for its hardy nature and ability to tolerate dry conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bidwillii var. major is primarily native to the arid and semi-arid regions of Australia, particularly in the inland areas of Western Australia, South Australia, and parts of the Northern Territory. It thrives in sandy or loamy soils and is commonly found in open woodlands and shrublands. This variety is well adapted to drought conditions and can tolerate high temperatures. It is often associated with rocky outcrops and is a characteristic component of the local flora in these regions. Its distribution is largely restricted to the interior parts of the Australian continent.",
    "distribution_introduced_art_desc": "Acacia bidwillii var. major was mainly introduced to South Australia and parts of Western Australia. It is commonly found in arid and semi-arid regions, often growing on rocky soils or in open woodlands. This species is known for its distinctive yellow flowers and its ability to thrive in harsh environmental conditions. It has been used in landscaping due to its hardy nature and ornamental value. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
