{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cyperophylla var. omearana",
    "plant_slug": "acacia-cyperophylla-var-omearana",
    "plant_name_scientific": "acacia cyperophylla var. omearana",
    "intro": "Acacia cyperophylla var. omearana, commonly known as the White Wattle, is a flowering plant native to Western Australia. It is a shrub that typically grows in sandy soils and is adapted to arid and semi-arid environments. The plant features feathery, yellow flowers that bloom in late summer to early autumn. Its leaves are narrow and linear, often covered in a fine layer of white powder. This variety is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cyperophylla"
    },
    "taxonomy_art_desc": "Acacia cyperophylla var. omearana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some modern plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and ability to thrive in arid environments. Its species is Acacia cyperophylla, a specific type of acacia known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cyperophylla var. omearana is primarily native to Western Australia. This variant is found in the southwestern region of the state, particularly in the area around the Fitzgerald River National Park. It thrives in sandy soils and is commonly associated with coastal and inland heathlands. The plant is well adapted to the local climate, which includes dry summers and wet winters. It plays an important role in the local ecosystem by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia cyperophylla var. omearana was mainly introduced to South Africa. It is commonly found in the Eastern Cape and Western Cape provinces. This plant thrives in coastal and inland regions with sandy or gravelly soils. It is often used for erosion control due to its hardy nature. However, it is considered a potential invasive species in some areas."
}
