{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spathulata",
    "plant_slug": "acacia-spathulata",
    "plant_name_scientific": "acacia spathulata",
    "intro": "Acacia spathulata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, compound leaves and yellow flowers that bloom in winter. The plant belongs to the Fabaceae family, known for its nitrogen-fixing ability, which benefits soil fertility. It thrives in dry, sandy soils and is often found in coastal and inland regions. Acacia spathulata is also valued for its ornamental appeal and is used in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spathulata is primarily native to the arid and semi-arid regions of Australia. It is commonly found in Western Australia, South Australia, and parts of the Northern Territory. This species thrives in sandy soils and is often associated with shrublands and spinifex grasslands. It is well adapted to drought and high temperatures, making it a resilient component of the local flora. Its distribution is largely restricted to the interior and western parts of the continent.",
    "distribution_introduced_art_desc": "Acacia spathulata was mainly introduced to New South Wales, Australia, as part of ecological restoration and land rehabilitation efforts. It is commonly used in revegetation projects due to its ability to stabilize soil and provide habitat for native wildlife. The plant thrives in a variety of soil types but prefers well-drained conditions. It is also valued for its ornamental qualities, including its distinctive foliage and flowering habit. However, its introduction has raised concerns about potential invasiveness in certain environments."
}
