{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia haematomma",
    "plant_slug": "acacia-haematomma",
    "plant_name_scientific": "acacia haematomma",
    "intro": "Acacia haematomma, commonly known as the blood acacia, is a shrub native to the arid regions of Australia. It is characterized by its slender, often twisted stems and small, greenish-yellow flowers that bloom in late winter to early spring. The plant produces flat, globular pods that contain several seeds, which are dispersed by wind. Acacia haematomma is adapted to drought conditions, with deep roots that allow it to access groundwater. Its foliage is often used in traditional medicine by Indigenous Australians for its purported healing properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia haematomma is primarily native to the arid and semi-arid regions of southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Zimbabwe. It thrives in sandy or gravelly soils and is commonly found in savannas and shrublands. This plant is well adapted to hot, dry climates and can tolerate periods of drought. It is often seen growing along roadsides and in open grassland areas. Its distribution is largely restricted to the southern African continent where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acacia haematomma was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Kenya, Somalia, and Sudan. This plant is often used for its hardy nature and ability to withstand drought conditions. It has been introduced to various parts of the world for purposes such as land stabilization and as a source of timber. However, its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments."
}
