{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acanthoclada subsp. glaucescens",
    "plant_slug": "acacia-acanthoclada-subsp-glaucescens",
    "plant_name_scientific": "acacia acanthoclada subsp. glaucescens",
    "intro": "Acacia acanthoclada subsp. glaucescens, commonly known as the glaucous wattle, is a shrub native to Australia. It is characterized by its slender, often twisted branches and small, bipinnate leaves that are covered in a whitish, powdery coating. The plant produces yellow globular flower heads during the winter months, which are composed of numerous tiny flowers. It is well adapted to arid and semi-arid environments, showing resistance to drought and salinity. The subspecies is distinguished by its glaucous appearance and is often found in sandy soils across the inland regions of Western Australia.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia acanthoclada"
    },
    "taxonomy_art_desc": "Acacia acanthoclada subsp. glaucescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures such as stomata. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their primitive floral structures and diverse forms. Its order is Fabales, which includes plants with a distinctive type of flower and is known for legumes that form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants in the legume family, known for their distinctive thorned stems and acacia-like foliage. Its species is Acacia acanthoclada, a specific type of acacia that includes the subspecies glaucescens, which is characterized by its bluish-green appearance and specific morphological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acanthoclada subsp. glaucescens is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This subspecies typically grows in dry, sandy soils and is adapted to arid and semi-arid environments. It is often seen in open woodlands and shrublands. Its distribution is largely restricted to the coastal and interior areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia acanthoclada subsp. glaucescens was mainly introduced to South Africa, particularly in the Western Cape region. It has been widely planted for ornamental purposes due to its attractive yellow flowers and drought-resistant characteristics. The plant thrives in well-drained soils and full sun, making it suitable for coastal and semi-arid environments. It is also used in reforestation and erosion control projects in its native range. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
