{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trichodes",
    "plant_slug": "acacia-trichodes",
    "plant_name_scientific": "acacia trichodes",
    "intro": "Acacia trichodes, commonly known as the silky acacia, is a small to medium-sized shrub or tree native to southern Africa. It is characterized by its narrow, feathery leaves that are covered in fine, silky hairs, giving it a soft, almost velvety appearance. The plant produces yellow flowers in clustered inflorescences, which are often visited by bees and other pollinators. Acacia trichodes is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. Its wood is sometimes used for fuel or small crafts, and it plays a role in local ecosystems by providing habitat and food for various wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trichodes is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and is often associated with savanna and shrubland ecosystems. This plant is well adapted to hot, dry climates and can thrive in areas with low rainfall. It plays an important role in stabilizing soil and providing habitat for various wildlife species. Acacia trichodes is also known for its ability to fix nitrogen, contributing to soil fertility in its native range.",
    "distribution_introduced_art_desc": "Acacia trichodes was mainly introduced to control erosion and provide shade in degraded landscapes. It is commonly found in disturbed areas such as roadsides, quarries, and agricultural fields. The plant has a rapid growth rate and can establish itself quickly in poor soil conditions. However, it may become invasive in some regions if not managed properly. Its introduction has had both positive and negative ecological impacts depending on the local environment."
}
