{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia songwensis",
    "plant_slug": "acacia-songwensis",
    "plant_name_scientific": "acacia songwensis",
    "intro": "Acacia songwensis, commonly known as the East African wattle, is a flowering plant native to eastern Africa. It is a shrub or small tree that typically grows in savanna and woodland habitats. The plant is characterized by its bipinnate leaves and yellow flowers that bloom in cylindrical spikes. Acacia songwensis is adapted to dry conditions and can thrive in poor soils. It plays an important role in local ecosystems and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia songwensis is primarily native to the eastern regions of South Africa, specifically within the Eastern Cape province. It is commonly found in rocky outcrops and mountainous areas where the climate is temperate and the soil is well-drained. This species thrives in areas with moderate rainfall and is often associated with coastal and inland mountainous habitats. Its distribution is limited to specific microhabitats that provide the necessary conditions for its growth. Acacia songwensis plays an important ecological role in its native environment, supporting local biodiversity and contributing to the structure of the vegetation.",
    "distribution_introduced_art_desc": "Acacia songwensis was mainly introduced to specific regions in East Africa, including Kenya and Tanzania, where it has been cultivated for its ornamental value and ecological benefits. It is often planted in urban landscapes and along roadsides due to its hardy nature and ability to thrive in degraded soils. The distribution of this species has been expanding as a result of its adaptability to different environmental conditions. However, its introduction has raised concerns about potential invasiveness in certain ecosystems. Despite its benefits, careful monitoring is recommended to prevent unintended ecological impacts."
}
