{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia iraqensis",
    "plant_slug": "acacia-iraqensis",
    "plant_name_scientific": "acacia iraqensis",
    "intro": "Acacia iraqensis, commonly known as the Iraqi acacia, is a shrub or small tree native to Iraq and parts of the Middle East. It is characterized by its slender, branching structure and phyllodes that are typically narrow and linear. The plant produces yellow flowers in globular clusters, which are followed by pod-like fruits containing seeds. Acacia iraqensis thrives in arid and semi-arid environments, making it well adapted to dry conditions. It is often found in rocky soils and is valued for its ecological and potential medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia iraqensis is primarily native to Iraq and parts of the Middle East. It is commonly found in arid and semi-arid regions, including deserts and rocky plains. This plant thrives in areas with low rainfall and high temperatures. It is often seen growing along roadsides and in open habitats. Its distribution is closely tied to the ecological conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia iraqensis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of the Middle East, particularly in Iraq, Jordan, and parts of Saudi Arabia. This plant is often used for soil stabilization and as a source of timber and fodder. Its introduction has helped in reclaiming degraded lands and supporting local ecosystems. Due to its hardy nature, it has become an important species in restoration projects across its range."
}
