{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica subsp. subalata",
    "plant_slug": "acacia-nilotica-subsp-subalata",
    "plant_name_scientific": "acacia nilotica subsp. subalata",
    "intro": "Acacia nilotica subsp. subalata, commonly known as the white acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its slender, often thornless branches and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow, globular flower heads that bloom in clusters, attracting pollinators such as bees and birds. Its bark and leaves have been traditionally used in medicine for their astringent and anti-inflammatory properties. The wood is hard and durable, making it valuable for construction and fuel.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica subsp. subalata is primarily native to East Africa, including countries such as Kenya, Tanzania, and Uganda. It is also found in parts of Sudan and the Horn of Africa. This subspecies thrives in arid and semi-arid environments, often growing in savannas and along riverbanks. It is well adapted to drought conditions and is commonly found in rocky or sandy soils. The plant plays an important ecological role in its native habitats, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia nilotica subsp. subalata was mainly introduced to South Africa, where it has become an invasive species. It was originally from the Horn of Africa and parts of the Arabian Peninsula. The plant was introduced for its hardy nature and potential use in agroforestry and soil stabilization. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to ecological concerns and management efforts to control its spread."
}
