{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia clavigera",
    "plant_slug": "acacia-clavigera",
    "plant_name_scientific": "acacia clavigera",
    "intro": "Acacia clavigera, commonly known as the golden wattle, is a flowering plant native to Australia. It is characterized by its distinctive yellow floral spikes and bipinnate leaves. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil. It thrives in a variety of habitats, including forests and woodlands, and is often found in coastal regions. Acacia clavigera is also recognized as the floral emblem of Australia, symbolizing the country's natural heritage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia clavigera is primarily native to eastern Australia, including New South Wales and Queensland. It is commonly found in dry sclerophyll forests and heathlands. This species thrives in well-drained soils and is often associated with rocky or sandy habitats. It is also present in parts of Victoria and South Australia. Acacia clavigera is known for its distinctive yellow flowers and is an important plant in local ecosystems.",
    "distribution_introduced_art_desc": "Acacia clavigera was mainly introduced to areas with well-drained soils and a temperate climate, typically found in regions with moderate rainfall. It thrives in open woodlands and grasslands, where it can receive ample sunlight. This plant is often found in coastal areas and can tolerate salt spray, making it suitable for coastal environments. It has been introduced to several regions outside its native range, including parts of Australia and New Zealand. Due to its hardy nature, it is sometimes used in reforestation and erosion control projects."
}
