{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia wetarensis",
    "plant_slug": "acacia-wetarensis",
    "plant_name_scientific": "acacia wetarensis",
    "intro": "Acacia wetarensis, commonly known as the Wetar acacia, is a shrub or small tree native to the island of Wetar in Indonesia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow floral spikes. The plant is adapted to tropical climates and thrives in well-drained soils. It produces small, pod-like fruits that contain several seeds. Acacia wetarensis is often found in coastal and lowland areas, contributing to local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia wetarensis"
    },
    "taxonomy_art_desc": "Acacia wetarensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose family. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod-like fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing abilities. Its species is Acacia wetarensis, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Lesser Sunda Is."
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia wetarensis is primarily native to the Lesser Sunda Islands. It is found in regions such as Sumba, Sumbawa, and Lombok, which are part of this island group. This plant thrives in tropical and subtropical climates, often in dry or semi-arid environments. It is commonly found in open woodlands and coastal areas. Its distribution is limited to specific habitats within the Lesser Sunda Islands.",
    "distribution_introduced_art_desc": "Acacia wetarensis was mainly introduced to New Guinea. It is commonly found in coastal areas and lowland regions. This plant thrives in sandy soils and is often used for its hardy characteristics. It has been introduced for ornamental purposes and as a source of timber. However, its spread has raised concerns about its impact on native ecosystems."
}
