{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia penninervis var. normalis",
    "plant_slug": "acacia-penninervis-var-normalis",
    "plant_name_scientific": "acacia penninervis var. normalis",
    "intro": "Acacia penninervis var. normalis, commonly known as the slender wattle, is a shrub or small tree native to Australia. It features narrow, linear leaves that are often arranged in a spiral pattern along the stems. The plant produces yellow globular flowers, which are typically borne in clusters during the warmer months. It is well adapted to dry and semi-arid environments, with a deep root system that helps it survive in poor soil conditions. The species is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia penninervis var. normalis is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and Malawi. It thrives in dry to semi-arid regions, often found in savannas and woodland areas. This plant is commonly associated with rocky soils and can be found in both coastal and inland habitats. It is well adapted to the tropical and subtropical climates of its native range. Its distribution is also influenced by its ability to tolerate drought and poor soil conditions.",
    "distribution_introduced_art_desc": "Acacia penninervis var. normalis was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly found in areas with low rainfall and sandy soils. This plant is valued for its ability to thrive in harsh environmental conditions. Its introduction has helped in rehabilitating arid and semi-arid regions. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
