{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pringlei subsp. californica",
    "plant_slug": "acacia-pringlei-subsp-californica",
    "plant_name_scientific": "acacia pringlei subsp. californica",
    "intro": "Acacia pringlei subsp. californica, commonly known as the California acacia, is a shrub native to coastal regions of California. It features compound leaves with small, oval leaflets and produces yellow flowers in clusters. The plant is adapted to dry, sandy soils and thrives in coastal climates. It is often used in landscaping for its drought tolerance and ornamental value. Its ecological role includes providing habitat and nectar for native pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pringlei subsp. californica is primarily native to the coastal areas of southern California, specifically in the regions of San Diego County and northern Baja California. It thrives in sandy soils along the coastline, often found in dunes and scrub habitats. This subspecies is adapted to the Mediterranean climate of the region, characterized by dry summers and mild, wet winters. It is commonly found in areas with limited vegetation, where it plays a role in stabilizing sand dunes. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acacia pringlei subsp. californica was mainly introduced to the western United States, particularly in California and parts of Nevada. It was brought in for its ornamental value due to its distinctive foliage and ability to thrive in arid conditions. The plant has been established in various habitats, including disturbed soils and rocky areas. Its introduction has led to concerns about its potential invasiveness in some regions. Despite its beauty, it requires careful management to prevent it from outcompeting native vegetation."
}
