{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stellaticeps",
    "plant_slug": "acacia-stellaticeps",
    "plant_name_scientific": "acacia stellaticeps",
    "intro": "Acacia stellaticeps, commonly known as the star-headed acacia, is a shrub native to southern Africa. It is characterized by its distinctive, star-shaped heads of yellow flowers that appear in late summer. The plant has small, bipinnate leaves that are often covered in fine hairs. Its woody stems are typically straight and can grow up to several meters in height. Acacia stellaticeps is well adapted to arid and semi-arid environments, making it a hardy and resilient species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stellaticeps"
    },
    "taxonomy_art_desc": "Acacia stellaticeps belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse flower structures. Its order is Fabales, which comprises plants with characteristic flowers that have five petals and are often associated with nitrogen-fixing symbiotic relationships. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their phyllodes and often for their ability to fix nitrogen through symbiotic bacteria. Its species is Acacia stellaticeps, a specific type of acacia characterized by its star-shaped leaves and typically found in arid or semi-arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stellaticeps is primarily native to the Northern Territory and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy soils and is often seen in shrublands and open woodlands. The plant is well adapted to the dry climate and can tolerate high temperatures. Its distribution is largely restricted to the specific ecological zones of the mentioned regions.",
    "distribution_introduced_art_desc": "Acacia stellaticeps was mainly introduced to areas with warm, dry climates and well-drained soils, often in regions where it is used for erosion control or as a ornamental plant. It thrives in full sun and is commonly found in disturbed soils such as along roadsides or in degraded landscapes. The plant is known for its distinctive star-shaped foliage and yellow flowers, making it a popular choice for landscaping in arid environments. However, it can become invasive in some regions if not managed properly. Its introduction has led to both ecological and agricultural impacts in certain areas."
}
