{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ludwigii",
    "plant_slug": "acacia-ludwigii",
    "plant_name_scientific": "acacia ludwigii",
    "intro": "Acacia ludwigii, commonly known as the Ludwig's acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its slender, multi-branched stems and bipinnate leaves that are often shed during the dry season. The plant produces yellow, globular flowerheads that attract a variety of pollinators, including bees and birds. Its seeds are enclosed in woody pods and are dispersed by animals or through mechanical means. Acacia ludwigii is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ludwigii is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This species thrives in well-drained soils and is adapted to the hot, dry climate of its native habitat. It is often seen growing along roadsides, in open woodlands, and on mountain slopes. Acacia ludwigii plays an important ecological role by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia ludwigii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the coastal areas of the country. The plant thrives in sandy soils and is often seen in coastal dunes and rocky outcrops. Due to its rapid growth and adaptability, it has spread beyond its original introduction sites. However, it is not considered invasive in most areas where it is established."
}
