{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia muriculata",
    "plant_slug": "acacia-muriculata",
    "plant_name_scientific": "acacia muriculata",
    "intro": "Acacia muriculata, commonly known as the rough acacia, is a shrub or small tree native to Australia. It is characterized by its compound leaves, which are often covered in fine, stiff hairs. The plant produces yellow flowers in spherical clusters, which are followed by flat, pod-like fruits. Acacia muriculata thrives in dry, sandy soils and is often found in arid or semi-arid regions. It is valued for its hardy nature and ability to provide habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia muriculata"
    },
    "taxonomy_art_desc": "Acacia muriculata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or bean family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and the production of pods containing seeds. Its species is Acacia muriculata, a specific type of acacia known for its unique morphology and ecological adaptations, commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia muriculata is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This plant typically grows in sandy soils and is often associated with coastal and inland dunes. It is well adapted to the dry and arid conditions of its native habitat. Acacia muriculata plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia muriculata was mainly introduced to control soil erosion and for its ornamental value in landscaping. It is commonly found in disturbed areas such as roadsides, waste lands, and along riverbanks. The plant thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. Its rapid growth and ability to fix nitrogen contribute to its success in invasive spread. However, it can outcompete native vegetation and is considered a potential weed in some areas."
}
