{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pawlikowskyana",
    "plant_slug": "acacia-pawlikowskyana",
    "plant_name_scientific": "acacia pawlikowskyana",
    "intro": "Acacia pawlikowskyana, commonly known as the Pawlikowsky's wattle, is a shrub native to Australia. It is characterized by its slender, upright growth habit and pinnate leaves composed of small, oval-shaped leaflets. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It thrives in well-drained soils and is adapted to dry, sunny environments. Acacia pawlikowskyana is valued for its ornamental appeal and its role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pawlikowskyana is primarily native to the arid and semi-arid regions of southern Africa, specifically Namibia and South Africa. It is commonly found in rocky outcrops, sandy soils, and along riverbanks in these areas. This species thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of its native habitat. It plays an important ecological role by providing shelter and food for various wildlife species. Due to its limited distribution, it is considered a rare and endemic plant in its native range.",
    "distribution_introduced_art_desc": "Acacia pawlikowskyana was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It was first recorded in the 1960s and has since spread across several regions, particularly in the North Island. The plant thrives in sunny environments and is often found in coastal and urban areas. Its rapid growth and ability to establish itself in disturbed soils have led to concerns about its potential invasiveness. Despite its aesthetic value, ongoing monitoring is necessary to assess its ecological impact."
}
