{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lanigera",
    "plant_slug": "acacia-lanigera",
    "plant_name_scientific": "acacia lanigera",
    "intro": "Acacia lanigera, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and dense clusters of small, yellow flowers. The plant produces flattened, leathery pods that contain several seeds. Its leaves are typically reduced to small, scale-like structures, giving it a distinctive appearance. Acacia lanigera thrives in arid and semi-arid environments, often found in rocky soils and savanna habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lanigera"
    },
    "taxonomy_art_desc": "Acacia lanigera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with showy flowers and diverse habitats. Its order is Fabales, which includes plants with flowers that typically have five petals and include legumes, which are important for nitrogen fixation. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their acacia-like foliage and often used in traditional medicine and as sources of timber. Its species is Acacia lanigera, a specific type of acacia found in certain regions, characterized by its hairy leaves and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lanigera is primarily native to New South Wales and Victoria. It is commonly found in the coastal and inland regions of these states. This plant thrives in a variety of soil types but prefers well-drained soils. It is often seen in open woodlands and heathlands. Acacia lanigera plays an important role in the local ecosystem by providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Acacia lanigera was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly found in arid and semi-arid regions where it provides valuable habitat for local wildlife. This plant has been successfully established in several parts of Australia and has shown adaptability to various soil types. Its introduction has also contributed to the restoration of native vegetation in disturbed areas. However, its spread requires careful management to avoid potential ecological impacts."
}
