{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia juncifolia subsp. serpentinicola",
    "plant_slug": "acacia-juncifolia-subsp-serpentinicola",
    "plant_name_scientific": "acacia juncifolia subsp. serpentinicola",
    "intro": "Acacia juncifolia subsp. serpentinicola, commonly known as the serpentine acacia, is a shrub native to southern Africa. It is characterized by its narrow, linear leaves and yellow flowers that appear in globular inflorescences. This subspecies is adapted to grow in nutrient-poor, calcareous soils, particularly on serpentine rock formations. Its ability to thrive in such harsh conditions makes it an important component of these unique ecosystems. The plant is also valued for its role in soil stabilization and as a source of traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia juncifolia subsp. serpentinicola is primarily native to the coastal regions of southern Western Australia. This subspecies is commonly found in areas with sandy soils and coastal dunes. It thrives in arid and semi-arid environments, often growing in association with other endemic flora. The plant is adapted to tolerate salt spray and high wind exposure typical of coastal habitats. Its distribution is largely restricted to the southern half of the state, particularly around the Geraldton and Shark Bay regions.",
    "distribution_introduced_art_desc": "Acacia juncifolia subsp. serpentinicola was mainly introduced to areas with serpentine soils due to its ability to thrive in nutrient-poor, aluminum-rich environments. It is commonly found in rocky and coastal regions where other plant species struggle to survive. This subspecies has been introduced to several parts of Australia, particularly in the south-western and eastern regions. Its introduction has sometimes led to ecological concerns due to its potential to outcompete native flora. Despite its invasive tendencies, it plays a role in stabilizing soils in degraded landscapes."
}
