{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glabripes",
    "plant_slug": "acacia-glabripes",
    "plant_name_scientific": "acacia glabripes",
    "intro": "Acacia glabripes, commonly known as the smooth acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-stemmed form and its bipinnate leaves, which are finely divided and give the plant a delicate appearance. The plant produces yellow flowers in globular or cylindrical inflorescences, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in savanna and woodland habitats. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardiness and visual interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glabripes is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy or gravelly soils and is commonly found in shrublands and open woodlands. This species is well adapted to hot, dry climates and can tolerate poor soil conditions. It is often used as a source of firewood and has cultural significance in some local communities. Acacia glabripes plays an important role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia glabripes was mainly introduced to South Africa, where it has been widely planted for its ornamental value and its ability to thrive in arid conditions. It is commonly found in gardens and along roadsides, particularly in the Western and Eastern Cape provinces. The plant is also used in reclamation projects due to its fast growth and nitrogen-fixing capabilities. However, it has the potential to become invasive in certain environments if not managed properly. Its introduction has led to both ecological and economic benefits in the region."
}
