{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riparia var. pseudoadhaerens",
    "plant_slug": "acacia-riparia-var-pseudoadhaerens",
    "plant_name_scientific": "acacia riparia var. pseudoadhaerens",
    "intro": "Acacia riparia var. pseudoadhaerens, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, wiry stems and narrow, feathery leaves that are often covered in fine hairs. The plant produces small, yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in sandy or gravelly soils and is often found in coastal and inland regions. This variety is noted for its adaptability to arid conditions and its role in stabilizing soils in degraded areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riparia var. pseudoadhaerens is primarily native to the semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils along riverbanks and in grassland habitats. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of its native range. The plant is often used in traditional medicine and is an important component of local ecosystems. Its distribution is closely linked to water availability, making it a characteristic species of floodplain and riparian zones.",
    "distribution_introduced_art_desc": "Acacia riparia var. pseudoadhaerens was mainly introduced to areas with sandy or gravelly soils along riverbanks and disturbed sites. It is commonly found in the southwestern United States, particularly in Arizona and New Mexico. This plant is often associated with riparian zones and can thrive in both full sun and partial shade. It is known for its ability to tolerate drought and poor soil conditions. Its introduction has led to concerns about its potential invasiveness in certain ecosystems."
}
