{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cedroides",
    "plant_slug": "acacia-cedroides",
    "plant_name_scientific": "acacia cedroides",
    "intro": "Acacia cedroides, commonly known as the African silver acacia, is a small to medium-sized evergreen tree native to parts of Africa. It is characterized by its slender, often multi-branched trunk and dense, feathery foliage composed of bipinnate leaves. The plant produces yellow flowers in clusters, which are followed by long, flat pods containing seeds. It thrives in well-drained soils and is drought-tolerant, making it adaptable to arid and semi-arid environments. Acacia cedroides is also valued for its ability to fix nitrogen, improving soil fertility in degraded areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cedroides"
    },
    "taxonomy_art_desc": "Acacia cedroides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns, horsetails, and other primitive vascular plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have small, inconspicuous flowers and often include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular (needle-like) leaves and often fragrant flowers. Its species is Acacia cedroides, a specific type of acacia known for its woody structure and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cedroides is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This plant typically grows in dry, sandy soils and is often seen in shrublands and woodlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia cedroides plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia cedroides was mainly introduced to areas with semi-arid to arid climates, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, including countries like Namibia, Botswana, and South Africa. This plant is often used for its hardy nature and ability to provide shade and forage for livestock. Its introduction has been primarily for ecological restoration and land stabilization purposes. However, it can become invasive in certain environments if not managed properly."
}
