{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spirocarpa",
    "plant_slug": "acacia-spirocarpa",
    "plant_name_scientific": "acacia spirocarpa",
    "intro": "Acacia spirocarpa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging branches and small, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Acacia spirocarpa is well adapted to arid and semi-arid environments, showing drought tolerance and ability to fix nitrogen through its root nodules. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spirocarpa is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This plant is well adapted to drought conditions and thrives in open woodlands and shrublands. It plays an important ecological role by providing habitat and food for various native animals. Its distribution is closely linked to the availability of water and soil type in its native range.",
    "distribution_introduced_art_desc": "Acacia spirocarpa was mainly introduced to areas with dry, sandy soils and a warm climate, typically found in regions such as parts of Australia and the Mediterranean. It is often cultivated for its ornamental value due to its distinctive foliage and ability to thrive in arid conditions. The plant is also used in reforestation projects because of its fast growth rate and nitrogen-fixing capabilities. However, it can become invasive in some ecosystems if not managed properly. Its distribution is primarily limited by its need for well-drained soil and low humidity."
}
