{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. typica",
    "plant_slug": "acacia-longifolia-var-typica",
    "plant_name_scientific": "acacia longifolia var. typica",
    "intro": "Acacia longifolia var. typica, commonly known as the coastal wattles, is a shrub or small tree native to southern Australia. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves. The plant produces yellow flower spikes that bloom in spring, attracting a variety of pollinators. It thrives in coastal and sandy soils, often forming dense thickets. Due to its hardiness and ornamental value, it is widely cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. typica is primarily native to southern Australia, including the states of New South Wales, Victoria, and South Australia. It is commonly found in coastal regions, sandy soils, and open woodlands. This variety is well adapted to dry and sunny environments, often growing in heathlands and scrublands. It plays an important ecological role by providing habitat and food for local wildlife. Its distribution is also influenced by its ability to thrive in nutrient-poor soils.",
    "distribution_introduced_art_desc": "Acacia longifolia var. typica was mainly introduced to South Africa, where it has become naturalized in coastal and sandy areas. It is commonly found in regions with a Mediterranean climate, such as the Western Cape. This plant is often used for erosion control due to its ability to thrive in poor soils. However, it can become invasive in some areas, outcompeting native vegetation. Its rapid growth and adaptability have led to its widespread distribution along the coastline."
}
