{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia thozetiana",
    "plant_slug": "acacia-thozetiana",
    "plant_name_scientific": "acacia thozetiana",
    "intro": "Acacia thozetiana, commonly known as the Madagascar acacia, is a shrub or small tree native to Madagascar. It is characterized by its compound leaves, which are often bipinnate, and its yellow flowers arranged in cylindrical inflorescences. The plant produces pod-like fruits that contain seeds, and it is adapted to the dry and arid conditions of its native habitat. Acacia thozetiana is also valued for its ecological role in providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia thozetiana is primarily native to Madagascar. It is found in the eastern part of the island, particularly in the northeastern regions. This species thrives in dry, rocky habitats and is commonly found in arid or semi-arid areas. It is adapted to the unique climate and soil conditions of Madagascar. Acacia thozetiana is an important component of the local flora and is often found in dry forests and scrublands.",
    "distribution_introduced_art_desc": "Acacia thozetiana was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, particularly in countries like South Africa, Namibia, and Botswana. This plant is often used for its hardy nature and ability to provide shade and erosion control. Its introduction has been primarily for ecological restoration and land stabilization purposes. However, it has also been reported as an invasive species in some regions outside its native range."
}
