{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciopsis bilimekii",
    "plant_slug": "acaciopsis-bilimekii",
    "plant_name_scientific": "acaciopsis bilimekii",
    "intro": "Acaciopsis bilimekii, commonly known as the Socotra acacia, is a unique plant native to the island of Socotra in the Arabian Sea. It belongs to the Fabaceae family and is characterized by its distinctive, thorn-covered stems and compound leaves. The plant produces small, yellow flowers that are followed by pod-like fruits containing seeds. It thrives in arid and semi-arid environments, adapting to the harsh climate of its native habitat. Due to its ecological significance and limited distribution, it is considered a rare and valuable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciopsis bilimekii is primarily native to the island of Socotra, which is located in the Arabian Sea. This unique plant is found in the arid and mountainous regions of Socotra, where it thrives in rocky and limestone soils. It is a member of the Fabaceae family and is known for its distinctive appearance, including its yellow flowers and woody stems. Due to its restricted habitat, Acaciopsis bilimekii is considered a rare and endemic species. Conservation efforts are ongoing to protect this plant from threats such as habitat loss and climate change.",
    "distribution_introduced_art_desc": "Acaciopsis bilimekii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Kenya, Tanzania, and Somalia. This plant is often used for its hardy nature and ability to withstand drought conditions. It has been introduced to various ecological restoration projects due to its potential for soil stabilization. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
