{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptophylla",
    "plant_slug": "acacia-leptophylla",
    "plant_name_scientific": "acacia leptophylla",
    "intro": "Acacia leptophylla, commonly known as the slender-leaved wattle, is a shrub native to Western Australia. It is characterized by its narrow, elongated phyllodes that are typically light green in color. The plant produces yellow flowers in late winter to early spring, which are arranged in cylindrical spikes. Acacia leptophylla is well adapted to arid and semi-arid environments, with a deep root system that helps it survive in dry conditions. It plays an important role in local ecosystems by providing food and habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptophylla is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Angola, and parts of South Africa. It thrives in sandy or gravelly soils and is commonly found in coastal dunes and inland savannas. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia leptophylla is also sometimes cultivated as an ornamental plant due to its distinctive appearance.",
    "distribution_introduced_art_desc": "Acacia leptophylla was mainly introduced to areas with sandy or loamy soils and a temperate to subtropical climate. It thrives in regions with moderate rainfall and well-drained soil conditions. This plant is commonly found in coastal and inland dune environments. It has been introduced to several parts of Australia, including New South Wales and South Australia. Due to its hardy nature, it is often used for erosion control and as a landscape plant."
}
