{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia reficiens",
    "plant_slug": "acacia-reficiens",
    "plant_name_scientific": "acacia reficiens",
    "intro": "Acacia reficiens, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its compound leaves and yellow flowers that bloom in cylindrical spikes. The plant is part of the Fabaceae family, which includes many legumes, and it has a symbiotic relationship with nitrogen-fixing bacteria. Acacia reficiens thrives in dry, sandy soils and is often found in coastal regions. Its ecological importance includes providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Poales",
        "family": "Cyperaceae",
        "genus": "Cyperus",
        "species": "Cyperus usitatus"
    },
    "taxonomy_art_desc": "Acacia reficiens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Poales, which consists of grasses and related plants, known for their wind pollination and C4 photosynthesis. Its family is Cyperaceae, commonly known as the sedge family, which includes plants with three-ranked leaves and usually three-sided stems. Its genus is Cyperus, a group of flowering plants commonly known as sedges, which are often found in wet or marshy habitats. Its species is Cyperus usitatus, a specific type of sedge that is widely distributed and often used in ornamental horticulture.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Botswana",
        "Namibia",
        "Northern Provinces",
        "Tanzania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia reficiens is primarily native to Botswana, Namibia, Northern Provinces, and Tanzania. This species is commonly found in arid and semi-arid regions across these countries. It thrives in sandy soils and is often seen in savanna and woodland habitats. The plant is well adapted to the harsh environmental conditions of its native range. It plays an important ecological role in supporting local wildlife and maintaining soil stability.",
    "distribution_introduced_art_desc": "Acacia reficiens was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was originally from Australia and was likely introduced through human activity, such as accidental transport or intentional planting. The plant thrives in disturbed areas and can outcompete native vegetation, leading to ecological concerns. It is commonly found in coastal and inland areas with sandy soils. Due to its rapid growth and spread, it is now considered a weed in many parts of its introduced range."
}
