{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia schinoides",
    "plant_slug": "acacia-schinoides",
    "plant_name_scientific": "acacia schinoides",
    "intro": "Acacia schinoides, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and feathery, bipinnate leaves. The plant produces yellow globular flowers in late winter to early spring, which are followed by flat, pod-like fruits. Acacia schinoides is adapted to arid and semi-arid environments, showcasing drought resistance and efficient water use. It plays an important ecological role in providing habitat and food for various native wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia schinoides"
    },
    "taxonomy_art_desc": "Acacia schinoides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Fabales, which includes plants with distinctive flowers that have five petals and are often associated with nitrogen-fixing symbiotic relationships. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities through root nodules. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia schinoides, a specific type of acacia known for its shrub-like form and its adaptation to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [
        "Kenya",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acacia schinoides is primarily native to New South Wales. It is commonly found in the coastal and tableland regions of the state. This plant typically grows in open forests, woodlands, and heathlands. It thrives in well-drained soils and is adapted to a variety of climatic conditions. Acacia schinoides is an important component of the local flora and plays a role in supporting native wildlife.",
    "distribution_introduced_art_desc": "Acacia schinoides was mainly introduced to Kenya and Zimbabwe. It is commonly found in savanna and woodland areas within these regions. The plant is often used for its hardy nature and ability to thrive in dry conditions. It has been introduced for purposes such as soil stabilization and as a source of timber. However, its spread has raised concerns about its potential impact on native ecosystems."
}
