{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia beckleri subsp. megaspherica",
    "plant_slug": "acacia-beckleri-subsp-megaspherica",
    "plant_name_scientific": "acacia beckleri subsp. megaspherica",
    "intro": "Acacia beckleri subsp. megaspherica, commonly known as the large globe acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its distinctive globular or spherical shape, formed by the dense clustering of its thorned branches. The plant produces yellow flowers in winter, which are clustered in spherical inflorescences, giving it its common name. Its leaves are small, phyllodes, and it has a deep root system adapted to drought conditions. This species is often used in landscaping for its unique appearance and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia beckleri"
    },
    "taxonomy_art_desc": "Acacia beckleri subsp. megaspherica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia beckleri, a specific variant within the Acacia genus, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia beckleri subsp. megaspherica is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the northern and eastern parts. This subspecies thrives in sandy soils and is often associated with low shrubland and open woodlands. It is well adapted to the harsh climatic conditions of the region, including high temperatures and low rainfall. The plant plays an important role in the local ecosystem, providing habitat and food for various native fauna.",
    "distribution_introduced_art_desc": "Acacia beckleri subsp. megaspherica was mainly introduced to areas with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It thrives in well-drained soils and is often found in coastal regions and inland valleys. This subspecies is commonly used for erosion control and as an ornamental plant due to its unique foliage and hardy nature. It has been introduced to parts of California, Oregon, and other regions with similar climatic conditions. However, it can become invasive in some areas if not managed properly."
}
