{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ingramii",
    "plant_slug": "acacia-ingramii",
    "plant_name_scientific": "acacia ingramii",
    "intro": "Acacia ingramii, commonly known as the narrow-leaf wattle, is a small shrub native to Western Australia. It is characterized by its slender, linear leaves and yellow, globular flower heads that appear in spring. The plant is adapted to arid and semi-arid environments, showcasing drought tolerance through its deep root system. It plays a role in stabilizing sandy soils and providing habitat for native wildlife. Acacia ingramii is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ingramii"
    },
    "taxonomy_art_desc": "Acacia ingramii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its characteristic pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and as sources of timber. Its species is Acacia ingramii, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ingramii is primarily native to New South Wales. It is commonly found in the coastal and tableland regions of the state. This species thrives in sandy soils and is often seen in heathlands and open forests. It is well adapted to the dry and sunny conditions of the region. Acacia ingramii plays an important role in the local ecosystem and is a characteristic plant of the area.",
    "distribution_introduced_art_desc": "Acacia ingramii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, thriving in the warm, dry climate. This plant is often used for erosion control due to its dense root system and ability to stabilize soil. However, it can also become invasive in some areas, outcompeting native vegetation. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
