{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia semitrullata",
    "plant_slug": "acacia-semitrullata",
    "plant_name_scientific": "acacia semitrullata",
    "intro": "Acacia semitrullata, commonly known as the narrow-leaf wattle, is a shrub native to Western Australia. It is characterized by its slender, zigzagging stems and small, bipinnate leaves that are often covered in fine hairs. The plant produces yellow globular flowers in late winter to early spring, which are followed by flat, pod-like fruits. Acacia semitrullata is drought-tolerant and thrives in sandy or gravelly soils. It plays an important role in stabilizing coastal and sandy soils and provides habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia semitrullata"
    },
    "taxonomy_art_desc": "Acacia semitrullata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving alternating generations. Its class is Equisetopsida, which comprises ferns, horsetails, and their relatives, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with specialized structures for pollination. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in landscaping and traditional medicine. Its species is Acacia semitrullata, a specific type of acacia known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia semitrullata is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy or gravelly soils. This species thrives in arid and semi-arid environments, often growing in open woodlands or shrublands. It is well adapted to the hot and dry climate of its native habitat. The plant plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia semitrullata was mainly introduced to regions with arid or semi-arid climates where it can thrive in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for rehabilitation of degraded lands. This plant is often used in afforestation projects due to its ability to fix nitrogen and improve soil fertility. Its introduction has helped in stabilizing soils and preventing erosion in various parts of Australia and Africa. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
