{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tenuispina",
    "plant_slug": "acacia-tenuispina",
    "plant_name_scientific": "acacia tenuispina",
    "intro": "Acacia tenuispina, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping phyllodes that are typically 2–6 cm long. The plant produces yellow flowers in globular or cylindrical inflorescences, which bloom in spring and summer. Acacia tenuispina is adapted to arid and semi-arid environments, making it resilient to drought conditions. Its foliage and flowers provide nectar for various pollinators, including honeyeaters and bees.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tenuispina is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry and hot climates. This plant is well adapted to low rainfall and poor soil conditions, making it a resilient species in its native habitat. It plays an important role in the local ecosystem by providing food and shelter for various wildlife species. Its distribution is largely confined to the southern African region, with limited occurrences in neighboring areas.",
    "distribution_introduced_art_desc": "Acacia tenuispina was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in Western Australia and South Australia. This plant is often used for erosion control due to its ability to stabilize soil and tolerate harsh environmental conditions. Its introduction has also been noted in some parts of Southeast Asia and the Mediterranean. However, it is considered a potential invasive species in certain regions where it can outcompete native flora."
}
