{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia frondosa",
    "plant_slug": "acacia-frondosa",
    "plant_name_scientific": "acacia frondosa",
    "intro": "Acacia frondosa, commonly known as the silky acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small, thread-like leaflets. The plant produces yellow flowers in dense, globular inflorescences, which appear in late winter to early spring. Its wood is light, soft, and used in various traditional crafts. The species is also valued for its ornamental appeal and ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia frondosa is primarily native to the eastern United States, specifically from New Jersey to Florida. It thrives in a variety of habitats, including woodlands, wetlands, and disturbed areas. This species is commonly found in the coastal plain regions of the southeastern U.S. It is also present in parts of the Midwest, such as Illinois and Indiana. Acacia frondosa prefers moist, well-drained soils and is often associated with riparian zones.",
    "distribution_introduced_art_desc": "Acacia frondosa was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its rapid growth and hardiness make it a popular choice for windbreaks and land restoration. However, in some areas, it has become invasive, outcompeting native vegetation."
}
