{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia costaricensis",
    "plant_slug": "acacia-costaricensis",
    "plant_name_scientific": "acacia costaricensis",
    "intro": "Acacia costaricensis, commonly known as the Guatemalan wattle, is a shrub or small tree native to Central America. It belongs to the Fabaceae family, which is characterized by its pod fruits and often nitrogen-fixing abilities. The plant has feathery, bipinnate leaves and produces yellow flowers in clusters. It is typically found in dry to semi-deciduous forests and is adapted to tropical climates. Acacia costaricensis is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia costaricensis is primarily native to Central America, specifically found in countries such as Costa Rica, Panama, and parts of Nicaragua. It thrives in tropical and subtropical regions, often growing in dry forests and along riverbanks. This species is commonly found in lowland areas with well-drained soils. It plays an important ecological role in its native habitat by providing shelter and food for local wildlife. Due to its adaptability, it is also occasionally cultivated in other parts of the tropics.",
    "distribution_introduced_art_desc": "Acacia costaricensis was mainly introduced to tropical and subtropical regions of Central and South America, particularly in countries like Costa Rica, Panama, and Colombia. It is often found in disturbed habitats such as roadsides, abandoned pastures, and secondary forests. The plant thrives in well-drained soils and full sun, making it adaptable to various environmental conditions. Its introduction has led to its naturalization in several areas, sometimes competing with native vegetation. Due to its rapid growth and ability to fix nitrogen, it is sometimes used for soil stabilization and reforestation efforts."
}
