{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decora var. biglandulosa",
    "plant_slug": "acacia-decora-var-biglandulosa",
    "plant_name_scientific": "acacia decora var. biglandulosa",
    "intro": "Acacia decora var. biglandulosa, commonly known as the biglandular acacia, is a shrub or small tree native to the arid regions of Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small, linear leaflets. The plant produces yellow, spherical flower heads that are clustered in dense, globular inflorescences. Its bark is typically smooth and greyish, with a tendency to flake off in small, irregular pieces. The species is well adapted to drought and is often used in landscaping for its ornamental value and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decora var. biglandulosa is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and Mozambique. This variant is commonly found in savanna and woodland habitats, often growing in well-drained soils. It thrives in regions with a tropical or subtropical climate and is adapted to seasonal rainfall patterns. The plant is known for its distinctive yellow flowers and is often used in traditional medicine and as a source of timber. Its distribution is closely linked to areas with open vegetation and moderate to high rainfall.",
    "distribution_introduced_art_desc": "Acacia decora var. biglandulosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive appearance and hardy nature. However, it has since become invasive, outcompeting native species in certain regions. The plant thrives in a variety of soil types and is drought-tolerant, which contributes to its spread. Efforts are ongoing to manage its impact on local ecosystems."
}
