{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tetragonocarpa",
    "plant_slug": "acacia-tetragonocarpa",
    "plant_name_scientific": "acacia tetragonocarpa",
    "intro": "Acacia tetragonocarpa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and bipinnate leaves composed of small, opposite leaflets. The plant produces yellow flowers in cylindrical spikes, which bloom in spring and attract nectar-feeding birds and insects. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia tetragonocarpa is well-suited to arid and semi-arid environments, showing some degree of drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tetragonocarpa"
    },
    "taxonomy_art_desc": "Acacia tetragonocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants that typically have compound leaves and produce legume-like fruits, often forming symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods as fruits and often containing nitrogen-fixing symbiotic relationships. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia tetragonocarpa, a specific type of acacia found in certain regions of Australia, characterized by its four-sided stems and small leaves.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tetragonocarpa is primarily native to Western Australia. It is found in the coastal regions and surrounding areas of the state. This plant typically grows in sandy soils and is commonly seen in heathlands and woodlands. It is well adapted to the arid and semi-arid climates of the region. Its distribution is largely confined to the southwestern part of Western Australia.",
    "distribution_introduced_art_desc": "Acacia tetragonocarpa was mainly introduced to New Zealand. It was brought there for its ornamental value and potential for soil stabilization. The plant has since become naturalized in several regions of the country. It thrives in a variety of soil types and is tolerant of both drought and frost. However, it is considered a potential weed in some areas due to its rapid growth and ability to spread aggressively."
}
