{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brevifolia",
    "plant_slug": "acacia-brevifolia",
    "plant_name_scientific": "acacia brevifolia",
    "intro": "Acacia brevifolia, commonly known as the narrow-leaved wattle, is a small shrub native to Australia. It is characterized by its slender, zigzagging stems and small, rounded phyllodes that are typically green with a slight reddish tinge. The plant produces yellow globular flowerheads that appear in late winter to early spring, attracting nectar-feeding birds and insects. It thrives in sandy or loamy soils and is often found in coastal regions and heathlands. Acacia brevifolia is well adapted to dry conditions and is drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brevifolia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and shrubland habitats. This species is well adapted to dry climates and can tolerate high temperatures and low rainfall. It plays an important ecological role by providing food and shelter for various animals. Acacia brevifolia is also known for its small, globular fruit pods and its ability to fix nitrogen in the soil.",
    "distribution_introduced_art_desc": "Acacia brevifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. The plant is known for its ability to tolerate drought and saline conditions, making it adaptable to various environments. It plays a role in soil stabilization and provides habitat for local wildlife. However, its spread can sometimes lead to ecological concerns due to its invasive potential in non-native areas."
}
