{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia eriantha",
    "plant_slug": "acacia-eriantha",
    "plant_name_scientific": "acacia eriantha",
    "intro": "Acacia eriantha, commonly known as the hairy wattle, is a shrub or small tree native to Australia. It is characterized by its yellow flowers and feathery leaves, which are often covered in fine hairs. The plant belongs to the Fabaceae family, known for its nitrogen-fixing ability, which benefits soil fertility. Acacia eriantha thrives in a variety of habitats, including woodlands and coastal areas. Its seed pods are typically flattened and contain several seeds, contributing to its reproductive strategy.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "India"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia eriantha is primarily native to India. It is commonly found in the southern and eastern regions of the country. This plant thrives in tropical and subtropical climates. It is often seen in dry, open habitats such as scrublands and forest edges. Acacia eriantha plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia eriantha was mainly introduced to areas with warm, dry climates and well-drained soils, often found in regions with Mediterranean or subtropical characteristics. It is commonly established in disturbed sites such as roadsides, abandoned fields, and along riverbanks. The plant thrives in full sun and is relatively drought-tolerant, making it adaptable to a variety of environmental conditions. Its introduction has sometimes led to it becoming invasive in certain regions, outcompeting native vegetation. Due to its hardy nature, it is often used in landscaping and for soil stabilization in arid environments."
}
