{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brunioides",
    "plant_slug": "acacia-brunioides",
    "plant_name_scientific": "acacia brunioides",
    "intro": "Acacia brunioides, commonly known as the coastal wattle, is a shrub or small tree native to southern Australia. It is characterized by its slender, often twisted branches and phyllodes that are typically pale green to yellowish in color. The plant produces yellow flowers in late spring to early summer, which are clustered in cylindrical inflorescences. Acacia brunioides is well adapted to coastal environments, tolerating salt spray and sandy soils. It plays an important ecological role in stabilizing dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia brunioides"
    },
    "taxonomy_art_desc": "Acacia brunioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which includes legumes and related plants known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive foliage and often symbiotic relationships with ants. Its species is Acacia brunioides, a specific type of acacia found in certain regions, recognized by its unique morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brunioides is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, open habitats such as woodlands, grasslands, and rocky areas. This species is well adapted to the arid and semi-arid climates of these regions. It plays an important ecological role by providing habitat and food for various native animals. Its distribution is largely confined to the eastern part of Australia within these two states.",
    "distribution_introduced_art_desc": "Acacia brunioides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. The plant is known for its hardy nature and ability to withstand drought conditions. It has been used in reclamation projects due to its fast growth and nitrogen-fixing capabilities. However, its spread has raised concerns about its potential to become invasive in local ecosystems."
}
