{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia matthewii",
    "plant_slug": "acacia-matthewii",
    "plant_name_scientific": "acacia matthewii",
    "intro": "Acacia matthewii, commonly known as the Matthew's acacia, is a shrub native to southern Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features small, yellow flowers arranged in cylindrical inflorescences, which attract pollinators like bees and birds. Its woody stems are often covered in a layer of fine, white hairs. Acacia matthewii is adapted to arid environments, making it resilient to drought and heat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia matthewii"
    },
    "taxonomy_art_desc": "Acacia matthewii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often characterized by their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are typically shrubs or trees with phyllodes and yellow flowers. Its species is Acacia matthewii, a specific type of acacia found in certain regions, known for its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia matthewii is primarily native to New South Wales. It is commonly found in the dry, sandy soils of the inland regions of the state. This plant thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the climate of New South Wales, with its small, waxy leaves helping to conserve water. Acacia matthewii plays an important ecological role in its native habitat, providing food and shelter for local wildlife.",
    "distribution_introduced_art_desc": "Acacia matthewii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, including countries like Namibia, Botswana, and South Africa. This plant is often used for its hardy nature and ability to withstand drought conditions. It has been introduced to other parts of the world as an ornamental or for erosion control. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
