{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chapmanii",
    "plant_slug": "acacia-chapmanii",
    "plant_name_scientific": "acacia chapmanii",
    "intro": "Acacia chapmanii, commonly known as the Chapman's wattle, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, wiry stems and small, yellow floral spikes that bloom in late winter or early spring. The plant produces small, bean-like pods that contain seeds, which are dispersed by wind. Acacia chapmanii is adapted to harsh, dry environments and has a deep root system to access water. It is often used in restoration projects due to its ability to stabilize soil and its resilience to drought.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia chapmanii"
    },
    "taxonomy_art_desc": "Acacia chapmanii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, including horsetails and some modern ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and vetches. Its family is Fabaceae, also known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, many of which are native to Australia. Its species is Acacia chapmanii, a specific type of acacia found in certain regions of Australia, known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chapmanii is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This species thrives in coastal and inland regions, often growing in open woodlands and heathlands. It is well adapted to the dry and sunny climate of its native habitat. Acacia chapmanii plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia chapmanii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and has spread into parts of the Eastern Cape. The plant thrives in well-drained soils and is often seen in coastal areas and fynbos vegetation. Its introduction has led to concerns about its potential to become invasive in native ecosystems. Despite its ornamental value, it requires careful management to prevent ecological disruption."
}
