{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata f. ornithophora",
    "plant_slug": "acacia-armata-f-ornithophora",
    "plant_name_scientific": "acacia armata f. ornithophora",
    "intro": "Acacia armata f. ornithophora, commonly known as the golden wattle, is a shrub native to Australia. It is characterized by its distinctive yellow flowers that bloom in late winter to early spring. The plant has phyllodes, which are flattened leaf-like stems that perform the function of leaves. It thrives in well-drained soils and is often found in coastal and inland regions. This variety is notable for its ornamental value and is widely cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata f. ornithophora is primarily native to South Africa, specifically the Western Cape Province. This subspecies is commonly found in the fynbos vegetation type, which is characteristic of the region's Mediterranean climate. It thrives in sandy or rocky soils and is often associated with coastal and mountainous areas. The plant is well adapted to the dry summers and wet winters typical of its native environment. It plays an important role in the local ecosystem and is valued for its ornamental qualities.",
    "distribution_introduced_art_desc": "Acacia armata f. ornithophora was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and semi-arid areas, particularly in the Western Cape and Eastern Cape provinces. This form is known for its distinctive ornamental features, including its finely feathery foliage and yellow flowers. It is often cultivated for its aesthetic value in gardens and landscapes. However, it can also pose a potential invasive risk in some ecosystems if not managed properly."
}
