{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia formosa",
    "plant_slug": "acacia-formosa",
    "plant_name_scientific": "acacia formosa",
    "intro": "Acacia formosa, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, zigzagging branches and small, feathery leaves that are covered in fine hairs. The plant produces yellow to orange flowers that bloom in winter, attracting a variety of pollinators. Its seeds are encased in pods that split open to release the seeds, aiding in its dispersal. Acacia formosa is often used in horticulture for its ornamental value and is relatively drought-tolerant once established.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia formosa is primarily native to southern and eastern Africa, including countries such as South Africa, Mozambique, Zimbabwe, and Tanzania. It thrives in a variety of habitats, including grasslands, woodlands, and coastal areas. This species is commonly found in regions with a warm climate and well-drained soils. It plays an important ecological role by providing food and shelter for local wildlife. Acacia formosa is also known for its distinctive yellow flowers and thorny structure.",
    "distribution_introduced_art_desc": "Acacia formosa was mainly introduced to ornamental horticulture and reforestation projects due to its attractive foliage and adaptability to various soil types. It is commonly found in regions with warm climates, including parts of Australia, the United States, and South Africa. The plant's rapid growth and ability to thrive in disturbed environments have led to its spread beyond cultivation. However, in some areas, it has become invasive, outcompeting native vegetation. Its introduction has raised concerns about ecological impacts in non-native habitats."
}
