{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia inamabilis",
    "plant_slug": "acacia-inamabilis",
    "plant_name_scientific": "acacia inamabilis",
    "intro": "Acacia inamabilis, commonly known as the sweet acacia, is a flowering plant native to parts of Africa and the Middle East. It belongs to the legume family, Fabaceae, and is characterized by its distinctive feathery foliage and yellow or golden flowers. The plant is known for its ability to thrive in arid and semi-arid environments, making it well-adapted to drought conditions. Its bark and leaves have been traditionally used in herbal medicine for their purported health benefits. Acacia inamabilis also plays an important ecological role by providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia inamabilis"
    },
    "taxonomy_art_desc": "Acacia inamabilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive leaf structures and often used in traditional medicine and as sources of timber. Its species is Acacia inamabilis, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia inamabilis is primarily native to Western Australia. It is commonly found in the coastal regions and sandplains of the state. This species thrives in sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the dry and warm climate of the region. Acacia inamabilis plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia inamabilis was mainly introduced to South Africa as an ornamental plant due to its unique appearance and hardiness. It is commonly found in gardens and along roadsides, where it thrives in well-drained soils and full sun. Despite its aesthetic value, it has the potential to become invasive in certain environments if not managed properly. The plant is also valued for its ability to fix nitrogen, which can improve soil fertility. However, its spread requires careful monitoring to prevent ecological disruption."
}
