{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia huilana",
    "plant_slug": "acacia-huilana",
    "plant_name_scientific": "acacia huilana",
    "intro": "Acacia huilana, commonly known as the Huilá acacia, is a shrub or small tree native to the Andean regions of Colombia and Ecuador. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow to orange globular flower heads, which are clustered in dense, spherical inflorescences. Acacia huilana is adapted to high-altitude environments, thriving in cool, temperate climates with well-drained soils. It plays a role in local ecosystems and has been used traditionally for its medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia huilana is primarily native to Central America, specifically found in countries such as Guatemala, Honduras, and El Salvador. It is commonly found in dry to semi-arid regions, often growing in disturbed or open habitats. This species is adapted to tropical climates and thrives in areas with well-drained soils. It is often seen in coastal areas and lowland regions, where it plays a role in stabilizing soil and providing habitat for local wildlife. Acacia huilana is an important plant in the ecological systems of its native range.",
    "distribution_introduced_art_desc": "Acacia huilana was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions of Central and South America, particularly in countries like Colombia, Ecuador, and Peru. This plant is often cultivated for its ornamental value and ability to fix nitrogen in the soil. It is also used in reforestation projects due to its fast growth and adaptability. However, its introduction has sometimes led to competition with native species in certain ecosystems."
}
