{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia theronii",
    "plant_slug": "acacia-theronii",
    "plant_name_scientific": "acacia theronii",
    "intro": "Acacia theronii, commonly known as the white thorn acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often thorned stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow flowers in dense clusters, which are followed by long, flat pods containing seeds. Acacia theronii is adapted to arid and semi-arid environments, making it a resilient species in dry regions. It plays a role in local ecosystems and has been used traditionally for its timber and as a source of fodder.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia theronii is primarily native to the southern regions of Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in arid and semi-arid environments, particularly in savannas and rocky outcrops. This species thrives in areas with low rainfall and is often adapted to withstand harsh climatic conditions. It plays an important ecological role in these regions by providing habitat and food for various wildlife species. Acacia theronii is also known for its distinctive yellow flowers and thorny structure, which help it survive in its native habitat.",
    "distribution_introduced_art_desc": "Acacia theronii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape. The plant thrives in well-drained soils and is often seen in coastal and mountainous areas. Its introduction has led to its spread along roadsides and in disturbed habitats. However, it is not considered invasive in the regions where it has been established."
}
