{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pachycarpa",
    "plant_slug": "acacia-pachycarpa",
    "plant_name_scientific": "acacia pachycarpa",
    "intro": "Acacia pachycarpa, commonly known as the thick-fruited acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, feathery foliage and distinctive, flat, green thorns. The plant produces yellow flowers in clusters, which are followed by woody, pod-like fruits containing edible seeds. Acacia pachycarpa thrives in arid and semi-arid environments, showcasing its adaptability to harsh conditions. Its botanical features make it an important species in both ecological and horticultural contexts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pachycarpa"
    },
    "taxonomy_art_desc": "Acacia pachycarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their sharp thorns and unique floral structures, often found in arid environments. Its species is Acacia pachycarpa, a specific type of acacia native to Australia, known for its distinctive seed pods and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pachycarpa is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy or rocky soils and is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to the specific environmental conditions found in these regions of Australia.",
    "distribution_introduced_art_desc": "Acacia pachycarpa was mainly introduced to areas with dry, rocky soils and semi-arid climates. It is commonly found in regions of Australia, particularly in the inland areas of Western Australia and South Australia. This plant thrives in well-drained soils and can tolerate high temperatures and low rainfall. It is often used for erosion control and as a source of browse for livestock. Its introduction has had both ecological and agricultural benefits in suitable environments."
}
