{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia viscidula",
    "plant_slug": "acacia-viscidula",
    "plant_name_scientific": "acacia viscidula",
    "intro": "Acacia viscidula, commonly known as the sticky acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its dense, thorny stems and small, yellow flowers that bloom in clusters. The leaves are feathery and often shed during dry periods, allowing the plant to conserve water. Its bark is sticky and emits a strong, unpleasant odor when broken. This plant is adapted to survive in harsh, dry environments with minimal water availability.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia viscidula"
    },
    "taxonomy_art_desc": "Acacia viscidula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are predominantly found in Australia and have distinctive phyllodes. Its species is Acacia viscidula, a shrub native to Australia, recognized by its sticky leaves and yellow flowers, commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia viscidula is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, open habitats such as woodlands, grasslands, and rocky outcrops. The plant thrives in regions with a temperate to subtropical climate. It is well adapted to the seasonal rainfall patterns of these areas. Acacia viscidula plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia viscidula was mainly introduced to the southeastern United States, particularly in Florida and along the Gulf Coast. It was brought in for its hardy nature and ability to thrive in disturbed soils. This plant has since spread into native habitats, often outcompeting native vegetation. Its introduction has led to ecological concerns due to its invasive potential. It is now considered a noxious weed in several regions where it has established itself."
}
