{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia squarrosa",
    "plant_slug": "acacia-squarrosa",
    "plant_name_scientific": "acacia squarrosa",
    "intro": "Acacia squarrosa, commonly known as the squarrose acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its distinctive, flat, disc-like phyllodes that are often covered in a powdery coating, giving it a grayish appearance. The plant produces yellow flowers in globular or cylindrical clusters, which bloom during the warmer months. Acacia squarrosa is adapted to drought conditions, with deep roots and a waxy cuticle to reduce water loss. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia squarrosa is primarily native to northern Australia, including parts of Western Australia, Northern Territory, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This plant thrives in coastal and inland areas with low rainfall. It is often seen growing in open woodlands and shrublands. Acacia squarrosa is well adapted to the harsh environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia squarrosa was mainly introduced to South Africa, particularly in the Western Cape region, as an ornamental plant due to its attractive appearance and hardy nature. It has since spread beyond its original cultivation areas and is now considered an invasive species in several parts of the country. The plant thrives in a variety of soil types and is highly adaptable to different environmental conditions. Its rapid growth and ability to form dense stands have led to its classification as a weed in some regions. Efforts are ongoing to manage its spread and mitigate its impact on native ecosystems."
}
