{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia demissa",
    "plant_slug": "acacia-demissa",
    "plant_name_scientific": "acacia demissa",
    "intro": "Acacia demissa, commonly known as the coastal acacia, is a small evergreen shrub native to the coastal regions of southern Africa. It is characterized by its narrow, leathery leaves and yellow flowers that bloom in clusters. The plant thrives in sandy or gravelly soils and is adapted to saline and coastal conditions. It plays a role in stabilizing dunes and providing habitat for local wildlife. Its ornamental value makes it a popular choice for coastal landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia demissa"
    },
    "taxonomy_art_desc": "Acacia demissa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of plants with legume-like flowers and includes many nitrogen-fixing species. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species found in Australia and other regions. Its species is Acacia demissa, a specific type of acacia known for its shrub-like growth and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia demissa is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the areas around the Geraldton and Esperance regions. This plant thrives in sandy soils and is often associated with coastal and inland habitats. It is well adapted to the arid and semi-arid climates of its native range. Acacia demissa plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia demissa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often forming dense thickets. The plant is known for its ability to thrive in harsh, arid conditions, making it a resilient species. It is widely used for erosion control and as a source of timber and fuelwood. However, its invasive potential has raised concerns in some parts of its range."
}
