{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia salicina",
    "plant_slug": "acacia-salicina",
    "plant_name_scientific": "acacia salicina",
    "intro": "Acacia salicina, commonly known as the river red gum, is a large, deciduous tree native to Australia. It is characterized by its slender, zigzagging branches and striking red bark that peels in thin, papery layers. The tree produces small, yellow globular flowers that bloom in late winter to early spring, attracting nectar-feeding birds and insects. Its leaves are bipinnate, consisting of numerous small, oval-shaped leaflets. Acacia salicina is well adapted to arid and semi-arid environments, often growing along riverbanks and in open woodlands.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia salicina"
    },
    "taxonomy_art_desc": "Acacia salicina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, known for their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid and tropical regions, often with phyllodes instead of leaves. Its species is Acacia salicina, a species native to Australia, known for its slender, often spiny appearance and its ability to thrive in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [
        "California",
        "India",
        "Mexico Southwest",
        "Palestine",
        "Tunisia"
    ],
    "distribution_native_art_desc": "Acacia salicina is primarily native to New South Wales, Northern Territory, Queensland, South Australia, and Victoria. It is commonly found in arid and semi-arid regions across these areas. This plant thrives in sandy soils and is often seen along roadsides and in open woodlands. It is well adapted to the harsh climate conditions of its native range. Acacia salicina plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia salicina was mainly introduced to California, India, Mexico Southwest, Palestine, and Tunisia. It is commonly found in regions with a Mediterranean climate or arid environments. This plant is often used for its ornamental value and for soil stabilization. It has been successfully established in these areas despite varying climatic conditions. However, it requires careful management to prevent it from becoming invasive in local ecosystems."
}
