{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia marginata var. angustata",
    "plant_slug": "acacia-marginata-var-angustata",
    "plant_name_scientific": "acacia marginata var. angustata",
    "intro": "Acacia marginata var. angustata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, linear leaves and yellow flowers that appear in spring. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. It plays an important role in stabilizing soil and providing habitat for native wildlife. The wood is lightweight and has been historically used by Indigenous Australians for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia marginata var. angustata is primarily native to northern Australia, including parts of Queensland and the Northern Territory. This variant is commonly found in arid and semi-arid regions, particularly in sandy soils. It thrives in open woodlands and scrublands, often along riverbanks and in coastal areas. The plant is well adapted to the harsh climatic conditions of its native habitat. Its distribution is also influenced by its ability to tolerate drought and nutrient-poor soils.",
    "distribution_introduced_art_desc": "Acacia marginata var. angustata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often growing in open woodlands and along the edges of forests. This variety is known for its slender, narrow leaves and its ability to thrive in coastal environments with salt spray. It is also valued for its ornamental appeal and is sometimes used in horticulture. However, its introduction has raised concerns about its potential to invade native ecosystems if not managed properly."
}
