{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chippendalei",
    "plant_slug": "acacia-chippendalei",
    "plant_name_scientific": "acacia chippendalei",
    "intro": "Acacia chippendalei, commonly known as the Chippendale wattle, is a small, shrub-like plant native to Western Australia. It features slender, wiry branches and produces small, yellow flowers in winter, which are clustered in spherical inflorescences. The leaves are phyllodes, which are flattened, leaf-like structures that reduce water loss in arid conditions. It thrives in well-drained soils and is adapted to coastal and sandy environments. The plant is valued for its ornamental appeal and is often used in native landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia chippendalei"
    },
    "taxonomy_art_desc": "Acacia chippendalei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and flowering plants. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia chippendalei, a specific type of acacia found in certain regions, distinguished by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chippendalei is primarily native to the Northern Territory, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. Acacia chippendalei is well adapted to the harsh climate of its native range. Its distribution is largely restricted to these specific regions in northern Australia.",
    "distribution_introduced_art_desc": "Acacia chippendalei was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and sandy soils, particularly in the Western Cape. The plant is known for its hardy nature and ability to thrive in arid conditions. It has been used in restoration projects due to its resilience and ecological benefits. However, its spread has raised concerns about potential invasiveness in native ecosystems."
}
