{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lunata var. crassiuscula",
    "plant_slug": "acacia-lunata-var-crassiuscula",
    "plant_name_scientific": "acacia lunata var. crassiuscula",
    "intro": "Acacia lunata var. crassiuscula, commonly known as the broad-leaved wattle, is a shrub or small tree native to southern Africa. It is characterized by its dense, feathery foliage and yellow flowers that bloom in late winter to early spring. The leaves are bipinnate, with numerous small, oval-shaped leaflets, and the plant produces cylindrical pods that contain seeds. It thrives in well-drained soils and is often used in ornamental gardening due to its attractive appearance and hardy nature. This variety is closely related to other acacia species but is distinguished by its broader leaves and compact growth habit.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lunata var. crassiuscula is primarily native to eastern Australia, including regions of New South Wales and Queensland. It thrives in sandy soils and is commonly found in coastal dunes and heathlands. This variety is adapted to arid and semi-arid environments, making it a resilient plant in these regions. It plays an important ecological role by providing habitat and food for native wildlife. The plant is also valued for its hardy nature and is often used in landscaping and rehabilitation projects.",
    "distribution_introduced_art_desc": "Acacia lunata var. crassiuscula was mainly introduced to stabilize soils and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, its introduction has led to concerns about potential invasiveness in some ecosystems. It is often planted as a windbreak or for livestock forage in agricultural landscapes."
}
