{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ochracea",
    "plant_slug": "acacia-ochracea",
    "plant_name_scientific": "acacia ochracea",
    "intro": "Acacia ochracea, commonly known as the yellow wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and clusters of small, yellow flowers that bloom in spring. The leaves are bipinnate, consisting of multiple pairs of small, oval-shaped leaflets. The plant produces elongated, flat seed pods that contain numerous seeds, which are dispersed by wind. Acacia ochracea is well adapted to arid and semi-arid environments, showing resilience to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ochracea is primarily native to Australia. It is found in the arid and semi-arid regions of Western Australia, South Australia, and northern New South Wales. This plant thrives in sandy soils and is commonly seen in open woodlands and shrublands. It is well adapted to drought conditions and can survive in low-nutrient environments. Acacia ochracea is often used as a source of firewood and has cultural significance to Indigenous communities.",
    "distribution_introduced_art_desc": "Acacia ochracea was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often growing in open habitats such as fynbos vegetation. The plant is known for its distinctive yellow flowers and its ability to thrive in arid conditions. It has been introduced for ornamental purposes and as a potential source of timber. However, it is considered a potential invasive species in some areas due to its rapid growth and adaptability."
}
