{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kalachariensis",
    "plant_slug": "acacia-kalachariensis",
    "plant_name_scientific": "acacia kalachariensis",
    "intro": "Acacia kalachariensis, commonly known as the Kalahari acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, thorny foliage and yellow flowers that bloom in spring. The plant has small, oval-shaped leaves that are often clustered at the base of the stems. It thrives in arid and semi-arid environments, making it well adapted to harsh, dry climates. The wood of Acacia kalachariensis is hard and durable, historically used by indigenous communities for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kalachariensis is primarily native to the arid regions of southern Africa, particularly Namibia and Angola. It thrives in sandy or rocky soils and is commonly found in savannas and shrublands. This plant is well adapted to dry climates and can survive with minimal rainfall. It is often seen growing in open woodlands and along riverbanks in its native range. Due to its resilience, it plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia kalachariensis was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread beyond cultivated areas and is now considered an invasive species in several regions. The plant thrives in arid and semi-arid environments, making it a significant threat to native vegetation. Its rapid growth and ability to outcompete local flora have led to concerns about ecological imbalance. Efforts are ongoing to control its spread through mechanical removal and biological control methods."
}
