{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spirocarpa f. pubescens",
    "plant_slug": "acacia-spirocarpa-f-pubescens",
    "plant_name_scientific": "acacia spirocarpa f. pubescens",
    "intro": "Acacia spirocarpa f. pubescens, commonly known as the hairy acacia, is a shrub or small tree native to parts of Australia. It is characterized by its slender, often twisted branches and phyllodes that are typically hairy, giving it its specific epithet \"pubescens.\" The plant produces yellow globular flower heads, which are clustered in dense, rounded inflorescences. It thrives in dry, well-drained soils and is often found in arid or semi-arid regions. The species is valued for its ornamental appeal and is sometimes used in horticulture for its drought tolerance and unique foliage.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spirocarpa f. pubescens is primarily native to the arid and semi-arid regions of southern Africa, particularly South Africa. It is commonly found in the Karoo biome, where it thrives in sandy or gravelly soils. This plant is well adapted to the harsh climatic conditions of its native habitat, including high temperatures and low rainfall. It often grows in open woodlands and shrublands, forming part of the local vegetation. Its distribution is limited to specific areas within South Africa, where it plays a role in the ecological balance of the region.",
    "distribution_introduced_art_desc": "Acacia spirocarpa f. pubescens was mainly introduced to South Africa, where it has been cultivated for ornamental purposes due to its attractive foliage and adaptability to local climates. It is commonly found in gardens and along roadsides, particularly in the Western Cape and Eastern Cape provinces. This subspecies is known for its ability to thrive in well-drained soils and its tolerance to drought conditions. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasiveness. Despite its ornamental value, its ecological impact remains a topic of ongoing study."
}
