{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lasiocarpa var. lasiocarpa",
    "plant_slug": "acacia-lasiocarpa-var-lasiocarpa",
    "plant_name_scientific": "acacia lasiocarpa var. lasiocarpa",
    "intro": "Acacia lasiocarpa var. lasiocarpa, commonly known as the rough-leaved wattle, is a shrub native to the arid regions of Australia. It is characterized by its pale yellow flowers that appear in late winter to early spring. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. Its woody stems are often covered in a dense layer of fine, silky hairs. It is well adapted to harsh environments, showcasing resilience to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lasiocarpa"
    },
    "taxonomy_art_desc": "Acacia lasiocarpa var. lasiocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of plants that includes horsetails and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with complex flower structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and small, clustered flowers. Its species is Acacia lasiocarpa, a specific type of acacia known for its hairy stems and yellow flowers, typically found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lasiocarpa var. lasiocarpa is primarily native to Western Australia. This plant is commonly found in the arid and semi-arid regions of the state. It typically grows in sandy soils and is often seen in coastal and inland areas. The species is well adapted to the harsh climatic conditions of the region. It plays an important ecological role in the local flora and fauna.",
    "distribution_introduced_art_desc": "Acacia lasiocarpa var. lasiocarpa was mainly introduced to regions with a Mediterranean climate, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal areas and inland valleys. This plant is often used for erosion control due to its deep root system and ability to stabilize soils. It is also valued for its ornamental qualities, including its fragrant flowers and distinctive foliage. However, it may become invasive in certain areas if not managed properly."
}
