{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chrysobotrya",
    "plant_slug": "acacia-chrysobotrya",
    "plant_name_scientific": "acacia chrysobotrya",
    "intro": "Acacia chrysobotrya, commonly known as the golden wattle, is a species native to Australia. It is a small to medium-sized shrub or tree that typically grows in dry, open habitats. The plant is characterized by its feathery, bipinnate leaves and yellow floral spikes that bloom in spring. Its flowers are clustered in cylindrical inflorescences, and the plant produces small, woody pods that contain seeds. Acacia chrysobotrya is also notable for its role in the Australian landscape and its use in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chrysobotrya is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often in savanna and grassland ecosystems. This species is well adapted to dry climates and can thrive in areas with low rainfall. It plays an important role in local ecosystems by providing habitat and food for various wildlife species. Acacia chrysobotrya is also sometimes cultivated for its ornamental value due to its distinctive yellow flowers.",
    "distribution_introduced_art_desc": "Acacia chrysobotrya was mainly introduced to South Africa, where it has been cultivated for its ornamental value and drought tolerance. It is commonly found in gardens and along roadsides, particularly in the Western Cape region. The plant thrives in well-drained soils and full sun, making it suitable for arid and semi-arid environments. Due to its rapid growth and ability to spread, it has become invasive in some areas, posing a threat to native vegetation. Efforts are being made to control its spread and manage its impact on local ecosystems."
}
