{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia exuvialis",
    "plant_slug": "acacia-exuvialis",
    "plant_name_scientific": "acacia exuvialis",
    "intro": "Acacia exuvialis, commonly known as the white acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Middle East. It is characterized by its slender, often branching stems and compound leaves composed of small, oval-shaped leaflets. The plant produces yellowish-white flowers that bloom in clusters, attracting various pollinators such as bees and birds. Its seeds are enclosed in woody pods and are adapted to disperse in dry conditions. Acacia exuvialis is well-suited to harsh environments and is often used in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia exuvialis is primarily native to the Arabian Peninsula, including parts of Saudi Arabia, Yemen, Oman, and the United Arab Emirates. It thrives in arid and semi-arid environments, often found in coastal areas and sandy soils. This plant is well adapted to hot, dry climates and can tolerate salt spray, making it common in coastal dunes. It plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife. Acacia exuvialis is also sometimes cultivated in regions with similar climatic conditions for its ornamental value and hardy nature.",
    "distribution_introduced_art_desc": "Acacia exuvialis was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the arid interior, as well as in parts of Africa and the Middle East. This plant is often used for its hardy nature and ability to provide shade and habitat for wildlife. Its introduction has sometimes led to ecological impacts, such as competition with native species. However, it is also valued for its role in soil stabilization and as a source of firewood."
}
