{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia coulteri",
    "plant_slug": "acacia-coulteri",
    "plant_name_scientific": "acacia coulteri",
    "intro": "Acacia coulteri, commonly known as the golden wattle, is a flowering plant native to Australia. It is a shrub or small tree that can grow up to 5 meters in height, featuring phyllodes that are narrow and yellow-green in color. The plant produces yellow flowers in globular clusters, which bloom in spring and attract a variety of pollinators. Its root system is deep and drought-resistant, allowing it to thrive in arid and semi-arid environments. The plant is also valued for its ornamental qualities and is used in landscaping and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia coulteri is primarily native to Southeast Asia, including countries such as Malaysia, Indonesia, Brunei, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with well-drained soils. This plant thrives in coastal and inland habitats, often growing in dry to moderately wet environments. It is a shrub or small tree that plays an important ecological role in its native range. Acacia coulteri is also known for its unique floral structure and is sometimes cultivated for ornamental purposes.",
    "distribution_introduced_art_desc": "Acacia coulteri was mainly introduced to areas with well-drained soils and moderate to high rainfall. It thrives in regions with full sun exposure and is commonly found in coastal and inland regions of Australia. This plant is often used for soil stabilization and as a source of timber and fuel. It has also been introduced to other parts of the world for ornamental purposes. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
