{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia quadricostata",
    "plant_slug": "acacia-quadricostata",
    "plant_name_scientific": "acacia quadricostata",
    "intro": "Acacia quadricostata, commonly known as the four-costate acacia, is a shrub or small tree native to southern Africa. It is characterized by its compound leaves, which are typically bipinnate and have a distinctive four-ribbed structure. The plant produces yellow flowers in globular heads, which are often visited by insects and birds. Its woody stems are covered with a layer of fine, silky hairs. Acacia quadricostata is often found in dry, rocky habitats and is adapted to arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia quadricostata is primarily native to parts of Australia, specifically the arid and semi-arid regions of Western Australia and South Australia. It is commonly found in sandy soils and is well adapted to the harsh, dry conditions of these environments. This plant is often seen growing in open woodlands and along riverbanks in its native range. It plays an important ecological role by providing habitat and food for various native animals. Its ability to thrive in low-water conditions makes it a resilient species in its natural habitat.",
    "distribution_introduced_art_desc": "Acacia quadricostata was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its rapid growth and hardy nature make it suitable for stabilizing degraded lands. However, it can become invasive in some areas if not managed properly."
}
