{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia squamata",
    "plant_slug": "acacia-squamata",
    "plant_name_scientific": "acacia squamata",
    "intro": "Acacia squamata, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, grayish stems covered in fine, scale-like structures, which give it its common name. The plant produces yellow flowers in globular or cylindrical clusters, typically in late winter to early spring. Its leaves are bipinnate, consisting of multiple pairs of small, oval-shaped leaflets. Acacia squamata is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia squamata"
    },
    "taxonomy_art_desc": "Acacia squamata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their unique morphology and ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its nitrogen-fixing ability and diverse plant forms. Its genus is Acacia, a group of shrubs and trees known for their distinctive acicular leaves and often yellow or white flowers, commonly found in arid regions. Its species is Acacia squamata, a specific type of acacia characterized by its scale-like leaves and is native to certain regions of Africa, often adapted to dry and harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia squamata is primarily native to Western Australia. It is commonly found in the semi-arid and arid regions of the state, particularly in the southern and western parts. This plant thrives in sandy soils and is often seen in spinifex plains and rocky outcrops. It is an important component of the local flora and provides habitat for various native fauna. Acacia squamata is well adapted to the harsh climatic conditions of its native environment.",
    "distribution_introduced_art_desc": "Acacia squamata was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since become naturalized in various parts of the country, particularly in the North Island. The plant thrives in a variety of soil types and is commonly found in coastal and urban areas. Its rapid growth and ability to spread through seed dispersal have led to concerns about its invasive potential. Despite its ecological impact, it remains popular for its aesthetic value in landscaping."
}
