{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adstringens",
    "plant_slug": "acacia-adstringens",
    "plant_name_scientific": "acacia adstringens",
    "intro": "Acacia adstringens, commonly known as the African bristled acacia, is a shrub or small tree native to tropical Africa. It is characterized by its slender, thorned stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow, globular inflorescences that attract pollinators such as bees and birds. Its bark and leaves contain tannins, which have been traditionally used in herbal medicine for their astringent properties. Acacia adstringens thrives in arid and semi-arid environments, often forming part of the vegetation in savanna ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adstringens is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Sudan, South Sudan, Ethiopia, and parts of East Africa. It thrives in dry, arid, and semi-arid environments, often found in savannas and woodlands. This plant is well adapted to harsh climatic conditions and is commonly found in association with other drought-resistant flora. It plays an important ecological role in its native habitat, providing food and shelter for various wildlife species. Due to its hardy nature, it is also cultivated in some regions outside its native range for ornamental and medicinal purposes.",
    "distribution_introduced_art_desc": "Acacia adstringens was mainly introduced to areas with dry climates and well-drained soils, where it can thrive in regions with low rainfall. It is commonly found in savannas and grasslands, particularly in parts of Africa and Australia. This plant is often used for its hardy nature and ability to stabilize soil, making it valuable for reforestation and erosion control. Its introduction has sometimes led to ecological changes in native ecosystems. However, it is generally considered a useful and adaptable species for certain environmental conditions."
}
