{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rhodacantha",
    "plant_slug": "acacia-rhodacantha",
    "plant_name_scientific": "acacia rhodacantha",
    "intro": "Acacia rhodacantha, commonly known as the red acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive bright red flowers, which bloom in clusters and attract various pollinators. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. It thrives in well-drained soils and is often found in savanna and woodland habitats. Acacia rhodacantha is also valued for its hardy nature and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rhodacantha is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in arid and semi-arid regions, often found in savannas and woodland areas. This species is well adapted to dry climates and can tolerate poor soil conditions. It plays an important role in local ecosystems and is sometimes used for its timber and fuelwood. The plant is also known for its distinctive yellow flowers and thorny growth habit.",
    "distribution_introduced_art_desc": "Acacia rhodacantha was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape, thriving in coastal and inland areas. The plant is often cultivated for its ornamental value due to its attractive yellow flowers and thorny structure. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasive behavior. Its introduction is largely attributed to horticultural practices and accidental dispersal through human activities."
}
