{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia metrosiderosifolia",
    "plant_slug": "acacia-metrosiderosifolia",
    "plant_name_scientific": "acacia metrosiderosifolia",
    "intro": "Acacia metrosiderosifolia, commonly known as the flame tree, is a fast-growing, deciduous tree native to tropical regions of Australia. It is characterized by its striking, bright red or orange flowers that bloom in dense clusters during the warmer months. The tree has bipinnate leaves that are often shed during dry seasons, and its bark is smooth and grayish in color. It thrives in full sun and well-drained soils, making it a popular choice for ornamental planting. The plant is also known for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia metrosiderosifolia is primarily native to the tropical regions of Southeast Asia, including countries such as Indonesia, Malaysia, and the Philippines. It thrives in humid, warm climates and is commonly found in lowland forests and along riverbanks. This species is well adapted to disturbed soils and can often be seen in secondary growth areas. It plays an important ecological role by providing habitat and food for various wildlife species. Its native range also extends to parts of Oceania, including some islands in the Pacific.",
    "distribution_introduced_art_desc": "Acacia metrosiderosifolia was mainly introduced to control erosion and for ornamental purposes in tropical and subtropical regions. It is commonly found in coastal areas and disturbed soils where it establishes quickly. The plant has become invasive in some regions due to its rapid growth and ability to form dense thickets. It is often used in reforestation projects because of its hardiness and adaptability. However, its spread can outcompete native vegetation, leading to ecological concerns in certain areas."
}
