{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crenulata",
    "plant_slug": "acacia-crenulata",
    "plant_name_scientific": "acacia crenulata",
    "intro": "Acacia crenulata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers in late winter to early spring, followed by flat, pod-like fruits. It is well adapted to arid and semi-arid environments, often growing in sandy soils. Acacia crenulata is also valued for its ornamental appeal and ability to fix nitrogen in the soil.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia crenulata"
    },
    "taxonomy_art_desc": "Acacia crenulata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their distinct reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in temperate regions. Its order is Fabales, which includes plants that are often legumes and are known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive umbrella-like flower clusters and thorny stems. Its species is Acacia crenulata, a specific type of acacia found in certain regions of Australia, known for its unique leaf shape and ecological importance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crenulata is primarily native to Western Australia. It is found in the southern and central regions of the state, particularly in the wheatbelt and jarrah forest areas. This plant typically grows in sandy or loamy soils and is often found in open woodlands and heathlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia crenulata plays an important ecological role in supporting local wildlife and maintaining biodiversity in its habitat.",
    "distribution_introduced_art_desc": "Acacia crenulata was mainly introduced to Australia as an ornamental plant due to its attractive yellow flowers and drought tolerance. It has since spread beyond cultivated areas and is now considered a weed in several regions, particularly in the eastern and southern parts of the country. The plant thrives in a variety of soil types but prefers well-drained soils and full sun. Its rapid growth and ability to produce large quantities of seed contribute to its invasive potential. Management strategies include mechanical removal, chemical control, and biological control methods to limit its spread."
}
