{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cuspidifolia",
    "plant_slug": "acacia-cuspidifolia",
    "plant_name_scientific": "acacia cuspidifolia",
    "intro": "Acacia cuspidifolia, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, needle-like phyllodes that give it a distinctive appearance. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in arid and semi-arid environments, showcasing its adaptability to harsh conditions. The bark is often fissured and greyish, providing additional identification features.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cuspidifolia"
    },
    "taxonomy_art_desc": "Acacia cuspidifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned stems and acacia-like leaves. Its species is Acacia cuspidifolia, a specific type of acacia characterized by its pointed leaves and typical features of the genus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cuspidifolia is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal regions and inland areas of the state. This plant thrives in arid and semi-arid environments, often growing in shrublands and woodland habitats. It is well adapted to the dry climate and can tolerate salt spray in coastal areas. Acacia cuspidifolia plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia cuspidifolia was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil conditions. The plant is known for its ability to thrive in harsh environments, making it a valuable species for land rehabilitation. However, it has also been reported to spread aggressively, sometimes becoming invasive in certain ecosystems. Its introduction has had both beneficial and problematic ecological impacts depending on the region."
}
