{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulchella var. fagonioides",
    "plant_slug": "acacia-pulchella-var-fagonioides",
    "plant_name_scientific": "acacia pulchella var. fagonioides",
    "intro": "Acacia pulchella var. fagonioides, commonly known as the silky wattle, is a shrub native to Australia. It is characterized by its slender, wiry stems and small, golden-yellow flowers that appear in cylindrical spikes. The leaves are bipinnate, meaning they are divided into two sets of small leaflets, giving the plant a feathery appearance. It thrives in well-drained soils and is often found in coastal and sandy environments. This variety is valued for its ornamental appeal and is sometimes cultivated in gardens for its delicate floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulchella var. fagonioides is primarily native to the eastern and southeastern regions of Australia, including parts of New South Wales, Queensland, and Victoria. This variety thrives in dry, sandy soils and is commonly found in coastal and inland areas. It is often associated with open woodlands and heathlands, where it forms part of the local flora. The plant is well adapted to the Mediterranean climate of these regions, characterized by hot, dry summers and mild, wet winters. Due to its ecological significance, it plays an important role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia pulchella var. fagonioides was mainly introduced to ornamental horticulture and landscape design due to its attractive foliage and ability to thrive in arid conditions. It is commonly used in gardens and public spaces in regions with warm, dry climates. The plant is also valued for its drought tolerance and low maintenance requirements. However, it has raised concerns in some areas due to its potential to become invasive. Its distribution has expanded beyond its native range, particularly in parts of Australia and the southwestern United States."
}
