{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis subsp. raddiana",
    "plant_slug": "acacia-tortilis-subsp-raddiana",
    "plant_name_scientific": "acacia tortilis subsp. raddiana",
    "intro": "Acacia tortilis subsp. raddiana, commonly known as the umbrella thorn acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its distinctive umbrella-shaped crown formed by dense, thorny branches. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves, and it produces yellow flowers in clusters. It is well adapted to drought conditions and can thrive in poor soils. The acacia also plays a significant role in providing shelter and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis subsp. raddiana is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of the Arabian Peninsula, particularly in southern Saudi Arabia and Yemen. This subspecies thrives in arid and semi-arid environments, often growing in rocky soils and along coastal areas. It is commonly found in savannas and shrublands, where it plays an important ecological role. Its distribution is closely linked to regions with a tropical and subtropical climate.",
    "distribution_introduced_art_desc": "Acacia tortilis subsp. raddiana was mainly introduced to regions with semi-arid to arid climates, where it thrives in sandy or rocky soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of the Arabian Peninsula and northern Africa. This subspecies is often used for its hardy nature and ability to provide shade and forage for livestock. It has been introduced to various parts of the world for ecological restoration and land stabilization efforts. Its distribution is also influenced by human activity, including cultivation and accidental spread through transportation."
}
