{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia seyal var. seretii",
    "plant_slug": "acacia-seyal-var-seretii",
    "plant_name_scientific": "acacia seyal var. seretii",
    "intro": "Acacia seyal var. seretii, commonly known as the yellow acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often thorned stems and bipinnate leaves that are typically small and feathery. The plant produces yellow to orange globular flowers, which are borne in dense clusters and attract various pollinators. Its seeds are encased in hard, woody pods that split open to release the seeds. Acacia seyal var. seretii is well adapted to drought conditions and plays an important ecological role in its native habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia seyal var. seretii is primarily native to eastern and southern Africa, including countries such as Ethiopia, Kenya, Somalia, Tanzania, and parts of South Africa. It thrives in arid and semi-arid regions, often found in savannas and along coastal areas. This variant is adapted to hot, dry climates and can tolerate poor soil conditions. It is commonly found in association with other Acacia species in woodland and shrubland ecosystems. The plant plays an important ecological role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia seyal var. seretii was mainly introduced to regions with a tropical or subtropical climate, where it thrives in well-drained soils and full sunlight. It is commonly found in areas of southern Africa, including countries like Namibia, Botswana, and South Africa. This plant is often used for its hardy nature and ability to withstand drought conditions, making it suitable for reforestation and land rehabilitation projects. Its introduction has also been linked to ornamental horticulture due to its attractive appearance and resilience. However, in some areas, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
