{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fischeri",
    "plant_slug": "acacia-fischeri",
    "plant_name_scientific": "acacia fischeri",
    "intro": "Acacia fischeri, commonly known as the Fischer's acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, branching stems and small, compound leaves that are often covered in fine hairs. The plant produces yellow flowers in clusters, which are followed by woody, pod-like fruits containing edible seeds. Acacia fischeri is well adapted to drought conditions, making it a resilient species in harsh environments. Its ecological importance includes providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fischeri is primarily native to the arid and semi-arid regions of southern Africa, particularly in Namibia, Botswana, and southwestern Angola. It thrives in sandy soils and is commonly found in savanna and grassland ecosystems. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important role in local ecosystems by providing shelter and food for various animals. Acacia fischeri is also known for its distinctive, flat, thorn-like leaves and its ability to fix nitrogen in the soil.",
    "distribution_introduced_art_desc": "Acacia fischeri was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions with low rainfall and high temperatures, such as parts of Australia and the southwestern United States. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. It has also been introduced to other parts of the world for ornamental purposes. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
