{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia benadirensis",
    "plant_slug": "acacia-benadirensis",
    "plant_name_scientific": "acacia benadirensis",
    "intro": "Acacia benadirensis, commonly known as the Benadire acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in dense, globular or cylindrical inflorescences, which are typically arranged in clusters at the ends of the branches. It thrives in arid and semi-arid environments, often found in rocky soils and along riverbanks. Acacia benadirensis is valued for its hardy nature and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia benadirensis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and grassland habitats, often along the edges of savannas. This species thrives in regions with low rainfall and high temperatures, adapting well to the harsh conditions of its native environment. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia benadirensis is also known for its distinctive appearance, with its slender, branching structure and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia benadirensis was mainly introduced to South Africa, where it has been established in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. The plant thrives in sandy soils and is often found in coastal areas. It has been noted for its ability to tolerate drought and high salinity. However, its introduction has raised concerns about its potential impact on native vegetation."
}
