{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bucheri",
    "plant_slug": "acacia-bucheri",
    "plant_name_scientific": "acacia bucheri",
    "intro": "Acacia bucheri, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched structure and its distinctive, feathery leaves that are typically gray-green in color. The plant produces small, yellow flowers that bloom in clusters, adding a striking visual element to its appearance. Acacia bucheri is adapted to arid and semi-arid environments, making it a hardy species suited to dry climates. Its bark and leaves have been used traditionally in various cultural and medicinal practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bucheri is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in rocky outcrops, savannas, and coastal areas where it thrives in well-drained soils. This species is adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role by providing habitat and food for various local wildlife. Acacia bucheri is also known for its distinctive yellow flowers and thorny structure, which help it survive in its native environment.",
    "distribution_introduced_art_desc": "Acacia bucheri was mainly introduced to specific regions in Australia, particularly in Queensland and New South Wales, as part of ecological restoration and land management efforts. It was introduced to help stabilize soils in degraded areas and to provide habitat for native wildlife. The plant is known for its ability to thrive in arid and semi-arid conditions, making it suitable for rehabilitation projects. However, its introduction has raised concerns due to its potential to become invasive in certain environments. Despite its ecological benefits, careful monitoring is required to prevent unintended spread."
}
