{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kybeanensis",
    "plant_slug": "acacia-kybeanensis",
    "plant_name_scientific": "acacia kybeanensis",
    "intro": "Acacia kybeanensis, commonly known as the slender wattle, is a shrub native to Western Australia. It is characterized by its slender, wiry stems and small, yellow floral spikes that appear in late winter to early spring. The plant produces small, bean-like pods that contain several seeds, typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and inland regions. The slender wattle is valued for its ornamental appeal and is also used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia kybeanensis"
    },
    "taxonomy_art_desc": "Acacia kybeanensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes, many of which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their phyllodes (modified leaves) and often used in traditional medicine and as sources of timber. Its species is Acacia kybeanensis, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kybeanensis is primarily native to New South Wales and Victoria. This species is commonly found in the coastal regions of these states. It thrives in sandy soils and is often associated with heathlands and coastal dunes. The plant is well adapted to the temperate climate of southeastern Australia. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia kybeanensis was mainly introduced to New South Wales, Australia, as part of ecological restoration and revegetation projects. It is commonly found in coastal and sandy soils, particularly in the southern regions of the state. The plant is valued for its ability to stabilize soil and provide habitat for native wildlife. It has also been used in urban landscaping due to its hardiness and aesthetic appeal. However, it is important to monitor its spread to prevent potential impacts on local ecosystems."
}
