{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subbinervia",
    "plant_slug": "acacia-subbinervia",
    "plant_name_scientific": "acacia subbinervia",
    "intro": "Acacia subbinervia, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant has bipinnate leaves that are narrow and often covered with fine hairs. Its yellow flowers are arranged in cylindrical spikes and bloom during the warmer months. Acacia subbinervia is adapted to dry and sandy soils, making it a resilient species in arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subbinervia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in well-drained soils. This species is particularly adapted to hot, dry climates and can tolerate low rainfall conditions. It plays an important ecological role by providing food and shelter for various wildlife species. Its distribution is largely confined to the southern African continent, with limited occurrences in neighboring regions.",
    "distribution_introduced_art_desc": "Acacia subbinervia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, growing in rocky soils and along coastal areas. This plant is often used in reclamation projects due to its ability to thrive in poor soil conditions. However, it can become invasive in some areas, outcompeting native vegetation. Its introduction has raised concerns about its ecological impact in local ecosystems."
}
