{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hemsleyi",
    "plant_slug": "acacia-hemsleyi",
    "plant_name_scientific": "acacia hemsleyi",
    "intro": "Acacia hemsleyi, commonly known as the Hemsley's acacia, is a shrub native to the arid regions of Mexico and Central America. It is characterized by its slender, often spiny stems and compound leaves that are typically reduced to small, rounded phyllodes. The plant produces yellow flowers in compact globular clusters, which are followed by long, slender seed pods. It is well adapted to drought conditions, with deep root systems that help it survive in nutrient-poor soils. Acacia hemsleyi plays a role in local ecosystems by providing habitat and food for various insects and small animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hemsleyi"
    },
    "taxonomy_art_desc": "Acacia hemsleyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and beans. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acorn-like seed pods and often used in traditional medicine and as sources of timber. Its species is Acacia hemsleyi, a specific type of acacia native to Mexico, known for its ecological importance and unique adaptations to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hemsleyi is primarily native to the Northern Territory, Queensland, and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy soils and is often seen in shrublands and open woodlands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distribution is closely linked to the environmental conditions of these regions.",
    "distribution_introduced_art_desc": "Acacia hemsleyi was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in arid and semi-arid regions, particularly in areas with well-drained soils. This plant is often used for erosion control due to its deep root system and ability to thrive in harsh conditions. It has been introduced to several ecological restoration projects in the region. However, its invasive potential remains a topic of ongoing study and management."
}
