{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia zanzibarica",
    "plant_slug": "acacia-zanzibarica",
    "plant_name_scientific": "acacia zanzibarica",
    "intro": "Acacia zanzibarica, commonly known as the Zanzibar umbrella tree, is a flowering plant native to the coastal regions of East Africa. It is characterized by its distinctive umbrella-shaped crown formed by its dense, feathery foliage. The plant produces small, yellow flowers that bloom in clusters, attracting pollinators such as bees and birds. Its leaves are bipinnate, meaning they are divided into small, thread-like segments, which help reduce water loss in arid conditions. Acacia zanzibarica is often cultivated as an ornamental plant due to its unique appearance and adaptability to tropical climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia zanzibarica is primarily native to the coastal regions of East Africa, including the islands of Zanzibar and Pemba. It thrives in tropical and subtropical climates, often found in coastal forests and dry woodlands. This species is commonly associated with sandy soils and is well adapted to the warm, humid conditions of the region. It plays an important ecological role in its native habitat, providing shelter and food for various wildlife species. Acacia zanzibarica is also sometimes cultivated in botanical gardens and as an ornamental plant outside its natural range.",
    "distribution_introduced_art_desc": "Acacia zanzibarica was mainly introduced to coastal areas and lowland regions of East Africa, particularly Tanzania and Kenya, for its ornamental value and potential use in agroforestry. It is commonly found in degraded lands and along roadsides, where it establishes quickly due to its high seed dispersal capability. The plant has also been introduced to parts of the Arabian Peninsula and Southeast Asia for similar reasons. Its rapid growth and ability to thrive in poor soils make it a useful species for soil stabilization and land rehabilitation. However, it is considered invasive in some regions, posing a threat to native ecosystems."
}
