{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia recurva",
    "plant_slug": "acacia-recurva",
    "plant_name_scientific": "acacia recurva",
    "intro": "Acacia recurva, commonly known as the zigzag acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, zigzagging branches and phyllodes that are narrow and often recurved at the tips. The plant produces yellow globular flowers, which appear in spring and are followed by flat, pod-like fruits. Acacia recurva thrives in arid and semi-arid environments, often growing on rocky soils. It is also valued for its ability to fix nitrogen, making it useful in soil rehabilitation efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia recurva is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in the dry savannas and grasslands of these regions. This plant thrives in areas with moderate to high rainfall and well-drained soils. It is often seen growing along riverbanks and in open woodlands. Acacia recurva plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia recurva was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soils and withstand drought conditions. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant has been introduced to parts of Southeast Asia and the Pacific Islands as well, often for erosion control and land stabilization. Due to its hardy nature, it has become invasive in some regions, outcompeting native vegetation. Its introduction has had both ecological and economic impacts, depending on the local environment."
}
