{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia basaltica",
    "plant_slug": "acacia-basaltica",
    "plant_name_scientific": "acacia basaltica",
    "intro": "Acacia basaltica, commonly known as the basalt acacia, is a unique shrub native to arid and semi-arid regions. It belongs to the Fabaceae family, which is characterized by its legume pods and nitrogen-fixing abilities. The plant is adapted to survive in nutrient-poor soils, often found in rocky or coastal areas. Its leaves are small and feathery, and it produces yellow flowers that attract pollinators. The wood of Acacia basaltica is dense and durable, making it valuable for local crafts and construction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia basaltica is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in rocky and well-drained soils, often found in mountainous and coastal areas. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Due to its resilience, it is commonly found in desert margins and along riverbanks in its native range.",
    "distribution_introduced_art_desc": "Acacia basaltica was mainly introduced to stabilize soil in arid and semi-arid regions due to its deep root system and ability to thrive in poor soil conditions. It is commonly used in reclamation projects and erosion control in areas affected by mining or deforestation. The plant is also valued for its drought tolerance and can survive with minimal water supply. Its introduction has helped restore degraded lands and improve biodiversity in certain ecosystems. However, it requires careful management to prevent it from becoming invasive in non-target environments."
}
