{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tumida var. extenta",
    "plant_slug": "acacia-tumida-var-extenta",
    "plant_name_scientific": "acacia tumida var. extenta",
    "intro": "Acacia tumida var. extenta, commonly known as the broad-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are often broad and elliptical in shape. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, spherical inflorescences. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The plant is also valued for its ornamental appeal and is often used in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tumida"
    },
    "taxonomy_art_desc": "Acacia tumida var. extenta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have leaves with a single vein and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia tumida, a specific type of acacia that is known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tumida var. extenta is primarily native to Western Australia. This variant of the species is found in the southern and western regions of the state. It typically grows in dry, sandy soils and is adapted to the arid and semi-arid climates of the region. The plant is commonly seen in coastal and inland areas, including parts of the Nullarbor Plain. It plays an important role in the local ecosystem and is a characteristic species of the region's flora.",
    "distribution_introduced_art_desc": "Acacia tumida var. extenta was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. This plant is known for its ability to tolerate drought and salty conditions, making it adaptable to various environments. It is often used for erosion control due to its extensive root system. However, its invasive potential has raised concerns in some areas where it competes with native vegetation."
}
