{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paludosa",
    "plant_slug": "acacia-paludosa",
    "plant_name_scientific": "acacia paludosa",
    "intro": "Acacia paludosa, commonly known as the swamp acacia, is a shrub native to wetland environments in Australia. It is characterized by its slender, often zigzagging stems and small, feathery leaves that help reduce water loss. The plant produces yellowish-white flowers in dense, globular clusters, which attract a variety of pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by wind or water. Acacia paludosa plays an important ecological role in stabilizing wetland soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia paludosa is primarily native to wetland and swampy areas of northern Australia, including parts of Queensland and the Northern Territory. It thrives in waterlogged soils and is commonly found in freshwater swamps and seasonally flooded plains. This plant is well adapted to the humid and tropical climate of its native region. It plays an important ecological role in stabilizing soil and providing habitat for various wildlife species. Acacia paludosa is also occasionally found in Southeast Asia, though its primary range remains in northern Australia.",
    "distribution_introduced_art_desc": "Acacia paludosa was mainly introduced to wetland and swamp areas where it thrives in poorly drained soils. It is commonly found in regions with high humidity and seasonal flooding. This plant has been introduced to several parts of the United States, particularly in the southeastern states. It is often used for erosion control due to its dense root system. However, it can become invasive in some environments if not managed properly."
}
