{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia scandens var. axa",
    "plant_slug": "acacia-scandens-var-axa",
    "plant_name_scientific": "acacia scandens var. axa",
    "intro": "Acacia scandens var. axa, commonly known as the climbing acacia, is a shrub or small tree native to parts of Africa and the Middle East. It is characterized by its slender, climbing stems and bipinnate leaves that are often covered in fine hairs. The plant produces yellow, globular flower heads that are clustered in dense inflorescences. It thrives in arid and semi-arid environments, making it well adapted to drought conditions. The wood of Acacia scandens var. axa is lightweight and has been traditionally used for fuel and construction in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia scandens var. axa is primarily native to Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. This variant is commonly found in tropical and subtropical regions, often growing in lowland areas with well-drained soils. It thrives in open habitats such as forest edges, shrublands, and disturbed sites. The plant is well adapted to warm climates and can tolerate moderate drought conditions. Its distribution is largely confined to the archipelagos of the Indo-Pacific region.",
    "distribution_introduced_art_desc": "Acacia scandens var. axa was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, abandoned fields, and degraded landscapes. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is often found in coastal and inland regions of southern Africa. Its introduction has led to its spread in areas where it competes with native vegetation. It is considered an invasive species in some regions due to its rapid growth and ability to colonize new areas."
}
