{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pycnantha",
    "plant_slug": "acacia-pycnantha",
    "plant_name_scientific": "acacia pycnantha",
    "intro": "Acacia pycnantha, commonly known as the golden wattle, is a small evergreen tree or shrub native to southeastern Australia. It is characterized by its dense, globular crown and bright yellow flowers that bloom in late winter to early spring. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic organs. Its flowers are clustered in spherical heads, and it produces long, slender pods that contain seeds. Acacia pycnantha is a symbol of Australia and is widely cultivated for its ornamental value and ecological benefits.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pycnantha"
    },
    "taxonomy_art_desc": "Acacia pycnantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often featuring jointed stems and spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species native to Australia and other parts of Africa and Asia. Its species is Acacia pycnantha, a small, deciduous tree known for its distinctive yellow flowers and is commonly referred to as the Australian wattle, a symbol of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [
        "California",
        "Cameroon",
        "Cape Provinces",
        "Cyprus",
        "India",
        "Italy",
        "Jawa",
        "Morocco",
        "Portugal",
        "Sardegna",
        "Spain",
        "Tanzania",
        "Tasmania",
        "Western Australia"
    ],
    "distribution_native_art_desc": "Acacia pycnantha is primarily native to New South Wales, South Australia, and Victoria. It is commonly found in a variety of habitats including woodlands, open forests, and along riverbanks. This species thrives in well-drained soils and is often associated with dry or semi-arid environments. It is known for its distinctive yellow floral spikes, which appear in late winter to early spring. The plant plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native regions.",
    "distribution_introduced_art_desc": "Acacia pycnantha was mainly introduced to California, Cameroon, Cape Provinces, Cyprus, India, Italy, Jawa, Morocco, Portugal, Sardegna, Spain, Tanzania, Tasmania, and Western Australia. It has been widely planted for its ornamental value, particularly for its bright yellow flowers. The plant is commonly used in landscaping and as a decorative element in gardens. However, in some regions, it has become invasive, outcompeting native flora. Its introduction has had both aesthetic and ecological impacts across these diverse locations."
}
