{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassifrugis",
    "plant_slug": "acacia-crassifrugis",
    "plant_name_scientific": "acacia crassifrugis",
    "intro": "Acacia crassifrugis, commonly known as the broad-fruited acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing ability. The plant features feathery, bipinnate leaves and produces yellow, globular inflorescences that attract pollinators. Its woody pods contain seeds that are dispersed by wind, contributing to its spread in arid environments. Acacia crassifrugis is adapted to dry conditions, making it a resilient species in semi-desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassifrugis is primarily native to southern Africa, specifically South Africa. It is commonly found in the Eastern Cape, Western Cape, and Northern Cape provinces. This species thrives in sandy soils and is often associated with coastal and inland shrublands. It is well adapted to arid and semi-arid environments. The plant is also known to occur in parts of Namibia and Botswana.",
    "distribution_introduced_art_desc": "Acacia crassifrugis was mainly introduced to control soil erosion and as a source of fodder in semi-arid regions. It is commonly found in countries such as Australia, South Africa, and parts of the United States. The plant thrives in well-drained soils and can tolerate drought conditions. Its rapid growth and ability to fix nitrogen make it a valuable species for land rehabilitation. However, it has also been noted to spread aggressively and potentially outcompete native vegetation in some areas."
}
