{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata f. hybrida",
    "plant_slug": "acacia-armata-f-hybrida",
    "plant_name_scientific": "acacia armata f. hybrida",
    "intro": "Acacia armata f. hybrida, commonly known as the hybrid acacia, is a shrub or small tree native to Australia. It is characterized by its distinctive, flat, feathery leaves that are often used in floral arrangements. The plant produces small, yellow, globular flowers that bloom in spring, attracting various pollinators. It thrives in well-drained soils and full sun, making it suitable for coastal and Mediterranean climates. Due to its ornamental value and hardiness, it is a popular choice for landscaping in arid regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata f. hybrida is primarily native to southern Australia, including parts of New South Wales, Victoria, and South Australia. It is commonly found in dry, inland regions with sandy or loamy soils. This subspecies thrives in arid and semi-arid environments, often growing in open woodlands or shrublands. It is well adapted to withstand drought and high temperatures. Its distribution is also influenced by its ability to form dense thickets, which helps it survive in harsh conditions.",
    "distribution_introduced_art_desc": "Acacia armata f. hybrida was mainly introduced to ornamental horticulture and landscaping due to its attractive foliage and adaptability to various climates. It is commonly used in gardens and as a decorative plant in urban settings because of its hardy nature and low maintenance requirements. This plant has been distributed across regions with Mediterranean climates, including parts of California, South Africa, and Australia. Its introduction has led to its establishment in some areas, raising concerns about its potential invasiveness. Despite its ornamental value, careful management is recommended to prevent unintended ecological impacts."
}
