{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia piptadenioides",
    "plant_slug": "acacia-piptadenioides",
    "plant_name_scientific": "acacia piptadenioides",
    "intro": "Acacia piptadenioides, commonly known as the silver wattle, is a small to medium-sized evergreen shrub or tree native to South Africa. It is characterized by its slender, grey-green foliage and distinctive yellow flowers that appear in clusters. The plant produces flat, pod-like fruits that contain several seeds, which are dispersed by wind. Acacia piptadenioides thrives in well-drained soils and is often found in coastal and mountainous regions. It is valued for its ornamental appeal and is also used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia piptadenioides is primarily native to the savannas and grasslands of sub-Saharan Africa. It is found in countries such as South Africa, Namibia, Botswana, and Zimbabwe. This plant thrives in regions with a tropical or subtropical climate and well-drained soils. It is commonly found in open woodlands and along riverbanks. Its distribution is closely linked to areas with seasonal rainfall patterns.",
    "distribution_introduced_art_desc": "Acacia piptadenioides was mainly introduced to control soil erosion and for its hardy nature in arid environments. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant has also been introduced for ornamental purposes because of its attractive foliage and yellow flowers. However, it can become invasive in some regions if not managed properly. Its distribution has expanded in parts of Africa and the Middle East as a result of these introductions."
}
