{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia caven var. stenocarpa",
    "plant_slug": "acacia-caven-var-stenocarpa",
    "plant_name_scientific": "acacia caven var. stenocarpa",
    "intro": "Acacia caven var. stenocarpa, commonly known as the narrow-fruited acacia, is a shrub or small tree native to South America. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow globular flowers that appear in summer, followed by woody, pod-like fruits containing seeds. It thrives in well-drained soils and is adapted to arid or semi-arid environments. This species is valued for its ornamental appeal and is sometimes used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia caven var. stenocarpa is primarily native to Argentina, specifically in the provinces of Buenos Aires, La Pampa, and San Luis. It is commonly found in dry grasslands and shrublands, often in areas with sandy or loamy soils. This variety is adapted to semi-arid and arid climates, thriving in regions with low rainfall and high sunlight exposure. It plays an important ecological role by providing habitat and food for various native wildlife species. The plant is also known for its hardy nature, making it a resilient component of the local flora.",
    "distribution_introduced_art_desc": "Acacia caven var. stenocarpa was mainly introduced to South America, particularly in countries such as Argentina, Bolivia, and Paraguay. It was brought there for its potential use in reforestation and as a source of timber and fuelwood. The plant thrives in dry to semi-arid environments and is often found in disturbed or degraded lands. Its introduction has led to its establishment in natural and agricultural areas, sometimes competing with native vegetation. Despite its benefits, it is considered an invasive species in some regions where it outcompetes local flora."
}
