{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia langlassei",
    "plant_slug": "acacia-langlassei",
    "plant_name_scientific": "acacia langlassei",
    "intro": "Acacia langlassei, commonly known as the Langlasse's acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures in mature plants. The plant produces yellow flowers in compact spherical or cylindrical inflorescences, which are typically visited by various pollinators. Acacia langlassei is adapted to survive in harsh, dry conditions with deep root systems and a slow growth rate. It is also known for its ability to fix atmospheric nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia langlassei is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and Angola. It thrives in sandy soils and is commonly found in savanna and shrubland ecosystems. This plant is well adapted to hot, dry climates and can tolerate low rainfall conditions. It plays an important ecological role by providing habitat and food for various wildlife species. Its distribution is largely restricted to the specific environmental conditions found in these regions.",
    "distribution_introduced_art_desc": "Acacia langlassei was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for erosion control due to its ability to stabilize soil and tolerate harsh environmental conditions. Its introduction has also led to its use in landscaping and as a source of timber. However, in some regions, it has been classified as an invasive species due to its rapid growth and spread."
}
