{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia yucatanensis",
    "plant_slug": "acacia-yucatanensis",
    "plant_name_scientific": "acacia yucatanensis",
    "intro": "Acacia yucatanensis, commonly known as the Yucatan acacia, is a small evergreen tree native to the Yucatán Peninsula in Mexico. It is characterized by its slender, branching trunk and dense, feathery foliage composed of bipinnate leaves. The plant produces yellow, globular flower heads that bloom in clusters, attracting pollinators such as bees and butterflies. Its bark is smooth and greyish, and it is often used in traditional medicine for its purported healing properties. Acacia yucatanensis thrives in tropical climates and is adapted to well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia yucatanensis is primarily native to the Yucatán Peninsula in Mexico, as well as parts of Belize and Guatemala. It thrives in tropical and subtropical regions, particularly in dry to semi-arid environments. This species is commonly found in limestone soils and is often associated with dry forests and savannas. It plays an important ecological role in these regions by providing habitat and food for various wildlife. Acacia yucatanensis is well adapted to the climate and environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia yucatanensis was mainly introduced to the southern United States, particularly in Texas and Florida, as well as parts of Mexico. It was brought in for its ornamental value due to its unique foliage and ability to thrive in arid conditions. The plant has since spread into native habitats, often outcompeting local vegetation. Its introduction has raised concerns about its impact on native ecosystems and biodiversity. Efforts are being made to monitor and control its spread to prevent ecological disruption."
}
