{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens f. mollis",
    "plant_slug": "acacia-decurrens-f-mollis",
    "plant_name_scientific": "acacia decurrens f. mollis",
    "intro": "Acacia decurrens f. mollis, commonly known as the soft-leaved wattle, is a shrub native to Australia. It is characterized by its soft, silky foliage, which gives it a distinctive appearance. The plant produces yellow flowers in cylindrical spikes, typically during the spring and summer seasons. It thrives in well-drained soils and is often found in coastal and sandy regions. This variety is valued for its ornamental appeal and ability to withstand coastal conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decurrens f. mollis is primarily native to the coastal regions of southern Africa, including South Africa, Namibia, and parts of Mozambique. This shrub thrives in sandy or rocky soils along the shoreline, often in areas with moderate to high salinity. It is commonly found in dune systems and coastal grasslands, where it plays a role in stabilizing sand dunes and providing habitat for local wildlife. The plant is well adapted to coastal conditions, including salt spray and strong winds. Its distribution is largely restricted to the southern African coastline due to its specific ecological requirements.",
    "distribution_introduced_art_desc": "Acacia decurrens f. mollis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, particularly in the Western and Eastern Cape provinces. This plant is often used for soil stabilization due to its deep root system and ability to thrive in harsh conditions. It has also been introduced to other parts of the world, including Australia and the Mediterranean, for ornamental and ecological purposes. However, its spread can sometimes lead to competition with native species in invaded areas."
}
