{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia juniperina var. typica",
    "plant_slug": "acacia-juniperina-var-typica",
    "plant_name_scientific": "acacia juniperina var. typica",
    "intro": "Acacia juniperina var. typica, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It is characterized by its slender, often multi-branched structure and narrow, linear leaves. The plant produces yellow, pea-like flowers arranged in compact inflorescences, which bloom in spring. It thrives in well-drained soils and is often found in coastal and sandy environments. The species is valued for its ornamental appeal and is sometimes used in horticulture.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia juniperina var. typica is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and shrubland ecosystems. This variety is well adapted to drought conditions and can tolerate high temperatures. It is often seen growing along riverbanks and in rocky outcrops. Its distribution is closely linked to the availability of water and well-drained soil conditions.",
    "distribution_introduced_art_desc": "Acacia juniperina var. typica was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its drought tolerance and ability to thrive in poor soil conditions. This plant has been introduced to several countries in Africa, the Middle East, and parts of Australia. Its rapid growth and dense foliage make it an effective choice for windbreaks and land rehabilitation. However, it can become invasive in some ecosystems if not managed properly."
}
