{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aemula subsp. muricata",
    "plant_slug": "acacia-aemula-subsp-muricata",
    "plant_name_scientific": "acacia aemula subsp. muricata",
    "intro": "Acacia aemula subsp. muricata, commonly known as the rough acacia, is a shrub native to southern Africa. It is characterized by its dense, thorned stems and feathery, bipinnate leaves. The plant produces yellow flowers in spikes, which are often followed by flat, pod-like fruits. It thrives in arid and semi-arid environments, adapting well to poor soils. Its botanical features make it an important component of local ecosystems and a useful plant for erosion control.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia aemula"
    },
    "taxonomy_art_desc": "Acacia aemula subsp. muricata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats around the world. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in various ecological and economic contexts. Its species is Acacia aemula, a specific variety within the Acacia genus, distinguished by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aemula subsp. muricata is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the areas around the Geraldton and Esperance regions. This subspecies thrives in sandy soils and is commonly found in coastal and inland areas. It is adapted to the arid and semi-arid climates of its native range. The plant is often seen in open woodlands and shrublands within its distribution area.",
    "distribution_introduced_art_desc": "Acacia aemula subsp. muricata was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential for erosion control. It is commonly found in coastal and inland regions, particularly in the Western Cape and Eastern Cape provinces. The plant thrives in well-drained soils and full sun, making it suitable for both naturalized and cultivated landscapes. Due to its rapid growth and adaptability, it has become established in several areas outside its native range. However, its invasive potential remains a topic of ongoing ecological study."
}
