{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia furcata",
    "plant_slug": "acacia-furcata",
    "plant_name_scientific": "acacia furcata",
    "intro": "Acacia furcata, commonly known as the African thorn acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, thorny stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers in clusters, which are followed by cylindrical pods containing seeds. Acacia furcata is well adapted to drought conditions, with deep roots that enable it to access water from deeper soil layers. It plays an important role in stabilizing soil and providing habitat for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia furcata is primarily native to parts of southern Africa, including South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This plant thrives in well-drained soils and is often associated with shrublands and grasslands. It is well adapted to the dry climate and can tolerate high temperatures and limited water availability. Acacia furcata plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia furcata was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with low rainfall and full sun exposure. This plant is often used for erosion control due to its deep root system. It has become naturalized in several parts of the United States, particularly in the southwestern states. Its rapid growth and ability to thrive in disturbed soils make it a common invasive species in some regions."
}
