{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia zygia",
    "plant_slug": "acacia-zygia",
    "plant_name_scientific": "acacia zygia",
    "intro": "Acacia zygia, commonly known as the white acacia, is a flowering plant native to parts of Australia. It is a small, shrub-like tree that typically grows in arid or semi-arid environments. The plant produces small, yellow flowers arranged in dense, globular clusters, which bloom during the warmer months. Its leaves are bipinnate, consisting of multiple small leaflets, and it has a robust root system adapted to drought conditions. Acacia zygia is also noted for its ability to fix nitrogen in the soil, making it ecologically significant in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia zygia is primarily native to the tropical and subtropical regions of Australia. It is commonly found in the northern parts of the country, including Queensland, Northern Territory, and Western Australia. This plant thrives in sandy soils and is often associated with coastal and inland dry forests. It is well adapted to arid and semi-arid environments. Acacia zygia is an important component of the local flora and plays a role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia zygia was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and adequate sunlight. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant has become naturalized in several parts of the world, including Australia, the United States, and parts of Southeast Asia. Its rapid growth and ability to thrive in poor soil conditions contribute to its spread. However, it can sometimes outcompete native vegetation, raising concerns about its ecological impact."
}
