{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riceana var. axillaris",
    "plant_slug": "acacia-riceana-var-axillaris",
    "plant_name_scientific": "acacia riceana var. axillaris",
    "intro": "Acacia riceana var. axillaris, commonly known as the narrow-leaf acacia, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its slender, often spiny stems and small, bipinnate leaves that are typically gray-green in color. The plant produces yellow flowers in globular or cylindrical inflorescences, which are attractive to pollinators such as bees and birds. It is adapted to thrive in poor soils and can tolerate drought conditions, making it a resilient species in harsh environments. The wood of Acacia riceana var. axillaris is sometimes used locally for fuel or minor construction purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riceana var. axillaris is primarily native to eastern Australia, specifically the states of Queensland and New South Wales. It is commonly found in coastal and lowland areas, particularly in regions with sandy or loamy soils. This variety thrives in warm, temperate climates and is often associated with open woodlands and heathlands. It is well adapted to coastal environments and can tolerate salt spray and sandy soils. The plant is an important component of the local flora and is often used in ecological restoration projects.",
    "distribution_introduced_art_desc": "Acacia riceana var. axillaris was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in sandy soils. The plant is often used for erosion control due to its extensive root system. It thrives in warm, dry climates and is adaptable to various soil types. However, its spread has raised concerns about potential invasiveness in some ecosystems."
}
