{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stenoptila",
    "plant_slug": "acacia-stenoptila",
    "plant_name_scientific": "acacia stenoptila",
    "intro": "Acacia stenoptila, commonly known as the narrow-leaved wattle, is a shrub native to the arid regions of Australia. It is characterized by its slender, often spiny stems and narrow, phyllodes that are typically a bright yellow-green color. The plant produces small, yellow flowers in globular clusters, which are typical of the Acacia genus. It is well adapted to harsh, dry environments and has a deep root system to access water. Acacia stenoptila is also valued for its role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stenoptila is primarily native to the arid regions of southern Africa, particularly Namibia and South Africa. It is commonly found in the Namib Desert and the succulent Karoo biome. This plant thrives in sandy and rocky soils, often growing on dunes or in crevices. It is well adapted to extreme drought conditions and high temperatures. Acacia stenoptila plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia stenoptila was mainly introduced to regions with arid or semi-arid climates, particularly in parts of Australia and other parts of the world with similar environmental conditions. It is commonly found in areas with low rainfall and well-drained soils. This plant is often used for erosion control due to its ability to thrive in harsh conditions. Its introduction has sometimes led to ecological concerns in non-native areas. It is valued for its hardy nature and ability to provide shade and habitat for local wildlife."
}
