{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hartwegii",
    "plant_slug": "acacia-hartwegii",
    "plant_name_scientific": "acacia hartwegii",
    "intro": "Acacia hartwegii, commonly known as the Hartweg's wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow globular flower heads, which are clustered in dense, cylindrical inflorescences. Acacia hartwegii is adapted to arid and semi-arid environments, exhibiting drought tolerance and efficient water use. It plays a role in stabilizing soils and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hartwegii is primarily native to parts of southern Africa, including countries such as Namibia, Angola, and Botswana. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This species thrives in well-drained soils and is adapted to low rainfall conditions. It is often seen growing along riverbanks and in open woodland areas. Acacia hartwegii plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia hartwegii was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread beyond its original introduction range, becoming naturalized in several parts of southern Europe. The plant thrives in well-drained soils and full sun, making it adaptable to a variety of climates. Its introduction has raised concerns about its potential to become invasive in certain ecosystems. Despite its ornamental value, management strategies are being developed to control its spread in non-native areas."
}
