{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia durangensis",
    "plant_slug": "acacia-durangensis",
    "plant_name_scientific": "acacia durangensis",
    "intro": "Acacia durangensis, commonly known as the Durango acacia, is a shrub or small tree native to Mexico. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant typically grows in arid and semi-arid regions, adapting to harsh environmental conditions. Its small, yellow flowers are clustered in dense inflorescences, attracting various pollinators. The bark and leaves have been traditionally used in local medicine for their potential therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia durangensis is primarily native to Mexico, specifically the states of Durango and Zacatecas. It thrives in arid and semi-arid environments, often found in rocky soils and along dry riverbeds. This plant is well adapted to the harsh climate of the region, with its deep root system allowing it to access groundwater. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Acacia durangensis is also valued for its hardy nature and potential use in reforestation efforts.",
    "distribution_introduced_art_desc": "Acacia durangensis was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soils and withstand high temperatures. It is commonly found in regions of Mexico, particularly in the states of Durango and San Luis Potosí. This plant is often used for its hardy nature, making it suitable for reforestation and soil stabilization projects. Its ability to fix nitrogen also makes it beneficial for improving soil fertility in degraded lands. However, due to its invasive potential, it requires careful management to prevent ecological imbalances."
}
