{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sowdenii",
    "plant_slug": "acacia-sowdenii",
    "plant_name_scientific": "acacia sowdenii",
    "intro": "Acacia sowdenii, commonly known as the yellow acacia, is a shrub or small tree native to South Africa. It is characterized by its slender, often spiny branches and its clusters of yellow, feathery flowers that bloom in spring. The plant produces flat, bean-like pods that contain edible seeds, which are used in traditional medicine and cuisine. Acacia sowdenii thrives in well-drained soils and is adapted to arid and semi-arid environments. Its foliage provides habitat for various insects and small animals, contributing to local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sowdenii is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This species is adapted to withstand high temperatures and low rainfall, making it a resilient component of the local flora. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia sowdenii is also valued for its hardiness and is sometimes used in reforestation efforts in its native habitat.",
    "distribution_introduced_art_desc": "Acacia sowdenii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, growing in sandy soils and along coastal areas. This plant is often used for its ornamental value due to its attractive foliage and yellow flowers. It has also been introduced to other parts of the world, including Australia and the United States, as an ornamental species. However, its spread outside its native range is limited due to its specific environmental requirements."
}
