{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ligustrina",
    "plant_slug": "acacia-ligustrina",
    "plant_name_scientific": "acacia ligustrina",
    "intro": "Acacia ligustrina, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, trifoliate leaves and yellow flowers that bloom in late spring. The plant is adapted to arid and semi-arid environments, thriving in well-drained soils. It produces small, woody pods that contain seeds, which are dispersed by wind. Acacia ligustrina is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ligustrina"
    },
    "taxonomy_art_desc": "Acacia ligustrina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and spore-producing reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and produce legume-like fruits. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their acicular leaves and pod fruits, often found in arid environments. Its species is Acacia ligustrina, a specific type of acacia native to certain regions of Africa, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ligustrina is primarily native to Western Australia. It is commonly found in the coastal and sandy regions of the state. This plant thrives in well-drained soils and is often seen in open woodlands and heathlands. It is well adapted to the dry and sunny conditions of the region. Its distribution is largely restricted to the southwestern and southeastern parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia ligustrina was mainly introduced to control soil erosion and for its ornamental value in landscaping. It is commonly found in disturbed areas such as roadsides, construction sites, and degraded lands. This plant thrives in arid and semi-arid environments, making it suitable for rehabilitation of degraded soils. Its rapid growth and ability to fix nitrogen contribute to its success in these ecosystems. However, it can become invasive in some regions if not managed properly."
}
