{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pachyceras var. najdensis",
    "plant_slug": "acacia-pachyceras-var-najdensis",
    "plant_name_scientific": "acacia pachyceras var. najdensis",
    "intro": "Acacia pachyceras var. najdensis, commonly known as the narrow-leaf wattle, is a shrub native to arid regions of Australia. It is characterized by its slender, often spiny stems and small, bipinnate leaves that are typically narrow and leathery. The plant produces yellow floral spikes that are highly attractive to nectar-feeding birds and insects. It is well adapted to drought conditions, with deep roots that allow it to survive in nutrient-poor soils. The species is also valued for its ornamental appeal and is sometimes cultivated in gardens in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pachyceras var. najdensis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Angola, and parts of southwestern Zimbabwe. This variety thrives in rocky soils and is commonly found in savanna and shrubland ecosystems. It is well adapted to dry climates and can tolerate high temperatures and low rainfall. The plant is often used as a source of firewood and has cultural significance in local communities. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acacia pachyceras var. najdensis was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of northern Australia and the arid regions of Southeast Asia. This plant is often used for soil stabilization and as a source of timber and fuelwood due to its hardy nature. Its introduction has been primarily for ecological restoration and land management purposes. However, it can become invasive in some environments if not properly managed."
}
