{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella curassavica",
    "plant_slug": "acaciella-curassavica",
    "plant_name_scientific": "acaciella curassavica",
    "intro": "Acaciella curassavica, commonly known as the Mexican acacia, is a shrub native to Central America and parts of the Caribbean. It is characterized by its slender, often thorned stems and bipinnate leaves that are typically small and delicate. The plant produces yellow flowers that are clustered in racemes, which bloom during the dry season. Its seed pods are elongated and contain several seeds, which are dispersed by wind. Acaciella curassavica is adapted to arid and semi-arid environments, making it a resilient plant in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella curassavica is primarily native to the Caribbean region, including parts of Cuba, Hispaniola, Jamaica, and the Bahamas. It is commonly found in coastal areas and lowland forests where it thrives in humid, tropical climates. This plant is often associated with sandy soils and can be seen growing along the edges of mangrove forests. It plays an important ecological role in stabilizing shorelines and providing habitat for local wildlife. Due to its limited range, it is considered a vulnerable species in some areas.",
    "distribution_introduced_art_desc": "Acaciella curassavica was mainly introduced to tropical and subtropical regions as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has been widely cultivated in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in warm climates with minimal rainfall, making it suitable for xeriscaping and landscaping in arid environments. However, it has also become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its rapid growth and ability to spread through seeds pose challenges to ecological balance in non-native habitats."
}
