{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia doratoxylon var. angustifolia",
    "plant_slug": "acacia-doratoxylon-var-angustifolia",
    "plant_name_scientific": "acacia doratoxylon var. angustifolia",
    "intro": "Acacia doratoxylon var. angustifolia, commonly known as the narrow-leaf wattle, is a species of flowering plant in the legume family. It is native to Australia and is characterized by its slender, linear leaves and yellow floral spikes. The plant is typically found in sandy or gravelly soils in arid and semi-arid regions. It produces small, pod-like fruits that contain seeds dispersed by wind. This variety is often used in ecological restoration due to its hardiness and ability to stabilize soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia doratoxylon var. angustifolia is primarily native to the arid and semi-arid regions of Australia, particularly in the northern and central parts of the country. It is commonly found in the Northern Territory, Queensland, and Western Australia. This plant thrives in sandy soils and is often associated with shrublands and grasslands. It is well adapted to drought conditions and can tolerate high temperatures. Its distribution is largely restricted to areas with low rainfall and sparse vegetation.",
    "distribution_introduced_art_desc": "Acacia doratoxylon var. angustifolia was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with full sun exposure and moderate rainfall. This variety is often planted for its ornamental value due to its attractive foliage and ability to tolerate dry conditions. It has been successfully established in parts of southern Australia and the southwestern United States. However, it requires careful management to prevent it from becoming invasive in native ecosystems."
}
