{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dasyphylla",
    "plant_slug": "acacia-dasyphylla",
    "plant_name_scientific": "acacia dasyphylla",
    "intro": "Acacia dasyphylla, commonly known as the coastal wattle, is a shrub or small tree native to coastal regions of southern Australia. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves that are grey-green in color. The plant produces yellow globular flowers in late winter to early spring, which are followed by cylindrical seed pods. It thrives in well-drained soils and is drought-tolerant, making it well-suited to coastal and sandy environments. Acacia dasyphylla is also valued for its role in stabilizing dunes and preventing soil erosion.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dasyphylla is primarily native to Australia, particularly in the arid and semi-arid regions of the central and western parts of the country. It is commonly found in the states of Western Australia, South Australia, and Queensland. This species thrives in sandy soils and is often associated with spinifex plains and other dry habitats. It is well adapted to the harsh conditions of the Australian outback. Acacia dasyphylla plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia dasyphylla was mainly introduced to urban and suburban landscapes in Australia for its ornamental value and hardy nature. It is commonly used in landscaping due to its ability to thrive in dry conditions and its attractive, feathery foliage. The plant is also valued for its role in soil stabilization and as a source of nectar for bees. However, it has been noted to spread aggressively in some areas, leading to concerns about its potential as an invasive species. Its distribution is primarily confined to the southern parts of Australia, including New South Wales and South Australia."
}
