{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia f. elongata",
    "plant_slug": "acacia-longifolia-f-elongata",
    "plant_name_scientific": "acacia longifolia f. elongata",
    "intro": "Acacia longifolia f. elongata, commonly known as the coastal acacia or narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, linear leaves and yellow floral spikes that bloom in spring. The plant thrives in coastal environments, tolerating salt spray and sandy soils. Its growth habit is typically upright, with a dense, bushy form. It is often used in landscaping for its hardiness and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia f. elongata is primarily native to southern Australia, including the states of South Australia, Victoria, and Western Australia. This subspecies is commonly found in coastal regions and sandy soils along the southern coastline. It thrives in Mediterranean climates characterized by dry summers and wet winters. The plant is often associated with coastal dunes and heathlands. Its distribution is limited to specific ecological zones within these regions.",
    "distribution_introduced_art_desc": "Acacia longifolia f. elongata was mainly introduced to control erosion and for ornamental purposes in coastal and sandy areas. It is commonly found in regions with a Mediterranean climate, such as southern Australia and parts of California. This plant thrives in well-drained soils and can tolerate salt spray, making it suitable for coastal restoration projects. However, it has become invasive in some areas, outcompeting native vegetation. Its rapid growth and ability to form dense thickets have led to its classification as a weed in certain regions."
}
