{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amblyophylla",
    "plant_slug": "acacia-amblyophylla",
    "plant_name_scientific": "acacia amblyophylla",
    "intro": "Acacia amblyophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, feathery leaves and yellow flowers that bloom in spring. The plant is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. It thrives in dry, sandy soils and is often found in coastal and inland regions. The plant is valued for its ornamental appeal and is used in landscaping due to its hardiness and low maintenance requirements.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia amblyophylla"
    },
    "taxonomy_art_desc": "Acacia amblyophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that are typically legumes, often characterized by their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or bean family, known for their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found primarily in arid regions, known for their thorn-like stems and compound leaves. Its species is Acacia amblyophylla, a specific type of acacia native to Australia, characterized by its small leaves and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amblyophylla is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas around the Fitzgerald River National Park and the Stirling Range. This plant typically grows in sandy or gravelly soils and is often associated with coastal and near-coastal habitats. It is well adapted to the dry and Mediterranean climate of its native range. Acacia amblyophylla is an important component of the local flora and plays a role in the ecological balance of its environment.",
    "distribution_introduced_art_desc": "Acacia amblyophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape, particularly in fynbos vegetation types. The plant is often cultivated for its ornamental value due to its attractive foliage and yellow flowers. However, it is considered invasive in some areas, outcompeting native vegetation. Its introduction has raised concerns about its impact on local ecosystems and biodiversity."
}
