{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia biaciculata",
    "plant_slug": "acacia-biaciculata",
    "plant_name_scientific": "acacia biaciculata",
    "intro": "Acacia biaciculata, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, bipinnate leaves composed of numerous thread-like leaflets. The plant produces yellow globular flowers that appear in spring, attracting a variety of pollinators. It thrives in well-drained soils and is often found in dry, open habitats. Acacia biaciculata is valued for its ornamental appeal and is also used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia biaciculata is primarily native to northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species thrives in open woodlands and shrublands, often along coastal areas and inland dunes. It is well adapted to dry climates and can tolerate high temperatures and low rainfall. Acacia biaciculata plays an important role in the local ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia biaciculata was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly used in reforestation and land rehabilitation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has been particularly beneficial in areas where traditional vegetation has been degraded. However, it requires careful management to prevent it from becoming invasive in non-target environments."
}
