{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia celsiana",
    "plant_slug": "acacia-celsiana",
    "plant_name_scientific": "acacia celsiana",
    "intro": "Acacia celsiana, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and narrow, phyllode-like leaves that are typically green and slightly hairy. The plant produces bright yellow flowers in late winter to early spring, which are clustered in spherical or cylindrical inflorescences. Acacia celsiana is well adapted to arid and semi-arid environments, with a deep root system that allows it to survive in poor soils. It is also noted for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia celsiana is primarily native to eastern Australia, including the states of New South Wales, Queensland, and Victoria. It is commonly found in dry sclerophyll forests and woodland areas. This species thrives in well-drained soils and is often associated with rocky or sandy habitats. Acacia celsiana is also present in some parts of South Australia and Tasmania. It is an important component of the local flora and plays a role in the ecological balance of its native environment.",
    "distribution_introduced_art_desc": "Acacia celsiana was mainly introduced to Australia as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since been planted in various regions across the country, particularly in southern and western areas. The plant is commonly found in gardens, along roadsides, and in degraded or disturbed landscapes. Its introduction has led to its establishment in some native ecosystems, raising concerns about its potential invasive behavior. Despite its ornamental value, careful management is recommended to prevent its spread into sensitive environments."
}
