{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kallunkiae",
    "plant_slug": "acacia-kallunkiae",
    "plant_name_scientific": "acacia kallunkiae",
    "intro": "Acacia kallunkiae, commonly known as the Western Australian acacia, is a shrub or small tree native to the coastal regions of Western Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow to golden spherical flower heads, which are clustered in dense, cylindrical inflorescences. It thrives in sandy soils and is adapted to arid and semi-arid environments. Acacia kallunkiae is also valued for its hardiness and is sometimes used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kallunkiae is primarily native to the arid and semi-arid regions of Western Australia. It is commonly found in the Pilbara and Goldfields regions, where it thrives in sandy soils. This species is typically associated with coastal and inland dunes, as well as rocky outcrops. It plays an important ecological role in stabilizing soil and providing habitat for native fauna. Acacia kallunkiae is well adapted to the harsh climate of its native range, with its hardy nature allowing it to survive in low rainfall conditions.",
    "distribution_introduced_art_desc": "Acacia kallunkiae was mainly introduced to South Australia as part of a revegetation program aimed at restoring degraded landscapes. It is commonly found in arid and semi-arid regions, particularly in the lower Mount Lofty Ranges and the Riverland area. The plant thrives in well-drained soils and is often used in erosion control due to its hardy nature. It has been successfully established in both natural and managed ecosystems. However, its spread is limited due to its preference for specific environmental conditions."
}
