{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia solandri",
    "plant_slug": "acacia-solandri",
    "plant_name_scientific": "acacia solandri",
    "intro": "Acacia solandri, commonly known as the silky acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and bipinnate leaves that are finely divided. The plant produces yellow globular flower heads, which are clustered in dense inflorescences. Acacia solandri is adapted to arid and semi-arid environments, exhibiting drought tolerance and a deep root system. It is also valued for its ornamental appeal and is sometimes used in landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia solandri is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry, open habitats such as grasslands, woodlands, and heathlands. This species thrives in well-drained soils and is often associated with coastal and inland regions. It is a hardy shrub or small tree that plays an important ecological role in its native range. Acacia solandri is well adapted to the semi-arid and temperate climates of its native distribution.",
    "distribution_introduced_art_desc": "Acacia solandri was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It is also valued for its ability to thrive in a variety of soil conditions and its role in soil stabilization. However, its introduction has led to concerns about its potential to become invasive in certain ecosystems. Despite its benefits, management strategies are often needed to prevent its spread into native habitats. The plant is now commonly found in both urban and rural areas across the country."
}
