{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sororia",
    "plant_slug": "acacia-sororia",
    "plant_name_scientific": "acacia sororia",
    "intro": "Acacia sororia, commonly known as the white acacia, is a shrub native to southern Africa. It is characterized by its slender, branched stems and small, feathery leaves that are often covered in fine hairs. The plant produces yellow flowers in globular clusters, which are highly attractive to bees and other pollinators. Its seed pods are elongated and woody, containing several seeds that are dispersed by wind. Acacia sororia is adapted to arid and semi-arid environments, making it a resilient plant in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sororia is primarily native to the southwestern United States and northern Mexico. It is commonly found in arid and semi-arid regions, including parts of Arizona, New Mexico, and Texas. This plant thrives in sandy or rocky soils and is often seen in desert scrub and chaparral habitats. It plays an important role in local ecosystems by providing food and shelter for various wildlife species. Acacia sororia is well adapted to the harsh environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia sororia was mainly introduced to regions with tropical and subtropical climates, where it thrives in well-drained soils and full sunlight. It has been commonly planted in Australia and parts of Southeast Asia for its ornamental value and ability to stabilize soil. The plant is also used in reforestation projects due to its fast growth and nitrogen-fixing capabilities. However, in some areas, it has become invasive, outcompeting native vegetation. Its introduction has led to both ecological benefits and management challenges in certain environments."
}
