{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciopsis californica",
    "plant_slug": "acaciopsis-californica",
    "plant_name_scientific": "acaciopsis californica",
    "intro": "Acaciopsis californica, commonly known as the California acaciopsis, is a small, deciduous shrub native to coastal areas of California. It has compound leaves with small, oval leaflets that are arranged in pairs along the stems. The plant produces yellow flowers in early spring, which are clustered in spherical inflorescences. It thrives in well-drained soils and is adapted to coastal climates with mild winters and dry summers. Acaciopsis californica is often used in restoration projects due to its ability to stabilize soils and provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciopsis californica is primarily native to the coastal regions of southern California, particularly in the counties of San Diego and Orange. It thrives in sandy soils along the coastline and in disturbed areas such as dunes and rocky outcrops. This plant is commonly found in areas with a Mediterranean climate, characterized by mild, wet winters and warm, dry summers. It plays an important role in stabilizing dunes and providing habitat for local wildlife. Due to habitat loss and environmental changes, it is considered a rare and endangered species in its native range.",
    "distribution_introduced_art_desc": "Acaciopsis californica was mainly introduced to California and the western United States. It was brought in during the 19th century as an ornamental plant due to its attractive foliage and adaptability to various soil types. The distribution of this species has expanded beyond its original introduction range, particularly in urban and suburban areas. It is now commonly found in parks, gardens, and along roadsides in the western regions. However, its spread has raised concerns about its potential impact on native plant communities."
}
