{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia latzii",
    "plant_slug": "acacia-latzii",
    "plant_name_scientific": "acacia latzii",
    "intro": "Acacia latzii, commonly known as the Lutz acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, often branched stems and small, greenish-yellow flowers that appear in compact clusters. The plant produces flat, bipinnate leaves that are adapted to reduce water loss in its harsh environment. Acacia latzii is often found in rocky soils and can thrive in full sun, making it well-suited for xerophytic conditions. Its ecological role includes providing habitat and food for various desert wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia latzii"
    },
    "taxonomy_art_desc": "Acacia latzii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and nitrogen-fixing capabilities. Its family is Fabaceae, commonly known as the legume or pea family, which is known for its distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their acicular leaves and often produces flowers in globular or cylindrical clusters. Its species is Acacia latzii, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia latzii is primarily native to the Northern Territory and South Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. It plays an important ecological role in providing habitat and food for local wildlife. Its distribution is closely tied to the environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia latzii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of the southwestern United States and northern Mexico. This plant is often used for erosion control due to its deep root system and ability to withstand drought. It has also been introduced to other parts of the world as an ornamental species. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
