{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia × semiaurea",
    "plant_slug": "acacia-×-semiaurea",
    "plant_name_scientific": "acacia × semiaurea",
    "intro": "Acacia × semiaurea, commonly known as the golden wattle, is a hybrid shrub native to Australia. It is characterized by its distinctive yellow floral spikes, which are borne along the stems and are highly attractive to pollinators. The plant has bipinnate leaves that are feathery in appearance and often have a pale golden hue. It thrives in well-drained soils and full sun, making it a popular ornamental plant in gardens. Acacia × semiaurea is also valued for its hardiness and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia × semiaurea"
    },
    "taxonomy_art_desc": "Acacia × semiaurea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide range of growth forms. Its order is Fabales, which includes plants with distinctive flowers and a variety of ecological roles, such as nitrogen fixation. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in landscaping and traditional medicine. Its species is Acacia × semiaurea, a hybrid species resulting from the cross between Acacia aneura and Acacia longifolia, known for its ornamental value and adaptability to various environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia × semiaurea is primarily native to South Australia. It is a hybrid species that occurs naturally in the region, often found in arid and semi-arid environments. This plant is commonly seen in coastal and inland areas where the climate supports its growth. It thrives in well-drained soils and is adapted to the harsh conditions of the Australian landscape. Its native distribution is closely linked to the unique ecological conditions of South Australia.",
    "distribution_introduced_art_desc": "Acacia × semiaurea was mainly introduced to ornamental horticulture and landscaping due to its attractive golden foliage and drought tolerance. It is commonly cultivated in regions with warm climates, such as parts of the Mediterranean, southern California, and Australia. This hybrid plant is often used in gardens and public spaces for its aesthetic value and low maintenance requirements. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its distribution is largely restricted to areas where it is intentionally planted, though it may establish itself in disturbed soils."
}
