{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia densifolia",
    "plant_slug": "acacia-densifolia",
    "plant_name_scientific": "acacia densifolia",
    "intro": "Acacia densifolia, commonly known as the denseleaf wattle, is a shrub native to the coastal regions of southern Australia. It is characterized by its dense, feathery foliage and yellow flowers that bloom in spring. The plant has compound leaves composed of multiple small, oval-shaped leaflets. Acacia densifolia is well adapted to sandy soils and salty coastal environments. It plays an important role in stabilizing dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia densifolia is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry sclerophyll forests and woodland habitats. This species thrives in well-drained soils and is often associated with rocky or sandy substrates. It is adapted to the seasonal rainfall patterns of the region. Acacia densifolia is an important component of the local flora and provides habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia densifolia was mainly introduced to control soil erosion and for its ornamental value in landscaping. It is commonly found in coastal and sandy areas where it helps stabilize dunes and prevent wind erosion. The plant thrives in well-drained soils and full sun, making it suitable for arid and semi-arid environments. Due to its rapid growth and hardiness, it has been used in reclamation projects across several regions. However, its invasive potential has raised concerns in some areas where it outcompetes native vegetation."
}
