{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia zatrichota",
    "plant_slug": "acacia-zatrichota",
    "plant_name_scientific": "acacia zatrichota",
    "intro": "Acacia zatrichota, commonly known as the coastal acacia, is a shrub or small tree native to the coastal regions of southern Africa. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves that are adapted to reduce water loss in arid environments. The plant produces yellow globular flowers that bloom in summer, attracting various pollinators such as bees and birds. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its ability to colonize sandy or disturbed soils. Acacia zatrichota is also known for its role in stabilizing coastal dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia zatrichota"
    },
    "taxonomy_art_desc": "Acacia zatrichota belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia zatrichota, a specific type of acacia found in certain regions, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia zatrichota is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the state. This plant thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the harsh climatic conditions of the region. Acacia zatrichota plays an important ecological role in supporting local wildlife and stabilizing soil in its native habitat.",
    "distribution_introduced_art_desc": "Acacia zatrichota was mainly introduced to South Africa, particularly in the Western Cape region. It was brought there for its ornamental value and its ability to thrive in dry, rocky environments. The plant has since spread beyond its original introduction sites, becoming naturalized in several areas. It is commonly found in gardens and along roadsides where it provides shade and attracts wildlife. However, its invasive potential remains a concern in some regions."
}
