{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glaucescens var. leiocalyx",
    "plant_slug": "acacia-glaucescens-var-leiocalyx",
    "plant_name_scientific": "acacia glaucescens var. leiocalyx",
    "intro": "Acacia glaucescens var. leiocalyx, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, feathery foliage composed of small, glandular, and often silky-haired leaves. The plant produces yellow, globular flower heads that are highly attractive to pollinators such as bees and birds. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. The wood of this species is hard and durable, historically used for construction and tool-making.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glaucescens var. leiocalyx is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in savanna and woodland habitats, often growing on rocky soils or in dry grasslands. It thrives in areas with low rainfall and high temperatures, adapting well to the harsh conditions of its native environment. The plant is well-known for its distinctive yellow flowers and its ability to provide shade and forage for wildlife. Due to its resilience, it plays an important ecological role in stabilizing soil and supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acacia glaucescens var. leiocalyx was mainly introduced to areas with warm, dry climates and well-drained soils, typically found in regions of Australia and parts of Southeast Asia. It is commonly found in disturbed soils and along roadsides, where it thrives in full sun. This plant has been introduced to new environments for its ornamental value and its ability to stabilize soil. However, it can become invasive in certain areas, outcompeting native vegetation. Its distribution is now expanding due to human activity and climate change."
}
