{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dumetorum",
    "plant_slug": "acacia-dumetorum",
    "plant_name_scientific": "acacia dumetorum",
    "intro": "Acacia dumetorum, commonly known as the white wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, paired leaves. The plant produces yellow flowers in globular clusters, which bloom during the spring and summer seasons. It thrives in dry, sandy soils and is often found in coastal and inland regions. Acacia dumetorum is also known for its ability to fix nitrogen, making it an important plant in soil enrichment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dumetorum is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in dry, open habitats such as grasslands, rocky outcrops, and sandy soils. The plant thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is often seen growing along roadsides, in savannas, and in disturbed areas. Acacia dumetorum is well adapted to arid conditions and can tolerate poor soil quality.",
    "distribution_introduced_art_desc": "Acacia dumetorum was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, grasslands, and agricultural fields. It thrives in regions with a warm, dry climate and is commonly found in parts of Australia and the Mediterranean. This plant is known for its ability to spread rapidly, often outcompeting native vegetation. Its introduction has led to ecological concerns in some regions due to its invasive potential. It is often used for erosion control and as a source of timber and fodder."
}
