{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia genistifolia subsp. platyphylla",
    "plant_slug": "acacia-genistifolia-subsp-platyphylla",
    "plant_name_scientific": "acacia genistifolia subsp. platyphylla",
    "intro": "Acacia genistifolia subsp. platyphylla, commonly known as the flat-leaf golden wattle, is a shrub native to southern Australia. It is characterized by its narrow, flat leaves that are typically green with a slight whitish underside. The plant produces yellow flowers in late winter to early spring, which are clustered in globular inflorescences. It thrives in well-drained soils and is often found in dry, sandy environments. This subspecies is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia genistifolia"
    },
    "taxonomy_art_desc": "Acacia genistifolia subsp. platyphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures. Its class is Equisetopsida, which encompasses ferns, horsetails, and their allies, typically featuring vascular tissues and a wide range of morphological diversity. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures and reproductive systems. Its order is Fabales, which includes legumes and related plants, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees, many of which are native to Africa and Australia, and are known for their distinctive acicular leaves and floral structures. Its species is Acacia genistifolia, a specific type within the Acacia genus, which includes various subspecies like platyphylla, and is recognized for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tasmania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia genistifolia subsp. platyphylla is primarily native to Tasmania. It is commonly found in the southern regions of the island, particularly in areas with sandy soils. This subspecies thrives in coastal and dry inland habitats. It is often seen in heathlands and open woodlands. Its distribution is limited to the unique environmental conditions of Tasmania.",
    "distribution_introduced_art_desc": "Acacia genistifolia subsp. platyphylla was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This subspecies is often found in open woodlands and rocky slopes. It has been introduced to several parts of southern Africa, including South Africa and Namibia. Due to its hardy nature, it has become naturalized in some local ecosystems."
}
