{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia browniana var. brevifolia",
    "plant_slug": "acacia-browniana-var-brevifolia",
    "plant_name_scientific": "acacia browniana var. brevifolia",
    "intro": "Acacia browniana var. brevifolia, commonly known as the narrow-leaved wattle, is a shrub or small tree native to southern Australia. It features slender, often zigzagging branches and small, phyllodes that are narrow and linear, typically less than 3 cm in length. The plant produces yellow flowers in spikes, which bloom in spring and attract various pollinators. It is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid regions. The species is valued for its ornamental appeal and ability to stabilize soil in degraded landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia browniana var. brevifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variety is commonly found in rocky outcrops, sandy soils, and coastal areas where it thrives in dry and hot climates. It is well adapted to low rainfall conditions and can tolerate high temperatures and poor soil quality. The plant plays an important ecological role in its native habitat by providing shelter and food for local wildlife. Its distribution is largely restricted to specific microhabitats within these regions.",
    "distribution_introduced_art_desc": "Acacia browniana var. brevifolia was mainly introduced to regions with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soils. It is commonly found in areas of southern Africa, including parts of Namibia, Angola, and South Africa. This plant is often used for erosion control and as a source of firewood or fodder. Its introduction has sometimes led to competition with native species in invaded areas. Despite its benefits, it requires careful management to prevent ecological imbalances."
}
