{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leprosa",
    "plant_slug": "acacia-leprosa",
    "plant_name_scientific": "acacia leprosa",
    "intro": "Acacia leprosa, commonly known as the yellow acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and small, yellow flowers that bloom in late summer. The plant produces flat, bean-like pods that contain edible seeds, which are a traditional food source for some indigenous communities. Its leaves are bipinnate, with numerous small, oval-shaped leaflets. Acacia leprosa is also valued for its ability to thrive in arid conditions, making it an important component of its native ecosystem.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leprosa"
    },
    "taxonomy_art_desc": "Acacia leprosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which comprises plants known for their legume fruits and often nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive flattened or globular seed pods and often used in traditional medicine. Its species is Acacia leprosa, a specific type of acacia found in certain regions, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leprosa is primarily native to New South Wales, Queensland, Tasmania, and Victoria. This species is commonly found in dry, open habitats such as woodlands and grasslands. It thrives in regions with a temperate to subtropical climate. Acacia leprosa is often seen growing along roadsides and in disturbed areas. Its distribution reflects its adaptability to various soil types and environmental conditions.",
    "distribution_introduced_art_desc": "Acacia leprosa was mainly introduced to areas with sandy soils and arid climates, particularly in regions of Australia and parts of the southern United States. It is commonly found in disturbed sites such as roadsides, degraded lands, and along riverbanks. This plant thrives in full sun and is highly drought-tolerant, making it a common invasive species in some regions. Its rapid growth and ability to fix nitrogen contribute to its competitive advantage over native vegetation. Due to its aggressive spread, it is often classified as a weed in agricultural and natural ecosystems."
}
