{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis var. raddiana",
    "plant_slug": "acacia-tortilis-var-raddiana",
    "plant_name_scientific": "acacia tortilis var. raddiana",
    "intro": "Acacia tortilis var. raddiana, commonly known as the umbrella thorn acacia, is a shrub or small tree native to the African savannas. It is characterized by its distinctive umbrella-shaped crown formed by its thick, spreading branches. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic organs. It produces yellow flowers in winter, followed by pods that contain seeds. This species is well adapted to arid environments and plays an important role in providing habitat and food for various wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis var. raddiana is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of Sudan and the Arabian Peninsula. This plant thrives in arid and semi-arid environments, often growing in savannas and rocky areas. It is well adapted to hot, dry climates with low rainfall. Its distribution is closely associated with regions that have a history of human interaction and land use.",
    "distribution_introduced_art_desc": "Acacia tortilis var. raddiana was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, the Middle East, and parts of southern Asia. This plant is often used for its hardy nature, providing shade and soil stabilization in degraded landscapes. Its introduction has been largely for ecological restoration and as a source of timber and fodder. However, its spread can sometimes lead to competition with native species in certain environments."
}
