{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortuosa",
    "plant_slug": "acacia-tortuosa",
    "plant_name_scientific": "acacia tortuosa",
    "intro": "Acacia tortuosa, commonly known as the sour acacia or the warty acacia, is a shrub or small tree native to Africa and the Arabian Peninsula. It is characterized by its distinctive warty, thorned stems and bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers that are clustered in spherical heads, followed by flat, elongated pods containing seeds. Acacia tortuosa is adapted to arid environments and is often found in rocky soils. It has been used traditionally for its wood, gum, and medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortuosa is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, often growing in rocky soils and along coastal areas. This plant is well adapted to hot and dry climates, making it a characteristic species of desert and coastal ecosystems. It plays an important role in the local environment by providing habitat and food for various wildlife. Acacia tortuosa is also known for its ability to thrive in poor soil conditions, contributing to its widespread distribution in its native range.",
    "distribution_introduced_art_desc": "Acacia tortuosa was mainly introduced to areas with arid or semi-arid climates due to its drought-resistant properties and ability to thrive in poor soils. It is commonly found in regions of Africa, the Middle East, and parts of Australia where it serves as a valuable source of timber and fodder. The plant's introduction has been largely for agricultural and ecological purposes, including land stabilization and soil improvement. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems. Its distribution is now widespread in parts of its introduced range, though it remains most prevalent in its native habitat."
}
