{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obtecta",
    "plant_slug": "acacia-obtecta",
    "plant_name_scientific": "acacia obtecta",
    "intro": "Acacia obtecta, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, often spiny stems and small, narrow leaves that are typically covered in a fine layer of white hairs. The plant produces yellow flowers in globular clusters, which bloom from late autumn to early spring. Acacia obtecta is adapted to arid and semi-arid environments, showing drought tolerance and resilience to poor soil conditions. It plays a role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia obtecta"
    },
    "taxonomy_art_desc": "Acacia obtecta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a distinct root system and a complex life cycle involving alternating generations. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia obtecta, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obtecta is primarily native to Western Australia. It is found in the southern and southwestern regions of the state. This species typically grows in dry, sandy soils and is commonly found in shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia obtecta plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia obtecta was mainly introduced to the coastal regions of southern Africa, particularly in South Africa, Namibia, and Botswana. It is commonly found in sandy soils along the coastline and in dune environments. The plant is adapted to arid and semi-arid conditions, making it a pioneer species in disturbed or degraded habitats. It plays an important role in stabilizing dunes and preventing soil erosion. Due to its hardiness, it has been introduced to other parts of the world for ecological restoration projects."
}
