{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fuliginea",
    "plant_slug": "acacia-fuliginea",
    "plant_name_scientific": "acacia fuliginea",
    "intro": "Acacia fuliginea, commonly known as the black wattle, is a shrub or small tree native to Australia. It is characterized by its dark, woody bark and compound leaves that are often covered in fine hairs. The plant produces yellow flowers arranged in cylindrical spikes, which are followed by flat, ribbed pods. It is well adapted to arid and semi-arid environments, thriving in sandy or rocky soils. Acacia fuliginea is also known for its historical use in the tanning industry due to its high tannin content.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fuliginea is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Zimbabwe. It thrives in arid and semi-arid regions, often found in savannas and rocky outcrops. This plant is well adapted to dry climates and can tolerate poor soil conditions. It is commonly seen in open woodlands and along riverbanks in its native range. Acacia fuliginea plays an important ecological role by providing habitat and food for various local wildlife species.",
    "distribution_introduced_art_desc": "Acacia fuliginea was mainly introduced to areas with sandy or coastal soils where it can thrive in well-drained conditions. It is commonly found in regions with a temperate to subtropical climate, often along coastal dunes or in disturbed habitats. This plant has been introduced to several parts of the world, including Australia, the United States, and South Africa, where it has become naturalized. Its rapid growth and ability to fix nitrogen make it a valuable plant for soil stabilization and erosion control. However, it can also become invasive in some ecosystems if not managed properly."
}
