{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia epacantha",
    "plant_slug": "acacia-epacantha",
    "plant_name_scientific": "acacia epacantha",
    "intro": "Acacia epacantha, commonly known as the white thorn acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, thorned stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers arranged in dense, globular inflorescences, which are followed by woody pods containing flat, seed-like structures. It thrives in arid and semi-arid environments, often found in rocky soils and along riverbanks. Acacia epacantha is well adapted to drought conditions and plays a role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia epacantha"
    },
    "taxonomy_art_desc": "Acacia epacantha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive acicular leaves and often spiny structures. Its species is Acacia epacantha, a specific type of acacia found in certain regions, recognized by its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia epacantha is primarily native to Western Australia. It is commonly found in the region's arid and semi-arid zones. This species thrives in sandy soils and is often seen along coastal areas and inland dunes. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. Its unique appearance makes it a distinctive feature of the Western Australian landscape.",
    "distribution_introduced_art_desc": "Acacia epacantha was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Kenya, Tanzania, and Ethiopia. This plant is often used for its hardy nature and ability to prevent soil erosion. Its introduction has been largely for ecological restoration and land rehabilitation purposes. However, it can sometimes become invasive in certain environments if not managed properly."
}
