{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia farinosa",
    "plant_slug": "acacia-farinosa",
    "plant_name_scientific": "acacia farinosa",
    "intro": "Acacia farinosa, commonly known as the white acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, often multi-branched structure and its distinctive, feathery leaves that are covered in a fine, whitish powder, giving it a dusty appearance. The plant produces yellow flowers in globular clusters, which are followed by long, flat pods containing seeds. Acacia farinosa is well adapted to harsh environments, with deep roots and a capacity to fix nitrogen, making it an important species in ecological restoration. Its unique morphology and ecological role make it a notable example of desert flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia farinosa"
    },
    "taxonomy_art_desc": "Acacia farinosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological characteristics. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acicular leaves and often being used for timber or as sources of gum. Its species is Acacia farinosa, a specific type of acacia found in certain regions, known for its distinctive features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia farinosa is primarily native to South Australia and Victoria. It is commonly found in arid and semi-arid regions within these states. This plant typically grows in sandy or gravelly soils along riverbanks and in open woodlands. It is well adapted to the harsh climate of the Australian outback. Its distribution is largely restricted to the southeastern part of the country.",
    "distribution_introduced_art_desc": "Acacia farinosa was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its drought resistance and ability to fix nitrogen, improving soil fertility. Its introduction has been particularly beneficial in areas with high wind erosion. However, it requires careful management to prevent it from becoming invasive in non-target environments."
}
