{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subtessarogona",
    "plant_slug": "acacia-subtessarogona",
    "plant_name_scientific": "acacia subtessarogona",
    "intro": "Acacia subtessarogona, commonly known as the narrow-leaf acacia, is a species of flowering plant in the legume family, Fabaceae. It is native to parts of Africa, particularly in countries like Sudan and South Sudan. The plant is characterized by its slender, often spiny stems and small, bipinnate leaves. Its yellow flowers are clustered in cylindrical inflorescences, and it produces flat, pod-like fruits that contain several seeds. Acacia subtessarogona is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia subtessarogona"
    },
    "taxonomy_art_desc": "Acacia subtessarogona belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their complex flower structures and diverse ecological adaptations. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes, a modified leaf structure, and their ability to thrive in arid environments. Its species is Acacia subtessarogona, a specific type of acacia that is likely adapted to particular ecological conditions and may have unique morphological or genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subtessarogona is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the areas of the Mid West and Goldfields-Eromanga. This species typically grows in sandy or gravelly soils, often in open woodlands or shrublands. It is well adapted to the arid and semi-arid climates of its native range. The plant plays an important ecological role in its habitat, providing food and shelter for various native animals.",
    "distribution_introduced_art_desc": "Acacia subtessarogona was mainly introduced to regions with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in areas with mild winters and warm, dry summers. The plant is often cultivated for its ornamental value and its ability to fix nitrogen in the soil. It has been introduced to several parts of Australia and the Pacific Islands. However, it can become invasive in some environments if not managed properly."
}
