{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia retinodes var. floribunda",
    "plant_slug": "acacia-retinodes-var-floribunda",
    "plant_name_scientific": "acacia retinodes var. floribunda",
    "intro": "Acacia retinodes var. floribunda, commonly known as the silky acacia, is a flowering plant native to southern Africa. It is characterized by its slender, often twisted stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow to golden flowers in clusters, which bloom during the warmer months. It thrives in well-drained soils and full sun, making it suitable for arid and semi-arid environments. The species is valued for its ornamental appeal and is often used in xeriscaping due to its drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia retinodes var. floribunda is primarily native to northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It thrives in arid and semi-arid regions, often found in sandy soils and open woodlands. This variety is commonly associated with coastal and inland dune environments. It is well adapted to the hot, dry climate of its native range. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia retinodes var. floribunda was mainly introduced to stabilize soil and prevent erosion in degraded lands. It is commonly found in agricultural areas where its deep root system helps improve soil structure. This plant is also used for ornamental purposes due to its attractive yellow flowers. It has been successfully established in various regions with semi-arid climates. However, its introduction has raised concerns about potential invasiveness in native ecosystems."
}
