{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oligophylla",
    "plant_slug": "acacia-oligophylla",
    "plant_name_scientific": "acacia oligophylla",
    "intro": "Acacia oligophylla, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, bipinnate leaves and yellow flowers that bloom in late winter to early spring. The plant is adapted to arid and semi-arid environments, showing drought tolerance through its deep root system. It plays a role in stabilizing soils and providing habitat for native wildlife. Acacia oligophylla is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oligophylla is primarily native to eastern Australia, including regions such as New South Wales and Queensland. It is commonly found in sandy soils along coastal areas and in heathlands. This species thrives in dry, open environments and is often associated with coastal dunes and cliffs. It plays an important ecological role in stabilizing sand dunes and providing habitat for native wildlife. Acacia oligophylla is well adapted to the harsh conditions of its native range, including high salinity and strong coastal winds.",
    "distribution_introduced_art_desc": "Acacia oligophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often along the edges of forests and in open woodlands. The plant is known for its ability to thrive in arid and semi-arid conditions, making it adaptable to various environmental conditions. It has been used in reforestation projects due to its fast growth and nitrogen-fixing capabilities. However, its spread has raised concerns about potential invasiveness in some ecosystems."
}
