{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia prainii",
    "plant_slug": "acacia-prainii",
    "plant_name_scientific": "acacia prainii",
    "intro": "Acacia prainii, commonly known as the Prain's wattle, is a flowering plant native to the tropical regions of Africa and southern Asia. It is a shrub or small tree that typically grows to a height of 2–5 meters. The plant produces bright yellow flowers arranged in dense, globular clusters, which bloom during the dry season. Its leaves are bipinnate, consisting of multiple small leaflets, and the plant is well adapted to arid environments. Acacia prainii is often used in horticulture for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia prainii"
    },
    "taxonomy_art_desc": "Acacia prainii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have flowers with a unique structure and often include legumes that form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of flowering plants in the legume family, known for their distinctive umbrella-like flower clusters and often used in traditional medicine. Its species is Acacia prainii, a specific type of acacia native to certain regions of Australia, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia prainii is primarily native to the Northern Territory, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions across these areas. It thrives in sandy soils and is often seen in open woodlands and shrublands. Acacia prainii is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia prainii was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in regions such as parts of northern Australia and the arid zones of Southeast Asia. It thrives in environments with low rainfall and high sunlight exposure, making it suitable for reclamation of degraded lands. This plant is often used in erosion control due to its deep root system and ability to stabilize soil. It is also valued for its hardy nature and ornamental value, making it a popular choice for landscaping in arid regions. However, its introduction has sometimes led to ecological concerns due to its potential to outcompete native species."
}
