{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obtusifolia",
    "plant_slug": "acacia-obtusifolia",
    "plant_name_scientific": "acacia obtusifolia",
    "intro": "Acacia obtusifolia, commonly known as the soft-leaved wattle, is a shrub native to South Australia. It is characterized by its narrow, ovate leaves that are usually covered in a fine layer of white hairs. The plant produces yellow globular flowers in late summer, which are clustered in spikes. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. The species is also valued for its ornamental appeal and ability to stabilize soil in degraded areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia obtusifolia"
    },
    "taxonomy_art_desc": "Acacia obtusifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and other primitive plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in groups of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their thorny stems and compound leaves, often found in arid regions. Its species is Acacia obtusifolia, a specific type of acacia known for its broad, rounded leaves and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obtusifolia is primarily native to New South Wales, Queensland, and Victoria. This plant is commonly found in the arid and semi-arid regions of these Australian states. It thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. Acacia obtusifolia is well adapted to the harsh climatic conditions of its native range. Its distribution is closely associated with the inland areas of eastern Australia.",
    "distribution_introduced_art_desc": "Acacia obtusifolia was mainly introduced to stabilize soils and provide shade in arid and semi-arid regions. It is commonly used in reforestation projects due to its drought tolerance and ability to thrive in poor soil conditions. The plant has been introduced to several countries in Africa, the Middle East, and parts of Asia. Its rapid growth and nitrogen-fixing ability make it a valuable species for land rehabilitation. However, it can become invasive in some areas if not managed properly."
}
