{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hystrix subsp. continua",
    "plant_slug": "acacia-hystrix-subsp-continua",
    "plant_name_scientific": "acacia hystrix subsp. continua",
    "intro": "Acacia hystrix subsp. continua, commonly known as the continuous acacia, is a shrub or small tree native to parts of Southeast Asia. It is characterized by its distinctive, flat, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in dense, cylindrical spikes, which are typical of the Acacia genus. Its seed pods are elongated and contain small, hard seeds. This species is adapted to arid and semi-arid environments, making it resilient to drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hystrix"
    },
    "taxonomy_art_desc": "Acacia hystrix subsp. continua belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their acorn-like seed pods and often used in traditional medicine and as sources of timber. Its species is Acacia hystrix, a specific type of acacia that has a subspecies, continua, and is typically found in specific geographic regions with particular ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hystrix subsp. continua is primarily native to Western Australia. This subspecies is commonly found in the region's arid and semi-arid areas. It thrives in sandy soils and is often seen in shrublands and open woodlands. The plant is well adapted to the harsh climatic conditions of the region. It plays an important role in the local ecosystem and is a characteristic feature of the landscape in Western Australia.",
    "distribution_introduced_art_desc": "Acacia hystrix subsp. continua was mainly introduced to regions with arid and semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for dryland environments. This subspecies is often used for soil stabilization and as a source of timber and fuelwood in its native range. Its introduction has been associated with both ecological benefits and potential invasiveness in certain areas. However, its distribution remains largely confined to specific geographic regions due to its environmental preferences."
}
