{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gilliesii",
    "plant_slug": "acacia-gilliesii",
    "plant_name_scientific": "acacia gilliesii",
    "intro": "Acacia gilliesii, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, fern-like appearance. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, spherical inflorescences. Acacia gilliesii is well adapted to arid and semi-arid environments, showing drought tolerance and resilience. Its ecological importance includes providing nectar for native pollinators and serving as a habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gilliesii is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in grasslands and savannas. This plant thrives in well-drained soils and is often seen growing along roadsides and in open habitats. It is well adapted to the harsh climate of its native range, with its waxy leaves reducing water loss. Acacia gilliesii is also known for its yellow flowers, which appear in clusters and attract various pollinators.",
    "distribution_introduced_art_desc": "Acacia gilliesii was mainly introduced to control soil erosion and stabilize sandy soils in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in harsh environmental conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, its rapid growth and spread have led to concerns about its invasive potential in some ecosystems. Despite its benefits, careful management is required to prevent it from becoming a weed in non-target areas."
}
