{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obscura var. canescens",
    "plant_slug": "acacia-obscura-var-canescens",
    "plant_name_scientific": "acacia obscura var. canescens",
    "intro": "Acacia obscura var. canescens, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its greyish-white, feathery foliage that gives it a distinctive appearance. The plant produces yellow flowers in clusters, which bloom in spring and attract pollinators such as bees and birds. Its bark is often flaky and may exude a milky sap when damaged. This variety is adapted to dry, sandy soils and is often found in coastal and inland regions of southern Australia.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obscura var. canescens is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variety is commonly found in sandy soils and coastal areas, where it thrives in harsh, dry conditions. It is often associated with shrublands and coastal dunes, forming part of the local vegetation in these ecosystems. The plant is well adapted to high temperatures and low rainfall, making it a resilient species in its native habitat. Its distribution is largely confined to the western and southern parts of the African continent.",
    "distribution_introduced_art_desc": "Acacia obscura var. canescens was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its hardy nature and ability to thrive in poor soil conditions. This plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped in restoring degraded lands across various parts of Australia. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
