{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pruinescens",
    "plant_slug": "acacia-pruinescens",
    "plant_name_scientific": "acacia pruinescens",
    "intro": "Acacia pruinescens, commonly known as the rough wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and phyllodes that are narrow, linear, and covered in a rough, scaly texture. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical inflorescences. Its leaves are modified into phyllodes, a common adaptation in the Acacia genus to reduce water loss. Acacia pruinescens is well adapted to arid and semi-arid environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pruinescens is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in rocky outcrops and savanna woodlands. This species thrives in well-drained soils and is adapted to withstand drought conditions. It is often seen growing along roadsides, in open woodlands, and on mountain slopes. Acacia pruinescens plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia pruinescens was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in regions of southern Africa. It thrives in open woodlands and rocky outcrops where it can receive ample sunlight. This plant is often cultivated for its ornamental value due to its distinctive foliage and ability to withstand drought conditions. It has also been introduced as a potential source of timber and forage in certain agricultural settings. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
