{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flocktoniae",
    "plant_slug": "acacia-flocktoniae",
    "plant_name_scientific": "acacia flocktoniae",
    "intro": "Acacia flocktoniae, commonly known as the Flockton's acacia, is a shrub native to the arid regions of South Africa. It is characterized by its slender, branching stems and small, feathery leaves that reduce water loss in its harsh environment. The plant produces yellow flowers in clusters, which attract pollinators such as bees and birds. Its wood is hard and durable, making it valuable for traditional uses. Acacia flocktoniae is also noted for its ability to thrive in poor soil conditions, contributing to its ecological significance in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia flocktoniae"
    },
    "taxonomy_art_desc": "Acacia flocktoniae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in Australia and Africa, known for their unique acorn-like seed pods and nitrogen-fixing capabilities. Its species is Acacia flocktoniae, a rare and endemic plant species native to South Africa, distinguished by its specific morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flocktoniae is primarily native to New South Wales. It is found in the arid and semi-arid regions of the state, particularly in the western and central parts. This species typically grows in sandy or rocky soils and is adapted to dry conditions. It is often seen in open woodlands and along riverbanks. Due to its limited distribution, it is considered a rare and localized plant within New South Wales.",
    "distribution_introduced_art_desc": "Acacia flocktoniae was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. This plant thrives in well-drained soils and is often seen in open woodlands and rocky areas. Due to its ability to fix nitrogen, it plays a role in soil enrichment. However, it is considered a potential invasive species in some areas."
}
