{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia goetzei subsp. microphylla",
    "plant_slug": "acacia-goetzei-subsp-microphylla",
    "plant_name_scientific": "acacia goetzei subsp. microphylla",
    "intro": "Acacia goetzei subsp. microphylla, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It features small, narrow, phyllodes that are typically yellow-green in color. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It is adapted to dry environments and is often found in sandy or rocky soils. The species is valued for its ornamental appeal and its ability to thrive in arid conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia goetzei subsp. microphylla is primarily native to southern Africa, specifically South Africa. It is found in the regions of the Western Cape, including the fynbos biome. This subspecies thrives in coastal and mountainous areas with a Mediterranean climate. It is commonly found in sandy soils and is often associated with other fynbos vegetation. Its distribution is limited to specific habitats within its native range.",
    "distribution_introduced_art_desc": "Acacia goetzei subsp. microphylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in rocky outcrops and sandy soils, often in coastal and inland areas. This subspecies is known for its small, narrow leaves and yellow flowers, which make it an attractive ornamental plant. However, it has also been reported to spread into native vegetation, raising concerns about its potential invasiveness. Its introduction is largely attributed to horticultural activities and accidental seed dispersal."
}
