{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia viminea",
    "plant_slug": "acacia-viminea",
    "plant_name_scientific": "acacia viminea",
    "intro": "Acacia viminea, commonly known as the weeping acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, drooping branches that give it a distinctive, cascading appearance. The plant produces small, yellow flowers that bloom in spring, attracting pollinators such as bees and birds. Its leaves are bipinnate, consisting of multiple pairs of small, oval-shaped leaflets. Acacia viminea is often cultivated for its ornamental value and is adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia viminea is primarily native to parts of eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in a variety of habitats, including savannas, woodlands, and rocky outcrops. This species is commonly found in regions with a tropical or subtropical climate. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia viminea is also known for its ability to adapt to harsh environmental conditions.",
    "distribution_introduced_art_desc": "Acacia viminea was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with low to moderate rainfall. It thrives in open landscapes such as grasslands, woodland edges, and disturbed sites where it can establish itself quickly. This plant is often found in coastal regions and sandy soils due to its tolerance for saline and nutrient-poor conditions. Its introduction has been noted in parts of Australia and the Mediterranean, where it has adapted well to the local environment. However, it is considered a potential invasive species in some areas due to its rapid growth and ability to outcompete native vegetation."
}
