{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella chamelensis",
    "plant_slug": "acaciella-chamelensis",
    "plant_name_scientific": "acaciella chamelensis",
    "intro": "Acaciella chamelensis, commonly known as the white acacia, is a shrub native to the arid regions of northern South America. It is characterized by its slender, multi-branched stems and small, feathery leaves that are adapted to reduce water loss in dry conditions. The plant produces yellowish-green flowers that are clustered in panicles, which bloom during the rainy season. Its seeds are enclosed in pod-like fruits that split open when mature, dispersing the seeds by wind. Acaciella chamelensis is often found in sandy or rocky soils and is well-suited to harsh, semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella chamelensis"
    },
    "taxonomy_art_desc": "Acaciella chamelensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acaciella, a group of flowering plants native to South America, often found in arid or semi-arid regions. Its species is Acaciella chamelensis, a specific type of plant within the genus Acaciella, known for its unique characteristics and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella chamelensis is primarily native to Mexico Southwest. It is found in the arid and semi-arid regions of this area. The plant thrives in rocky and sandy soils. It is commonly found in desert scrub and thorn forests. Its distribution is limited to specific ecological zones within Mexico's southwestern region.",
    "distribution_introduced_art_desc": "Acaciella chamelensis was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soil conditions. It is commonly found in regions of North Africa, the Middle East, and parts of the Arabian Peninsula. This plant is often used for its hardy nature and ability to withstand extreme temperatures. It has been introduced to several regions for erosion control and as an ornamental plant. Its distribution is largely limited to areas where it can establish itself in sparse vegetation."
}
