{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paniculata var. incana",
    "plant_slug": "acacia-paniculata-var-incana",
    "plant_name_scientific": "acacia paniculata var. incana",
    "intro": "Acacia paniculata var. incana, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its silvery-gray foliage, which gives it a distinctive appearance. The plant produces yellow globular flower heads that appear in late winter to early spring. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The leaves are bipinnate, with small, feathery leaflets that contribute to its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia paniculata var. incana is primarily native to northern Australia, including regions of Queensland, Western Australia, and the Northern Territory. It is commonly found in arid and semi-arid environments, often growing in sandy or rocky soils. This variety is well adapted to hot, dry climates and can thrive in areas with low rainfall. It is typically found in open woodlands, grasslands, and along riverbanks. Its distribution is largely restricted to the tropical and subtropical zones of northern Australia.",
    "distribution_introduced_art_desc": "Acacia paniculata var. incana was mainly introduced to areas with warm, dry climates and well-drained soils, often found in regions of Australia and parts of Southeast Asia. It is commonly cultivated as an ornamental plant due to its attractive, feathery foliage and ability to thrive in harsh environmental conditions. This species is also valued for its hardiness and low maintenance requirements, making it suitable for landscaping in arid and semi-arid regions. Its introduction has been primarily for ornamental and ecological purposes, including soil stabilization and providing habitat for native wildlife. However, it is important to monitor its spread to prevent potential invasiveness in non-native environments."
}
