{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia microcybe",
    "plant_slug": "acacia-microcybe",
    "plant_name_scientific": "acacia microcybe",
    "intro": "Acacia microcybe, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It is characterized by its slender, often multi-branched stems and small, dark green leaves that are narrow and oval in shape. The plant produces yellow flowers in winter, which are clustered in globular heads, attracting various pollinators. Its seeds are encased in pods that split open when mature, dispersing the seeds by wind. Acacia microcybe is adapted to dry environments and is often found in sandy soils across arid and semi-arid regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia microcybe"
    },
    "taxonomy_art_desc": "Acacia microcybe belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which comprises flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of flowering plants known for their distinctive acacia-like appearance and often used in traditional medicine. Its species is Acacia microcybe, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia microcybe is primarily native to Queensland. It is commonly found in the northern and central regions of the state. This species thrives in dry, open habitats such as grasslands and woodlands. It is well adapted to the tropical and sub-tropical climates of Queensland. Acacia microcybe plays an important role in the local ecosystem and is often used in traditional land management practices.",
    "distribution_introduced_art_desc": "Acacia microcybe was mainly introduced to control soil erosion and as a forage plant in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, it has been reported to spread aggressively in some areas, potentially displacing native vegetation. Its introduction has had both beneficial and problematic ecological impacts depending on the environment."
}
