{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella calderonii",
    "plant_slug": "acaciella-calderonii",
    "plant_name_scientific": "acaciella calderonii",
    "intro": "Acaciella calderonii, commonly known as the Calderón's acacia, is a small shrub native to the dry regions of Mexico. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant features small, bipinnate leaves and produces yellow flowers that are clustered in inflorescences. It is adapted to arid environments, with a deep root system that helps it survive in poor soil conditions. Acaciella calderonii is often found in rocky or sandy soils and is of interest to botanists due to its unique ecological adaptations.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella calderonii is primarily native to the Yucatán Peninsula in Mexico. It is found in the tropical dry forests and coastal areas of this region. This plant thrives in arid and semi-arid environments with well-drained soils. It is commonly found in limestone soils and is adapted to the seasonal climate of the area. Due to its limited distribution, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Acaciella calderonii was mainly introduced to the southern regions of the United States, particularly in Texas and California, as part of ornamental horticulture. It was distributed primarily through the propagation of its unique, spiny foliage and its ability to thrive in arid conditions. The plant's introduction was largely driven by its aesthetic appeal and low maintenance requirements. However, it has since become a concern in some areas due to its potential to spread beyond cultivated areas. Its distribution is now monitored to prevent ecological disruption in native habitats."
}
