{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leucophloea var. melanochaetes",
    "plant_slug": "acacia-leucophloea-var-melanochaetes",
    "plant_name_scientific": "acacia leucophloea var. melanochaetes",
    "intro": "Acacia leucophloea var. melanochaetes, commonly known as the black-stemmed acacia, is a shrub or small tree native to the arid and semi-arid regions of southern Africa. It is characterized by its dark, almost black stems that are covered in a layer of smooth, greyish bark. The plant produces small, yellow flowers arranged in globular heads, which are often visited by bees and other pollinators. Its leaves are bipinnate, consisting of numerous tiny, oval-shaped leaflets. This species is adapted to drought conditions and is often used in traditional medicine for its various therapeutic properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leucophloea var. melanochaetes is primarily native to eastern Africa, including countries such as Kenya, Tanzania, and Uganda. It is commonly found in dry savannas and woodland areas. This variant is adapted to arid and semi-arid environments, often growing on rocky soils. It plays an important role in local ecosystems by providing habitat and food for various wildlife species. The plant is also valued for its hard wood and traditional uses by indigenous communities.",
    "distribution_introduced_art_desc": "Acacia leucophloea var. melanochaetes was mainly introduced to areas with well-drained soils and a temperate to subtropical climate, often found in regions with seasonal rainfall. It is commonly established in disturbed sites such as roadsides, clearings, and degraded forests. This plant thrives in full sun and is known for its nitrogen-fixing ability, which can enhance soil fertility. However, its rapid growth and spreading habit may lead to ecological impacts in native habitats. It is often used in reforestation and soil stabilization projects due to its hardiness and adaptability."
}
