{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia farnesiana var. heterocarpa",
    "plant_slug": "acacia-farnesiana-var-heterocarpa",
    "plant_name_scientific": "acacia farnesiana var. heterocarpa",
    "intro": "Acacia farnesiana var. heterocarpa, commonly known as the yellow acacia, is a deciduous shrub native to the Mediterranean region. It features compound leaves that are often feathery and gray-green in color, with small, yellow flowers that bloom in clusters. The plant produces flat, pod-like fruits that contain several seeds. It is adapted to dry climates and is often found in coastal areas and disturbed soils. Its ornamental value and ability to thrive in poor soil conditions make it a popular choice for landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia farnesiana var. heterocarpa is primarily native to the Caribbean, Central America, and parts of northern South America. It is commonly found in regions with tropical and subtropical climates, including countries such as Mexico, Cuba, and the Bahamas. This variant thrives in coastal areas and dry forests, often growing in sandy or limestone soils. It is also known to occur in the Greater Antilles and the Lesser Antilles. Its distribution is closely associated with disturbed habitats and human-altered environments.",
    "distribution_introduced_art_desc": "Acacia farnesiana var. heterocarpa was mainly introduced to the southern United States, particularly in Texas and Florida, as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has also been introduced to parts of California and the southwestern regions of the country. The plant is known for its rapid growth and ability to establish itself in disturbed soils, which has led to its naturalization in some areas. Its introduction has raised concerns due to its potential invasiveness in certain ecosystems. Despite its ornamental value, it is important to monitor its spread to prevent ecological impacts."
}
