{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hildebrandtii",
    "plant_slug": "acacia-hildebrandtii",
    "plant_name_scientific": "acacia hildebrandtii",
    "intro": "Acacia hildebrandtii, commonly known as the Hildebrandt's acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, multi-branched stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow, globular flower heads that bloom in late winter to early spring. It thrives in arid and semi-arid environments, demonstrating drought tolerance. Acacia hildebrandtii is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hildebrandtii is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Botswana, and South Africa. It is commonly found in savannas, shrublands, and rocky outcrops where it thrives in dry, well-drained soils. This species is well adapted to the harsh climatic conditions of its native habitat, showing resilience to drought and high temperatures. It plays an important ecological role by providing habitat and food for various wildlife species. Its distribution is largely restricted to the specific environmental conditions found in these regions of southern Africa.",
    "distribution_introduced_art_desc": "Acacia hildebrandtii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western and Northern Cape provinces, as well as in parts of the Eastern Cape. The plant thrives in sandy or gravelly soils and is often seen in open woodlands and along coastal areas. Its introduction has led to its spread into native ecosystems, raising concerns about its potential invasiveness. Despite its ornamental value, it is important to monitor its impact on local biodiversity."
}
