{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cochlocarpa subsp. cochlocarpa",
    "plant_slug": "acacia-cochlocarpa-subsp-cochlocarpa",
    "plant_name_scientific": "acacia cochlocarpa subsp. cochlocarpa",
    "intro": "Acacia cochlocarpa subsp. cochlocarpa, commonly known as the coastal acacia, is a shrub or small tree native to coastal regions of southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are covered in fine hairs. The plant produces yellow globular flowers arranged in dense clusters, which are followed by flat, leathery pods containing seeds. It thrives in sandy or gravelly soils and is adapted to coastal conditions with high salinity and wind exposure. This species is often used in coastal stabilization due to its hardy nature and ability to prevent soil erosion.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cochlocarpa"
    },
    "taxonomy_art_desc": "Acacia cochlocarpa subsp. cochlocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and complex vascular systems. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods as fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in tropical and subtropical regions, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia cochlocarpa, a specific type of acacia found in certain regions of Africa, recognized by its unique morphological characteristics and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cochlocarpa subsp. cochlocarpa is primarily native to Western Australia. It is found in the southern and western regions of the state, including the Swan Coastal Plain and the Geraldton area. This subspecies is commonly associated with sandy soils and coastal environments. It is often seen in heathlands and open woodlands. Its distribution is limited to specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acacia cochlocarpa subsp. cochlocarpa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Eastern and Western Cape provinces. This plant thrives in sandy or loamy soils and is often associated with disturbed habitats. Its introduction has led to its spread along roadsides and in urban environments. However, it is not considered invasive in the regions where it has been introduced."
}
