{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia maidenii",
    "plant_slug": "acacia-maidenii",
    "plant_name_scientific": "acacia maidenii",
    "intro": "Acacia maidenii, commonly known as the slender wattle, is a shrub native to Western Australia. It belongs to the legume family, Fabaceae, and is characterized by its delicate, feathery foliage. The plant produces yellow flowers in summer, which are clustered in cylindrical inflorescences. Acacia maidenii is adapted to arid environments and has a deep root system for water absorption. It plays an important ecological role by providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia maidenii"
    },
    "taxonomy_art_desc": "Acacia maidenii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their nitrogen-fixing capabilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive acacia-like leaves and often used in traditional medicine. Its species is Acacia maidenii, a specific type of acacia found in certain regions of Australia, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [
        "Argentina Northeast",
        "Florida",
        "India"
    ],
    "distribution_native_art_desc": "Acacia maidenii is primarily native to New South Wales, Queensland, and Victoria. This plant is commonly found in the eastern regions of Australia, particularly in areas with a temperate climate. It thrives in well-drained soils and is often seen in open woodlands and grasslands. Acacia maidenii is well adapted to the local environmental conditions of these states. Its distribution reflects its preference for specific ecological niches within these regions.",
    "distribution_introduced_art_desc": "Acacia maidenii was mainly introduced to Argentina Northeast, Florida, and India. This plant is native to Australia and has been spread to these regions likely through human activity. It is commonly found in disturbed soils and can thrive in a variety of environmental conditions. Its introduction has raised concerns due to its potential to become invasive in non-native habitats. The plant's rapid growth and adaptability make it a notable species in these areas."
}
