{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia triacantha",
    "plant_slug": "acacia-triacantha",
    "plant_name_scientific": "acacia triacantha",
    "intro": "Acacia triacantha, commonly known as the spiny acacia, is a shrub or small tree native to arid regions of Africa and the Middle East. It is characterized by its thorned stems and bipinnate leaves, which are adapted to reduce water loss in hot, dry environments. The plant produces yellow flowers that are clustered in cylindrical spikes, followed by flat, pod-like fruits containing seeds. It is often used in traditional medicine and as a source of timber and forage. Its ecological role includes providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia triacantha is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savannas and shrublands. This plant thrives in sandy or rocky soils and is well adapted to hot, dry climates. It is often used in traditional medicine and as a source of firewood. Its distribution is closely linked to the ecological conditions of the region, making it a characteristic species of the African drylands.",
    "distribution_introduced_art_desc": "Acacia triacantha was mainly introduced to control soil erosion and as a windbreak in semi-arid regions. It is commonly used for its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its timber and as a source of fodder for livestock. However, its introduction has led to concerns about potential invasiveness in some ecosystems. It is often planted in reclamation projects due to its rapid growth and drought tolerance."
}
