{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acinacea var. brevipedunculata",
    "plant_slug": "acacia-acinacea-var-brevipedunculata",
    "plant_name_scientific": "acacia acinacea var. brevipedunculata",
    "intro": "Acacia acinacea var. brevipedunculata, commonly known as the narrow-pedunculate wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features small, yellow flowers arranged in dense, cylindrical spikes. Its leaves are bipinnate, with numerous tiny leaflets, and it produces flat, leathery pods that contain seeds. It is well adapted to dry, sandy soils and is often found in coastal and inland regions of southern Australia.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acinacea var. brevipedunculata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in rocky outcrops, sandy soils, and open woodlands where it can receive sufficient sunlight. This variant is adapted to withstand high temperatures and low rainfall, making it a resilient species in harsh environments. It is commonly found in the Karoo and Kalahari regions, where it contributes to local biodiversity. Due to its hardy nature, it is often used in landscaping and for erosion control in degraded areas.",
    "distribution_introduced_art_desc": "Acacia acinacea var. brevipedunculata was mainly introduced to South Africa, particularly in the Eastern Cape and Western Cape provinces. It was introduced for its ornamental value due to its attractive yellow flowers and its ability to thrive in arid conditions. This variety is commonly found in gardens and along roadsides where it serves as a decorative plant. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasiveness. Despite its aesthetic appeal, its ecological impact remains a topic of ongoing study."
}
