{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia browniana var. intermedia",
    "plant_slug": "acacia-browniana-var-intermedia",
    "plant_name_scientific": "acacia browniana var. intermedia",
    "intro": "Acacia browniana var. intermedia, commonly known as the silky acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its feathery, bipinnate leaves that give it a soft, silky appearance. The plant produces yellow or pale yellow flowers arranged in dense, spherical clusters, which are highly attractive to pollinators. Its woody pods contain seeds that are often used in traditional medicine. The species is well adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia browniana"
    },
    "taxonomy_art_desc": "Acacia browniana var. intermedia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are native to Australia and are known for their unique leaf structures and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia browniana, a specific type of acacia that is known for its variability and is further divided into varieties such as var. intermedia, which exhibits intermediate characteristics between different forms.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia browniana var. intermedia is primarily native to Western Australia. This variant of the species is found in the arid and semi-arid regions of the state. It typically grows in sandy soils and is adapted to the harsh climatic conditions of the region. The plant is commonly seen in areas with low rainfall and high temperatures. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia browniana var. intermedia was mainly introduced to areas with well-drained soils and a temperate to subtropical climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is often found in coastal and sandy soils, making it suitable for dune stabilization. It has been introduced to parts of southeastern Australia and the western United States. Its rapid growth and drought tolerance make it a popular choice for landscaping and erosion control."
}
