{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leucospira",
    "plant_slug": "acacia-leucospira",
    "plant_name_scientific": "acacia leucospira",
    "intro": "Acacia leucospira, commonly known as the white-leaf acacia, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are covered in fine white hairs, giving it a distinctive silvery appearance. The plant produces yellow flowers in dense, globular clusters, which bloom during the warmer months. Acacia leucospira is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for rocky or sandy soils. It is also valued for its role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leucospira is primarily native to northern Australia, including regions of Western Australia, Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This species is often associated with coastal and inland dunes, as well as rocky outcrops. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife. Acacia leucospira is also known for its distinctive white or pale yellow flower spikes that bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia leucospira was mainly introduced to South Africa as an ornamental plant due to its attractive appearance and adaptability to various soil types. It has since spread beyond cultivated areas and is now considered an invasive species in some regions. The plant thrives in arid and semi-arid environments, which has contributed to its rapid colonization of disturbed habitats. Its introduction has led to competition with native vegetation, altering local ecosystems. Efforts are being made to control its spread through mechanical removal and biological control methods."
}
