{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica var. adstringens",
    "plant_slug": "acacia-nilotica-var-adstringens",
    "plant_name_scientific": "acacia nilotica var. adstringens",
    "intro": "Acacia nilotica var. adstringens, commonly known as the Egyptian acacia or Sudanese acacia, is a shrub or small tree native to Africa and the Arabian Peninsula. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow to orange globular flowers that bloom in clusters, followed by long, flat pods containing hard, brown seeds. It thrives in arid and semi-arid environments, making it well adapted to drought conditions. The bark and pods have been traditionally used for their astringent properties in medicinal and industrial applications.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica var. adstringens is primarily native to parts of East Africa, including countries such as Kenya, Tanzania, and Uganda. It is commonly found in semi-arid and tropical regions, often growing in savannas and along riverbanks. This variety is well adapted to dry climates and can thrive in poor soils. It is also present in some areas of the Arabian Peninsula and northern parts of Sudan. The plant is known for its hardy nature and has been used traditionally for its medicinal and practical properties.",
    "distribution_introduced_art_desc": "Acacia nilotica var. adstringens was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils. It is commonly found in parts of Africa, the Middle East, and South Asia where it has been cultivated for its medicinal properties. This plant is often used in traditional medicine for its astringent and anti-inflammatory effects. Its introduction has also been linked to ornamental horticulture due to its unique foliage and drought tolerance. However, it can become invasive in certain environments if not managed properly."
}
