{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia graminea",
    "plant_slug": "acacia-graminea",
    "plant_name_scientific": "acacia graminea",
    "intro": "Acacia graminea, commonly known as the slender acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often multi-branched stems and compound leaves that are typically reduced to small, needle-like structures. The plant produces yellow flowers in globular heads, which are followed by flat, pod-like fruits containing seeds. Acacia graminea thrives in arid and semi-arid environments, making it well adapted to drought conditions. It is often used in landscaping for its ornamental value and ability to stabilize soil in dry regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia graminea is primarily native to tropical and subtropical regions of Africa, including countries such as Sudan, South Sudan, Ethiopia, and parts of East Africa. It is commonly found in savannas, grasslands, and woodland areas where it thrives in well-drained soils. This plant is also present in some parts of the Middle East and southern Asia, though its primary range remains in Africa. It is often used for its hardy nature and has adapted to dry and seasonal climates. Acacia graminea plays an important ecological role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia graminea was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate rainfall. It is commonly found in parts of Southeast Asia, Australia, and the Pacific Islands. This plant is often cultivated for its ornamental value and as a source of timber. It has also been introduced to some parts of Africa and the Americas as an ornamental or for land stabilization. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
