{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia robeorum",
    "plant_slug": "acacia-robeorum",
    "plant_name_scientific": "acacia robeorum",
    "intro": "Acacia robeorum, commonly known as the Robe's wattle, is a flowering plant native to Australia. It belongs to the Fabaceae family and is characterized by its slender, erect shrub form. The plant produces small, yellow flowers arranged in spikes, which bloom during the spring and summer seasons. Its leaves are bipinnate, consisting of multiple small leaflets, and it is often found in sandy or rocky soils. Acacia robeorum is valued for its ornamental appeal and its role in supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia robeorum"
    },
    "taxonomy_art_desc": "Acacia robeorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern flowering plants. Its subclass is Magnoliidae, which is a large group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped flower heads and often used in various applications. Its species is Acacia robeorum, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia robeorum is primarily native to Western Australia. It is found in the coastal regions of the state, particularly in the southern and southwestern parts. This plant typically grows in sandy soils and is often associated with coastal heathlands and dunes. It is well adapted to the dry, Mediterranean climate of its native region. Acacia robeorum plays an important role in the local ecosystem by providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Acacia robeorum was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in disturbed soils, such as along roadsides, in degraded landscapes, and in areas with low vegetation cover. This plant has a spreading habit and produces small, yellow flowers that attract pollinators like bees and birds. Due to its hardy nature, it is often used in rehabilitation projects to stabilize soil and prevent erosion. However, its rapid growth and ability to form dense thickets can sometimes lead to competitive exclusion of native species."
}
