{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia coriacea",
    "plant_slug": "acacia-coriacea",
    "plant_name_scientific": "acacia coriacea",
    "intro": "Acacia coriacea, commonly known as the rough acacia, is a shrub or small tree native to southern Africa. It is characterized by its thick, rough, bark that is often fissured and grayish in color. The plant produces yellow flowers in globular or cylindrical clusters, which appear during the warmer months. Its leaves are bipinnate, consisting of numerous small, oval-shaped leaflets. Acacia coriacea is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia coriacea"
    },
    "taxonomy_art_desc": "Acacia coriacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants with a distinctive type of flower and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pods and the ability to fix atmospheric nitrogen through symbiotic bacteria. Its genus is Acacia, a large genus of flowering plants known for their thorny shrubs and acacia-like appearance, often found in arid environments. Its species is Acacia coriacea, a specific type of acacia known for its hard, corrugated bark and is commonly found in tropical and subtropical regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia coriacea is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy or rocky soils and is often seen in shrublands and woodlands. It plays an important ecological role by providing habitat and food for local wildlife. Its hardy nature makes it well adapted to the harsh environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia coriacea was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and KwaZulu-Natal provinces. The plant thrives in well-drained soils and is often seen in coastal and inland savanna habitats. Due to its hardy nature, it has spread beyond its original introduction sites. However, its invasive potential remains a topic of ecological concern in some areas."
}
