{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bancroftiorum",
    "plant_slug": "acacia-bancroftiorum",
    "plant_name_scientific": "acacia bancroftiorum",
    "intro": "Acacia bancroftiorum, commonly known as the narrow-leaf wattle, is a flowering plant native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, feathery leaves and yellow flowers. The plant is typically found in sandy soils and is adapted to arid and semi-arid environments. It plays a role in soil stabilization and provides nectar for pollinators. Its distinctive appearance makes it a popular choice for ornamental gardening.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia bancroftiorum"
    },
    "taxonomy_art_desc": "Acacia bancroftiorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and semi-arid regions, known for their acicular leaves and often used for timber or as ornamental plants. Its species is Acacia bancroftiorum, a specific type of acacia found in certain regions of Africa, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bancroftiorum is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This plant typically grows in open woodlands and dry forests. It is well adapted to the arid and semi-arid conditions of Queensland. Acacia bancroftiorum plays an important role in the local ecosystem and is often used in traditional land management practices.",
    "distribution_introduced_art_desc": "Acacia bancroftiorum was mainly introduced to areas with a subtropical or tropical climate, particularly where there is a need for drought-resistant vegetation. It thrives in well-drained soils and is commonly found in open woodlands and savannas. This plant is often used for soil stabilization and as a source of timber and fodder. Its introduction has been associated with ecological restoration projects in regions facing land degradation. However, it can become invasive in some environments if not managed properly."
}
