{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spania",
    "plant_slug": "acacia-spania",
    "plant_name_scientific": "acacia spania",
    "intro": "Acacia spania, commonly known as the Spanish acacia, is a shrub or small tree native to the Canary Islands. It belongs to the Fabaceae family, which includes legumes, and is characterized by its compound leaves and yellow flowers. The plant has small, pod-like fruits that contain seeds, and it is adapted to arid and coastal environments. Acacia spania is often found in rocky soils and can thrive in areas with limited water availability. Its ecological role includes providing habitat and food for various local wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spania"
    },
    "taxonomy_art_desc": "Acacia spania belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes and are known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their acicular leaves and often used in traditional medicine. Its species is Acacia spania, a specific type of acacia that is native to certain regions and is characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spania is primarily native to Queensland. It is found in the northeastern part of the state, particularly in the wet tropical and subtropical regions. This plant thrives in well-drained soils and is commonly found in open woodlands and rainforests. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Acacia spania is also valued for its hardy nature and ornamental qualities.",
    "distribution_introduced_art_desc": "Acacia spania was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant has also been introduced as an ornamental species in some tropical and subtropical areas. However, its rapid growth and spreading habit have led to concerns about its potential invasiveness in certain environments. Proper management is recommended to prevent unintended ecological impacts."
}
