{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drummondii subsp. affinis",
    "plant_slug": "acacia-drummondii-subsp-affinis",
    "plant_name_scientific": "acacia drummondii subsp. affinis",
    "intro": "Acacia drummondii subsp. affinis, commonly known as the Drummond's wattle, is a shrub native to the arid regions of Australia. It is characterized by its feathery, yellow-flowered inflorescences that appear during the warmer months. The plant has narrow, grey-green leaves that are adapted to reduce water loss in hot, dry environments. It produces long, slender pods that contain seeds with a hard coat, typical of many legumes. This subspecies is often used in ecological restoration due to its resilience and ability to stabilize soils in degraded areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia drummondii"
    },
    "taxonomy_art_desc": "Acacia drummondii subsp. affinis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid and tropical regions, known for their distinctive phyllodes and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia drummondii, a specific type of acacia that is further divided into subspecies, with subsp. affinis being one of its recognized subspecies.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drummondii subsp. affinis is primarily native to Western Australia. This subspecies is found in the arid and semi-arid regions of the state, particularly in the southern and western parts. It typically grows in sandy or gravelly soils and is adapted to the harsh climatic conditions of the region. The plant is commonly seen in open woodlands and shrublands. Its distribution is largely confined to the specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acacia drummondii subsp. affinis was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly used in rehabilitation projects due to its rapid growth and ability to thrive in harsh conditions. This subspecies is particularly valued for its hardy nature and capacity to colonize disturbed areas quickly. Its introduction has been documented in several regions with arid and semi-arid climates. However, its spread has raised concerns about potential ecological impacts on native vegetation."
}
