{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bancroftiana",
    "plant_slug": "acacia-bancroftiana",
    "plant_name_scientific": "acacia bancroftiana",
    "intro": "Acacia bancroftiana, commonly known as the African bristled acacia, is a shrub or small tree native to eastern and southern Africa. It is characterized by its slender, often thorny stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in dense, globular clusters, which are followed by woody, pod-like fruits containing several seeds. It thrives in dry, well-drained soils and is adapted to arid and semi-arid environments. Acacia bancroftiana is often used in traditional medicine and is also valued for its role in providing habitat for wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bancroftiana is primarily native to northern Australia, particularly in the Northern Territory and Queensland. It is commonly found in arid and semi-arid regions, growing in sandy soils and rocky outcrops. This species is well adapted to dry climates and can tolerate high temperatures and low rainfall. It is often seen in savanna woodlands and along riverbanks in its native range. Acacia bancroftiana plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia bancroftiana was mainly introduced to areas with a tropical and subtropical climate, particularly in regions with well-drained soils and sufficient sunlight. It is commonly found in parts of Australia, where it has been introduced for its ornamental value and ability to thrive in arid conditions. The plant is also cultivated in other parts of the world, including Southeast Asia and the Pacific Islands, for similar reasons. Due to its hardy nature, it has sometimes become invasive in non-native environments. However, its introduction is generally managed to prevent ecological disruption."
}
