{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dissona var. indoloria",
    "plant_slug": "acacia-dissona-var-indoloria",
    "plant_name_scientific": "acacia dissona var. indoloria",
    "intro": "Acacia dissona var. indoloria, commonly known as the red acacia, is a shrub or small tree native to parts of Australia. It is characterized by its slender, often twisted branches and its distinctive, feathery foliage composed of small, linear phyllodes. The plant produces yellow flowers in globular or cylindrical inflorescences, which bloom from late winter to early spring. Its seed pods are woody, elongated, and contain several seeds, which are dispersed by wind. This species is adapted to arid and semi-arid environments, showing resistance to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dissona"
    },
    "taxonomy_art_desc": "Acacia dissona var. indoloria belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive leaf structures and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia dissona, a specific type of acacia that is part of the broader Acacia genus and is known for its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dissona var. indoloria is primarily native to Western Australia. This variant of the species is found in the southern regions of the state, particularly in the coastal and inland areas. It thrives in sandy soils and is commonly found in woodland and shrubland habitats. The plant is well adapted to the arid and semi-arid climates of the region. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia dissona var. indoloria was mainly introduced to areas with a tropical to subtropical climate, characterized by warm temperatures and seasonal rainfall. It thrives in well-drained soils and is often found in savanna and woodland habitats. This plant is commonly used for soil stabilization and as a source of timber and fodder. Its introduction has been associated with ecological restoration projects in regions facing land degradation. However, it requires careful management to prevent potential invasiveness in non-native environments."
}
