{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia media",
    "plant_slug": "acacia-media",
    "plant_name_scientific": "acacia media",
    "intro": "Acacia media, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small, feather-like leaflets. The plant produces yellow globular flowers that are clustered in dense inflorescences, typically blooming in spring. Acacia media is well adapted to arid and semi-arid environments, with a deep root system that allows it to thrive in poor soils. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia media is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the states of Western Australia, South Australia, and New South Wales. This plant thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. It is well adapted to drought conditions and can survive with minimal rainfall. Acacia media plays an important ecological role by providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Acacia media was mainly introduced to urban and suburban landscapes due to its adaptability and aesthetic appeal. It thrives in well-drained soils and is often used in landscaping for its ornamental foliage and nitrogen-fixing capabilities. The plant is particularly popular in regions with Mediterranean climates, where it can withstand drought conditions. Its introduction has also been associated with ecological impacts, as it can outcompete native vegetation in certain areas. Despite its benefits, careful management is recommended to prevent its spread into natural habitats."
}
