{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia caduca",
    "plant_slug": "acacia-caduca",
    "plant_name_scientific": "acacia caduca",
    "intro": "Acacia caduca, commonly known as the weeping acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its feathery, bipinnate leaves that turn yellow before falling in autumn. The plant produces yellow globular flowers that bloom in spring, attracting pollinators such as bees and birds. Its slender, drooping branches give it a distinctive appearance, making it a popular ornamental plant. Acacia caduca thrives in well-drained soils and is adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia caduca is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, Uganda, and the Democratic Republic of the Congo. It thrives in savannas, grasslands, and woodland areas where the climate is warm and the rainfall is seasonal. This plant is commonly found in open habitats with well-drained soils, often growing along riverbanks or in disturbed areas. Its distribution extends into parts of the Middle East and southern Arabia as well. Acacia caduca plays an important ecological role by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia caduca was mainly introduced to regions with warm, dry climates and well-drained soils, often as an ornamental or for erosion control. It is commonly found in disturbed areas, along roadsides, and in agricultural fields where it can establish quickly. The plant thrives in full sun and is drought-tolerant, making it adaptable to a variety of environmental conditions. Its rapid growth and ability to spread through both seeds and root sprouts contribute to its invasive potential in some areas. However, it is also valued for its nitrogen-fixing capabilities and ability to improve soil quality."
}
