{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica subsp. indica",
    "plant_slug": "acacia-nilotica-subsp-indica",
    "plant_name_scientific": "acacia nilotica subsp. indica",
    "intro": "Acacia nilotica subsp. indica, commonly known as the Indian acacia or khair, is a deciduous shrub or small tree native to the Indian subcontinent. It is characterized by its slender, thorned stems and bipinnate leaves composed of numerous small, oval leaflets. The plant produces yellow, fragrant flowers arranged in cylindrical clusters, followed by long, flat pods containing flat, edible seeds. It thrives in arid and semi-arid climates, often found in dry forests and scrublands. The wood and gum of this species have been used traditionally for various purposes, including construction and medicinal applications.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica subsp. indica is primarily native to the Indian subcontinent, including countries such as India, Pakistan, and Bangladesh. It is commonly found in arid and semi-arid regions, particularly in the Thar Desert and other parts of Rajasthan. This subspecies thrives in sandy soils and is often seen along roadsides, in dry forests, and in scrublands. It is well adapted to hot, dry climates and can tolerate poor soil conditions. The plant is also present in parts of Southeast Asia, including Myanmar and Thailand.",
    "distribution_introduced_art_desc": "Acacia nilotica subsp. indica was mainly introduced to regions with semi-arid to arid climates, particularly in parts of Africa, the Middle East, and South Asia. It is commonly found in areas with well-drained soils and moderate to high temperatures. This subspecies is often cultivated for its hardy nature and ability to thrive in harsh environmental conditions. It has been introduced for purposes such as soil stabilization, fuelwood, and traditional uses in local communities. Its distribution is also influenced by human activity and land-use changes in these regions."
}
