{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptophleba",
    "plant_slug": "acacia-leptophleba",
    "plant_name_scientific": "acacia leptophleba",
    "intro": "Acacia leptophleba, commonly known as the slender-leaved wattle, is a small to medium-sized shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It is well adapted to arid and semi-arid environments, with a deep root system that helps it survive in dry conditions. The plant is also valued for its role in soil stabilization and as a source of nectar for native pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leptophleba"
    },
    "taxonomy_art_desc": "Acacia leptophleba belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and a variety of stamen arrangements. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their unique leaf structures and symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia leptophleba, a specific type of acacia known for its slender leaves and is typically found in certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptophleba is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. Its distribution is largely restricted to the central and western parts of the Northern Territory. It is an important component of the local flora and plays a role in stabilizing the soil in its native habitat.",
    "distribution_introduced_art_desc": "Acacia leptophleba was mainly introduced to urban and suburban areas for its ornamental value and ability to thrive in poor soils. It is commonly found along roadsides, in parks, and on building sites due to its hardy nature. The plant is often used in landscaping because of its distinctive yellow flowers and nitrogen-fixing capabilities. However, it can become invasive in certain regions, outcompeting native vegetation. Its distribution is now widespread in parts of Australia and New Zealand where it has been intentionally planted."
}
