{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia persica",
    "plant_slug": "acacia-persica",
    "plant_name_scientific": "acacia persica",
    "intro": "Acacia persica, commonly known as Persian acacia, is a flowering plant native to the Middle East and parts of Central Asia. It is a deciduous shrub or small tree that typically grows to a height of 2 to 5 meters. The plant is characterized by its compound leaves, which are often feathery and arranged in pairs. Its yellow flowers are borne in dense, globular clusters and are highly fragrant. Acacia persica is valued for its ornamental appeal and has been used in traditional medicine for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia persica is primarily native to the arid and semi-arid regions of southwestern Asia, including parts of Iran, Afghanistan, and Pakistan. It thrives in hot, dry climates with well-drained soils. This plant is commonly found in rocky hills, dry forests, and along riverbanks in its native range. It plays an important ecological role in stabilizing soil and providing habitat for various wildlife species. Acacia persica is also valued for its ornamental and medicinal properties in traditional practices.",
    "distribution_introduced_art_desc": "Acacia persica was mainly introduced to regions with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soils. It is commonly found in parts of the Middle East, North Africa, and the southwestern United States. The plant has been introduced for its ornamental value, as well as for its potential in soil stabilization and livestock forage. However, in some areas, it has become invasive, outcompeting native vegetation. Its distribution is largely limited by temperature and water availability, making it a challenging species to manage in ecological restoration projects."
}
