{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella hartwegii",
    "plant_slug": "acaciella-hartwegii",
    "plant_name_scientific": "acaciella hartwegii",
    "intro": "Acaciella hartwegii, commonly known as the Hartweg's acacia, is a shrub native to the arid regions of South America. It belongs to the Fabaceae family, which is characterized by its nitrogen-fixing ability through symbiotic relationships with rhizobia bacteria. The plant features small, bipinnate leaves and produces yellow or orange flowers that attract pollinators such as bees and butterflies. Its seeds are encased in hard pods, and the plant is adapted to survive in dry, nutrient-poor soils. Acaciella hartwegii plays an important role in stabilizing soil and providing habitat in its native ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella hartwegii"
    },
    "taxonomy_art_desc": "Acaciella hartwegii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often characterized by compound leaves and pod fruits. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its characteristic fruit type and nitrogen-fixing abilities. Its genus is Acaciella, a group of flowering plants within the Fabaceae family, often found in arid and tropical regions. Its species is Acaciella hartwegii, a specific plant species within the genus Acaciella, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella hartwegii is primarily native to Mexico Central, Mexico Northeast, and Mexico Southwest. This species is commonly found in the tropical and subtropical regions of these areas. It thrives in dry, open habitats such as scrublands and rocky slopes. The plant is well adapted to the arid and semi-arid climates of its native range. It plays an important ecological role in its local environment.",
    "distribution_introduced_art_desc": "Acaciella hartwegii was mainly introduced to the Pacific Islands, particularly in Hawaii, as an ornamental plant due to its attractive foliage and ability to thrive in tropical climates. It has since become naturalized in several regions, spreading through both seeds and vegetative propagation. The plant is often found growing in disturbed areas, along roadsides, and in coastal environments. Its rapid growth and adaptability have led to concerns about its potential impact on native ecosystems. Despite its invasive tendencies, it remains popular in horticulture for its aesthetic value."
}
