{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella angustissima var. chisosiana",
    "plant_slug": "acaciella-angustissima-var-chisosiana",
    "plant_name_scientific": "acaciella angustissima var. chisosiana",
    "intro": "Acaciella angustissima var. chisosiana, commonly known as the Chisos acacia, is a shrub native to the Chisos Mountains of Texas. It is characterized by its slender, woody stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces small, yellowish-white flowers that bloom in spring, followed by flat, pod-like fruits containing angular seeds. It is adapted to arid and rocky environments, showing resilience to drought and poor soil conditions. This variety is of interest to botanists and conservationists due to its limited distribution and ecological significance in the region.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella angustissima var. chisosiana is primarily native to the Chisos Mountains in west-central Texas, USA. This variety is found in the mountainous regions of the Chisos Basin, which is part of the Chihuahuan Desert ecosystem. It thrives in rocky soils and is adapted to the arid and semi-arid conditions of the area. The plant is commonly found in canyons and on slopes within this region. It is a rare and endemic species, with a limited geographic range.",
    "distribution_introduced_art_desc": "Acaciella angustissima var. chisosiana was mainly introduced to the Chisos Mountains in Texas. It is native to Mexico but has been planted in this region for ornamental purposes. The plant thrives in rocky soils and dry climates, making it well-suited for the local environment. Its introduction has led to its establishment in several areas within the Chisos Mountains. However, it is not considered invasive and is primarily found in specific habitats where it is cultivated or naturally occurs."
}
