{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia echinata",
    "plant_slug": "acacia-echinata",
    "plant_name_scientific": "acacia echinata",
    "intro": "Acacia echinata, commonly known as the spiny acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its dense, thorny foliage and small, yellow flowers that bloom in clusters. The plant has narrow, elongated leaves that are often covered in fine hairs, and its bark is typically greyish or brown. Acacia echinata is well adapted to dry conditions, with deep roots that allow it to survive in nutrient-poor soils. It plays an important role in providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia echinata is primarily native to eastern Australia, including regions such as New South Wales, Queensland, and the northern parts of Victoria. It is commonly found in dry, open forests, woodlands, and rocky areas. This species thrives in well-drained soils and is often associated with sandy or gravelly substrates. It is well adapted to the arid and semi-arid climates of its native range. Acacia echinata plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia echinata was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its hardy nature and capacity to establish quickly in arid environments. However, its introduction has raised concerns about potential invasiveness in certain ecosystems. Its distribution is primarily limited to regions with suitable climatic conditions and human intervention."
}
