{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia maxwellii",
    "plant_slug": "acacia-maxwellii",
    "plant_name_scientific": "acacia maxwellii",
    "intro": "Acacia maxwellii, commonly known as the Maxwell's wattle, is a shrub native to western Australia. It is characterized by its delicate, feathery foliage and bright yellow flowers that bloom in spring. The plant has small, pod-like fruits that contain seeds, which are dispersed by wind. It thrives in well-drained soils and is often found in coastal and sandy areas. Acacia maxwellii is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia maxwellii"
    },
    "taxonomy_art_desc": "Acacia maxwellii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and often having jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many familiar species with diverse floral structures. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their phyllodes and often used in landscaping and for their ecological importance. Its species is Acacia maxwellii, a specific type of acacia native to Australia, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia maxwellii is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal regions and inland areas of the state. This species thrives in arid and semi-arid environments, often growing in shrublands and woodlands. It is well adapted to the climate of Western Australia, with its hardy nature allowing it to survive in harsh conditions. The plant is an important component of the local flora and ecosystem in this region.",
    "distribution_introduced_art_desc": "Acacia maxwellii was mainly introduced to South Australia as part of ecological restoration and revegetation projects. It is commonly found in sandy soils within coastal and inland regions of the state. This species is valued for its ability to stabilize soils and provide habitat for native wildlife. Its introduction has helped in restoring degraded landscapes and improving biodiversity. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
