{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gladiiformis",
    "plant_slug": "acacia-gladiiformis",
    "plant_name_scientific": "acacia gladiiformis",
    "intro": "Acacia gladiiformis, commonly known as the swordleaf acacia, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its narrow, sword-shaped leaves. The plant produces yellow flowers in dense clusters, which are followed by flat, pod-like fruits. It is drought-tolerant and thrives in well-drained soils, making it adaptable to arid environments. The species is also valued for its ornamental appeal and is sometimes used in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gladiiformis"
    },
    "taxonomy_art_desc": "Acacia gladiiformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of plants with characteristic flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, known for their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, often with phyllodes instead of leaves. Its species is Acacia gladiiformis, a specific type of acacia known for its sword-shaped leaves and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gladiiformis is primarily native to New South Wales. It is commonly found in the arid and semi-arid regions of the state. This plant typically grows in sandy or gravelly soils along creek lines and in open woodlands. It is well adapted to the harsh climatic conditions of the region. Its distribution is largely restricted to the southern and western parts of New South Wales.",
    "distribution_introduced_art_desc": "Acacia gladiiformis was mainly introduced to New Zealand as an ornamental plant due to its unique foliage and hardy nature. It was initially cultivated for its aesthetic appeal in gardens and landscaped areas. However, it has since become invasive in some regions, outcompeting native species and altering local ecosystems. Its rapid growth and ability to thrive in various soil types have contributed to its spread. Conservation efforts are now underway to control its population and mitigate its ecological impact."
}
