{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glaucocaesia",
    "plant_slug": "acacia-glaucocaesia",
    "plant_name_scientific": "acacia glaucocaesia",
    "intro": "Acacia glaucocaesia, commonly known as the white wattle, is a shrub or small tree native to the coastal regions of southern Africa. It is characterized by its pale green to white foliage, which gives it its common name. The plant produces yellow flowers in spherical or cylindrical heads, typically blooming during the warmer months. Its leaves are bipinnate, with numerous small leaflets arranged in a feathery pattern. Acacia glaucocaesia is well adapted to coastal environments, tolerating salt spray and sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia glaucocaesia"
    },
    "taxonomy_art_desc": "Acacia glaucocaesia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns, horsetails, and their relatives, often featuring jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures and evolutionary relationships. Its order is Fabales, which consists of flowering plants that typically have legume-like fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their compound leaves and often spiny thorns. Its species is Acacia glaucocaesia, a specific type of acacia found in certain regions of Africa, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glaucocaesia is primarily native to Western Australia. It is commonly found in the coastal and inland regions of the state, particularly in areas with sandy or rocky soils. This species thrives in dry and arid environments, making it well adapted to the harsh conditions of the Australian landscape. It is often seen growing in shrublands and open woodlands. Its distribution is largely restricted to the southern and western parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia glaucocaesia was mainly introduced to South Africa as an ornamental plant due to its attractive silver-green foliage and drought tolerance. It has since become naturalized in several regions, including parts of the Western Cape and the Eastern Cape. The plant is commonly found in disturbed areas, along roadsides, and in urban environments where it thrives in poor soils. Its rapid growth and ability to spread through seed dispersal have led to concerns about its invasive potential in certain ecosystems. Despite its ornamental value, management strategies are being developed to control its spread in sensitive habitats."
}
