{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia howittii",
    "plant_slug": "acacia-howittii",
    "plant_name_scientific": "acacia howittii",
    "intro": "Acacia howittii, commonly known as the Howitt's wattle, is a shrub or small tree native to arid regions of Australia. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves. The plant produces yellow, globular inflorescences that bloom in spring, attracting nectar-feeding birds and insects. It is well adapted to drought and can thrive in sandy or rocky soils. Acacia howittii plays a role in stabilizing soil and providing habitat in its native environment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia howittii"
    },
    "taxonomy_art_desc": "Acacia howittii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees, many of which are native to Africa, Australia, and the Americas, and are known for their phyllodes and symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia howittii, a specific type of acacia found in certain regions of Australia, known for its distinctive morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [
        "Tasmania"
    ],
    "distribution_native_art_desc": "Acacia howittii is primarily native to Victoria. It is commonly found in the dry, open habitats of the state, including grassy woodlands and heathlands. This species is well adapted to the arid and semi-arid conditions of Victoria's inland regions. It often grows along roadsides and in disturbed areas, showing a preference for well-drained soils. Acacia howittii plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia howittii was mainly introduced to Tasmania. It is a leguminous shrub that has been planted for its ornamental value and potential for soil stabilization. The plant is well adapted to the local climate and can thrive in a variety of soil types. However, it has the potential to become invasive if not managed properly. Its distribution in Tasmania is primarily limited to areas where it has been intentionally planted."
}
