{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia castorum",
    "plant_slug": "acacia-castorum",
    "plant_name_scientific": "acacia castorum",
    "intro": "Acacia castorum, commonly known as the Castor tree, is a species of flowering plant in the legume family. It is native to the Mediterranean region and parts of southern Europe. The tree is characterized by its flat, bipinnate leaves and yellow, spherical flower heads. It produces a hard, woody pod that contains seeds surrounded by a fibrous, cotton-like material. Acacia castorum is often cultivated for its ornamental value and has historical uses in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia castorum"
    },
    "taxonomy_art_desc": "Acacia castorum belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and ability to thrive in arid environments. Its species is Acacia castorum, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia castorum is primarily native to Queensland. It is commonly found in the eastern part of the state, particularly in the tropical and subtropical regions. This plant thrives in well-drained soils and is often seen in open woodlands and savannas. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its presence is a key indicator of the region's unique biodiversity.",
    "distribution_introduced_art_desc": "Acacia castorum was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its hardy nature and capacity to provide shade and fodder for livestock. Its introduction has been particularly beneficial in areas prone to desertification. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
