{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia estrophiolata",
    "plant_slug": "acacia-estrophiolata",
    "plant_name_scientific": "acacia estrophiolata",
    "intro": "Acacia estrophiolata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and compound leaves composed of several small, narrow leaflets. The plant produces yellow flowers in globular or cylindrical spikes, which appear in spring and attract pollinators such as bees and birds. Acacia estrophiolata is drought-tolerant and thrives in well-drained soils, making it adaptable to various arid and semi-arid environments. Its ecological significance includes providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia estrophiolata"
    },
    "taxonomy_art_desc": "Acacia estrophiolata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Fabales, which includes plants with distinctive flowers that have a single pistil and stamens in groups of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acacia-like leaves and often used in traditional medicine. Its species is Acacia estrophiolata, a specific type of acacia found in certain regions, distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia estrophiolata is primarily native to the Northern Territory, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions within these states. It thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh environmental conditions of its native range. It plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia estrophiolata was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for soil stabilization and as a source of timber and fodder. Its introduction has sometimes led to ecological concerns due to its potential invasiveness. It is valued for its hardiness and ability to withstand harsh environmental conditions."
}
