{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia esterhazia",
    "plant_slug": "acacia-esterhazia",
    "plant_name_scientific": "acacia esterhazia",
    "intro": "Acacia esterhazia, commonly known as the Esterhazy acacia, is a shrub or small tree native to the arid and semi-arid regions of southern Africa. It belongs to the Fabaceae family, which is characterized by its compound leaves and often leguminous flowers. The plant produces small, yellow, pod-like fruits that contain seeds used in traditional medicine. Its ability to thrive in dry conditions makes it an important species for soil stabilization and ecological resilience. Acacia esterhazia is also valued for its hard, durable wood and its role in supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia esterhazia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and woodland habitats. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role by providing shelter and food for various animals. Acacia esterhazia is also known for its distinctive yellow flowers and thorny structure.",
    "distribution_introduced_art_desc": "Acacia esterhazia was mainly introduced to South Africa for its ornamental value and potential use in reforestation projects. It is commonly found in coastal areas and along roadsides, where it thrives in sandy or well-drained soils. The plant has also been introduced to parts of Australia and New Zealand as a potential source of timber and for soil stabilization. Due to its rapid growth and ability to spread through seeds, it has become a concern in some regions where it outcompetes native vegetation. Its introduction has led to discussions about its ecological impact and management strategies."
}
