{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nicholsonensis",
    "plant_slug": "acacia-nicholsonensis",
    "plant_name_scientific": "acacia nicholsonensis",
    "intro": "Acacia nicholsonensis, commonly known as the Nicholson acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, often multi-stemmed structure and its distinctive, feathery leaves that are typically small and bipinnate. The plant produces yellow flowers in summer, which are clustered in spherical inflorescences, and it is adapted to thrive in dry, sandy soils. Acacia nicholsonensis is also known for its ability to fix nitrogen, which helps improve soil fertility in nutrient-poor environments. Its hardy nature makes it a valuable plant for erosion control and reforestation projects in arid landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia nicholsonensis"
    },
    "taxonomy_art_desc": "Acacia nicholsonensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis and their complex cellular structures. Its class is Equisetopsida, a group that includes ferns, horsetails, and their relatives, known for their vascular systems and often ancient evolutionary origins. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as those in the rose and citrus families. Its order is Fabales, which consists of flowering plants with distinctive flowers and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia nicholsonensis, a specific type of acacia found in certain regions of Africa, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nicholsonensis is primarily native to the Northern Territory. It is found in arid and semi-arid regions within this area. The plant typically grows in sandy or rocky soils. It is commonly seen in areas with low rainfall and high temperatures. Its distribution is largely restricted to the northern parts of the territory.",
    "distribution_introduced_art_desc": "Acacia nicholsonensis was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of browse for livestock. Its introduction has been associated with land rehabilitation efforts in degraded landscapes. However, it is important to monitor its spread to prevent potential ecological impacts."
}
