{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gamblei",
    "plant_slug": "acacia-gamblei",
    "plant_name_scientific": "acacia gamblei",
    "intro": "Acacia gamblei, commonly known as the white wattle, is a small to medium-sized shrub or tree native to southern Australia. It is characterized by its narrow, linear phyllodes that are typically white to pale green in color. The plant produces yellow flowers in globular or cylindrical clusters, which appear during the autumn and winter seasons. Acacia gamblei is well adapted to dry, sandy soils and is often found in coastal and inland regions. It plays an important role in local ecosystems by providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gamblei is primarily native to the coastal regions of Western Australia. It is commonly found in sandy soils along the southern and western coasts of the state. This plant thrives in arid and semi-arid environments, often growing in open woodlands or heathlands. It is well adapted to the hot, dry climate of its native habitat. Acacia gamblei is also occasionally seen in inland areas with similar environmental conditions.",
    "distribution_introduced_art_desc": "Acacia gamblei was mainly introduced to South Africa, where it has become an invasive species. It was originally from Australia and was brought to South Africa for ornamental purposes due to its attractive foliage and ability to thrive in various soil types. However, it has since spread beyond cultivated areas, colonizing disturbed sites and threatening native vegetation. Its rapid growth and ability to form dense thickets make it a significant ecological threat. Efforts are ongoing to control its spread through mechanical removal and herbicide application."
}
