{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spirorbis",
    "plant_slug": "acacia-spirorbis",
    "plant_name_scientific": "acacia spirorbis",
    "intro": "Acacia spirorbis, commonly known as the spiral acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its distinctive spiral arrangement of branches, which gives it its common name. The plant produces small, yellow flowers that are clustered in spherical heads, attracting various pollinators. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acacia spirorbis is adapted to survive in dry conditions, with deep roots and a low-growing habit to reduce water loss.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spirorbis"
    },
    "taxonomy_art_desc": "Acacia spirorbis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in groups. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia spirorbis, a specific type of acacia known for its unique spiral-shaped seed pods and its adaptation to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Caledonia",
        "New Guinea",
        "Queensland",
        "Vanuatu"
    ],
    "distribution_introduced": [
        "Leeward Is."
    ],
    "distribution_native_art_desc": "Acacia spirorbis is primarily native to New Caledonia, New Guinea, Queensland, and Vanuatu. This species is commonly found in tropical and subtropical regions within these areas. It thrives in coastal and lowland environments, often growing in sandy or well-drained soils. The plant is well adapted to the humid and warm climates of its native range. It plays an important ecological role in the flora of these regions.",
    "distribution_introduced_art_desc": "Acacia spirorbis was mainly introduced to the Leeward Islands. It was likely brought there for its ornamental value due to its unique foliage and ability to thrive in tropical climates. The plant has since become established in coastal and disturbed areas across the region. Its introduction has raised concerns due to its potential to outcompete native vegetation. However, detailed ecological impact studies are still ongoing."
}
