{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia irrorata subsp. irrorata",
    "plant_slug": "acacia-irrorata-subsp-irrorata",
    "plant_name_scientific": "acacia irrorata subsp. irrorata",
    "intro": "Acacia irrorata subsp. irrorata, commonly known as the white wattle, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in globular or cylindrical spikes, which are typically arranged in clusters at the ends of branches. It is well adapted to drought conditions, with a deep root system that allows it to survive in nutrient-poor soils. The species is also valued for its role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia irrorata"
    },
    "taxonomy_art_desc": "Acacia irrorata subsp. irrorata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive characteristics and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of growth forms. Its order is Fabales, which consists of flowering plants that are typically legumes and are known for their ability to fix atmospheric nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive thorn-like structures and compound leaves. Its species is Acacia irrorata, a specific type within the Acacia genus, characterized by its unique morphology and ecological adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia irrorata subsp. irrorata is primarily native to New South Wales, Queensland, and Victoria. This subspecies is commonly found in arid and semi-arid regions across these Australian states. It typically grows in open woodlands, shrublands, and along rocky outcrops. The plant is well adapted to dry conditions and can thrive in sandy or gravelly soils. Its distribution reflects its ability to survive in harsh, inland environments of southeastern Australia.",
    "distribution_introduced_art_desc": "Acacia irrorata subsp. irrorata was mainly introduced to areas with sandy soils and arid or semi-arid climates. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This subspecies is known for its ability to thrive in harsh environmental conditions. It has been introduced for its ornamental value and as a potential source of timber. However, its spread can sometimes lead to ecological concerns in non-native regions."
}
