{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia wiseana",
    "plant_slug": "acacia-wiseana",
    "plant_name_scientific": "acacia wiseana",
    "intro": "Acacia wiseana, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant is part of the legume family, Fabaceae, and has the ability to fix nitrogen in the soil through symbiotic bacteria in its root nodules. It is widely cultivated for its ornamental value and is also an important component of native ecosystems. Acacia wiseana plays a role in supporting local wildlife, including insects and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia wiseana"
    },
    "taxonomy_art_desc": "Acacia wiseana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for its primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their distinctive thorn-like stems and small, often bipinnate leaves. Its species is Acacia wiseana, a specific type of acacia native to Australia, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia wiseana is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant typically grows in sandy or rocky soils, often in open woodlands or shrublands. It is well adapted to the harsh climatic conditions of its native range. Acacia wiseana plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia wiseana was mainly introduced to areas with sandy soils and low rainfall, typically in coastal regions. It is commonly found in the coastal dunes and sandy plains of southern Australia. This plant has been introduced to several regions outside its native range, including parts of New Zealand and South Africa. It is often used for dune stabilization due to its extensive root system. However, it can become invasive in some environments if not managed properly."
}
