{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glauca",
    "plant_slug": "acacia-glauca",
    "plant_name_scientific": "acacia glauca",
    "intro": "Acacia glauca, commonly known as the blue acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spindly branches and small, bean-like pods. The plant produces yellow flowers that bloom in winter, adding visual interest during the cooler months. Its leaves are bipinnate, consisting of numerous small, feather-like leaflets. Acacia glauca is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glauca is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, thriving in sandy or rocky soils. This species is often associated with savannas and shrublands, where it forms part of the native vegetation. It is well adapted to drought conditions and can tolerate high temperatures. Acacia glauca plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia glauca was mainly introduced to South Africa, where it has become naturalized in various regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. The plant is known for its ability to tolerate drought and saline conditions, which contributes to its successful establishment. It has also been reported in other parts of southern Africa, including Namibia and Zimbabwe. Due to its adaptability, it is considered a potential invasive species in some regions."
}
