{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dangarensis",
    "plant_slug": "acacia-dangarensis",
    "plant_name_scientific": "acacia dangarensis",
    "intro": "Acacia dangarensis, commonly known as the Zimbabwean acacia, is a deciduous shrub or small tree native to southern Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant is adapted to arid and semi-arid environments, with its deep root system allowing it to access groundwater. Its flowers are typically yellow or golden in color, attracting pollinators such as bees and birds. The wood of Acacia dangarensis is hard and durable, making it valuable for local craftsmanship and construction.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dangarensis"
    },
    "taxonomy_art_desc": "Acacia dangarensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their complex floral structures and diverse habitats. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their acicular leaves and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia dangarensis, a specific type of acacia found in certain regions of Africa, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dangarensis is primarily native to New South Wales. It is commonly found in the dry and semi-arid regions of the state. This species thrives in sandy or loamy soils and is often seen in open woodlands and grasslands. It plays an important ecological role by providing habitat and food for local wildlife. The plant is well adapted to the harsh climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia dangarensis was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was likely introduced through human activities such as accidental seed dispersal or intentional planting for ornamental or agricultural purposes. The plant thrives in a variety of soil types and can tolerate drought, contributing to its spread. It has been reported in areas such as the Eastern Cape and KwaZulu-Natal, where it competes with native vegetation. Due to its rapid growth and ability to form dense stands, it poses a threat to local biodiversity and ecosystem balance."
}
