{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia semitriptera",
    "plant_slug": "acacia-semitriptera",
    "plant_name_scientific": "acacia semitriptera",
    "intro": "Acacia semitriptera, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging branches and narrow, feather-like leaves. The plant produces yellow globular flower heads, which are typically arranged in clusters. It thrives in well-drained soils and is often found in dry, open habitats. Acacia semitriptera is also valued for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia semitriptera is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland habitats. This species is well adapted to dry conditions and can tolerate high temperatures and low rainfall. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia semitriptera is also known for its distinctive appearance, with its narrow leaves and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia semitriptera was mainly introduced to control soil erosion and for land stabilization in semi-arid regions. It is commonly planted in degraded lands to prevent wind and water erosion. The plant thrives in poor soils and requires minimal water, making it suitable for rehabilitation projects. Its rapid growth and ability to fix nitrogen improve soil fertility over time. However, it can become invasive if not managed properly, posing a risk to native ecosystems."
}
