{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciopsis constricta var. paucispina",
    "plant_slug": "acaciopsis-constricta-var-paucispina",
    "plant_name_scientific": "acaciopsis constricta var. paucispina",
    "intro": "Acaciopsis constricta var. paucispina, commonly known as the narrow-leaf acaciopsis, is a shrub native to southern Africa. It features small, narrow leaves that are often clustered at the base of the stems. The plant produces yellow flowers in compact spikes, which are typically followed by small, woody pods. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Due to its ornamental value and drought tolerance, it is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciopsis constricta var. paucispina is primarily native to northern Australia, specifically the Northern Territory and Western Australia. It is commonly found in the arid and semi-arid regions of these areas. This species thrives in sandy or rocky soils and is often associated with coastal and inland dune environments. It is well adapted to the harsh climatic conditions of its native range, including high temperatures and low rainfall. The plant plays an important ecological role in stabilizing soil and providing habitat for local fauna.",
    "distribution_introduced_art_desc": "Acaciopsis constricta var. paucispina was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of Australia and South Africa. This plant is often used for erosion control due to its deep root system and ability to withstand drought conditions. Its introduction has been primarily for ecological restoration and land stabilization purposes. However, it is important to monitor its spread to prevent potential invasion of native ecosystems."
}
