{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia delavayi var. kunmingensis",
    "plant_slug": "acacia-delavayi-var-kunmingensis",
    "plant_name_scientific": "acacia delavayi var. kunmingensis",
    "intro": "Acacia delavayi var. kunmingensis, commonly known as the Yunnan acacia, is a shrub native to southwestern China. It is characterized by its bipinnate leaves, which are divided into small, feather-like segments. The plant produces yellow flowers arranged in cylindrical spikes, which bloom in the spring. It thrives in well-drained soils and is often found in mountainous regions. This variety is valued for its ornamental appeal and ecological role in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia delavayi var. kunmingensis is primarily native to Yunnan Province in southwestern China. It is commonly found in subtropical and warm temperate regions, particularly in areas with well-drained soils. This variety thrives in mountainous terrain and is often associated with secondary forests and shrublands. It is also present in parts of Sichuan Province and northern Vietnam. The plant is adapted to a variety of microhabitats, including rocky slopes and open woodland areas.",
    "distribution_introduced_art_desc": "Acacia delavayi var. kunmingensis was mainly introduced to regions with a temperate climate, particularly in parts of China, where it has been cultivated for its ornamental value and potential ecological benefits. It thrives in well-drained soils and full sunlight, making it suitable for urban landscaping and reforestation projects. The plant is valued for its hardy nature and ability to withstand urban pollution, contributing to green spaces in cities. It has also been introduced to some areas in Southeast Asia for its potential in soil stabilization and biodiversity enhancement. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
