{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ureniae",
    "plant_slug": "acacia-ureniae",
    "plant_name_scientific": "acacia ureniae",
    "intro": "Acacia ureniae, commonly known as the narrow-leaf wattle, is a small shrub native to the arid regions of southern Africa. It is characterized by its slender, erect stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow globular flowers that bloom in late summer, attracting pollinators such as bees and birds. Acacia ureniae is well adapted to drought conditions, with a deep root system that allows it to access water from deeper soil layers. Its hardy nature makes it a resilient species in harsh, semi-desert environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ureniae is primarily native to Victoria. This plant is found in the diverse ecosystems of Victoria, including dry sclerophyll forests and grasslands. It is adapted to the region's Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Acacia ureniae plays an important ecological role in supporting local wildlife and maintaining soil stability. Its distribution is limited to specific areas within Victoria due to its particular habitat requirements.",
    "distribution_introduced_art_desc": "Acacia ureniae was mainly introduced to areas with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is commonly found in regions such as southern California, parts of Chile, and the southwestern United States. This plant thrives in well-drained soils and full sun, making it suitable for xeriscaping and drought-tolerant landscapes. Its introduction has sometimes led to ecological concerns due to its potential to become invasive in non-native habitats. Despite its ornamental value, careful management is recommended to prevent its spread beyond controlled environments."
}
