{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hakeoides",
    "plant_slug": "acacia-hakeoides",
    "plant_name_scientific": "acacia hakeoides",
    "intro": "Acacia hakeoides, commonly known as the silver wattle, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and small, fern-like leaves that are covered in fine hairs. The plant produces yellow flowers in clusters, which are followed by cylindrical pods containing seeds. It is adapted to arid and semi-arid environments, making it a hardy species suitable for dry climates. The plant is also valued for its ornamental appeal and is sometimes used in reforestation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hakeoides"
    },
    "taxonomy_art_desc": "Acacia hakeoides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing symbiotic relationships. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and the production of pod-like fruits. Its species is Acacia hakeoides, a specific type of acacia native to southern Africa, recognized for its upright growth and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hakeoides is primarily native to New South Wales, Queensland, South Australia, Victoria, and Western Australia. This plant is commonly found in dry, open habitats such as woodlands, grasslands, and rocky areas. It thrives in regions with low rainfall and well-drained soils. Acacia hakeoides is often seen growing along roadsides and in disturbed areas. Its distribution reflects its adaptability to arid and semi-arid environments across these Australian states.",
    "distribution_introduced_art_desc": "Acacia hakeoides was mainly introduced to control soil erosion and for its ornamental value in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, it has been reported to spread aggressively and become invasive in some areas. Its introduction has led to both ecological benefits and challenges in certain environments."
}
