{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia multisiliqua",
    "plant_slug": "acacia-multisiliqua",
    "plant_name_scientific": "acacia multisiliqua",
    "intro": "Acacia multisiliqua, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, feathery leaves. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and sandy regions. Acacia multisiliqua is valued for its ornamental appeal and its role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia multisiliqua"
    },
    "taxonomy_art_desc": "Acacia multisiliqua belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their nitrogen-fixing capabilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia multisiliqua, a specific type of acacia known for its multiple seed pods and found in specific regions of Africa, often adapted to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia multisiliqua is primarily native to the Northern Territory, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions within these states. It thrives in sandy soils and is often seen in open woodlands and shrublands. Acacia multisiliqua is well adapted to the harsh climatic conditions of its native range. Its distribution reflects its ability to survive in low rainfall and high temperature environments.",
    "distribution_introduced_art_desc": "Acacia multisiliqua was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant has also been introduced for ornamental purposes because of its attractive foliage and ability to form dense thickets. However, it can become invasive in some areas, outcompeting native vegetation. Its distribution is primarily in regions with low rainfall and high temperatures."
}
