{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pycnantha var. angustifolia",
    "plant_slug": "acacia-pycnantha-var-angustifolia",
    "plant_name_scientific": "acacia pycnantha var. angustifolia",
    "intro": "Acacia pycnantha var. angustifolia, commonly known as the narrow-leaved golden wattle, is a flowering plant native to southeastern Australia. It is a small shrub or tree with slender, angular stems and bipinnate leaves composed of numerous tiny leaflets. The plant produces bright yellow globular flowers in late winter to early spring, which are highly attractive to birds and insects. It thrives in well-drained soils and full sun, making it a popular choice for gardens and landscaping. The species is also valued for its ornamental appeal and role in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pycnantha var. angustifolia is primarily native to southeastern Australia, including parts of New South Wales, Victoria, and South Australia. This variant is typically found in dry sclerophyll forests and open woodlands. It thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. The plant is well adapted to nutrient-poor soils and can tolerate periodic drought conditions. It is often found growing along riverbanks and in rocky outcrops within its native range.",
    "distribution_introduced_art_desc": "Acacia pycnantha var. angustifolia was mainly introduced to Australia as an ornamental plant due to its attractive yellow flowers and hardy nature. It has since become naturalized in various regions, particularly in southern and eastern Australia. The plant is often found in disturbed soils and along roadsides, where it can spread aggressively. Its introduction has raised concerns about its potential to become invasive in native ecosystems. Despite its ornamental value, management efforts are needed to control its spread in sensitive habitats."
}
