{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustissima subsp. typica",
    "plant_slug": "acacia-angustissima-subsp-typica",
    "plant_name_scientific": "acacia angustissima subsp. typica",
    "intro": "Acacia angustissima subsp. typica, commonly known as the narrow-leaf wattle, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its narrow, feather-like leaves and yellow flowers that bloom in late spring to early summer. The plant is well adapted to drought conditions, with deep root systems that allow it to survive in nutrient-poor soils. It plays an important role in stabilizing soil and providing habitat for native wildlife. The wood of Acacia angustissima subsp. typica is hard and durable, historically used by Indigenous Australians for tools and weapons.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustissima subsp. typica is primarily native to southern Africa, particularly in countries such as South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, including savannas and rocky outcrops. This subspecies thrives in well-drained soils and is often associated with shrubland and woodland ecosystems. It is well adapted to the dry climate and can tolerate periods of drought. Due to its hardy nature, it is sometimes used in landscaping and reclamation projects in its native range.",
    "distribution_introduced_art_desc": "Acacia angustissima subsp. typica was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in sandy soils and along coastal areas. The plant is often used in horticulture for its ornamental value and drought tolerance. It has also been introduced to other parts of southern Africa, including Namibia and Botswana. However, its spread is limited due to its preference for specific environmental conditions."
}
