{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella texensis",
    "plant_slug": "acaciella-texensis",
    "plant_name_scientific": "acaciella texensis",
    "intro": "Acaciella texensis, commonly known as the Texas acacia, is a shrub native to the arid regions of Texas and northern Mexico. It is characterized by its compound leaves, which are often reduced to small, needle-like structures to minimize water loss. The plant produces small, yellowish-green flowers that are clustered in inflorescences, typically blooming in late spring. It thrives in well-drained soils and is adapted to hot, dry climates. Acaciella texensis plays a role in stabilizing soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella texensis is primarily native to the southern United States, specifically Texas and parts of New Mexico. It is commonly found in rocky soils and dry, open habitats such as limestone hills and sandy plains. This plant thrives in arid and semi-arid environments, often growing in association with other drought-tolerant species. It is an important component of the local flora in these regions. Its distribution is limited to specific ecological niches within its native range.",
    "distribution_introduced_art_desc": "Acaciella texensis was mainly introduced to the southwestern United States and northern Mexico. It is commonly found in dry, rocky soils along the edges of desertscrub and grassland habitats. This plant thrives in arid environments with low rainfall and high temperatures. It plays a role in stabilizing soil and providing habitat for small wildlife. However, its introduction has raised concerns about its potential impact on native plant communities."
}
