{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia floribunda",
    "plant_slug": "acacia-floribunda",
    "plant_name_scientific": "acacia floribunda",
    "intro": "Acacia floribunda, commonly known as the yellow acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, zigzagging branches and pinnate leaves composed of several pairs of small, elliptical leaflets. The plant produces bright yellow inflorescences, which are clusters of small, fragrant flowers that bloom in spring. Acacia floribunda is well adapted to arid and semi-arid environments, often thriving in sandy or gravelly soils. It is also valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia floribunda"
    },
    "taxonomy_art_desc": "Acacia floribunda belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have leaves with stipules and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often used in various ecological and economic contexts. Its species is Acacia floribunda, a specific type of acacia known for its flowering characteristics and native to certain regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [
        "Jawa",
        "Malaya",
        "New Zealand North",
        "Sri Lanka",
        "Sumatera",
        "Tasmania"
    ],
    "distribution_native_art_desc": "Acacia floribunda is primarily native to New South Wales, Queensland, and Victoria. This species is commonly found in various habitats across these regions, including dry sclerophyll forests and woodland areas. It thrives in well-drained soils and is often associated with dry and semi-arid environments. The plant is well adapted to the climatic conditions of southeastern Australia. Its distribution reflects its ecological preferences and historical range within these states.",
    "distribution_introduced_art_desc": "Acacia floribunda was mainly introduced to Jawa, Malaya, New Zealand North, Sri Lanka, Sumatera, and Tasmania. It is a leguminous shrub or small tree native to Australia. The plant was likely introduced for its ornamental value or for use in land rehabilitation. It has since become naturalized in some of these regions. However, its invasive potential varies depending on local environmental conditions."
}
