{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia setulifera",
    "plant_slug": "acacia-setulifera",
    "plant_name_scientific": "acacia setulifera",
    "intro": "Acacia setulifera, commonly known as the hairy acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branched stems and small, yellowish-green leaves that are covered in fine, silky hairs. The plant produces small, globular pods that contain several seeds, which are dispersed by wind. Acacia setulifera thrives in dry, sandy soils and is often found in coastal and inland regions with a warm, arid climate. It is also valued for its role in stabilizing soils and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia setulifera"
    },
    "taxonomy_art_desc": "Acacia setulifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive thorn-like structures and compound leaves. Its species is Acacia setulifera, a specific type of acacia known for its hairy branches and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia setulifera is primarily native to the Northern Territory and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often seen in shrublands and open woodlands. Acacia setulifera is well adapted to the harsh environmental conditions of its native range. It plays an important ecological role in supporting local wildlife and stabilizing soil in its habitat.",
    "distribution_introduced_art_desc": "Acacia setulifera was mainly introduced to control soil erosion and for windbreak purposes in arid and semi-arid regions. It is commonly found in areas with sandy or gravelly soils where other vegetation struggles to establish. The plant is valued for its rapid growth and ability to thrive in harsh environmental conditions. However, its introduction has sometimes led to ecological concerns due to its potential for invasiveness. It is often used in reclamation projects and as a source of timber and fuel."
}
