{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia exigua",
    "plant_slug": "acacia-exigua",
    "plant_name_scientific": "acacia exigua",
    "intro": "Acacia exigua, commonly known as the dwarf wattle, is a small shrub native to southern Africa. It is characterized by its slender, wiry stems and small, yellowish-green flowers that appear in dense spikes. The plant has bipinnate leaves, which are divided into numerous tiny leaflets, giving it a feathery appearance. It is well adapted to arid and semi-arid environments, often growing in rocky or sandy soils. Acacia exigua is also known for its ability to fix nitrogen, contributing to soil fertility in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia exigua"
    },
    "taxonomy_art_desc": "Acacia exigua belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and vetches. Its family is Fabaceae, commonly known as the legume family, which is characterized by the presence of pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorned appearance and their ability to thrive in arid environments. Its species is Acacia exigua, a specific type of acacia native to parts of Africa, known for its small size and adaptations to dry conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia exigua is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This plant thrives in dry, arid environments and is often seen in shrublands and open woodlands. It is well adapted to the local climate and plays an important role in the ecosystem. Its distribution is largely restricted to the coastal and inland regions of Western Australia.",
    "distribution_introduced_art_desc": "Acacia exigua was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions with low rainfall and high temperatures, such as parts of Australia and southern Africa. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. Its introduction has sometimes led to the displacement of native vegetation in invaded areas. Acacia exigua is also valued for its timber and as a source of fodder for livestock."
}
