{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brachystachya",
    "plant_slug": "acacia-brachystachya",
    "plant_name_scientific": "acacia brachystachya",
    "intro": "Acacia brachystachya, commonly known as the narrow-leaved wattle, is a small to medium-sized shrub native to Australia. It is characterized by its delicate, feathery foliage and yellow flower spikes that appear in spring. The plant produces small, pod-like fruits that contain seeds dispersed by wind. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia brachystachya is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia brachystachya"
    },
    "taxonomy_art_desc": "Acacia brachystachya belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a distinctive arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorny appearance and association with nitrogen-fixing bacteria. Its species is Acacia brachystachya, a specific type of acacia found in arid regions, characterized by its small, clustered flowers and adapted to drought conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brachystachya is primarily native to New South Wales, Northern Territory, Queensland, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions across these states. It thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia brachystachya was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in sandy soils and along coastal areas. The plant is often used in landscaping due to its hardy nature and attractive appearance. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasiveness. Its distribution is largely limited to areas with a Mediterranean climate."
}
