{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mucronata var. acuta",
    "plant_slug": "acacia-mucronata-var-acuta",
    "plant_name_scientific": "acacia mucronata var. acuta",
    "intro": "Acacia mucronata var. acuta, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often spiny stems and narrow, lance-shaped leaves. The plant produces yellow globular flowers that appear in late summer to early autumn. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The species is often used in horticulture for its ornamental value and ability to stabilize soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mucronata var. acuta is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It thrives in arid and semi-arid regions, often found in sandy soils and open woodlands. This variety is well adapted to hot, dry climates and can tolerate low rainfall conditions. It is commonly seen in coastal and inland areas where the soil is well-drained. Its distribution is largely restricted to the northern parts of the Australian continent.",
    "distribution_introduced_art_desc": "Acacia mucronata var. acuta was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential for soil stabilization. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. The plant is valued for its rapid growth and ability to tolerate drought conditions, making it suitable for reforestation and land rehabilitation projects. However, it has also been reported to spread aggressively in certain regions, raising concerns about its impact on native vegetation. Its introduction has led to both ecological benefits and challenges in some parts of its range."
}
