{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella angustissima var. hirta",
    "plant_slug": "acaciella-angustissima-var-hirta",
    "plant_name_scientific": "acaciella angustissima var. hirta",
    "intro": "Acaciella angustissima var. hirta, commonly known as the hairy acaciella, is a small, shrub-like plant native to parts of South America, particularly Brazil. It belongs to the legume family, Fabaceae, and is characterized by its narrow, hairy leaves and small, yellow flowers. The plant is adapted to dry, sandy soils and is often found in coastal or semi-arid regions. Its ecological role includes nitrogen fixation, which enriches the soil, and it serves as a habitat for various insects and small animals. Due to its unique morphology and habitat, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella angustissima var. hirta is primarily native to southern Africa, specifically South Africa. It is found in the Eastern Cape and Western Cape provinces. This plant typically grows in coastal and mountainous regions with sandy or rocky soils. It is commonly associated with fynbos vegetation. Its distribution is limited to specific microhabitats within these regions.",
    "distribution_introduced_art_desc": "Acaciella angustissima var. hirta was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along the edges of forests, thriving in sandy or well-drained soils. This plant is often used for erosion control due to its ability to stabilize soil with its extensive root system. It is also valued for its ornamental qualities, with its small, feathery leaves and yellow flowers. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
