{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aprepta",
    "plant_slug": "acacia-aprepta",
    "plant_name_scientific": "acacia aprepta",
    "intro": "Acacia aprepta, commonly known as the white wattle, is a small evergreen shrub native to southern Africa. It is characterized by its slender, wiry stems and bipinnate leaves composed of numerous small, rounded leaflets. The plant produces yellowish-white inflorescences that bloom in summer, attracting various pollinators. Its seeds are encased in woody pods, which split open to release the seeds when mature. Acacia aprepta is often used in ornamental gardening due to its attractive foliage and flowering habit.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia aprepta"
    },
    "taxonomy_art_desc": "Acacia aprepta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of secondary cell walls and complex structures such as stomata. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity and often possessing showy flowers. Its order is Fabales, which includes plants with a distinctive leaf structure and often legume-like flowers, many of which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities through root nodules. Its genus is Acacia, a large group of shrubs and trees known for their distinctive flattened or thorn-like leaves and often used in traditional medicine. Its species is Acacia aprepta, a specific type within the Acacia genus, typically found in certain geographic regions and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aprepta is primarily native to Queensland. It is commonly found in the eastern parts of the state, particularly in areas with sandy or loamy soils. This plant thrives in open woodlands and grasslands, often in regions with a subtropical climate. It is well adapted to the local environmental conditions, including seasonal rainfall patterns. Acacia aprepta plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia aprepta was mainly introduced to control soil erosion and as a source of timber and fuelwood in arid and semi-arid regions. It is commonly found in degraded lands and along roadsides where it establishes quickly due to its adaptability to poor soil conditions. The plant is also used for livestock forage, although its foliage is generally unpalatable. Its rapid growth and ability to fix nitrogen make it valuable for rehabilitating degraded ecosystems. However, it can become invasive in some areas if not managed properly."
}
