{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mollissima var. leichhardtii",
    "plant_slug": "acacia-mollissima-var-leichhardtii",
    "plant_name_scientific": "acacia mollissima var. leichhardtii",
    "intro": "Acacia mollissima var. leichhardtii, commonly known as the silky acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its finely feathery, grey-green foliage and yellow flowers that appear in globular heads. The plant produces pod-like fruits that contain seeds, which are dispersed by wind. It is well adapted to dry conditions, with deep roots and a capacity to fix nitrogen. This species is often used in reforestation and land rehabilitation due to its hardiness and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mollissima var. leichhardtii is primarily native to central and western Australia, including the Northern Territory, Queensland, and South Australia. It is commonly found in arid and semi-arid regions, often growing in sandy soils and on rocky outcrops. This variety is well adapted to harsh environmental conditions, such as high temperatures and low rainfall. It is often seen in open woodlands and shrublands, contributing to the local ecosystem. The plant is known for its distinctive foliage and is sometimes used in horticulture for its ornamental value.",
    "distribution_introduced_art_desc": "Acacia mollissima var. leichhardtii was mainly introduced to regions of Australia, particularly in the arid and semi-arid areas of Western Australia and South Australia. It was introduced for its ability to thrive in harsh, dry environments and its potential for soil stabilization. This plant is often used in rehabilitation projects due to its hardy nature and capacity to prevent soil erosion. However, it has also been reported to spread aggressively, sometimes becoming invasive in certain ecosystems. Its introduction has had both ecological and practical implications in the regions where it has been established."
}
