{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cowellii",
    "plant_slug": "acacia-cowellii",
    "plant_name_scientific": "acacia cowellii",
    "intro": "Acacia cowellii, commonly known as the Cowell's wattle, is a shrub native to Western Australia. It features small, yellow, pea-like flowers that bloom in spring, adding a vibrant touch to its habitat. The plant has phyllodes, which are flattened, leaf-like stems that reduce water loss in its arid environment. It is often found in sandy soils and can thrive in full sun. Acacia cowellii is valued for its ornamental appeal and its role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cowellii is primarily native to the arid and semi-arid regions of southern Australia, including parts of Western Australia, South Australia, and the Northern Territory. It thrives in sandy or gravelly soils and is commonly found in coastal dunes, inland plains, and rocky outcrops. This species is well adapted to hot, dry climates and can tolerate salt spray, making it a characteristic plant of coastal and inland desert environments. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife. Acacia cowellii is also sometimes referred to as the coastal wattle due to its prevalence along the coastlines of southern Australia.",
    "distribution_introduced_art_desc": "Acacia cowellii was mainly introduced to Australia as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since spread beyond cultivated areas and is now found in various parts of the country, particularly in semi-arid and tropical regions. The plant is considered an environmental weed in some areas, where it can outcompete native vegetation. Its introduction has led to concerns about its impact on local ecosystems and biodiversity. Management strategies are being developed to control its spread and mitigate its effects on native flora."
}
