{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kochii",
    "plant_slug": "acacia-kochii",
    "plant_name_scientific": "acacia kochii",
    "intro": "Acacia kochii, commonly known as the yellow acacia, is a shrub or small tree native to arid regions of southern Africa. It is characterized by its slender, often thornless stems and bipinnate leaves that are finely divided. The plant produces small, yellow flowers in globular clusters, which are followed by flat, pod-like fruits. Acacia kochii is adapted to drought conditions, with deep roots that allow it to thrive in sandy or rocky soils. It plays an important role in local ecosystems by providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia kochii"
    },
    "taxonomy_art_desc": "Acacia kochii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of complex structures like vascular tissue and true roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and are often associated with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and a wide variety of growth forms. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their acicular leaves and often used in traditional medicine. Its species is Acacia kochii, a specific type of acacia found in certain regions of Africa, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kochii is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the Geraldton area. This plant typically grows in sandy or gravelly soils and is often found in coastal and inland regions. It is well adapted to the arid and semi-arid climates of its native range. Acacia kochii plays an important ecological role in its habitat, providing food and shelter for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia kochii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. The plant is often used for soil stabilization due to its deep root system and ability to tolerate drought. It has also been introduced to other parts of the world, including Australia and the United States, as an ornamental and for erosion control. However, its spread in non-native areas has raised concerns about its potential invasiveness."
}
