{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riparia var. argentinensis",
    "plant_slug": "acacia-riparia-var-argentinensis",
    "plant_name_scientific": "acacia riparia var. argentinensis",
    "intro": "Acacia riparia var. argentinensis, commonly known as the Argentine river acacia, is a shrub or small tree native to South America. It is characterized by its slender, often branching stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow, globular inflorescences that attract various pollinators, including bees and birds. Its seeds are encased in woody pods and are adapted for dispersal by wind or animals. This species is often found along riverbanks and in semi-arid regions, where it plays a role in stabilizing soil and providing habitat for wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riparia var. argentinensis is primarily native to Argentina, particularly in the northern regions of the country. It is commonly found in the provinces of Salta, Jujuy, and Tucumán. This variant thrives in arid and semi-arid environments, often growing along riverbanks and in dry grasslands. It is well adapted to the harsh climatic conditions of the region, including high temperatures and low precipitation. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia riparia var. argentinensis was mainly introduced to South America, particularly Argentina, as a ornamental plant due to its unique foliage and adaptability to various soil conditions. It is commonly found in regions with semi-arid climates, where it thrives in well-drained soils. This variety is also used in reforestation projects because of its ability to fix nitrogen and prevent soil erosion. However, its introduction has led to concerns about its potential to become invasive in local ecosystems. Despite its benefits, careful management is required to prevent unintended ecological impacts."
}
