{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rigescens",
    "plant_slug": "acacia-rigescens",
    "plant_name_scientific": "acacia rigescens",
    "intro": "Acacia rigescens, commonly known as the rigid acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, upright branches and small, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers in globular clusters, which are followed by flat, leathery pods containing seeds. Acacia rigescens is adapted to arid and semi-arid environments, making it a resilient species in harsh conditions. It is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rigescens"
    },
    "taxonomy_art_desc": "Acacia rigescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a large group of flowering plants that includes many familiar species such as roses and magnolias, and is distinguished by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have small, clustered flowers and include legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of shrubs and trees found mainly in tropical and subtropical regions, known for their distinctive, often thorny foliage and protein-rich seed pods. Its species is Acacia rigescens, a specific type of acacia known for its erect growth habit and is commonly found in arid and semi-arid regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rigescens is primarily native to the Northern Territory. It is commonly found in arid and semi-arid regions within this area. The plant thrives in sandy soils and is often seen along coastal areas and inland dunes. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its hardy nature makes it well adapted to the harsh environmental conditions of the Northern Territory.",
    "distribution_introduced_art_desc": "Acacia rigescens was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coast and in coastal dunes. The plant is valued for its hardy nature and ability to thrive in harsh environmental conditions. It has been used in restoration projects due to its ecological benefits. However, its introduction has also raised concerns about potential invasiveness in local ecosystems."
}
