{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia procumbens",
    "plant_slug": "acacia-procumbens",
    "plant_name_scientific": "acacia procumbens",
    "intro": "Acacia procumbens, commonly known as the prostrate wattle, is a low-growing shrub native to southern Australia. It features slender, often prostrate stems that root at the nodes, allowing it to spread across the ground. The plant produces small, yellow flowers arranged in racemes, which bloom in spring. Its leaves are bipinnate, consisting of multiple pairs of small, oval leaflets. Acacia procumbens is well adapted to arid environments and is often found in coastal and sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia procumbens is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This plant thrives in well-drained soils and is adapted to withstand high temperatures and low rainfall. It is often seen growing along roadsides and in open grasslands. Acacia procumbens plays an important ecological role by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia procumbens was mainly introduced to stabilize soil and prevent erosion in degraded areas. It is commonly used in ecological restoration projects due to its hardy nature and ability to thrive in poor soil conditions. The plant spreads through its extensive root system, which helps bind the soil and reduce runoff. It is also valued for its nitrogen-fixing capabilities, improving soil fertility over time. However, its rapid growth can sometimes lead to the displacement of native vegetation if not managed properly."
}
