{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aneura var. argentea",
    "plant_slug": "acacia-aneura-var-argentea",
    "plant_name_scientific": "acacia aneura var. argentea",
    "intro": "Acacia aneura var. argentea, commonly known as the silver wattle, is a shrub or small tree native to the arid regions of Australia. It is characterized by its feathery, bipinnate leaves that are covered in a fine, silvery-white pubescence, giving it a distinctive appearance. The plant produces yellow globular flowers in late winter to early spring, which are followed by long, flat pods. It is well adapted to dry conditions, with deep roots that allow it to thrive in nutrient-poor soils. This variety is often cultivated for its ornamental value and is also used in traditional Indigenous practices.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aneura var. argentea is primarily native to the arid and semi-arid regions of central and western Australia. It is commonly found in areas such as the Simpson Desert, the Great Sandy Desert, and parts of the Northern Territory. This variety is well adapted to harsh, dry environments and thrives in sandy or rocky soils. It is often seen growing along roadsides, in open woodlands, and on sand plains. Its silvery foliage and distinctive appearance make it a notable species in the local flora.",
    "distribution_introduced_art_desc": "Acacia aneura var. argentea was mainly introduced to urban and roadside environments due to its hardy nature and ornamental value. It is commonly found in coastal and semi-arid regions of southern Australia. This variety is known for its silver-blue foliage, which makes it a popular choice for landscaping. It has been widely planted as a decorative shrub in gardens and public spaces. However, its invasive potential has raised concerns in some areas where it may outcompete native vegetation."
}
