{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verricula",
    "plant_slug": "acacia-verricula",
    "plant_name_scientific": "acacia verricula",
    "intro": "Acacia verricula, commonly known as the dwarf acacia, is a small shrub native to the arid regions of Australia. It is characterized by its dense, thorny growth and small, feathery leaves that help reduce water loss in its harsh environment. The plant produces yellow flowers in winter, which are clustered in spherical heads and attract various pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by animals or through fire. Acacia verricula is well-suited to dry conditions and is often used in revegetation projects due to its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia verricula"
    },
    "taxonomy_art_desc": "Acacia verricula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as those in the rose family. Its order is Fabales, which comprises flowering plants that are often legumes, characterized by their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their characteristic phyllodes and often used in traditional medicine and as sources of timber. Its species is Acacia verricula, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verricula is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This plant typically grows in sandy soils and is often seen in open woodlands and coastal areas. It is well adapted to the dry and warm climate of its native habitat. Acacia verricula plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia verricula was mainly introduced to areas with disturbed soils and arid conditions, often as part of reclamation efforts or for its ecological benefits. It is commonly found in regions with low rainfall and poor soil quality, where it can establish itself quickly. This plant is known for its ability to fix nitrogen, which improves soil fertility in degraded landscapes. Its introduction has been documented in several parts of the world, including Australia and North America. However, it is sometimes considered an invasive species in certain regions due to its rapid growth and competitive nature."
}
