{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adhaerens var. parviceps",
    "plant_slug": "acacia-adhaerens-var-parviceps",
    "plant_name_scientific": "acacia adhaerens var. parviceps",
    "intro": "Acacia adhaerens var. parviceps, commonly known as the dwarf acacia, is a shrub native to the arid regions of northern Australia. It is characterized by its small, slender stems and dense clusters of yellow flowers that bloom throughout the dry season. The plant has small, bipinnate leaves that are adapted to reduce water loss in its harsh environment. Its root system is deep and extensive, allowing it to access groundwater in nutrient-poor soils. Acacia adhaerens var. parviceps plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adhaerens var. parviceps is primarily native to the arid and semi-arid regions of northern Australia, particularly in the Northern Territory and Western Australia. This variant is commonly found in sandy soils and open woodlands, often in areas with low rainfall. It is well adapted to the harsh environmental conditions of its native habitat, including high temperatures and limited water availability. The plant plays an important ecological role in stabilizing soil and providing habitat for various native fauna. Its distribution is closely tied to the specific climatic and geological features of the region.",
    "distribution_introduced_art_desc": "Acacia adhaerens var. parviceps was mainly introduced to areas with well-drained soils and a tropical or subtropical climate. It is commonly found in disturbed habitats such as roadsides, degraded forests, and abandoned pastures. This plant is known for its ability to thrive in poor soil conditions, making it a successful invader in many regions. Its rapid growth and adaptability contribute to its spread across different ecosystems. However, its introduction can lead to competition with native species and alter local biodiversity."
}
