{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stenoptera",
    "plant_slug": "acacia-stenoptera",
    "plant_name_scientific": "acacia stenoptera",
    "intro": "Acacia stenoptera, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its compound leaves, which are narrow and often have a feathery appearance. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. Acacia stenoptera is adapted to arid and semi-arid environments, exhibiting drought tolerance. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stenoptera"
    },
    "taxonomy_art_desc": "Acacia stenoptera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or bean family, which includes plants that form nodules on their roots to fix atmospheric nitrogen. Its genus is Acacia, a large group of shrubs and trees native to Australia and other parts of Africa, known for their distinctive, often thorny foliage and flower heads. Its species is Acacia stenoptera, a specific type of acacia known for its narrow, needle-like leaves and is commonly found in arid and semi-arid regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stenoptera is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in arid and semi-arid environments, often growing in sandy soils. It is a hardy shrub that is well adapted to the local climate. Acacia stenoptera plays an important role in the ecological balance of its native habitat.",
    "distribution_introduced_art_desc": "Acacia stenoptera was mainly introduced to control soil erosion and provide windbreaks in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant has also been introduced for ornamental purposes because of its unique foliage and hardiness. However, it can become invasive in some areas if not managed properly. Its distribution is now widespread in parts of Australia and other regions with similar climates."
}
