{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia legnota",
    "plant_slug": "acacia-legnota",
    "plant_name_scientific": "acacia legnota",
    "intro": "Acacia legnota, commonly known as the narrow-leaf wattle, is a flowering plant native to Australia. It belongs to the Fabaceae family, characterized by its pod fruits and nitrogen-fixing abilities. The plant features slender, bipinnate leaves and produces yellow, pea-like flowers. It thrives in dry, sandy soils and is often found in coastal areas. Acacia legnota is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia legnota"
    },
    "taxonomy_art_desc": "Acacia legnota belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a true root system and vascular tissue. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and other primitive plant forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that are often legumes and have a symbiotic relationship with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are native to Africa, Australia, and the Americas. Its species is Acacia legnota, a specific type of acacia that is native to certain regions of Africa and is known for its unique ecological and possibly medicinal properties.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia legnota is primarily native to Queensland. It is found in the arid and semi-arid regions of the state, particularly in the inland areas. This species typically grows in sandy soils and is adapted to low rainfall conditions. It is often seen in woodland and shrubland habitats. Acacia legnota plays an important role in the local ecosystem and is part of the diverse flora of Queensland.",
    "distribution_introduced_art_desc": "Acacia legnota was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly used in reforestation projects due to its fast growth and ability to thrive in poor soils. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, it has been reported to spread aggressively, sometimes becoming invasive in certain regions. Its introduction has had both beneficial and problematic ecological impacts depending on the environment."
}
