{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia latisiliqua var. paucifoliola",
    "plant_slug": "acacia-latisiliqua-var-paucifoliola",
    "plant_name_scientific": "acacia latisiliqua var. paucifoliola",
    "intro": "Acacia latisiliqua var. paucifoliola, commonly known as the narrow-leaved wattle, is a shrub native to southern Africa. It is characterized by its slender, wiry stems and small, narrow leaves that are often clustered at the base of the plant. The plant produces yellow globular flower heads, which are typical of the Acacia genus. It thrives in dry, sandy soils and is adapted to arid and semi-arid environments. This variety is notable for its unique foliage and is often used in horticulture for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia latisiliqua var. paucifoliola is primarily native to the Arabian Peninsula, particularly in countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, growing in rocky soils and along coastal areas. This variety is adapted to hot, dry climates and can thrive in areas with limited rainfall. It is often seen in coastal dunes and scrublands, where it contributes to local vegetation. Its distribution is closely associated with the unique ecological conditions of the region.",
    "distribution_introduced_art_desc": "Acacia latisiliqua var. paucifoliola was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of timber due to its hardy nature. Its introduction has also been associated with ecological changes in native habitats. However, it is considered a potential invasive species in some regions."
}
