{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia olsenii",
    "plant_slug": "acacia-olsenii",
    "plant_name_scientific": "acacia olsenii",
    "intro": "Acacia olsenii, commonly known as the desert acacia, is a shrub native to the arid regions of the southwestern United States and northern Mexico. It is characterized by its slender, multi-branched stems and small, bean-like pods that contain its seeds. The plant produces yellow flowers that bloom in clusters, adding a striking visual element to its desert habitat. Acacia olsenii is well adapted to harsh conditions, with deep root systems and waxy leaves that reduce water loss. It plays an important ecological role by providing food and shelter for various desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia olsenii"
    },
    "taxonomy_art_desc": "Acacia olsenii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and diverse reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its characteristic pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia olsenii, a specific type of acacia found in certain regions of Australia, known for its unique ecological role and potential medicinal properties.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia olsenii is primarily native to New South Wales. It is found in the coastal and inland regions of the state, particularly in areas with sandy or rocky soils. This plant typically grows in dry, open habitats such as woodlands, heathlands, and coastal dunes. It is well adapted to the semi-arid and temperate climates of New South Wales. Acacia olsenii plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia olsenii was mainly introduced to the western United States, particularly in California and Nevada. It was originally brought to these regions for its ornamental value and ability to thrive in arid conditions. This plant has since become naturalized in several areas, often found in disturbed soils and along roadsides. Its introduction has raised concerns due to its potential to outcompete native vegetation. Despite its beauty, Acacia olsenii is considered an invasive species in some parts of its range."
}
