{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pennata var. dolichosperma",
    "plant_slug": "acacia-pennata-var-dolichosperma",
    "plant_name_scientific": "acacia pennata var. dolichosperma",
    "intro": "Acacia pennata var. dolichosperma, commonly known as the long-seeded wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and bipinnate leaves composed of small, oval-shaped leaflets. The plant produces yellow flowers in late winter to early spring, followed by elongated, flattened pods that contain seeds. It thrives in well-drained soils and is often found in dry, open habitats. This species is valued for its ornamental appeal and its role in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pennata var. dolichosperma is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils and rocky outcrops, often in areas with low rainfall. It thrives in environments with high sunlight exposure and well-drained soil conditions. The plant is well adapted to the harsh climate of its native habitat, showing resilience to drought and extreme temperatures. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia pennata var. dolichosperma was mainly introduced to control soil erosion and for ornamental purposes in semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its adaptability to poor soil conditions. This plant has spread beyond its original introduction sites, becoming invasive in some areas. Its rapid growth and ability to fix nitrogen make it a valuable species for land rehabilitation. However, it can outcompete native vegetation if not managed properly."
}
