{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polypodioides",
    "plant_slug": "acacia-polypodioides",
    "plant_name_scientific": "acacia polypodioides",
    "intro": "Acacia polypodioides, commonly known as the fern-leaf acacia, is a shrub native to Australia. It is characterized by its delicate, fern-like leaves that are compound and pinnate. The plant produces small, yellow flowers that are clustered in dense, globular inflorescences. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia polypodioides is valued for its ornamental appeal and ecological role in supporting native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia polypodioides is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in rocky outcrops, savannas, and sandy soils where it can thrive in harsh environmental conditions. This plant is well adapted to drought and high temperatures, making it a resilient species in its native habitat. It plays an important role in local ecosystems by providing shelter and food for various animals. Its distribution is largely confined to the southern African continent, with limited occurrences in neighboring regions.",
    "distribution_introduced_art_desc": "Acacia polypodioides was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since become naturalized in several regions, particularly in coastal and disturbed areas. The plant is known for its rapid growth and ability to colonize open spaces, which has led to its classification as a potential weed in some areas. Despite its invasive tendencies, it is still cultivated for its aesthetic value in gardens and public landscapes. Its distribution is now largely restricted to the northern and western parts of the country."
}
