{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pycnantha var. petiolaris",
    "plant_slug": "acacia-pycnantha-var-petiolaris",
    "plant_name_scientific": "acacia pycnantha var. petiolaris",
    "intro": "Acacia pycnantha var. petiolaris, commonly known as the narrow-leaved golden wattle, is a small to medium-sized shrub or tree native to Australia. It is characterized by its slender, dark green leaves that are narrow and have a slightly hairy texture. The plant produces bright yellow flowers in winter, which are clustered in spherical heads, making it a striking ornamental plant. It thrives in well-drained soils and full sun, often found in coastal and sandy environments. This variety is closely related to the more widely known Acacia pycnantha, but it has distinct leaf morphology and is less commonly cultivated.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pycnantha var. petiolaris is primarily native to southeastern Australia, including parts of New South Wales, Victoria, and South Australia. This variant is commonly found in dry sclerophyll forests and open woodlands. It thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. The plant is adapted to well-drained soils and is often seen growing in coastal and inland areas. Its distribution is closely linked to the natural vegetation patterns of these regions.",
    "distribution_introduced_art_desc": "Acacia pycnantha var. petiolaris was mainly introduced to South Africa as an ornamental plant due to its attractive yellow flowers and hardy nature. It is commonly found in gardens and along roadsides, where it thrives in well-drained soils and full sun. This variety is also valued for its ability to fix nitrogen, making it useful in soil enrichment. However, it has been noted to spread aggressively in some areas, raising concerns about its impact on native vegetation. Its introduction has led to both aesthetic appreciation and ecological challenges in certain regions."
}
