{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glaucescens",
    "plant_slug": "acacia-glaucescens",
    "plant_name_scientific": "acacia glaucescens",
    "intro": "Acacia glaucescens, commonly known as the blue acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often spiny stems and small, pale green to blue-gray leaves that are arranged in pairs. The plant produces yellow flowers in compact globular heads, which are typically pollinated by insects. Acacia glaucescens is adapted to drought conditions, with deep root systems that allow it to survive in nutrient-poor soils. It is often used in traditional medicine and as a source of timber and animal fodder.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glaucescens is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in a variety of habitats, including savannas, woodlands, and rocky outcrops. This plant is commonly found in regions with a tropical or subtropical climate. It is well adapted to dry conditions and can tolerate poor soils. Its distribution is largely influenced by rainfall patterns and availability of suitable growing conditions.",
    "distribution_introduced_art_desc": "Acacia glaucescens was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and drought tolerance. It has since been cultivated in various regions, including parts of Australia and the Mediterranean, for landscaping purposes. Despite its aesthetic value, it has raised concerns due to its potential to become invasive in certain environments. The plant's ability to thrive in poor soils and its rapid growth rate contribute to its spread. Proper management is recommended to prevent it from outcompeting native vegetation."
}
