{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia simsii",
    "plant_slug": "acacia-simsii",
    "plant_name_scientific": "acacia simsii",
    "intro": "Acacia simsii, commonly known as the silver acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, multi-branched stems and small, feathery leaves that give it a distinctive appearance. The plant produces yellow flowers in summer, which are clustered in cylindrical inflorescences. It is well adapted to drought conditions, making it a resilient species in harsh environments. Acacia simsii is often used in landscaping due to its ornamental value and ability to thrive in poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia simsii"
    },
    "taxonomy_art_desc": "Acacia simsii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which includes plants known for their legume fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often compound leaves. Its genus is Acacia, a large group of shrubs and trees found primarily in Africa and Australia, known for their distinctive phyllodes and ability to thrive in arid environments. Its species is Acacia simsii, a specific type of acacia found in certain regions of Africa, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea",
        "Northern Territory",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia simsii is primarily native to New Guinea, Northern Territory, and Queensland. This plant is commonly found in the tropical and subtropical regions of these areas. It thrives in dry, open habitats such as savannas and woodlands. Acacia simsii is well adapted to the local climate and soil conditions of its native range. It plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia simsii was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland regions where it can establish itself easily. Its introduction has led to its spread in several parts of the world, including Australia and South Africa. However, it is considered a potential invasive species in some areas due to its rapid growth and adaptability."
}
