{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia johnsonii",
    "plant_slug": "acacia-johnsonii",
    "plant_name_scientific": "acacia johnsonii",
    "intro": "Acacia johnsonii, commonly known as the Johnson's acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often thornless stems and bipinnate leaves that are typically reduced to small, scale-like structures. The plant produces yellow flowers in compact, globular heads, which are followed by flat, pod-like fruits containing seeds. It is well adapted to harsh environments, exhibiting drought tolerance and efficient water use. Acacia johnsonii plays an important ecological role in providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia johnsonii"
    },
    "taxonomy_art_desc": "Acacia johnsonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for its vascular system. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are mostly shrubs or trees found in Australia and other regions. Its species is Acacia johnsonii, a specific type of acacia that is native to Australia and is known for its distinctive appearance and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia johnsonii is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, open habitats such as woodlands and grasslands. This species thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Acacia johnsonii is often associated with sandy or loamy soils and is well adapted to arid environments. Its distribution reflects its ability to survive in nutrient-poor soils and withstand periods of drought.",
    "distribution_introduced_art_desc": "Acacia johnsonii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in coastal and semi-arid environments. This plant is often planted for its ornamental value and for soil stabilization purposes. However, it has also been reported to spread into native vegetation, raising concerns about its invasive potential. Its introduction has led to discussions about its ecological impact and management in local ecosystems."
}
