{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hanniana",
    "plant_slug": "acacia-hanniana",
    "plant_name_scientific": "acacia hanniana",
    "intro": "Acacia hanniana, commonly known as the white acacia, is a deciduous shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stem and bipinnate leaves that are finely divided. The plant produces yellow to golden-yellow inflorescences, which are clusters of small, fragrant flowers. Acacia hanniana is adapted to arid and semi-arid environments, showcasing drought tolerance and efficient water use. Its ecological importance includes providing food and habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hanniana is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in a variety of habitats, including savannas, grasslands, and rocky outcrops. This species is commonly found in areas with a tropical or subtropical climate. It plays an important ecological role by providing food and shelter for local wildlife. Acacia hanniana is also known for its ability to withstand drought conditions, making it well adapted to its native environment.",
    "distribution_introduced_art_desc": "Acacia hanniana was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Kenya, Somalia, and Sudan. This plant is often used for its hardy nature and ability to prevent soil erosion. Its introduction has been associated with land rehabilitation projects in degraded landscapes. However, it can become invasive in certain environments if not managed properly."
}
