{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lycopodioides",
    "plant_slug": "acacia-lycopodioides",
    "plant_name_scientific": "acacia lycopodioides",
    "intro": "Acacia lycopodioides, commonly known as the coastal acacia, is a shrub native to coastal regions of southern Africa. It is characterized by its slender, often spiny stems and small, scale-like leaves. The plant produces yellow flowers in clusters, which are followed by woody pods containing seeds. It thrives in sandy or rocky soils and is adapted to coastal conditions with high salt exposure. Acacia lycopodioides plays a role in stabilizing dunes and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lycopodioides is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland ecosystems. This plant is well adapted to harsh environmental conditions, including high temperatures and limited rainfall. It plays an important role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to the southwestern and central parts of the African continent.",
    "distribution_introduced_art_desc": "Acacia lycopodioides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in open grasslands and rocky outcrops, thriving in well-drained soils. The plant is known for its dense foliage and ability to tolerate drought conditions. It has been reported as an invasive species in some areas, outcompeting native vegetation. Due to its hardy nature, it is sometimes used in reclamation projects for soil stabilization."
}
