{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia scalpelliformis",
    "plant_slug": "acacia-scalpelliformis",
    "plant_name_scientific": "acacia scalpelliformis",
    "intro": "Acacia scalpelliformis, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, often spindly growth habit. The plant produces yellow flowers in spherical or cylindrical clusters, which are typical of the acacia genus. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. Acacia scalpelliformis is adapted to arid and semi-arid environments, making it a resilient species in harsh conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia scalpelliformis"
    },
    "taxonomy_art_desc": "Acacia scalpelliformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and some primitive vascular plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acacia-like foliage and often used in various ecological and economic contexts. Its species is Acacia scalpelliformis, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia scalpelliformis is primarily native to Western Australia. It is found in the coastal regions of the state, particularly in the south-western and mid-western areas. This species thrives in sandy soils and is commonly associated with coastal heathlands and dunes. It is well adapted to the arid and semi-arid climates of its native habitat. The plant plays an important ecological role in stabilizing coastal dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia scalpelliformis was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its hardy nature and potential for erosion control. However, it has since spread rapidly due to its ability to thrive in a variety of soil types and climates. The plant outcompetes native vegetation, leading to significant ecological impacts. Efforts are ongoing to manage its spread and mitigate its effects on local ecosystems."
}
