{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis subsp. heteracantha",
    "plant_slug": "acacia-tortilis-subsp-heteracantha",
    "plant_name_scientific": "acacia tortilis subsp. heteracantha",
    "intro": "Acacia tortilis subsp. heteracantha, commonly known as the umbrella thorn acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its distinctive umbrella-shaped crown formed by its dense, spreading branches. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves, and it produces yellow flowers followed by pod fruits containing seeds. It is well adapted to harsh environments, with deep roots and a thick, waxy cuticle to reduce water loss. This species is also known for its role in providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis subsp. heteracantha is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of the Arabian Peninsula, particularly in Yemen and Oman. This subspecies thrives in arid and semi-arid environments, often growing in savannas and rocky terrains. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is closely associated with regions that have a tropical or subtropical climate with seasonal rainfall.",
    "distribution_introduced_art_desc": "Acacia tortilis subsp. heteracantha was mainly introduced to areas with arid and semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, the Middle East, and parts of Asia. This subspecies is known for its ability to tolerate drought and poor soil conditions, making it adaptable to various environments. It is often used for erosion control and as a source of timber and fuelwood. Its introduction has had both ecological and economic impacts in the regions where it has been established."
}
