{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flava f. chariensis",
    "plant_slug": "acacia-flava-f-chariensis",
    "plant_name_scientific": "acacia flava f. chariensis",
    "intro": "Acacia flava f. chariensis, commonly known as the yellow wattle. This variant of Acacia flava is characterized by its golden-yellow flowers and narrow, linear leaves. It is a shrub native to Australia, typically found in dry, sandy soils. The plant produces small, flat pods that contain seeds dispersed by wind. It is valued for its ornamental appeal and is often cultivated in gardens for its vibrant color.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flava f. chariensis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. This subspecies is commonly found in rocky outcrops, sandy soils, and coastal dunes where it thrives in dry, well-drained conditions. It is adapted to withstand high temperatures and low rainfall, making it a characteristic plant of the Namib Desert and surrounding areas. The plant plays an important ecological role by providing shelter and food for local wildlife. Its distribution is largely restricted to these specific habitats, reflecting its specialized environmental requirements.",
    "distribution_introduced_art_desc": "Acacia flava f. chariensis was mainly introduced to areas with well-drained sandy soils and a warm, temperate climate. It is commonly found in regions with low to moderate rainfall. This plant thrives in full sun and is often used in landscaping for its ornamental value. It has been introduced to several parts of the United States, particularly in the southern and western states. Due to its adaptability, it has become a common ornamental species in both residential and commercial settings."
}
