{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trudgeniana",
    "plant_slug": "acacia-trudgeniana",
    "plant_name_scientific": "acacia trudgeniana",
    "intro": "Acacia trudgeniana, commonly known as the Trudgen's acacia, is a shrub or small tree native to southern Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant is known for its yellow flowers and is often found in coastal and sandy soils. It has adapted to arid environments, showing resilience to drought conditions. Its ecological importance includes providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia trudgeniana"
    },
    "taxonomy_art_desc": "Acacia trudgeniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns, horsetails, and their relatives, typically featuring vascular tissues and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, known for their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive flattened or spiny leaves and often used in traditional medicine. Its species is Acacia trudgeniana, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trudgeniana is primarily native to Western Australia. It is found in the southern regions of the state, particularly in the areas of the Geraldton and Shark Bay regions. This plant typically grows in sandy soils and is adapted to the arid and semi-arid climates of its native habitat. It is commonly found in coastal and inland areas, often in association with other native shrubs and grasses. Acacia trudgeniana plays an important ecological role in its native environment, providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia trudgeniana was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has also been noted in some parts of Southeast Asia and the Pacific Islands. However, it is considered a potential invasive species in certain environments."
}
