{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia meridionalis",
    "plant_slug": "acacia-meridionalis",
    "plant_name_scientific": "acacia meridionalis",
    "intro": "Acacia meridionalis, commonly known as the southern acacia, is a shrub or small tree native to southern Africa. It is characterized by its bipinnate leaves, which are compound and consist of multiple pairs of small leaflets. The plant produces yellow flowers arranged in cylindrical spikes, which are typical of the Acacia genus. It thrives in arid and semi-arid environments, showing adaptability to dry conditions. The plant is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia meridionalis is primarily native to the south-western region of Australia. It is commonly found in the states of Western Australia and South Australia. This plant thrives in arid and semi-arid environments, often growing in sandy or gravelly soils. It is typically found in open woodlands and shrublands. Its distribution is limited to specific ecological zones within these regions.",
    "distribution_introduced_art_desc": "Acacia meridionalis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. This plant is often used for erosion control due to its deep root system and ability to withstand drought conditions. However, it has also been reported to invade native vegetation in some areas, raising concerns about its ecological impact. Its introduction has led to discussions about managing its spread to protect local biodiversity."
}
