{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia baxteri",
    "plant_slug": "acacia-baxteri",
    "plant_name_scientific": "acacia baxteri",
    "intro": "Acacia baxteri, commonly known as the Baxter's wattle, is a small shrub native to the arid regions of Western Australia. It is characterized by its slender, often twisted stems and bipinnate leaves that are covered in fine hairs. The plant produces yellow globular flowers in late winter to early spring, which are arranged in dense spikes. Acacia baxteri is adapted to survive in harsh, dry conditions with its deep root system and ability to fix nitrogen. It is also valued for its ornamental appeal and ecological importance in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia baxteri"
    },
    "taxonomy_art_desc": "Acacia baxteri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their relatives, including horsetails, and is known for its vascular system. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which includes legumes and related plants, known for their ability to form nitrogen-fixing symbioses with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees, commonly known as wattles, found mainly in Australia and Africa. Its species is Acacia baxteri, a specific type of acacia native to Australia, known for its distinctive foliage and ecological importance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia baxteri is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This species is often associated with coastal and near-coastal environments. It thrives in well-drained soils and is adapted to the semi-arid climate of its native range. Acacia baxteri plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia baxteri was mainly introduced to areas with arid or semi-arid climates, particularly in regions of Australia and parts of Southeast Asia. It thrives in well-drained soils and is often found in coastal dunes or inland sandy plains. This plant is commonly used for erosion control due to its deep root system and ability to stabilize soil. It has also been introduced as an ornamental plant in some regions because of its unique foliage and hardy nature. However, in certain areas, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
