{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia alcockii",
    "plant_slug": "acacia-alcockii",
    "plant_name_scientific": "acacia alcockii",
    "intro": "Acacia alcockii, commonly known as the yellow acacia, is a shrub or small tree native to the arid regions of Australia. It is characterized by its slender, often spiny stems and compound leaves that are typically reduced to small, scale-like structures. The plant produces yellow flowers in globular clusters, which are highly attractive to nectar-feeding birds and insects. Acacia alcockii is adapted to survive in dry, nutrient-poor soils, and it plays an important role in stabilizing sandy soils. Its unique morphology and ecological significance make it a notable species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia alcockii"
    },
    "taxonomy_art_desc": "Acacia alcockii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissues. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species, often with primitive floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia alcockii, a specific type of acacia found in certain regions, noted for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia alcockii is primarily native to South Australia. It is found in the arid and semi-arid regions of the state, particularly in the central and western parts. This species typically grows in sandy soils and is often found in open woodlands and shrublands. It is well adapted to the harsh environmental conditions of the region. Its distribution is limited to specific areas within South Australia where the climate and soil conditions are suitable.",
    "distribution_introduced_art_desc": "Acacia alcockii was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant thrives in a variety of soil types and is highly adaptable to different environmental conditions. Its rapid growth and ability to spread through seed dispersal have made it a significant ecological concern."
}
