{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leprosa var. binervis",
    "plant_slug": "acacia-leprosa-var-binervis",
    "plant_name_scientific": "acacia leprosa var. binervis",
    "intro": "Acacia leprosa var. binervis, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It features slender, often twisted stems and bipinnate leaves with two rows of small, linear leaflets. The plant produces yellow globular flower heads that appear in spring, attracting various pollinators. It is adapted to arid and semi-arid environments, showing drought tolerance. The species is valued for its ornamental appeal and is sometimes used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leprosa var. binervis is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, growing in sandy or rocky soils. This variety is adapted to hot and dry climates, often thriving in open woodlands and shrublands. It is also present in some areas of New Guinea. The plant is well-known for its distinctive yellow flowers and its ability to withstand harsh environmental conditions.",
    "distribution_introduced_art_desc": "Acacia leprosa var. binervis was mainly introduced to New Zealand. It was brought there during the 19th century as part of the introduction of exotic plant species for ornamental and agricultural purposes. This variety is known for its distinctive bipinnate leaves and is often found in coastal and sandy soils. It has since become naturalized in certain areas, though it is not considered a major invasive species. Its distribution is limited to specific regions where it thrives in well-drained, sunny conditions."
}
