{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia excentrica",
    "plant_slug": "acacia-excentrica",
    "plant_name_scientific": "acacia excentrica",
    "intro": "Acacia excentrica, commonly known as the slender wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and small, phyllodes that are typically green and pointed. The plant produces yellow flowers in globular heads, which appear in spring and attract various pollinators. Acacia excentrica is adapted to dry conditions and is often found in sandy or rocky soils. Its leaves are modified into phyllodes, a feature common in many acacia species, which helps reduce water loss.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia excentrica"
    },
    "taxonomy_art_desc": "Acacia excentrica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall and complex structures like vascular tissues. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral morphology. Its order is Fabales, which consists of flowering plants with a distinctive type of flower and includes legumes, which are known for their nitrogen-fixing ability. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by its fruit type and nitrogen-fixing symbiosis with bacteria. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species adapted to arid environments. Its species is Acacia excentrica, a specific type of acacia known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia excentrica is primarily native to Western Australia. It is commonly found in the coastal regions and surrounding areas of the state. This plant thrives in sandy soils and is often seen in heathlands and coastal dunes. It is well adapted to the dry and warm climate of the region. Acacia excentrica plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia excentrica was mainly introduced to control soil erosion and as a forage plant in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. The plant thrives in disturbed soils and is often used for land rehabilitation projects. Its rapid growth and ability to fix nitrogen make it a valuable species for ecological restoration. However, it can become invasive in some regions if not managed properly."
}
