{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catechu var. catechuoides",
    "plant_slug": "acacia-catechu-var-catechuoides",
    "plant_name_scientific": "acacia catechu var. catechuoides",
    "intro": "Acacia catechu var. catechuoides, commonly known as the Indian blackwood, is a deciduous shrub or small tree native to the Indian subcontinent. It is characterized by its slender, often twisted branches and bipinnate leaves composed of numerous small, oval leaflets. The plant produces yellowish-green, globular inflorescences that bear small, fragrant flowers. Its most notable feature is the production of a dark brown to black resin, which has been traditionally used in dyeing and tanning. The plant is also valued for its hard, durable wood, which is used in furniture and musical instruments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catechu var. catechuoides is primarily native to southern and eastern Africa, including countries such as South Africa, Mozambique, Tanzania, and Madagascar. It thrives in tropical and subtropical regions, often found in dry savannas and woodland areas. This species is well adapted to arid and semi-arid climates, making it a common component of the local flora. It is also occasionally found in parts of Southeast Asia, though its primary range remains in Africa. The plant is known for its hardy nature and is sometimes used in traditional medicine and for tannin extraction.",
    "distribution_introduced_art_desc": "Acacia catechu var. catechuoides was mainly introduced to areas where it can thrive in tropical and subtropical climates with well-drained soils. It is commonly found in regions of Southeast Asia, including parts of India, China, and Indonesia. This plant is often cultivated for its timber and traditional uses in medicine and dye production. Its introduction has been driven by both ecological and economic factors. However, it can sometimes become invasive in non-native environments if not managed properly."
}
