{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptopetala",
    "plant_slug": "acacia-leptopetala",
    "plant_name_scientific": "acacia leptopetala",
    "intro": "Acacia leptopetala, commonly known as the narrow-petaled wattle, is a shrub native to Australia. It is characterized by its slender, wiry stems and small, yellow flowers that bloom in late spring. The plant produces flat, pod-like fruits that contain several seeds. It thrives in well-drained soils and is often found in dry, open habitats. Acacia leptopetala is valued for its ornamental appeal and its role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leptopetala"
    },
    "taxonomy_art_desc": "Acacia leptopetala belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia leptopetala, a specific type of acacia known for its slender petals and adapted to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptopetala is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is particularly associated with the Nullarbor Plain and surrounding areas. Acacia leptopetala is well adapted to the harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia leptopetala was mainly introduced to areas with well-drained soils and a temperate to subtropical climate, often found in regions with mild winters and warm, dry summers. It thrives in open landscapes such as grasslands, rocky slopes, and disturbed sites where it can establish quickly. This plant is commonly used in reforestation and erosion control due to its hardy nature and ability to fix nitrogen in the soil. Its introduction has been documented in parts of the United States, Australia, and New Zealand, where it has become naturalized in some regions. However, it is considered invasive in certain areas, where it can outcompete native vegetation."
}
