{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella igualensis",
    "plant_slug": "acaciella-igualensis",
    "plant_name_scientific": "acaciella igualensis",
    "intro": "Acaciella igualensis, commonly known as the Iguales acacia, is a shrub native to the Andean region of South America. It belongs to the Fabaceae family, which is characterized by its leguminous properties and often nitrogen-fixing capabilities. The plant features small, compound leaves and produces yellow flowers that attract pollinators such as bees and butterflies. Its seeds are encased in a woody pod, typical of many legumes, and are dispersed by wind or animals. Acaciella igualensis is adapted to dry and rocky environments, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella igualensis"
    },
    "taxonomy_art_desc": "Acaciella igualensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often leguminous. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acaciella, a group of flowering plants native to South America, often found in dry and rocky habitats. Its species is Acaciella igualensis, a specific plant species endemic to Ecuador, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mexico Central",
        "Mexico Northeast",
        "Mexico Southwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella igualensis is primarily native to Mexico Central, Mexico Northeast, and Mexico Southwest. This plant is found in the region encompassing these areas, where it thrives in its natural habitat. It is commonly associated with dry and semi-arid environments within these regions. The distribution of Acaciella igualensis is largely confined to these specific parts of Mexico. Its presence in these areas highlights its adaptation to the local climate and soil conditions.",
    "distribution_introduced_art_desc": "Acaciella igualensis was mainly introduced to the region of Ecuador, specifically in the provinces of Ibarra and Latacunga. It is commonly found in dry forests and secondary growth areas. The plant is adapted to arid and semi-arid conditions, making it suitable for reforestation efforts. It has been used in local ecological restoration projects due to its resilience and ability to thrive in poor soil conditions. Its introduction has helped in stabilizing soil and preventing erosion in the region."
}
