{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia melanoxylon f. frutescens",
    "plant_slug": "acacia-melanoxylon-f-frutescens",
    "plant_name_scientific": "acacia melanoxylon f. frutescens",
    "intro": "Acacia melanoxylon f. frutescens, commonly known as the red bloodwood, is a shrub or small tree native to southern Australia. It is characterized by its dense, gnarled trunk and dark reddish-brown bark that peels in thin, flaky layers. The plant produces small, yellowish-green flowers arranged in spherical clusters, which are followed by flat, leathery pods. Its leaves are bipinnate, consisting of multiple pairs of small, oval-shaped leaflets. This form is a compact variant of the species, adapted to harsh, dry environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia melanoxylon f. frutescens is primarily native to southern Australia, including the states of South Australia, Victoria, and Tasmania. This form is typically found in dry sclerophyll forests and woodlands. It thrives in regions with a Mediterranean climate characterized by dry summers and wet winters. The plant is well adapted to nutrient-poor soils and can tolerate drought conditions. It plays an important ecological role in its native habitat by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia melanoxylon f. frutescens was mainly introduced to South Africa for its ornamental value and potential use in erosion control. It is commonly found in coastal and inland regions, particularly in the Western Cape and Eastern Cape provinces. This form is characterized by its compact growth habit and smaller leaves compared to the typical acacia. It thrives in well-drained soils and is often used in landscaping due to its hardiness and aesthetic appeal. However, it requires careful management to prevent it from becoming invasive in local ecosystems."
}
