{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia unguicula",
    "plant_slug": "acacia-unguicula",
    "plant_name_scientific": "acacia unguicula",
    "intro": "Acacia unguicula, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often zigzagging stems and small, phyllodes that are typically narrow and pointed. The plant produces yellow floral spikes that bloom in spring, attracting a variety of pollinators. It is well adapted to arid and semi-arid environments, with a deep root system that allows it to survive in drought conditions. Acacia unguicula is also valued for its hardy nature and is often used in landscaping and erosion control.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia unguicula"
    },
    "taxonomy_art_desc": "Acacia unguicula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their distinctive acorn-like seed pods. Its species is Acacia unguicula, a specific type of acacia found in Australia, known for its small, clustered flowers and unique seed structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia unguicula is primarily native to Western Australia. It is commonly found in the regions of the Pilbara and the Mid West. This plant typically grows in sandy soils and is often associated with coastal and inland dunes. It is well adapted to the arid and semi-arid climates of its native range. Acacia unguicula plays an important role in the local ecosystem and is a characteristic feature of the native vegetation in Western Australia.",
    "distribution_introduced_art_desc": "Acacia unguicula was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. The plant is often used in restoration projects due to its ability to stabilize soil and provide habitat for native wildlife. Its introduction has sometimes led to competition with native species in certain ecosystems. Despite its benefits, it requires careful management to prevent it from becoming invasive."
}
