{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia myrtifolia f. angustifolia",
    "plant_slug": "acacia-myrtifolia-f-angustifolia",
    "plant_name_scientific": "acacia myrtifolia f. angustifolia",
    "intro": "Acacia myrtifolia f. angustifolia, commonly known as the narrow-leaved golden wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, lance-shaped leaves and bright yellow flowers that appear in clusters. The plant belongs to the Fabaceae family, which includes legumes, and it has a symbiotic relationship with nitrogen-fixing bacteria. It thrives in well-drained soils and is often found in coastal and sandy environments. This variety is valued for its ornamental appeal and ecological benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia myrtifolia f. angustifolia is primarily native to the arid and semi-arid regions of Australia, particularly in the states of Queensland, New South Wales, and South Australia. This plant thrives in sandy or rocky soils and is commonly found in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of these regions, including high temperatures and low rainfall. The subspecies is known for its narrow, linear leaves and its ability to withstand drought. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia myrtifolia f. angustifolia was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in coastal regions and inland areas with mild winters. It thrives in full sun and is commonly used in landscaping for its ornamental value and drought tolerance. This form is particularly adapted to sandy or loamy soils and is often found in disturbed sites such as roadsides and clearings. Its introduction has been noted in several regions of Australia and parts of the Mediterranean. However, it is considered an invasive species in some areas where it outcompetes native vegetation."
}
