{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia celastrifolia",
    "plant_slug": "acacia-celastrifolia",
    "plant_name_scientific": "acacia celastrifolia",
    "intro": "Acacia celastrifolia, commonly known as the strangled acacia, is a tropical shrub or small tree native to parts of Africa and the Arabian Peninsula. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and small, yellow flowers. The plant is notable for its ability to fix nitrogen through symbiotic relationships with nitrogen-fixing bacteria in its root nodules. Its seeds are enclosed in woody pods and are often dispersed by animals. Acacia celastrifolia is also known for its role in traditional medicine and as a source of timber in its native regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia celastrifolia"
    },
    "taxonomy_art_desc": "Acacia celastrifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some flowering plants. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped or flattened compound leaves. Its species is Acacia celastrifolia, a specific type of acacia native to certain regions, known for its unique leaf structure and ecological importance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia celastrifolia is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils and Mediterranean climate conditions. This species thrives in coastal and inland areas, often growing in open woodlands and heathlands. It is well adapted to the dry and nutrient-poor environments typical of its native range. The plant plays an important ecological role in supporting local wildlife and maintaining biodiversity in its habitat.",
    "distribution_introduced_art_desc": "Acacia celastrifolia was mainly introduced to areas with warm, dry climates and well-drained soils, often as an ornamental or for its hardy characteristics. It is commonly found in regions of Australia, particularly in the arid and semi-arid zones of Western Australia and South Australia. The plant has also been introduced to parts of New Zealand and some Pacific islands due to its adaptability and aesthetic appeal. However, in some regions, it has become invasive, outcompeting native vegetation. Its distribution is largely driven by human activity and its ability to thrive in disturbed environments."
}
