{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia penninervis var. impressa",
    "plant_slug": "acacia-penninervis-var-impressa",
    "plant_name_scientific": "acacia penninervis var. impressa",
    "intro": "Acacia penninervis var. impressa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, linear leaves that are often slightly curved and have a distinctive impressed midrib. The plant produces yellow globular flower heads that bloom in spring, attracting various pollinators. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The species is valued for its ornamental appeal and ability to stabilize soil in erosion-prone areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia penninervis var. impressa is primarily native to the eastern and southern regions of Africa, including countries such as South Africa, Kenya, Tanzania, and Mozambique. It is commonly found in savanna woodlands and rocky outcrops where it thrives in well-drained soils. This variant is adapted to semi-arid and arid climates, making it a resilient species in these environments. It plays an important ecological role by providing habitat and food for various wildlife species. The plant is also valued for its hard wood and has been used traditionally by local communities.",
    "distribution_introduced_art_desc": "Acacia penninervis var. impressa was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has since become naturalized in certain regions, particularly in coastal and disturbed areas. The plant's rapid growth and ability to thrive in harsh environments have led to its spread beyond cultivated areas. However, its introduction has raised concerns due to potential ecological impacts on native ecosystems. Despite its ornamental value, management strategies are being developed to control its spread and minimize its invasive potential."
}
