{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elephantorrhiza",
    "plant_slug": "acacia-elephantorrhiza",
    "plant_name_scientific": "acacia elephantorrhiza",
    "intro": "Acacia elephantorrhiza, commonly known as the African umbrella thorn, is a deciduous shrub or small tree native to southern Africa. It is characterized by its distinctive umbrella-like crown formed by its long, drooping branches. The plant has phyllodes, which are flattened, leaf-like structures that perform photosynthesis. It produces yellow flowers followed by pods containing edible seeds. Acacia elephantorrhiza is adapted to arid environments and plays an important role in local ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia elephantorrhiza is primarily native to the savannas and grasslands of southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It thrives in arid and semi-arid environments, often found in rocky soils and along riverbanks. This species is well adapted to the hot and dry climate of its native range. It plays an important ecological role by providing food and shelter for various wildlife species. Its distribution is closely linked to the availability of water and suitable soil conditions in its habitat.",
    "distribution_introduced_art_desc": "Acacia elephantorrhiza was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is commonly found in the Eastern Cape and KwaZulu-Natal provinces. The plant thrives in disturbed soils and can outcompete native vegetation. Its rapid growth and ability to form dense thickets make it a significant ecological concern. Efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
