{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia buxifolia",
    "plant_slug": "acacia-buxifolia",
    "plant_name_scientific": "acacia buxifolia",
    "intro": "Acacia buxifolia, commonly known as the boxleaf acacia, is a small evergreen shrub native to southern Africa. It features dense, dark green foliage with leaves that are small, ovate, and have a leathery texture. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits containing seeds. It thrives in well-drained soil and is often used in horticulture for its ornamental value. Acacia buxifolia is also valued for its ability to tolerate drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia buxifolia"
    },
    "taxonomy_art_desc": "Acacia buxifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by the presence of vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and a variety of stamen arrangements. Its family is Fabaceae, commonly known as the legume family, characterized by the distinctive pod-like fruits and nitrogen-fixing capabilities. Its genus is Acacia, a group of flowering plants commonly known as wattles, which are often found in arid and tropical regions. Its species is Acacia buxifolia, a specific type of acacia known for its small, leathery leaves and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia buxifolia is primarily native to New South Wales, Queensland, and Victoria. This shrub or small tree is commonly found in dry to semi-arid regions within these states. It thrives in sandy or loamy soils and is often seen in open woodlands and grasslands. The plant is well adapted to the local climate and can tolerate periods of drought. Its distribution reflects its preference for the specific environmental conditions found in these areas.",
    "distribution_introduced_art_desc": "Acacia buxifolia was mainly introduced to India. It is commonly found in the states of Tamil Nadu, Kerala, and Karnataka. The plant is often cultivated for its ornamental value and is used in landscaping. It thrives in tropical and subtropical climates with well-drained soil. However, it has also been reported to spread beyond cultivated areas, raising concerns about its invasive potential."
}
