{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nudiflora",
    "plant_slug": "acacia-nudiflora",
    "plant_name_scientific": "acacia nudiflora",
    "intro": "Acacia nudiflora, commonly known as the desert wattle, is a shrub native to arid regions of Australia. It is characterized by its slender, wiry stems and small, scale-like leaves that reduce water loss. The plant produces yellow flowers in summer, which are clustered in cylindrical spikes. It is well adapted to harsh environments, with deep roots that access groundwater. Acacia nudiflora plays an important role in stabilizing soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nudiflora is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the central and western parts of the country, including areas such as Queensland, South Australia, and the Northern Territory. This plant thrives in sandy soils and is often associated with spinifex plains and salt lakes. It is well adapted to harsh environmental conditions, including high temperatures and low rainfall. Acacia nudiflora plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia nudiflora was mainly introduced to areas with well-drained soils and a warm, temperate climate, often in regions where it has been used for erosion control and as a source of timber. It thrives in full sun and is commonly found in coastal dunes and sandy soils. The plant is known for its ability to fix nitrogen, which enhances soil fertility and supports the growth of other plant species. Due to its hardy nature, it has been introduced to several regions beyond its native range. However, its spread can sometimes lead to ecological concerns if it outcompetes native vegetation."
}
