{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paraensis",
    "plant_slug": "acacia-paraensis",
    "plant_name_scientific": "acacia paraensis",
    "intro": "Acacia paraensis, commonly known as the Brazilian wattle, is a flowering plant native to Brazil. It belongs to the Fabaceae family, which is characterized by its pod fruits and often nitrogen-fixing abilities. The plant features slender, zigzagging branches and produces small, yellow flowers clustered in cylindrical inflorescences. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acacia paraensis is adapted to tropical and subtropical climates, often found in savannas and woodland areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia paraensis is primarily native to the Brazilian states of Pará and Maranhão. It is found in the Atlantic Forest biome, specifically in the eastern part of the Amazon region. This plant typically grows in humid, tropical environments with well-drained soils. It is commonly found in secondary forests and along riverbanks. Acacia paraensis plays an important ecological role in its native habitat by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia paraensis was mainly introduced to regions with tropical and subtropical climates, particularly in South America. It thrives in well-drained soils and full sunlight, making it suitable for arid and semi-arid environments. This plant is commonly found in areas such as Brazil, Argentina, and Paraguay. It has been used for its hardy nature and potential for erosion control. Its introduction has also been noted in some parts of Africa and Southeast Asia for similar ecological benefits."
}
