{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mollis",
    "plant_slug": "acacia-mollis",
    "plant_name_scientific": "acacia mollis",
    "intro": "Acacia mollis, commonly known as the silky acacia, is a shrub or small tree native to South Africa. It is characterized by its slender, often branched stems and feathery, finely divided leaves that give it a delicate appearance. The plant produces small, yellow flowers arranged in globular inflorescences, which are highly attractive to pollinators such as bees and birds. Its foliage is often covered in a fine, silky hair, contributing to its common name. Acacia mollis is drought-tolerant and thrives in well-drained soils, making it suitable for xeriscaping in arid regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mollis is primarily native to Australia, specifically found in the arid and semi-arid regions of the central and western parts of the country. It is commonly found in areas such as South Australia, Western Australia, and the Northern Territory. This plant thrives in sandy or gravelly soils and is often seen in shrublands and open woodlands. It is well adapted to dry conditions and can tolerate high temperatures. Acacia mollis is an important component of the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia mollis was mainly introduced to areas with well-drained soils and full sun exposure. It is commonly found in regions with a Mediterranean climate. This plant is often used in landscaping due to its ornamental value and drought tolerance. It can thrive in coastal areas and is resistant to salt spray. However, it may become invasive in certain environments if not managed properly."
}
