{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia biflora var. aurea",
    "plant_slug": "acacia-biflora-var-aurea",
    "plant_name_scientific": "acacia biflora var. aurea",
    "intro": "Acacia biflora var. aurea, commonly known as the golden wattle, is a flowering plant native to Australia. It is characterized by its distinctive yellow flowers that bloom in late winter to early spring. The plant has bipinnate leaves, which are divided into small, feather-like segments. It thrives in well-drained soils and is often found in open woodlands and heathlands. The golden wattle is a symbol of Australia and is widely cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia biflora var. aurea is primarily native to the coastal regions of southern Australia, including parts of New South Wales and Victoria. This variety is commonly found in sandy soils along the coastline, often in dune systems and open woodlands. It thrives in areas with a temperate climate and is adapted to withstand coastal conditions such as salt spray and strong winds. The plant is also sometimes referred to as the golden wattle, though it is a variant of the more well-known Acacia biflora. It plays an important ecological role in stabilizing dunes and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia biflora var. aurea was mainly introduced to enhance the aesthetic value of urban landscapes and gardens due to its striking yellow foliage. It is commonly found in coastal regions and sandy soils where it thrives in full sun conditions. This variety is prized for its ornamental qualities, making it a popular choice for landscaping in temperate climates. However, it requires regular watering and well-drained soil to prevent root rot. Its introduction has also contributed to the biodiversity of certain garden ecosystems."
}
