{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mabellae",
    "plant_slug": "acacia-mabellae",
    "plant_name_scientific": "acacia mabellae",
    "intro": "Acacia mabellae, commonly known as the Mabellae wattle, is a shrub or small tree native to Western Australia. It is characterized by its feathery, bipinnate leaves and produces yellow flowers in late winter to early spring. The plant is adapted to arid and semi-arid environments, showcasing drought tolerance. Its flowers are often visited by nectar-feeding birds and insects, contributing to local biodiversity. The wood of Acacia mabellae is hard and durable, historically used by Indigenous Australians for tool-making.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mabellae"
    },
    "taxonomy_art_desc": "Acacia mabellae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and specialized structures for water transport. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and some flowering plants, and is known for its evolutionary significance. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by its floral structure and pollen types. Its order is Fabales, which consists of flowering plants with legumes, often characterized by symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is notable for its nitrogen-fixing capabilities and diverse morphological features. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa and Australia, known for their thorn-like stems and pod fruits. Its species is Acacia mabellae, a specific type of acacia found in certain regions of Africa, characterized by its unique morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mabellae is primarily native to New South Wales. It is found in the southern and central regions of the state, particularly in areas with sandy or gravelly soils. This plant typically grows in dry, open habitats such as woodlands and grasslands. It is well adapted to the local climate and soil conditions of New South Wales. Its distribution is largely restricted to specific ecological zones within the state.",
    "distribution_introduced_art_desc": "Acacia mabellae was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is often cultivated for its ornamental value due to its unique foliage and ability to withstand drought conditions. It has been introduced to several parts of the United States, including California and Texas. However, it is important to monitor its spread to prevent potential ecological impacts in native habitats."
}
