{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heteroneura var. petila",
    "plant_slug": "acacia-heteroneura-var-petila",
    "plant_name_scientific": "acacia heteroneura var. petila",
    "intro": "Acacia heteroneura var. petila, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping branches and narrow, greenish-yellow phyllodes that are typically less than 5 cm in length. The plant produces yellow globular flower heads, which are clustered in dense, cylindrical spikes. It thrives in well-drained soils and is often found in dry, open habitats such as woodlands and grasslands. The species is valued for its ornamental appeal and is sometimes cultivated for erosion control and as a garden plant.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia heteroneura"
    },
    "taxonomy_art_desc": "Acacia heteroneura var. petila belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have flowers with five parts and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia heteroneura, a specific type of acacia that has a unique morphology and is found in particular geographic regions, with the varietal form petila distinguishing it from other varieties.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia heteroneura var. petila is primarily native to Western Australia. This variant of the species is found in the arid and semi-arid regions of the state. It typically grows in sandy soils and is adapted to the harsh environmental conditions of the region. The plant is commonly observed in areas with low rainfall and high temperatures. It plays an important ecological role in the local flora and fauna of Western Australia.",
    "distribution_introduced_art_desc": "Acacia heteroneura var. petila was mainly introduced to areas with well-drained soils and a temperate to subtropical climate. It is commonly found in regions with mild winters and warm, dry summers. This plant is often used in landscaping due to its drought tolerance and attractive foliage. It thrives in full sun and requires minimal maintenance once established. Its introduction has been noted in parts of southern Australia and the southwestern United States."
}
