{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ovoidea var. tenuifolia",
    "plant_slug": "acacia-ovoidea-var-tenuifolia",
    "plant_name_scientific": "acacia ovoidea var. tenuifolia",
    "intro": "Acacia ovoidea var. tenuifolia, commonly known as the narrow-leaved wattle, is a shrub native to southern Africa. It is characterized by its slender, elongated phyllodes that are typically less than 5 cm in length. The plant produces yellow globular flowers in late summer, which are clustered in dense, spherical inflorescences. It thrives in well-drained soils and is often found in coastal and rocky habitats. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ovoidea var. tenuifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland ecosystems. This variety is adapted to withstand high temperatures and low rainfall, making it a resilient plant in its native habitat. It is often seen growing along riverbanks and in coastal areas where it can access some moisture. The plant plays an important ecological role by providing habitat and food for various local wildlife species.",
    "distribution_introduced_art_desc": "Acacia ovoidea var. tenuifolia was mainly introduced to New Zealand. It was brought there for its ornamental value and potential for soil stabilization. The plant thrives in coastal and sandy environments, making it suitable for reforestation and erosion control. However, it has shown invasive tendencies in some areas, outcompeting native species. Its distribution is now largely limited to the northern and eastern regions of the country."
}
