{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia schlechteri",
    "plant_slug": "acacia-schlechteri",
    "plant_name_scientific": "acacia schlechteri",
    "intro": "Acacia schlechteri, commonly known as the Schlechter's wattle, is a shrub native to South Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features small, yellow flowers that bloom in spring, attracting pollinators such as bees and birds. Its root system is adapted to sandy soils, allowing it to thrive in arid environments. The bark and leaves have been traditionally used in herbal medicine for their potential health benefits.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia schlechteri is primarily native to the southern regions of Africa, specifically South Africa. It is found in the eastern and western parts of the country, including the Cape Province and the Eastern Cape. This species thrives in arid and semi-arid environments, often growing in rocky soils and on coastal dunes. It is commonly found in natural vegetation types such as fynbos and thicket. Acacia schlechteri is well adapted to the climate and ecological conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia schlechteri was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, particularly in fynbos vegetation. The plant spreads rapidly through its seed pods, which burst open when dry, dispersing seeds over long distances. Due to its aggressive growth, it can outcompete native plants and alter local ecosystems. Efforts are ongoing to control its spread and mitigate its impact on biodiversity."
}
