{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia barattensis",
    "plant_slug": "acacia-barattensis",
    "plant_name_scientific": "acacia barattensis",
    "intro": "Acacia barattensis, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging stems and bipinnate leaves composed of numerous small, thread-like leaflets. The plant produces yellow globular flower heads, which are typical of the Acacia genus. It thrives in arid and semi-arid environments, demonstrating drought tolerance. The species is also valued for its ornamental appeal and is sometimes used in reforestation efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia barattensis"
    },
    "taxonomy_art_desc": "Acacia barattensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and their relatives, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive leaf structures and often used in traditional medicine. Its species is Acacia barattensis, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia barattensis is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy soils and is often seen along roadsides and in open woodlands. It is well adapted to the harsh climate of the region. Acacia barattensis plays an important role in the local ecosystem and is a characteristic feature of the landscape in South Australia.",
    "distribution_introduced_art_desc": "Acacia barattensis was mainly introduced to New South Wales, Australia, as part of ecological restoration and land rehabilitation efforts. It is commonly found in dry sclerophyll forests and open woodlands, where it helps stabilize soil and prevent erosion. This species is valued for its ability to thrive in poor soil conditions and its role in providing habitat for native wildlife. However, its introduction has raised concerns about potential invasiveness in certain ecosystems. Despite these concerns, it remains an important component of reforestation projects in the region."
}
