{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spinii",
    "plant_slug": "acacia-spinii",
    "plant_name_scientific": "acacia spinii",
    "intro": "Acacia spinii, commonly known as the spinous acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its thorny stems and bipinnate leaves, which are adapted to reduce water loss in harsh environments. The plant produces yellow flowers in clusters, which are followed by pod-like fruits containing seeds. Acacia spinii is often used in traditional medicine and as a source of timber and fodder. Its ecological importance includes providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spinii is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in arid and semi-arid regions, particularly in rocky soils and coastal areas. This plant thrives in hot, dry climates and is often seen along the edges of deserts. It plays an important ecological role by providing shelter and food for local wildlife. Acacia spinii is also adapted to withstand salt spray, making it a common species in coastal dunes.",
    "distribution_introduced_art_desc": "Acacia spinii was mainly introduced to control soil erosion and provide shade in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its hardy nature and capacity to fix nitrogen, improving soil fertility. However, its introduction has sometimes led to the displacement of native vegetation in certain areas. Despite its benefits, careful management is required to prevent it from becoming invasive."
}
