{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia arabica var. indica",
    "plant_slug": "acacia-arabica-var-indica",
    "plant_name_scientific": "acacia arabica var. indica",
    "intro": "Acacia arabica var. indica, commonly known as the Indian acacia, is a shrub or small tree native to the Indian subcontinent. It is characterized by its slender, often thorned stems and bipinnate leaves composed of numerous small, oval leaflets. The plant produces yellow to orange flower clusters that bloom in spring, attracting pollinators such as bees and birds. Its seeds are encased in hard, woody pods, which are used in traditional medicine and as a source of tannins. The species is also valued for its ornamental appeal and is sometimes cultivated for its hardy nature in arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia arabica var. indica is primarily native to the Arabian Peninsula, particularly Saudi Arabia and Yemen. It is commonly found in coastal and inland regions with sandy or rocky soils. This variety thrives in arid and semi-arid climates, often growing in coastal dunes and scrublands. It is also present in parts of the Horn of Africa, including Somalia and Eritrea. The plant is well adapted to hot, dry environments and is often used for its timber and as a source of gum arabic.",
    "distribution_introduced_art_desc": "Acacia arabica var. indica was mainly introduced to regions with a warm, dry climate and well-drained soils, particularly in parts of southern Africa and the Arabian Peninsula. It is commonly found in areas with low rainfall and high sunlight exposure, where it thrives as a hardy shrub or small tree. This plant is often used for its ornamental value due to its distinctive foliage and ability to withstand harsh environmental conditions. It has also been introduced for erosion control and as a source of timber and fodder. Its distribution is largely limited to areas where it can establish itself without significant competition from native vegetation."
}
