{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia senegal var. pseudoglaucophylla",
    "plant_slug": "acacia-senegal-var-pseudoglaucophylla",
    "plant_name_scientific": "acacia senegal var. pseudoglaucophylla",
    "intro": "Acacia senegal var. pseudoglaucophylla, commonly known as the Sudan acacia, is a shrub or small tree native to the Sahel region of Africa. It is characterized by its slender, branching structure and phyllodes that are narrow and often glaucous in appearance. The plant produces yellow flowers in globular inflorescences, which are followed by elongated, flat pods containing seeds. It thrives in arid and semi-arid environments, often growing on sandy or rocky soils. The species is valued for its gum arabic production and its role in traditional medicine and land stabilization.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia senegal var. pseudoglaucophylla is primarily native to the Sahel region of Africa, including countries such as Sudan, Chad, Niger, and Mali. It thrives in semi-arid and arid environments, often found in savannas and along riverbanks. This variant is well adapted to dry climates with poor soil conditions. It plays an important ecological role in stabilizing soils and providing forage for livestock. Its distribution is closely linked to the availability of water and the specific climatic conditions of the Sahel.",
    "distribution_introduced_art_desc": "Acacia senegal var. pseudoglaucophylla was mainly introduced to areas with semi-arid to arid climates, where it thrives in well-drained sandy or loamy soils. It is commonly found in regions of Africa, particularly in countries like Sudan, Ethiopia, and Somalia. This variety is valued for its ability to tolerate drought and its potential for use in agroforestry systems. It has also been introduced to parts of the Arabian Peninsula and northern Australia for similar ecological and economic purposes. However, its spread is often limited by its specific climatic requirements and soil preferences."
}
