{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia levata",
    "plant_slug": "acacia-levata",
    "plant_name_scientific": "acacia levata",
    "intro": "Acacia levata, commonly known as the white acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces yellow flowers in globular clusters, which are followed by long, straight pods. It thrives in arid and semi-arid environments, showcasing its adaptability to harsh conditions. Acacia levata is also valued for its hardy nature and role in stabilizing soils in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia levata"
    },
    "taxonomy_art_desc": "Acacia levata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often primitive features. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants with distinctive flowers and often leguminous properties. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their acacia-like leaves and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia levata, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia levata is primarily native to Western Australia. It is commonly found in the coastal regions and sandplain areas of the state. This plant thrives in well-drained soils and is often seen in open woodlands and heathlands. It is well adapted to the dry and sunny conditions of the region. Acacia levata plays an important role in the local ecosystem and is a characteristic species of the Western Australian flora.",
    "distribution_introduced_art_desc": "Acacia levata was mainly introduced to areas with a Mediterranean climate, characterized by mild, wet winters and hot, dry summers. It thrives in well-drained soils and is commonly found in coastal regions and open woodlands. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. It has also been introduced to other parts of the world for ornamental purposes and as a source of timber. However, in some regions, it has become an invasive species, outcompeting native flora."
}
