{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia arabica var. adstringens",
    "plant_slug": "acacia-arabica-var-adstringens",
    "plant_name_scientific": "acacia arabica var. adstringens",
    "intro": "Acacia arabica var. adstringens, commonly known as the Egyptian acacia, is a shrub native to the Arabian Peninsula and northern Africa. It is characterized by its straight, slender branches and small, yellowish-green flowers that bloom in clusters. The plant produces flat, leaf-like phyllodes that are often mistaken for leaves, and it has a deep root system adapted to arid environments. Its bark and leaves contain tannins, making it valuable in traditional medicine and as a source of natural dye. The species is also notable for its role in the production of gum arabic, a substance used in food, pharmaceuticals, and industry.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia arabica var. adstringens is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It thrives in arid and semi-arid regions, often found in dry savannas and rocky soils. This variant is commonly associated with coastal and inland dry forest ecosystems. It is also present in parts of southern Arabia, particularly in the southern regions of the Arabian Peninsula. The plant is well adapted to the harsh climatic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia arabica var. adstringens was mainly introduced to regions with a warm, arid climate and well-drained soils, where it thrives in full sun. It is commonly found in areas of Australia, particularly in the northern and central regions, where it has been cultivated for its ornamental value and medicinal properties. The plant is well adapted to withstand drought conditions, making it a suitable species for xeriscaping and landscaping in dry environments. Its introduction has been largely driven by horticultural interests and traditional use in herbal medicine. However, its spread has also raised concerns about potential ecological impacts in non-native habitats."
}
