{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mbuluensis",
    "plant_slug": "acacia-mbuluensis",
    "plant_name_scientific": "acacia mbuluensis",
    "intro": "Acacia mbuluensis, commonly known as the Congo acacia, is a deciduous tree native to Central Africa. It is characterized by its slender, often multi-branched trunk and bipinnate leaves that are typically gray-green in color. The plant produces small, yellowish flowers arranged in dense, globular inflorescences, which are followed by flat, pod-like fruits. It thrives in moist, well-drained soils and is often found in rainforests or along riverbanks. Acacia mbuluensis plays a role in local ecosystems by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mbuluensis is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as Angola, the Democratic Republic of the Congo, and Tanzania. It thrives in dry to semi-arid environments, often found in savannas and woodland areas. This species is well adapted to poor soils and can withstand periods of drought. It is commonly found in open habitats with moderate to high sunlight exposure. Acacia mbuluensis plays an important ecological role in its native range, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia mbuluensis was mainly introduced to areas with semi-arid to arid climates, where it thrives in well-drained soils. It is commonly found in savannas and rocky outcrops, often forming dense shrubs or small trees. This plant is valued for its ability to withstand drought and its role in soil stabilization. It is also used in traditional medicine and as a source of fuelwood in some regions. Its introduction has helped in restoring degraded lands in parts of Africa."
}
