{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia atacorensis",
    "plant_slug": "acacia-atacorensis",
    "plant_name_scientific": "acacia atacorensis",
    "intro": "Acacia atacorensis, commonly known as the Atacorensis acacia, is a shrub or small tree native to South America, particularly found in Brazil and Peru. It belongs to the Fabaceae family, which is characterized by its pod fruits and often nitrogen-fixing abilities. The plant has bipinnate leaves, meaning they are divided into two sets of smaller leaflets, and produces yellow flowers that attract pollinators. Its bark and leaves have been used traditionally in local medicine for their purported healing properties. Acacia atacorensis is also valued for its hard, durable wood, which is used in construction and crafts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia atacorensis is primarily native to the Amazon Basin, specifically in parts of northern South America. It is found in countries such as Brazil, Colombia, and Venezuela. This plant thrives in tropical and subtropical regions, often in moist, well-drained soils. It is commonly found in forested areas and along riverbanks. Its distribution is closely linked to the humid climate and rich biodiversity of the Amazon region.",
    "distribution_introduced_art_desc": "Acacia atacorensis was mainly introduced to South America, particularly in countries like Brazil, Argentina, and Paraguay. It was brought there for its potential in soil stabilization and as a source of timber and forage. The plant thrives in tropical and subtropical climates, making it well-suited for the regions where it has been introduced. However, it has raised concerns due to its potential to become invasive in certain ecosystems. Its distribution is now expanding beyond its original range, prompting further ecological studies."
}
