{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nilotica subsp. adansonii",
    "plant_slug": "acacia-nilotica-subsp-adansonii",
    "plant_name_scientific": "acacia nilotica subsp. adansonii",
    "intro": "Acacia nilotica subsp. adansonii, commonly known as the white acacia, is a shrub or small tree native to Africa and the Arabian Peninsula. It is characterized by its slender, often spiny stems and bipinnate leaves that are typically gray-green in color. The plant produces yellow, globular inflorescences that attract pollinators such as bees and birds. Its seeds are encased in a fibrous pod, and the plant is adapted to arid and semi-arid environments. It is often used in traditional medicine and has ecological importance in stabilizing soils in degraded areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nilotica subsp. adansonii is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in dry, semi-arid regions and is commonly found in savannas and woodland areas. This subspecies is well adapted to hot and arid climates, often growing along riverbanks and in rocky soils. It plays an important ecological role by providing habitat and food for various wildlife species. Additionally, it has been used traditionally for its timber, fuel, and medicinal properties.",
    "distribution_introduced_art_desc": "Acacia nilotica subsp. adansonii was mainly introduced to regions with a warm, dry climate and well-drained soils, often in areas where it is used for its hardy nature and drought tolerance. It is commonly found in parts of Africa, the Middle East, and South Asia, where it has been introduced for ornamental purposes and as a source of timber and fuelwood. This subspecies is also cultivated in arid and semi-arid regions for its ability to thrive in poor soil conditions. Its introduction has sometimes led to ecological impacts, including competition with native vegetation. Despite this, it remains a valuable plant for land stabilization and traditional uses in many communities."
}
