{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia denudata var. spinosissima",
    "plant_slug": "acacia-denudata-var-spinosissima",
    "plant_name_scientific": "acacia denudata var. spinosissima",
    "intro": "Acacia denudata var. spinosissima, commonly known as the spiny wattle, is a shrub native to Australia. It is characterized by its slender, spiny stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It is adapted to arid and semi-arid environments, showing drought tolerance and a preference for well-drained soils. This variety is notable for its distinctive spines and is often used in landscaping for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia denudata var. spinosissima is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. This variant is commonly found in savannas, grasslands, and rocky outcrops where it thrives in well-drained soils. It is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. The plant often grows as a shrub or small tree, and it plays an important role in providing habitat and food for local wildlife. Its distribution is closely linked to the specific ecological conditions of the region.",
    "distribution_introduced_art_desc": "Acacia denudata var. spinosissima was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coast and in coastal dunes. The plant is often used for erosion control due to its extensive root system. It is also valued for its hardiness and ability to thrive in arid conditions. However, its introduction has raised concerns about its potential to become invasive in local ecosystems."
}
