{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amputata",
    "plant_slug": "acacia-amputata",
    "plant_name_scientific": "acacia amputata",
    "intro": "Acacia amputata, commonly known as the yellow acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and small, bipinnate leaves. The plant produces yellow globular flower heads that appear in spring, attracting various pollinators. Its wood is lightweight and has been traditionally used for making furniture and tools. Acacia amputata is also valued for its ability to thrive in arid conditions, making it an important species in dryland ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia amputata"
    },
    "taxonomy_art_desc": "Acacia amputata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a variety of floral structures. Its order is Fabales, which comprises plants with flowers that typically have five petals and include legumes, which are known for their nitrogen-fixing ability. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a group of flowering plants commonly known as wattles, which are native to Australia and are characterized by their acicular leaves and pod fruits. Its species is Acacia amputata, a specific type of acacia known for its unique morphology and ecological adaptations, often found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amputata is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the southern and western parts of the state. This species is well adapted to the arid and semi-arid climates of its native range. It often grows in open woodlands and shrublands, thriving in well-drained soils. Acacia amputata plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia amputata was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of southern Africa, including South Africa, Namibia, and Botswana. This plant is often used for its hardy nature and ability to withstand drought conditions. It has been introduced to various parts of the world as an ornamental plant due to its unique appearance. However, it can sometimes become invasive in non-native environments if not managed properly."
}
