{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kraussiana subsp. madagascariensis",
    "plant_slug": "acacia-kraussiana-subsp-madagascariensis",
    "plant_name_scientific": "acacia kraussiana subsp. madagascariensis",
    "intro": "Acacia kraussiana subsp. madagascariensis, commonly known as the Madagascar acacia, is a shrub or small tree native to Madagascar. It is characterized by its bipinnate leaves, which are divided into numerous small leaflets, and its yellow, globular flower heads. The plant produces long, thin pods that contain seeds with a tuft of silky hair. It thrives in dry, arid environments and is often found in coastal and inland regions of Madagascar. This subspecies is notable for its ecological importance and is sometimes cultivated for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kraussiana subsp. madagascariensis is primarily native to Madagascar. It is found in the eastern part of the island, particularly in the humid forests and coastal areas. This subspecies thrives in tropical and subtropical climates with high rainfall. It is commonly observed in lowland and midland regions with well-drained soils. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia kraussiana subsp. madagascariensis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often along the edges of forests and in disturbed habitats. The plant is valued for its hardy nature and ability to thrive in harsh environmental conditions. It has been used in reforestation projects due to its rapid growth and nitrogen-fixing capabilities. However, its introduction has raised concerns about potential invasiveness in local ecosystems."
}
