{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia seyal var. fistula",
    "plant_slug": "acacia-seyal-var-fistula",
    "plant_name_scientific": "acacia seyal var. fistula",
    "intro": "Acacia seyal var. fistula, commonly known as the pale acacia, is a shrub or small tree native to the arid regions of Africa. It is characterized by its long, slender, yellow to brown stipules and its narrow, green, trifoliate leaves. The plant produces yellow flowers that are clustered in cylindrical inflorescences, followed by flat, pod-like fruits containing seeds. It is adapted to survive in dry conditions, with deep roots that allow it to access water from deeper soil layers. This species is often used in traditional medicine and for its hard, durable wood.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia seyal var. fistula is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of the Arabian Peninsula, particularly in Yemen and Oman. This plant thrives in arid and semi-arid environments, often growing in savannas and along rocky outcrops. It is well adapted to high temperatures and low rainfall, making it a common species in desert and dry woodland regions. Its distribution extends into northern Kenya and southern Sudan as well.",
    "distribution_introduced_art_desc": "Acacia seyal var. fistula was mainly introduced to provide shade and for its durable wood, which is used in construction and furniture making. It is also valued for its ability to thrive in arid and semi-arid environments, making it useful for land rehabilitation and soil stabilization. The plant has been introduced to several regions in Africa, including Ethiopia, Kenya, and Somalia, where it is cultivated for both ecological and economic benefits. Its introduction has helped in combating desertification and supporting local livelihoods through timber and fodder production. However, it can become invasive in some areas if not managed properly."
}
