{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia iteaphylla",
    "plant_slug": "acacia-iteaphylla",
    "plant_name_scientific": "acacia iteaphylla",
    "intro": "Acacia iteaphylla, commonly known as the silver wattle, is a small shrub or tree native to Australia. It is characterized by its slender, often twisted branches and small, feathery leaves that give it a distinctive appearance. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Its leaves are covered in fine, silvery hairs, contributing to its common name. Acacia iteaphylla is well adapted to dry, sandy soils and is often found in coastal and inland regions of southern Australia.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia iteaphylla"
    },
    "taxonomy_art_desc": "Acacia iteaphylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have legumes as fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of flowering plants commonly known as wattles, which are found mainly in Australia and are known for their distinctive foliage and flowers. Its species is Acacia iteaphylla, a specific type of acacia native to Australia, recognized for its unique leaf structure and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [
        "New South Wales",
        "Victoria",
        "Western Australia"
    ],
    "distribution_native_art_desc": "Acacia iteaphylla is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of the region. Its distribution is largely restricted to the southern parts of South Australia.",
    "distribution_introduced_art_desc": "Acacia iteaphylla was mainly introduced to New South Wales, Victoria, and Western Australia. It is commonly found in dry, sandy soils and is often used in revegetation projects. The plant is valued for its hardy nature and ability to thrive in arid conditions. It has become naturalized in some areas, contributing to local ecosystems. However, its spread is generally limited to the regions where it was initially introduced."
}
