{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata var. bartheriana",
    "plant_slug": "acacia-armata-var-bartheriana",
    "plant_name_scientific": "acacia armata var. bartheriana",
    "intro": "Acacia armata var. bartheriana, commonly known as the Barther's wattle, is a shrub native to Australia. It is characterized by its slender, wiry stems and small, yellow flowers arranged in dense, globular clusters. The leaves are phyllodes, which are flattened leaf stalks that function as the primary photosynthetic organs. It thrives in sandy soils and is often found in coastal and inland regions. This variety is noted for its hardy nature and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata var. bartheriana is primarily native to the arid regions of southern Africa, particularly in Namibia and South Africa. It is commonly found in the Namib Desert and the Kalahari Desert, where it thrives in sandy and gravelly soils. This variant is well adapted to harsh, dry environments and often grows along dunes or in open shrublands. It is a small shrub that plays an important role in stabilizing sand dunes and providing habitat for local wildlife. Due to its resilience, it is also found in parts of Botswana and Angola.",
    "distribution_introduced_art_desc": "Acacia armata var. bartheriana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape, thriving in coastal and semi-arid environments. This variety is often cultivated for its ornamental value due to its distinctive foliage and ability to withstand drought conditions. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact and management in local ecosystems."
}
