{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lirellata",
    "plant_slug": "acacia-lirellata",
    "plant_name_scientific": "acacia lirellata",
    "intro": "Acacia lirellata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, linear leaves and yellow flower spikes that bloom in spring. The plant is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia lirellata is often used in reforestation and soil stabilization due to its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lirellata"
    },
    "taxonomy_art_desc": "Acacia lirellata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and specialized structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of parts. Its family is Fabaceae, commonly known as the legume family, characterized by pods as fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped flower heads and often used in traditional medicine. Its species is Acacia lirellata, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lirellata is primarily native to Western Australia. It is commonly found in the region's coastal and inland areas, particularly in sandy soils. This plant thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the dry climate and can tolerate poor soil conditions. Acacia lirellata plays an important role in the local ecosystem by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia lirellata was mainly introduced to New Zealand as part of ecological restoration efforts and for its ornamental value. It was introduced in the late 19th century and has since become naturalized in various regions across the country. The plant is now considered a potential weed in some areas due to its rapid growth and ability to spread aggressively. It thrives in a variety of soil types and is tolerant of both drought and poor soil conditions. Despite its benefits, its spread has raised concerns among land managers due to its invasive potential."
}
