{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptoclada",
    "plant_slug": "acacia-leptoclada",
    "plant_name_scientific": "acacia leptoclada",
    "intro": "Acacia leptoclada, commonly known as the slender acacia, is a shrub native to the arid and semi-arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in compact, globular clusters, which are typical of the Acacia genus. It is well adapted to drought conditions, with deep root systems that allow it to survive in nutrient-poor soils. The plant is also valued for its hard, durable wood and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leptoclada"
    },
    "taxonomy_art_desc": "Acacia leptoclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their simple, often primitive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes and are known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees found mainly in Africa and Australia, known for their unique, often thorn-like structures and nitrogen-fixing abilities. Its species is Acacia leptoclada, a specific type of acacia found in certain regions of Australia, characterized by its slender, upright growth and adaptations to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptoclada is primarily native to New South Wales. It is commonly found in the coastal regions and sandplain areas of the state. This plant thrives in sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the local climate and plays an important role in the ecosystem. Its distribution is largely restricted to the eastern parts of New South Wales.",
    "distribution_introduced_art_desc": "Acacia leptoclada was mainly introduced to control soil erosion and as a source of timber and fuelwood in arid and semi-arid regions. It is commonly found in degraded lands where it helps stabilize the soil and prevent further degradation. The plant is also used for its nitrogen-fixing properties, which improve soil fertility in agricultural areas. Due to its hardiness, it has been widely planted in regions with low rainfall and poor soil quality. However, its introduction has sometimes led to the displacement of native vegetation, raising concerns about its ecological impact."
}
