{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rotundifolia",
    "plant_slug": "acacia-rotundifolia",
    "plant_name_scientific": "acacia rotundifolia",
    "intro": "Acacia rotundifolia, commonly known as the globe acacia, is a shrub or small tree native to southern Africa. It is characterized by its globular, rounded leaves that are clustered at the ends of its branches. The plant produces yellow flowers in winter, which are clustered in spherical heads. Its small, pod-like fruits contain seeds that are dispersed by wind. Acacia rotundifolia is well adapted to arid and semi-arid environments, making it a hardy and drought-resistant species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rotundifolia is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It thrives in arid and semi-arid regions, often found in rocky outcrops and savanna woodlands. The plant is well adapted to hot, dry climates and can tolerate poor soil conditions. It is commonly seen in the Karoo and Succulent Karoo biomes. Acacia rotundifolia plays an important ecological role by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia rotundifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil conditions. It has since spread beyond cultivation and is now considered a potential weed in certain regions. The plant thrives in a range of environments, including coastal areas and disturbed soils, contributing to its rapid establishment. Its introduction has raised concerns about its impact on native ecosystems and biodiversity. Management strategies are being developed to control its spread and mitigate its ecological effects."
}
