{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia graniticola",
    "plant_slug": "acacia-graniticola",
    "plant_name_scientific": "acacia graniticola",
    "intro": "Acacia graniticola, commonly known as the granite acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its dense, thorny foliage and small, yellow flowers that bloom in clusters. The plant is well adapted to harsh environments, with deep roots that allow it to access water from deep underground. Its leaves are typically small and leathery, reducing water loss through transpiration. Acacia graniticola plays an important role in stabilizing soil and providing habitat for various desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia graniticola"
    },
    "taxonomy_art_desc": "Acacia graniticola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants with a wide range of morphological diversity, including ferns and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of floral structures. Its order is Fabales, which comprises flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, characterized by the distinctive pod-shaped fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia graniticola, a specific type of acacia found in rocky or granitic soils, adapted to arid environments and known for its hardy nature.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia graniticola is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area known as the Geraldton Hills. This plant typically grows in sandy or gravelly soils and is adapted to the arid and semi-arid environments of the region. It is commonly found in open woodlands and on rocky outcrops. Its distribution is closely associated with granite-derived soils, which are characteristic of the area.",
    "distribution_introduced_art_desc": "Acacia graniticola was mainly introduced to areas with rocky or gravelly soils, often found in arid or semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it well-suited for degraded or disturbed lands. This plant is commonly found in regions such as parts of Australia, South Africa, and the southwestern United States. Its introduction has sometimes led to ecological impacts, including competition with native species. It is often used for soil stabilization and as a source of timber or fuelwood."
}
