{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia penicillifera",
    "plant_slug": "acacia-penicillifera",
    "plant_name_scientific": "acacia penicillifera",
    "intro": "Acacia penicillifera, commonly known as the white acacia, is a flowering plant native to the Arabian Peninsula and parts of North Africa. It is a small to medium-sized tree with a spreading crown and long, slender branches. The plant produces yellow flowers in globular clusters, which are followed by flat, bean-like pods. Its leaves are bipinnate, consisting of numerous small, feather-like leaflets. The tree is well adapted to arid environments and is often used for its timber and as a source of gum arabic.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia penicillifera is primarily native to the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It is commonly found in coastal areas and along the edges of deserts, where it thrives in arid and semi-arid environments. This species is also present in parts of the Horn of Africa, particularly in Somalia and Eritrea. It grows on sandy soils and is often associated with dunes and rocky landscapes. Acacia penicillifera is well adapted to high temperatures and low rainfall, making it a resilient plant in its native habitat.",
    "distribution_introduced_art_desc": "Acacia penicillifera was mainly introduced to the Mediterranean region for its ornamental value and its ability to thrive in arid conditions. It is also cultivated in parts of southern Europe, North Africa, and the Middle East due to its drought tolerance and rapid growth. This plant has been used for shade, as a source of wood, and for its gum, which has various industrial applications. However, its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. Despite these issues, it remains an important species in reforestation and land stabilization efforts."
}
