{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia holstii",
    "plant_slug": "acacia-holstii",
    "plant_name_scientific": "acacia holstii",
    "intro": "Acacia holstii, commonly known as the Holst's acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, upright branches and bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow, globular flower heads that bloom in spring, attracting pollinators such as bees and birds. Its seeds are encased in woody pods that split open when mature, dispersing the seeds by wind. Acacia holstii is adapted to arid and semi-arid environments, making it a resilient species in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia holstii is primarily native to the coastal regions of southern Africa, including countries such as South Africa, Namibia, and Botswana. It thrives in sandy or rocky soils along the Atlantic coast, particularly in the Western and Northern Cape provinces of South Africa. This species is commonly found in dune systems and coastal scrublands, where it plays a vital role in stabilizing sand dunes and providing habitat for local wildlife. It is well adapted to the arid and semi-arid climate of its native range, with its deep root system allowing it to access groundwater. Acacia holstii is also known for its distinctive yellow flowers, which bloom during the cooler months, attracting pollinators such as bees and birds.",
    "distribution_introduced_art_desc": "Acacia holstii was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. This plant is valued for its ability to thrive in harsh environmental conditions. It has been widely used in reclamation projects and land restoration efforts. Its introduction has helped improve land productivity in degraded ecosystems."
}
