{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fistula",
    "plant_slug": "acacia-fistula",
    "plant_name_scientific": "acacia fistula",
    "intro": "Acacia fistula, commonly known as the white acacia, is a flowering plant native to southern Africa. It is a small shrub or tree that typically grows in dry, sandy soils. The plant produces small, yellow flowers that are clustered in spherical inflorescences. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. Acacia fistula is known for its hardiness and ability to thrive in arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fistula is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This plant is well adapted to the harsh climate of its native habitat, with its deep root system allowing it to access water from deeper underground. It plays an important ecological role by providing shelter and food for various wildlife species. Due to its resilience, it is also occasionally cultivated in other regions with similar environmental conditions.",
    "distribution_introduced_art_desc": "Acacia fistula was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in degraded lands where it helps stabilize the soil and improve land productivity. The plant is well adapted to dry conditions and can thrive with minimal water requirements. Its rapid growth and ability to fix nitrogen make it a valuable species for land rehabilitation. However, its introduction has sometimes led to competition with native vegetation, raising concerns about ecological impact."
}
