{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia anastomosa",
    "plant_slug": "acacia-anastomosa",
    "plant_name_scientific": "acacia anastomosa",
    "intro": "Acacia anastomosa, commonly known as the honeywood, is a shrub or small tree native to southern Africa. It is characterized by its dense, feathery foliage and produces yellow flowers in clusters. The plant has a deep root system that helps it survive in arid conditions. Its bark is thick and fissured, providing protection against drought and fire. Acacia anastomosa is also known for its ability to fix nitrogen in the soil, making it an important species in ecological restoration.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia anastomosa"
    },
    "taxonomy_art_desc": "Acacia anastomosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in diverse habitats. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing properties. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in landscaping and traditional medicine. Its species is Acacia anastomosa, a specific type of acacia found in certain regions, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia anastomosa is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the coastal areas and nearby inland regions. This plant thrives in sandy soils and is often seen in heathlands and woodlands. It is well adapted to the dry and semi-arid climate of its native habitat. Acacia anastomosa plays an important role in the local ecosystem, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia anastomosa was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the southern and western parts of the country. This plant is often used for erosion control due to its extensive root system and ability to fix nitrogen. It has also been introduced to other parts of the world, including some regions of the United States and South Africa. However, its introduction has raised concerns about its potential invasiveness in non-native environments."
}
