{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia truculenta",
    "plant_slug": "acacia-truculenta",
    "plant_name_scientific": "acacia truculenta",
    "intro": "Acacia truculenta, commonly known as the prickly acacia, is a shrub or small tree native to arid regions of Africa and the Arabian Peninsula. It is characterized by its spiny branches and small, greenish-yellow flowers that bloom in clusters. The plant produces flat, pod-like seed pods that contain edible seeds, which are often used in local cuisines. Its leaves are trifoliate, consisting of three small, oval-shaped leaflets. Acacia truculenta is well adapted to drought conditions and plays a role in stabilizing sandy soils in its native habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia truculenta"
    },
    "taxonomy_art_desc": "Acacia truculenta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their advanced reproductive structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include many legumes. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped flower heads and often used in traditional medicine and as sources of timber. Its species is Acacia truculenta, a particular type of acacia known for its hardy nature and ability to thrive in arid environments, commonly found in regions of Africa and the Middle East.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia truculenta is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This plant thrives in dry, open habitats such as shrublands and woodlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia truculenta plays an important ecological role in supporting local wildlife and soil stabilization.",
    "distribution_introduced_art_desc": "Acacia truculenta was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, the Middle East, and parts of Australia. This plant is often used for its hardy nature and ability to prevent soil erosion. Its introduction has sometimes led to ecological impacts in non-native environments. Due to its resilience, it has been planted for ornamental and landscaping purposes in various regions."
}
