{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia carnosula",
    "plant_slug": "acacia-carnosula",
    "plant_name_scientific": "acacia carnosula",
    "intro": "Acacia carnosula, commonly known as the sweet acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, feathery foliage and yellow flowers that bloom in spring. The plant produces flat, pod-like fruits that contain several seeds. Acacia carnosula is often used in traditional medicine and as a source of gum arabic. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia carnosula"
    },
    "taxonomy_art_desc": "Acacia carnosula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which includes plants with flowers that have a distinctive structure, such as those in the legume family. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their characteristic phyllodes and often used in landscaping and for their nitrogen-fixing properties. Its species is Acacia carnosula, a specific type of acacia native to southern Africa, known for its woody stems and small, clustered flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia carnosula is primarily native to Western Australia. It is found in the southern and western regions of the state, including the coastal and inland areas. This plant thrives in a variety of soil types but is commonly associated with sandy and gravelly soils. It is often found in open woodlands and shrublands. Acacia carnosula is well adapted to the arid and semi-arid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia carnosula was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape, growing in rocky soils and disturbed areas. The plant is often used for erosion control due to its hardy nature and ability to thrive in arid conditions. It is also valued for its ornamental qualities and has been planted in gardens and along roadsides. However, its spread can sometimes lead to competition with native vegetation in certain ecosystems."
}
