{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adenocalyx",
    "plant_slug": "acacia-adenocalyx",
    "plant_name_scientific": "acacia adenocalyx",
    "intro": "Acacia adenocalyx, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are finely divided. The plant produces small, yellow flowers arranged in dense, globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and sandy areas. The plant is also valued for its ornamental appeal and is sometimes cultivated for its hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adenocalyx is primarily native to northern Australia, including parts of Western Australia, Queensland, and the Northern Territory. It thrives in arid and semi-arid regions, often found in sandy or rocky soils. This species is commonly associated with mulga woodlands and open shrublands. It is well adapted to the harsh climatic conditions of its native range. Acacia adenocalyx plays an important role in the ecological balance of these environments.",
    "distribution_introduced_art_desc": "Acacia adenocalyx was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, thriving in warm, dry climates. The plant is known for its small, yellow flowers and its ability to tolerate poor soil conditions. It has been introduced for ornamental purposes and as a potential source of timber. However, it is considered a potential invasive species in some areas due to its rapid spread."
}
