{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amanda",
    "plant_slug": "acacia-amanda",
    "plant_name_scientific": "acacia amanda",
    "intro": "Acacia amanda, commonly known as the slender wattle, is a shrub native to Australia. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing capabilities. The plant features slender, often twisted branches and small, bipinnate leaves. Its yellow flowers are arranged in cylindrical spikes, typical of many Acacia species. Acacia amanda is adapted to arid and semi-arid environments, making it a resilient component of native Australian flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia amanda"
    },
    "taxonomy_art_desc": "Acacia amanda belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails, and is known for having vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which comprises plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pods as fruits and often having nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorny foliage and showy flowers. Its species is Acacia amanda, a specific type of acacia found in certain regions, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amanda is primarily native to the Northern Territory. It is commonly found in the arid and semi-arid regions of this area. This plant thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. Its distribution is largely restricted to the specific environmental conditions of the Northern Territory.",
    "distribution_introduced_art_desc": "Acacia amanda was mainly introduced to control soil erosion and as a windbreak in arid and semi-arid regions. It is commonly found in degraded lands and is used for its hardy nature and ability to thrive in poor soil conditions. The plant has been introduced in several countries in Africa and the Middle East for its ecological and agricultural benefits. It is also valued for its timber and as a source of fodder for livestock. However, its introduction has raised concerns about potential invasiveness in some environments."
}
