{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mutabilis subsp. rhynchophylla",
    "plant_slug": "acacia-mutabilis-subsp-rhynchophylla",
    "plant_name_scientific": "acacia mutabilis subsp. rhynchophylla",
    "intro": "Acacia mutabilis subsp. rhynchophylla, commonly known as the variable wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that change color throughout the year, ranging from green to red or bronze. The plant produces yellow globular flowers in late winter to early spring, which are followed by flat, leathery pods. It thrives in well-drained soils and is often found in dry, open habitats. Due to its ornamental value, it is cultivated in gardens and landscapes across Australia.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mutabilis"
    },
    "taxonomy_art_desc": "Acacia mutabilis subsp. rhynchophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails, and is known for having vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants with a unique type of flower and includes legumes, which have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive acorn-like pods and often used in traditional medicine and for timber. Its species is Acacia mutabilis, a type of acacia that is known for its variable leaf forms and is typically found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mutabilis subsp. rhynchophylla is primarily native to Western Australia. This subspecies is found in the southern and western regions of the state. It typically grows in sandy soils and is commonly associated with coastal and inland dune environments. The plant is well adapted to the arid and semi-arid climates of its native range. It plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia mutabilis subsp. rhynchophylla was mainly introduced to New Zealand. It was introduced as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, spreading rapidly in native ecosystems. The plant is particularly problematic in coastal and riparian areas where it outcompetes native vegetation. Its introduction has led to significant ecological concerns and management efforts to control its spread."
}
