{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia strigosa var. endlicheri",
    "plant_slug": "acacia-strigosa-var-endlicheri",
    "plant_name_scientific": "acacia strigosa var. endlicheri",
    "intro": "Acacia strigosa var. endlicheri, commonly known as the slender wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging branches and yellow flowers that appear in spikes. The leaves are small, phyllodes, and have a rough, hairy texture. It thrives in sandy or gravelly soils and is often found in coastal and inland regions. This plant is valued for its ornamental appeal and its role in providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia strigosa var. endlicheri is primarily native to eastern Australia, including Queensland, New South Wales, and Victoria. It is commonly found in dry sclerophyll forests and woodlands. This variety thrives in sandy or loamy soils and is often associated with coastal and inland regions. It is well adapted to the Mediterranean climate of southern Australia. The plant is known for its hardy nature and ability to withstand drought conditions.",
    "distribution_introduced_art_desc": "Acacia strigosa var. endlicheri was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Western and Eastern Cape provinces. This plant thrives in well-drained soils and is often seen in disturbed habitats such as roadsides and agricultural areas. Its introduction has led to its spread along the coast, where it forms dense thickets. Despite its ornamental value, it is considered a potential invasive species in some parts of its range."
}
