{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dalzielii",
    "plant_slug": "acacia-dalzielii",
    "plant_name_scientific": "acacia dalzielii",
    "intro": "Acacia dalzielii, commonly known as the Dalziel's acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in dense, globular clusters, which are typically visited by bees and other pollinators. Its seeds are enclosed in woody pods and are dispersed by wind. Acacia dalzielii is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dalzielii is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and the Free State. This plant typically grows in rocky outcrops, grasslands, and along riverbanks. It is well adapted to arid and semi-arid environments. Acacia dalzielii is known for its distinctive yellow flowers and is often used in traditional medicine.",
    "distribution_introduced_art_desc": "Acacia dalzielii was mainly introduced to regions with a Mediterranean climate, characterized by dry summers and wet winters. It thrives in well-drained soils and is commonly found in coastal areas and open woodlands. This plant has been introduced to parts of California, Oregon, and other areas of the western United States. It is often used in landscaping due to its drought tolerance and ornamental value. However, it can become invasive in some environments if not managed properly."
}
