{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verek",
    "plant_slug": "acacia-verek",
    "plant_name_scientific": "acacia verek",
    "intro": "Acacia verek, commonly known as the white acacia, is a flowering plant native to southern Africa. It is characterized by its slender, often spiny stems and compound leaves that are typically bipinnate. The plant produces yellow to golden flowers that bloom in clusters, attracting various pollinators. Acacia verek thrives in arid and semi-arid environments, making it well adapted to drought conditions. Its wood is valued for its durability and is used in traditional crafts and construction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verek is primarily native to eastern Australia, including regions in New South Wales and Queensland. It thrives in a variety of habitats, such as open forests, woodlands, and coastal areas. This plant is commonly found in sandy or loamy soils and is well adapted to the local climate. It plays an important role in the ecosystem by providing food and shelter for various wildlife species. Acacia verek is also known for its hardy nature and ability to withstand drought conditions.",
    "distribution_introduced_art_desc": "Acacia verek was mainly introduced to control soil erosion and provide shade in arid regions. It is commonly found in degraded lands and along roadsides where it thrives in poor soil conditions. The plant has been widely used in reclamation projects due to its rapid growth and deep root system. However, its introduction has sometimes led to competition with native species in certain ecosystems. Despite its benefits, it requires careful management to prevent overgrowth and ecological imbalance."
}
