{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia × barteriana",
    "plant_slug": "acacia-×-barteriana",
    "plant_name_scientific": "acacia × barteriana",
    "intro": "Acacia × barteriana, commonly known as the weeping acacia, is a hybrid plant resulting from the cross between Acacia longifolia and Acacia dealbata. It is characterized by its distinctive drooping branches that give it a graceful, tree-like appearance. The plant produces small, yellow flowers clustered in spherical inflorescences, which bloom in spring and attract pollinators such as bees and birds. Its leaves are bipinnate, with numerous small, feathery leaflets, and it thrives in well-drained soils in temperate climates. Acacia × barteriana is often cultivated as an ornamental plant due to its aesthetic appeal and adaptability.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia × barteriana"
    },
    "taxonomy_art_desc": "Acacia × barteriana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns, horsetails, and their allies, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive umbrella-shaped flower heads and often used in traditional medicine. Its species is Acacia × barteriana, a hybrid plant resulting from the cross between two Acacia species, known for its ornamental value and adaptability to various environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia × barteriana is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy or gravelly soils and is often seen in open woodlands and scrublands. It is well adapted to the harsh climate conditions of the region. Its distribution is largely confined to the southern parts of South Australia.",
    "distribution_introduced_art_desc": "Acacia × barteriana was mainly introduced to regions with a warm, temperate climate where it can thrive in well-drained soils. It is commonly found in areas with mild winters and hot, dry summers, making it suitable for cultivation in parts of the Mediterranean, South Africa, and the southwestern United States. This hybrid species is valued for its ornamental qualities, including its feathery foliage and yellow flowers. It is also used in reforestation projects due to its ability to fix nitrogen and improve soil quality. However, it can become invasive in certain environments if not managed properly."
}
