{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia insulae-iacobi",
    "plant_slug": "acacia-insulae-iacobi",
    "plant_name_scientific": "acacia insulae-iacobi",
    "intro": "Acacia insulae-iacobi, commonly known as the island jacobi acacia, is a small shrub native to the island of Ile-de-France. It features narrow, linear leaves that are often covered in a fine layer of white hairs, which help reduce water loss in its arid environment. The plant produces small, yellow flowers arranged in compact, globular inflorescences, which attract a variety of pollinators. Its seed pods are elongated and woody, containing several elliptical seeds. Acacia insulae-iacobi is adapted to rocky soils and is often found in coastal or semi-arid regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia insulae-iacobi is primarily native to the island of Ile-Rousse in the southwest of Madagascar. It is found in the dry, rocky habitats of this region, where it thrives in well-drained soils. The plant is adapted to the arid climate and seasonal rainfall patterns of its native environment. It is commonly seen growing in coastal and inland areas with sparse vegetation. Due to its limited range, it is considered a rare and endemic species.",
    "distribution_introduced_art_desc": "Acacia insulae-iacobi was mainly introduced to control soil erosion and provide shade in arid regions. It is commonly found in degraded landscapes where other vegetation has been lost. This plant thrives in well-drained soils and can tolerate high temperatures and low rainfall. Its rapid growth and deep root system make it effective for land stabilization. However, it has raised concerns due to its potential to become invasive in certain ecosystems."
}
