{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pusilla",
    "plant_slug": "acacia-pusilla",
    "plant_name_scientific": "acacia pusilla",
    "intro": "Acacia pusilla, commonly known as the dwarf wattle, is a small shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its delicate, feathery foliage. The plant produces small yellow flowers in spring, which are clustered in spherical inflorescences. Acacia pusilla is typically found in sandy soils and is adapted to arid or semi-arid environments. It plays a role in stabilizing soil and providing habitat for small native animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pusilla"
    },
    "taxonomy_art_desc": "Acacia pusilla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which comprises flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pod fruits and nitrogen-fixing symbiosis with bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acacia-like features and ability to thrive in arid environments. Its species is Acacia pusilla, a small shrub native to Australia, recognized for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pusilla is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the Geraldton area. This small shrub thrives in sandy soils and is often associated with coastal and near-coastal environments. It is well adapted to the dry and semi-arid conditions of its native habitat. The plant plays an important role in local ecosystems and is part of the diverse flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia pusilla was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive small leaves and yellow flowers. However, it has since become naturalized and is now considered a potential weed in some areas. The plant thrives in a variety of soil types and can tolerate both full sun and partial shade. Its spread has raised concerns among land managers due to its ability to colonize disturbed sites."
}
