{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia grandifolia",
    "plant_slug": "acacia-grandifolia",
    "plant_name_scientific": "acacia grandifolia",
    "intro": "Acacia grandifolia, commonly known as the silky acacia, is a tropical plant native to Southeast Asia. It is characterized by its feathery, bipinnate leaves that give it a delicate, fern-like appearance. The plant produces yellow flowers in compact spikes, which are often used in traditional medicine and as ornamental plants. Acacia grandifolia thrives in well-drained soil and requires full sun to partial shade. It is also valued for its ability to fix nitrogen, making it beneficial for soil enrichment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia grandifolia"
    },
    "taxonomy_art_desc": "Acacia grandifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a true root system and a complex vascular system. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many early-diverging lineages with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include economically important legumes. Its family is Fabaceae, commonly known as the legume family, characterized by distinctive pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a group of shrubs and trees known for their acicular leaves and often for their ability to thrive in arid environments. Its species is Acacia grandifolia, a specific type of acacia known for its large, showy flowers and is native to certain regions of South America.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia grandifolia is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This plant thrives in coastal and lowland areas, often in sandy or well-drained soils. It is an important component of the local flora and is often seen in coastal forests and woodlands. Acacia grandifolia is well adapted to the climate and environmental conditions of Queensland.",
    "distribution_introduced_art_desc": "Acacia grandifolia was mainly introduced to tropical and subtropical regions for its ornamental value and potential use in agroforestry. It is commonly found in countries such as Brazil, India, and parts of Southeast Asia. The plant thrives in well-drained soils and full sun, making it adaptable to a variety of environments. Its introduction has sometimes led to naturalization in new areas, raising concerns about its potential invasiveness. Despite its benefits, careful management is recommended to prevent ecological disruption."
}
