{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gerrardi var. latisiliqua",
    "plant_slug": "acacia-gerrardi-var-latisiliqua",
    "plant_name_scientific": "acacia gerrardi var. latisiliqua",
    "intro": "Acacia gerrardi var. latisiliqua, commonly known as the broad-leaved acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its dense, feathery foliage composed of narrow, green, bipinnate leaves. The plant produces yellow, globular flower heads that bloom in spring, attracting pollinators such as bees and birds. Its hardy nature makes it suitable for erosion control and ornamental use in dry landscapes. The wood is durable and has been traditionally used for various purposes by local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gerrardi var. latisiliqua is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and shrubland ecosystems. This variety is well adapted to the harsh climate conditions of its native habitat, including high temperatures and low rainfall. It plays an important ecological role by providing shelter and food for local wildlife. Due to its resilience, it is also sometimes cultivated in other parts of the world for ornamental or ecological purposes.",
    "distribution_introduced_art_desc": "Acacia gerrardi var. latisiliqua was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with low rainfall. It is commonly used for erosion control and as a source of timber due to its hardy nature. This plant thrives in open landscapes and is often found in disturbed soils such as roadsides and abandoned fields. Its introduction has been associated with both ecological benefits and potential invasiveness in certain environments. It is important to monitor its spread to manage its impact on native flora."
}
