{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gloveri",
    "plant_slug": "acacia-gloveri",
    "plant_name_scientific": "acacia gloveri",
    "intro": "Acacia gloveri, commonly known as the Glove acacia, is a small, shrub-like plant native to the arid regions of southern Africa. It features slender, twisted branches and produces small, yellow flowers that bloom in clusters during the dry season. The plant has phyllodes, which are flattened leaf-like structures that help reduce water loss in its harsh environment. Acacia gloveri is adapted to survive in low-nutrient soils and can tolerate extreme temperatures and limited water availability. It plays a role in stabilizing sandy soils and provides habitat for various desert organisms.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gloveri is primarily native to the coastal regions of South Africa, specifically the Western Cape Province. It is commonly found in sandy soils along the Atlantic coastline. This plant thrives in the Mediterranean climate of the region, characterized by dry summers and wet winters. It is often associated with fynbos vegetation, which is a unique type of shrubland found in the area. Acacia gloveri is well adapted to the harsh coastal conditions, including salt spray and strong winds.",
    "distribution_introduced_art_desc": "Acacia gloveri was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was likely introduced through human activity, possibly as an ornamental plant or for soil stabilization purposes. The plant thrives in disturbed soils and can outcompete native vegetation, leading to ecological concerns. Its rapid growth and seed dispersal mechanisms contribute to its spread across various habitats. Conservation efforts are ongoing to manage its impact on local ecosystems."
}
