{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella polypodioides",
    "plant_slug": "acaciella-polypodioides",
    "plant_name_scientific": "acaciella polypodioides",
    "intro": "Acaciella polypodioides, commonly known as the slender acaciella, is a small, evergreen shrub native to the tropical regions of South America. It belongs to the Leguminosae family and is characterized by its narrow, linear leaves that are often clustered at the base of the plant. The plant produces small, yellowish flowers that are typically arranged in racemose inflorescences, followed by pod-like fruits containing several seeds. It thrives in well-drained soils and is often found in dry, open habitats such as scrublands and rocky areas. Due to its ornamental value and adaptability, it is occasionally cultivated in botanical gardens and as a landscape plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella polypodioides is primarily native to the Caribbean region, including parts of the Greater and Lesser Antilles. It is commonly found in tropical and subtropical areas, particularly in moist, shaded environments such as forests and rocky crevices. This species thrives in humid climates with well-drained soil, often growing on limestone substrates. Its distribution includes countries like Cuba, Hispaniola, Jamaica, and Puerto Rico. Acaciella polypodioides is typically associated with coastal and inland forested areas, where it plays a role in the local ecosystem.",
    "distribution_introduced_art_desc": "Acaciella polypodioides was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its unique appearance and adaptability. Despite its aesthetic value, it has since become invasive, outcompeting native species in certain areas. The plant thrives in a variety of soil types and can grow in both full sun and partial shade. Its rapid spread has led to increased management efforts to control its impact on local ecosystems."
}
