{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia guanacastensis",
    "plant_slug": "acacia-guanacastensis",
    "plant_name_scientific": "acacia guanacastensis",
    "intro": "Acacia guanacastensis, commonly known as the Guanacaste acacia, is a flowering plant native to Central America. It is a deciduous tree that can grow up to 20 meters tall, characterized by its compound leaves and yellow flowers. The plant belongs to the Fabaceae family, which includes legumes, and it has a symbiotic relationship with nitrogen-fixing bacteria. Its bark and wood are used in traditional medicine and for construction due to their durability. The plant plays an important ecological role in its native habitat by providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia guanacastensis is primarily native to Central America, specifically found in countries such as Guatemala, Belize, Honduras, and El Salvador. It thrives in tropical and subtropical regions, often growing in dry to moist forests and along riverbanks. This species is commonly found in lowland areas with well-drained soils. It plays an important ecological role in its native habitat by providing food and shelter for various wildlife species. The plant is well adapted to the warm and humid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia guanacastensis was mainly introduced to areas with tropical and subtropical climates, particularly in regions of Central and South America. It thrives in well-drained soils and is often found in disturbed or degraded habitats. This species is commonly used for its hard, durable wood and has been introduced for agroforestry and reforestation purposes. It can also be found in some parts of the Caribbean and Southeast Asia due to its adaptability. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
