{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cassicula",
    "plant_slug": "acacia-cassicula",
    "plant_name_scientific": "acacia cassicula",
    "intro": "Acacia cassicula, commonly known as the coastal wattle, is a small, shrub-like plant native to Australia. It is characterized by its slender, often prostrate stems and small, yellow flowers that appear in globular clusters. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic structures. Acacia cassicula is well adapted to coastal environments, tolerating salt spray and sandy soils. It plays an important role in stabilizing dunes and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cassicula"
    },
    "taxonomy_art_desc": "Acacia cassicula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises flowering plants that are typically legumes and have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa and Australia, known for their thorn-like stems and compound leaves. Its species is Acacia cassicula, a small shrub native to Australia, recognized for its dense foliage and ability to thrive in arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cassicula is primarily native to Western Australia. It is commonly found in the coastal and inland regions of the state, particularly in sandy soils. This species thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the hot and dry climate of the region. Acacia cassicula plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia cassicula was mainly introduced to South Australia, where it has become naturalized in various habitats. It is commonly found in sandy soils along coastal areas and in open woodlands. The plant is known for its small, globular acacia pods and its ability to thrive in arid conditions. Its introduction has led to its establishment in both natural and disturbed environments. However, it is not considered invasive in the region and is often used for soil stabilization."
}
