{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dichromotricha",
    "plant_slug": "acacia-dichromotricha",
    "plant_name_scientific": "acacia dichromotricha",
    "intro": "Acacia dichromotricha, commonly known as the slender wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its bipinnate leaves and yellow flowers. The plant has slender, often spiny stems and is adapted to dry environments. It plays a role in soil stabilization and provides habitat for native wildlife. Acacia dichromotricha is also valued for its ornamental appeal in horticulture.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dichromotricha"
    },
    "taxonomy_art_desc": "Acacia dichromotricha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which comprises flowering plants that are often legumes, characterized by their distinctive flower structures and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, known for their pods and ability to fix nitrogen in the soil. Its genus is Acacia, a large genus of shrubs and trees native to Africa, Australia, and the Americas, known for their unique acorn-like fruits and often used for timber or as ornamental plants. Its species is Acacia dichromotricha, a specific type of acacia found in certain regions, characterized by its distinctive leaf and flower structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dichromotricha is primarily native to Queensland. It is commonly found in the tropical and sub-tropical regions of the state. This plant typically grows in open woodlands and along riverbanks. It is well adapted to the local climate and soil conditions. Its distribution is largely confined to the eastern and northern parts of Queensland.",
    "distribution_introduced_art_desc": "Acacia dichromotricha was mainly introduced to areas with a warm, arid climate and well-drained soils, typically found in regions of Australia and parts of Southeast Asia. It is commonly used for soil stabilization and as a source of timber and fuelwood due to its hardiness and rapid growth. The plant thrives in full sun and is often found in coastal and inland dune environments. Its introduction has sometimes led to ecological concerns due to its potential to outcompete native species in invaded areas. Despite this, it remains an important species in reforestation and land rehabilitation projects."
}
