{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia similis",
    "plant_slug": "acacia-similis",
    "plant_name_scientific": "acacia similis",
    "intro": "Acacia similis, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small, linear leaflets. The plant produces yellow flowers in dense, globular inflorescences, which are a defining feature of the genus Acacia. It thrives in dry, sandy soils and is adapted to arid and semi-arid environments. Acacia similis is often used in horticulture for its ornamental value and ability to provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia similis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savanna and grassland ecosystems. This plant is well adapted to withstand drought conditions and high temperatures. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia similis is also sometimes cultivated for its ornamental value and as a source of timber.",
    "distribution_introduced_art_desc": "Acacia similis was mainly introduced to regions with a warm, dry climate and well-drained soils, particularly in parts of Australia and the Mediterranean. It is commonly found in disturbed areas such as roadsides, abandoned fields, and along riverbanks. This plant thrives in full sun and is known for its ability to tolerate drought conditions. Its introduction has led to its establishment in various ecological zones, sometimes outcompeting native flora. Due to its adaptability, it has become a common weed in agricultural and urban landscapes."
}
