{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia virgultosa",
    "plant_slug": "acacia-virgultosa",
    "plant_name_scientific": "acacia virgultosa",
    "intro": "Acacia virgultosa, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flower spikes that appear in spring. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil. It thrives in a variety of soil types but prefers well-drained conditions. Acacia virgultosa is also recognized for its ecological importance, providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia virgultosa is primarily native to parts of southern Africa, including South Africa, Namibia, and Botswana. It is commonly found in savanna and grassland habitats. This plant thrives in well-drained soils and is adapted to arid and semi-arid conditions. It is often seen growing along riverbanks and in open woodlands. Acacia virgultosa plays an important ecological role by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia virgultosa was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in a variety of soil conditions. It has since become naturalized in several regions, particularly in coastal and disturbed areas where it can outcompete native vegetation. The plant's rapid growth and seed dispersal have led to concerns about its invasive potential in certain ecosystems. Despite its ornamental value, its spread has prompted management efforts to control its impact on local biodiversity. Acacia virgultosa remains a common sight in urban and rural landscapes across parts of New Zealand."
}
