{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sclerophylla",
    "plant_slug": "acacia-sclerophylla",
    "plant_name_scientific": "acacia sclerophylla",
    "intro": "Acacia sclerophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to the arid and semi-arid regions of southern Australia. It is characterized by its narrow, linear leaves and yellow flowers that appear in late winter to early spring. The plant is adapted to drought conditions, with thick, waxy leaves that reduce water loss. It plays an important role in stabilizing soils and providing habitat for native wildlife. Acacia sclerophylla is also valued for its ornamental appeal and is often used in landscaping in dry climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sclerophylla"
    },
    "taxonomy_art_desc": "Acacia sclerophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and their allies, often exhibiting a wide range of morphological diversity. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which comprises flowering plants with characteristic features such as legume fruits and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, and is recognized for its distinctive pod-shaped fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their sharp, often thorny branches and characteristic flower clusters. Its species is Acacia sclerophylla, a specific type of acacia known for its sclerophyllous leaves and adapted to arid or semi-arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sclerophylla is primarily native to New South Wales, South Australia, Victoria, and Western Australia. This hardy shrub or small tree is commonly found in dry, sandy soils across these regions. It thrives in arid and semi-arid environments, often growing in open woodlands or along coastal areas. The plant is well adapted to the climate of these states, with its dense foliage and drought-resistant features. It plays an important ecological role in supporting local wildlife and stabilizing soil in its native habitat.",
    "distribution_introduced_art_desc": "Acacia sclerophylla was mainly introduced to control soil erosion and stabilize degraded lands in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its rapid growth and drought tolerance, making it suitable for environmental restoration efforts. However, its introduction has raised concerns about potential invasiveness in non-native ecosystems. Its distribution is primarily limited to areas where it has been deliberately planted for ecological or agricultural purposes."
}
