{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia serpentinicola",
    "plant_slug": "acacia-serpentinicola",
    "plant_name_scientific": "acacia serpentinicola",
    "intro": "Acacia serpentinicola, commonly known as the serpentine acacia, is a shrub native to the rocky, nutrient-poor soils of southern Africa. It is adapted to grow in serpentine soils, which are rich in heavy metals and low in essential nutrients. The plant has small, compound leaves and produces yellow flowers that attract pollinators. Its root system is highly specialized to tolerate and even thrive in these challenging conditions. Acacia serpentinicola plays an important ecological role in stabilizing soil and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia serpentinicola"
    },
    "taxonomy_art_desc": "Acacia serpentinicola belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and diverse reproductive strategies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often leguminous, contributing to nitrogen fixation in soils. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and symbiotic nitrogen-fixing relationships with bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular or flattened leaflets and often used in traditional medicine and as sources of timber. Its species is Acacia serpentinicola, a specific type of acacia adapted to grow in nutrient-poor soils, particularly those rich in serpentine rock, showcasing its ecological specificity and resilience.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia serpentinicola is primarily native to New South Wales. This species is commonly found in rocky and lateritic soils, particularly in areas with serpentine substrates. It is often associated with dry, open habitats such as grasslands and woodlands. The plant is well adapted to nutrient-poor soils and can thrive in arid conditions. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia serpentinicola was mainly introduced to areas with serpentine soils due to its ability to thrive in nutrient-poor and metal-rich environments. It is commonly found in regions such as California, Oregon, and parts of Australia where serpentine rock formations are prevalent. This plant has been introduced to various ecological restoration projects to stabilize soils and prevent erosion. Its introduction has also raised concerns about its potential invasiveness in non-native habitats. Despite its ecological benefits, monitoring its spread is essential to manage its impact on local flora."
}
