{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gunnii",
    "plant_slug": "acacia-gunnii",
    "plant_name_scientific": "acacia gunnii",
    "intro": "Acacia gunnii, commonly known as the silver wattle, is a shrub or small tree native to southern Australia. It is characterized by its feathery, bipinnate leaves that are covered in fine, silvery hairs, giving it a distinctive appearance. The plant produces yellow globular flowers in late winter to early spring, which are clustered in spikes. Acacia gunnii is adapted to dry, sandy soils and is often found in coastal areas. It plays an important ecological role in providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gunnii"
    },
    "taxonomy_art_desc": "Acacia gunnii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their unique reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which comprises flowering plants that are typically legumes, often with compound leaves and pod fruits. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their acacia-like foliage and often used in traditional medicine and land restoration. Its species is Acacia gunnii, a specific type of acacia native to Australia, recognized for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "South Australia",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gunnii is primarily native to New South Wales, Queensland, South Australia, Tasmania, and Victoria. It is commonly found in a variety of habitats, including dry sclerophyll forests and rocky outcrops. This plant thrives in well-drained soils and is often seen in coastal and inland regions. It plays an important ecological role in supporting local wildlife and maintaining biodiversity. Its distribution reflects its adaptability to the diverse climates of these Australian states.",
    "distribution_introduced_art_desc": "Acacia gunnii was mainly introduced to New Zealand. It was brought there during the 19th century as part of the ornamental plant trade. The plant has since naturalized and is now found in various regions across the country. It thrives in coastal and urban environments due to its tolerance of salty air and compact growth habit. However, it is considered a potential weed in some areas where it can spread aggressively."
}
