{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia excelsa var. polyphleba",
    "plant_slug": "acacia-excelsa-var-polyphleba",
    "plant_name_scientific": "acacia excelsa var. polyphleba",
    "intro": "Acacia excelsa var. polyphleba, commonly known as the narrow-leaf acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and small, narrow, greenish-gray leaves that are adapted to reduce water loss. The plant produces yellow flowers in globular or cylindrical inflorescences, which attract pollinators such as bees and birds. Its seeds are enclosed in woody pods and are dispersed by wind or animals. This species is valued for its hardiness and is sometimes used in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia excelsa var. polyphleba is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, Uganda, and the Democratic Republic of the Congo. It is commonly found in savanna and woodland habitats, often growing in areas with well-drained soils. This variant is adapted to dry and semi-arid conditions, making it a resilient species in these environments. It plays an important ecological role by providing habitat and food for various wildlife species. The plant is also valued for its timber and is sometimes used in local traditional practices.",
    "distribution_introduced_art_desc": "Acacia excelsa var. polyphleba was mainly introduced to areas with a tropical or subtropical climate, characterized by warm temperatures and distinct wet and dry seasons. It thrives in well-drained soils and is commonly found in regions with low to moderate rainfall. This plant is often used for its hardy nature and ability to tolerate poor soil conditions. It has been introduced to parts of Southeast Asia, including Indonesia and the Philippines. Its introduction has sometimes led to ecological concerns due to its potential for invasive growth in native ecosystems."
}
