{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sulcata var. planoconvexa",
    "plant_slug": "acacia-sulcata-var-planoconvexa",
    "plant_name_scientific": "acacia sulcata var. planoconvexa",
    "intro": "Acacia sulcata var. planoconvexa, commonly known as the flat-convex acacia, is a shrub native to arid and semi-arid regions of Africa. It is characterized by its distinctive flat, convex thorns and compound leaves with small, linear leaflets. The plant produces yellow flowers in clusters, which are followed by woody pods containing edible seeds. It is adapted to drought conditions and has a deep root system for water absorption. This variety is valued for its ornamental appeal and ecological role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sulcata"
    },
    "taxonomy_art_desc": "Acacia sulcata var. planoconvexa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as stomata and specialized reproductive organs. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often exhibiting a wide range of morphological diversity. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often characterized by the presence of symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia sulcata, a specific type of acacia that has a particular variety, planoconvexa, which refers to the shape of its seed pods.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sulcata var. planoconvexa is primarily native to Western Australia. This variant of the species is found in the arid and semi-arid regions of the state. It typically grows in sandy soils and is adapted to the harsh climatic conditions of the region. The plant is commonly seen in areas with low rainfall and high temperatures. Its distribution is limited to specific habitats within Western Australia.",
    "distribution_introduced_art_desc": "Acacia sulcata var. planoconvexa was mainly introduced to regions with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soils. It is commonly found in areas of southern Africa, particularly in countries like Namibia and Botswana, where it has become naturalized. The plant is often used for land stabilization and as a source of timber and fodder. Its rapid growth and spreading habit have led to concerns about its potential to invade native vegetation. Despite its benefits, its introduction has raised ecological questions about its impact on local biodiversity."
}
