{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia diptera var. angustior",
    "plant_slug": "acacia-diptera-var-angustior",
    "plant_name_scientific": "acacia diptera var. angustior",
    "intro": "Acacia diptera var. angustior, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, angular stems and bipinnate leaves that are narrow and often hairy. The plant produces yellow globular flowers in late summer, which are arranged in dense spikes. It thrives in well-drained soils and is drought-tolerant, making it suitable for dryland environments. The species is valued for its ornamental appeal and is often used in landscaping and restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia diptera var. angustior is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. This variant is commonly found in rocky outcrops, sandy soils, and along riverbanks in these areas. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of its native habitat. The plant is often seen growing in scattered populations across the landscape, contributing to the ecological diversity of the region. Its distribution is closely tied to the availability of well-drained soils and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Acacia diptera var. angustior was mainly introduced to control soil erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in degraded lands and along roadsides where it establishes quickly. The plant's rapid growth and ability to thrive in poor soils make it a popular choice for rehabilitation projects. However, its invasive tendencies can lead to the displacement of native vegetation if not managed properly. It is now considered a weed in many areas where it has spread beyond its intended use."
}
