{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nervosula",
    "plant_slug": "acacia-nervosula",
    "plant_name_scientific": "acacia nervosula",
    "intro": "Acacia nervosula, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its fine, feathery foliage and yellow flowers that appear in globular clusters. The plant has slender, wiry branches and small, compound leaves with a delicate, thread-like appearance. It thrives in well-drained soils and is often found in dry, open habitats. Acacia nervosula is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nervosula is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry and hot climates. The plant is well adapted to withstand drought conditions and is often seen growing along riverbanks and in sandy soils. It plays an important ecological role by providing habitat and food for various wildlife species. Its unique appearance and resilience make it a characteristic feature of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acacia nervosula was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was first recorded in the 19th century and has since become established in various regions of the country. The plant thrives in a range of soil types and is particularly common in coastal and urban areas. Its introduction has led to concerns about its potential invasiveness in certain ecosystems. Despite its ornamental value, ongoing monitoring is necessary to assess its ecological impact."
}
