{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sphenophylla",
    "plant_slug": "acacia-sphenophylla",
    "plant_name_scientific": "acacia sphenophylla",
    "intro": "Acacia sphenophylla, commonly known as the narrow-leaf wattle, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, zigzagging stems and small, phyllodes that are typically narrow and linear. The plant produces yellow flowers in globular or cylindrical clusters, which bloom during the warmer months. It is well adapted to dry conditions, with a deep root system that allows it to survive in nutrient-poor soils. Acacia sphenophylla plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sphenophylla"
    },
    "taxonomy_art_desc": "Acacia sphenophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their ancient lineage and primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia sphenophylla, a specific type of acacia found in certain regions, known for its unique leaf and flower structures.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sphenophylla is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This species thrives in coastal and inland habitats, including heathlands and woodlands. It is well adapted to the arid and semi-arid climates of its native range. The plant is an important component of the local flora and plays a role in the ecological balance of its environment.",
    "distribution_introduced_art_desc": "Acacia sphenophylla was mainly introduced to areas with dry, sandy soils and a warm, arid climate. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for soil stabilization and as a source of timber. Its introduction has been associated with both ecological benefits and potential invasive tendencies. Due to its hardiness, it has been cultivated in various parts of the world with similar climatic conditions."
}
