{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia koa var. latifolia",
    "plant_slug": "acacia-koa-var-latifolia",
    "plant_name_scientific": "acacia koa var. latifolia",
    "intro": "Acacia koa var. latifolia, commonly known as the broadleaf koa, is a native Hawaiian tree species belonging to the legume family. It is characterized by its broad, lance-shaped leaves and produces yellow to golden pod-like fruits. The plant is well adapted to the tropical climate of Hawaii, thriving in well-drained soils and full sunlight. It plays an important ecological role in providing habitat and food for native wildlife. Due to its ornamental value and cultural significance, it is also cultivated for landscaping and traditional uses.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia koa var. latifolia is primarily native to the Hawaiian Islands, specifically the Big Island and Maui. This variety of Acacia koa is found in coastal and lowland areas, often in dry, well-drained soils. It thrives in the tropical climate of Hawaii, where it plays an important ecological role. The plant is commonly found in native forests and along the coastlines of these islands. It is an important species for both ecological and cultural reasons in Hawaiian ecosystems.",
    "distribution_introduced_art_desc": "Acacia koa var. latifolia was mainly introduced to Hawaii, where it has become naturalized in certain areas. It is commonly found in lowland and coastal regions, particularly in dry to mesic habitats. This plant is often used for ornamental purposes due to its attractive foliage and ability to thrive in various soil types. However, it can sometimes compete with native plant species, raising concerns about its ecological impact. Despite its popularity, its distribution remains limited compared to other introduced species in the region."
}
