{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lacerans",
    "plant_slug": "acacia-lacerans",
    "plant_name_scientific": "acacia lacerans",
    "intro": "Acacia lacerans, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, drooping branches and feathery, bipinnate leaves that give it a delicate appearance. The plant produces yellow flowers in clusters, which are followed by long, slender pods containing flat, fibrous seeds. Acacia lacerans thrives in well-drained soils and is often found in coastal and sandy habitats. It is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lacerans is primarily native to eastern Australia, including Queensland, New South Wales, and the Australian Capital Territory. It is commonly found in dry to wet sclerophyll forests, woodlands, and heathlands. This species thrives in well-drained soils and is often associated with coastal and inland regions. It is also known to occur in parts of southern New Guinea. Acacia lacerans is an important component of the local flora and provides habitat and food for various native fauna.",
    "distribution_introduced_art_desc": "Acacia lacerans was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, degraded forests, and agricultural fields. It thrives in regions with a warm, dry climate and well-drained soils. The plant is often found in coastal and inland areas of southern Africa, including countries like South Africa, Namibia, and Zimbabwe. Due to its rapid growth and ability to colonize disturbed sites, it has become an invasive species in some regions. Its introduction has led to competition with native flora and altered local ecosystems."
}
