{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia persiciflora",
    "plant_slug": "acacia-persiciflora",
    "plant_name_scientific": "acacia persiciflora",
    "intro": "Acacia persiciflora, commonly known as the Persian acacia, is a flowering plant native to the Middle East and parts of Central Asia. It is characterized by its slender, often spiny stems and bipinnate leaves that are typically gray-green in color. The plant produces small, yellow to golden flowers arranged in dense, globular clusters, which bloom in spring. Acacia persiciflora is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for xeriscaping. It is also valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia persiciflora is primarily native to eastern Australia, specifically the states of New South Wales and Queensland. It is commonly found in dry sclerophyll forests and woodlands, particularly in regions with a Mediterranean climate. This species thrives in well-drained soils and is often associated with rocky or sandy terrain. It is known for its distinctive foliage and is sometimes cultivated for ornamental purposes. Acacia persiciflora plays an important ecological role in its native habitat by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia persiciflora was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. This plant is often used in reforestation projects due to its fast growth and drought tolerance. It has also been introduced as an ornamental plant in some regions for its attractive foliage. However, its introduction has raised concerns about potential ecological impacts in non-native environments."
}
