{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia torquata",
    "plant_slug": "acacia-torquata",
    "plant_name_scientific": "acacia torquata",
    "intro": "Acacia torquata, commonly known as the silver wattle, is a shrub or small tree native to southern Australia. It is characterized by its slender, twisted branches and bright yellow flowers that bloom in late winter to early spring. The plant produces small, flat, green pods that contain seeds covered in a fibrous mesh. Its leaves are bipinnate, consisting of multiple pairs of small, oval-shaped leaflets. Acacia torquata is well adapted to arid environments and is often used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia torquata is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, shrublands, and rocky outcrops where it thrives in dry, well-drained soils. This species is well adapted to the harsh climate of its native habitat, exhibiting drought resistance and efficient water use. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia torquata is also sometimes cultivated in regions with similar environmental conditions for ornamental or practical purposes.",
    "distribution_introduced_art_desc": "Acacia torquata was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped in restoring degraded lands across parts of Australia and other dry regions. However, it has raised concerns about its potential to become invasive in certain ecosystems."
}
