{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verticillata var. latifolia",
    "plant_slug": "acacia-verticillata-var-latifolia",
    "plant_name_scientific": "acacia verticillata var. latifolia",
    "intro": "Acacia verticillata var. latifolia, commonly known as the broad-leaved wattle, is a shrub native to Australia. It is characterized by its feathery, yellow flowers that bloom in late winter to early spring. The plant has compound leaves with numerous small, oval-shaped leaflets arranged in a whorl. It thrives in well-drained soils and is often found in coastal and sandy environments. The species is valued for its ornamental appeal and ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verticillata var. latifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils and is often associated with shrubland and grassland ecosystems. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of the savanna. The plant is known for its distinctive umbrella-shaped clusters of small, yellow flowers. Its distribution is largely confined to the interior regions of these African countries where it plays a role in local biodiversity and ecological stability.",
    "distribution_introduced_art_desc": "Acacia verticillata var. latifolia was mainly introduced to stabilize sand dunes and prevent soil erosion in coastal and arid regions. It is commonly used in revegetation projects due to its rapid growth and ability to thrive in harsh conditions. This plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its adaptability makes it suitable for reclamation of degraded lands. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
