{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subcaerulea",
    "plant_slug": "acacia-subcaerulea",
    "plant_name_scientific": "acacia subcaerulea",
    "intro": "Acacia subcaerulea, commonly known as the blue acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, often multi-branched stems and small, greenish-yellow flowers that appear in clusters. The plant produces flat, elongated seed pods that contain edible seeds, which are a food source for various animals. It thrives in well-drained soils and is adapted to withstand drought conditions. The blue acacia is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia subcaerulea"
    },
    "taxonomy_art_desc": "Acacia subcaerulea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and other primitive plant forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive acicular leaves and often yellow or white flowers. Its species is Acacia subcaerulea, a specific type of acacia known for its blue-green foliage and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subcaerulea is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the areas of the Geraldton and Esperance regions. This plant typically grows in sandy soils and is often found in coastal and semi-arid environments. It is well adapted to the dry and warm climate of its native habitat. Acacia subcaerulea is an important component of the local flora and is often seen in open woodlands and shrublands.",
    "distribution_introduced_art_desc": "Acacia subcaerulea was mainly introduced to regions with a Mediterranean climate, characterized by mild, wet winters and warm, dry summers. It thrives in well-drained soils and is often found in coastal areas and hillsides. This plant is commonly used for erosion control due to its deep root system and ability to withstand drought. It has also been introduced as an ornamental plant for its attractive blue-green foliage and yellow flowers. However, in some areas, it has become invasive, outcompeting native vegetation."
}
