{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia poliochroa",
    "plant_slug": "acacia-poliochroa",
    "plant_name_scientific": "acacia poliochroa",
    "intro": "Acacia poliochroa, commonly known as the variable acacia, is a shrub or small tree native to southern Africa. It is characterized by its bipinnate leaves, which are often feathery and composed of numerous small leaflets. The plant produces yellow, globular flowers that are clustered in dense, spherical inflorescences. Acacia poliochroa is adapted to arid and semi-arid environments, showing some degree of drought tolerance. Its ecological role includes providing habitat and food for various insects and animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia poliochroa"
    },
    "taxonomy_art_desc": "Acacia poliochroa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often with compound leaves and specific pollination mechanisms. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia poliochroa, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia poliochroa is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This species thrives in dry, sandy soils and is often seen in shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native habitat. The plant plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia poliochroa was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with low rainfall. It is commonly established in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This plant thrives in full sun and is known for its ability to colonize open spaces quickly. Its introduction has led to its spread in several parts of the world, including Australia and the United States. Due to its rapid growth and adaptability, it is considered a potential invasive species in some regions."
}
