{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kostermansii",
    "plant_slug": "acacia-kostermansii",
    "plant_name_scientific": "acacia kostermansii",
    "intro": "Acacia kostermansii, commonly known as the Koster's acacia, is a shrub or small tree native to the savannas of southern Africa. It is characterized by its slender, often multi-stemmed structure and its distinctive, feathery foliage composed of small, opposite leaflets. The plant produces yellow, spherical flower heads that bloom in clusters, typically during the warmer months. Its bark is smooth and grayish, and it is often used in traditional medicine by local communities. Acacia kostermansii is also valued for its role in preventing soil erosion and supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kostermansii is primarily native to the tropical regions of Africa, specifically found in countries such as Tanzania, Kenya, and Uganda. It thrives in dry, savannah-like environments and is commonly found in rocky or sandy soils. This species is often associated with open woodlands and shrublands, where it plays a role in stabilizing soil and providing habitat for local wildlife. Its distribution is limited to specific ecological niches within these regions. Acacia kostermansii is not found outside of this native range.",
    "distribution_introduced_art_desc": "Acacia kostermansii was mainly introduced to South Africa, where it has been established in certain regions. It is commonly found in the eastern part of the country, particularly in KwaZulu-Natal. This plant is often seen in coastal areas and on sandy soils. It has been introduced for ornamental purposes due to its attractive foliage and ability to thrive in harsh conditions. However, it is considered invasive in some areas, posing a threat to native vegetation."
}
