{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia armata var. angustifolia",
    "plant_slug": "acacia-armata-var-angustifolia",
    "plant_name_scientific": "acacia armata var. angustifolia",
    "intro": "Acacia armata var. angustifolia, commonly known as the narrow-leaf wattle, is a shrub native to the arid regions of Australia. It features slender, angular stems and pinnate leaves composed of narrow, linear leaflets. The plant produces yellow globular flowers that bloom in late winter to early spring. It is well adapted to drought conditions, with a deep root system for water uptake. This variety is often used in landscaping for its ornamental value and hardiness in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia armata var. angustifolia is primarily native to southern Australia, including the states of South Australia, Western Australia, and Victoria. It is commonly found in arid and semi-arid regions, particularly in coastal and inland areas with sandy or gravelly soils. This variety is often associated with shrublands and open woodlands, where it forms part of the local vegetation. It is well adapted to dry conditions and can tolerate high levels of salt in the soil. Due to its hardy nature, it plays an important ecological role in stabilizing soils and providing habitat for native fauna.",
    "distribution_introduced_art_desc": "Acacia armata var. angustifolia was mainly introduced to South Africa as an ornamental plant due to its attractive, narrow leaves and yellow flowers. It has since become naturalized in several regions, particularly in the Western Cape, where it thrives in coastal and semi-arid environments. This plant is often found growing in disturbed areas, roadsides, and along riverbanks, where it can spread aggressively. Its introduction has raised concerns due to its potential to become invasive and outcompete native vegetation. Despite its ornamental value, management strategies are being developed to control its spread in sensitive ecosystems."
}
