{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia peruviana",
    "plant_slug": "acacia-peruviana",
    "plant_name_scientific": "acacia peruviana",
    "intro": "Acacia peruviana, commonly known as the Peruvian acacia, is a flowering plant native to South America. It is a shrub or small tree that can grow up to 6 meters tall, characterized by its woody, fissured bark and bipinnate leaves. The plant produces yellow or orange globular inflorescences, which are composed of numerous small, clustered flowers. Its seeds are enclosed in pods and are often used in traditional medicine. Acacia peruviana is also valued for its ornamental appeal and ability to thrive in arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Peru"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia peruviana is primarily native to Peru. It is commonly found in the dry and semi-arid regions of the country, particularly in the coastal areas and highland valleys. This plant thrives in well-drained soils and is often associated with shrublands and savanna ecosystems. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia peruviana is also valued for its hardy nature and is sometimes used in traditional practices.",
    "distribution_introduced_art_desc": "Acacia peruviana was mainly introduced to South America, particularly in regions with a tropical or subtropical climate. It is commonly found in countries such as Peru, Bolivia, and Argentina. This plant is often cultivated for its ornamental value due to its distinctive foliage and ability to thrive in poor soils. It has also been introduced to parts of Africa and Australia for erosion control and as a source of timber. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
