{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bussei var. benadirensis",
    "plant_slug": "acacia-bussei-var-benadirensis",
    "plant_name_scientific": "acacia bussei var. benadirensis",
    "intro": "Acacia bussei var. benadirensis, commonly known as the Benadire acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellowish to golden flowers arranged in globular or cylindrical inflorescences, which bloom during the warm season. It thrives in well-drained soils and is often found in rocky or coastal areas. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bussei var. benadirensis is primarily native to the coastal regions of southern Africa, specifically Namibia and Angola. This variety thrives in arid and semi-arid environments, often found in sandy soils along the coastline. It is commonly associated with dune systems and coastal plains where it plays a role in stabilizing sand dunes. The plant is well adapted to high salt levels and strong coastal winds. Its distribution is closely linked to the unique ecological conditions of the Namib and Angolan coastlines.",
    "distribution_introduced_art_desc": "Acacia bussei var. benadirensis was mainly introduced to areas with a tropical and subtropical climate, characterized by warm temperatures and seasonal rainfall. It thrives in well-drained soils and is commonly found in savannas and degraded lands. This plant is often used for soil stabilization and as a source of timber and fodder. Its introduction has been associated with land rehabilitation projects in regions of Africa. However, it may pose a risk of ecological invasion in non-native environments."
}
