{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tequilana",
    "plant_slug": "acacia-tequilana",
    "plant_name_scientific": "acacia tequilana",
    "intro": "Acacia tequilana, commonly known as the Mexican acacia, is a shrub or small tree native to the dry regions of Mexico. It is characterized by its slender, often spiny branches and bipinnate leaves that are divided into many small, linear leaflets. The plant produces yellow, pea-like flowers that bloom in clusters, attracting pollinators such as bees and butterflies. Its seeds are enclosed in woody pods and are used in traditional medicine and as a source of tannins. Acacia tequilana is adapted to arid environments, showing resilience to drought and poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tequilana is primarily native to the Mexican states of Jalisco, Guanajuato, and Michoacán. It is also found in parts of the southern United States, including Texas and New Mexico. This plant thrives in arid and semi-arid environments, often growing in limestone soils. It is commonly associated with the Tequila region, where it plays a role in the local ecosystem. Acacia tequilana is an important component of the vegetation in these regions, contributing to biodiversity and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia tequilana was mainly introduced to Mexico, particularly in the state of Jalisco, where it is commonly found in the Tequila region. It is cultivated for its ornamental value and as a source of timber. The plant is also used in traditional medicine and as a component in the production of tequila. Its distribution has been expanded through horticultural practices and ecological restoration projects. However, it is considered an invasive species in some areas outside its native range."
}
