{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia quornensis",
    "plant_slug": "acacia-quornensis",
    "plant_name_scientific": "acacia quornensis",
    "intro": "Acacia quornensis, commonly known as the Quorn acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and phyllodes that are typically linear to lanceolate in shape. The plant produces yellow globular flower heads during the warmer months, which are arranged in dense, compact clusters. Its leaves are modified into phyllodes, a common adaptation in acacia species to reduce water loss. Acacia quornensis is often found in rocky or sandy soils and is adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia quornensis"
    },
    "taxonomy_art_desc": "Acacia quornensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that are typically characterized by legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and as sources of timber. Its species is Acacia quornensis, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia quornensis is primarily native to South Australia. It is found in the arid and semi-arid regions of the state, particularly in the southern and central parts. This plant typically grows in sandy soils and is adapted to the harsh, dry conditions of the region. It is often seen in open woodlands and shrublands. Acacia quornensis is an important part of the local flora and provides habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia quornensis was mainly introduced to India as an ornamental plant due to its unique appearance and adaptability to various climates. It has been cultivated in regions with warm and dry conditions, particularly in southern and western parts of the country. The plant is valued for its ability to thrive in poor soils and its use in landscaping and erosion control. However, its introduction has raised concerns about potential invasiveness in local ecosystems. Despite these concerns, it remains a popular choice for gardeners and landscapers in India."
}
