{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia petraea",
    "plant_slug": "acacia-petraea",
    "plant_name_scientific": "acacia petraea",
    "intro": "Acacia petraea, commonly known as the rock acacia, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its slender, branching structure and small, phyllodes that are often glandular and covered in fine hairs. The plant produces yellow flowers in globular or cylindrical heads, which are typically visited by a variety of pollinators. Acacia petraea is well adapted to drought conditions, with deep root systems that allow it to access water from deeper soil layers. Its ecological importance includes providing habitat and food for various wildlife species in its native environment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia petraea"
    },
    "taxonomy_art_desc": "Acacia petraea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with a unique structure and are often legumes. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in various ecological and economic contexts. Its species is Acacia petraea, a specific type of acacia found in certain environments, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia petraea is primarily native to Queensland. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in rocky and sandy soils, often growing on cliffs and outcrops. It is well adapted to the harsh climate of Queensland's inland areas. Acacia petraea plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia petraea was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant has been introduced to several countries in Africa, the Middle East, and parts of Australia. Its introduction has helped in restoring degraded lands and providing habitat for local wildlife. However, in some areas, it has become invasive, outcompeting native vegetation."
}
