{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia harala",
    "plant_slug": "acacia-harala",
    "plant_name_scientific": "acacia harala",
    "intro": "Acacia harala, commonly known as the Harala acacia, is a shrub or small tree native to the arid and semi-arid regions of East Africa. It is characterized by its straight, slender trunk and dense, feathery foliage composed of phyllodes, which are flattened leaf stalks that perform the function of leaves. The plant produces yellow, globular flower heads that bloom in clusters, attracting various pollinators such as bees and birds. Its root system is deep and drought-resistant, allowing it to thrive in poor soils and extreme climates. Acacia harala is also valued for its timber and has cultural significance in some local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia harala is primarily native to the island of Socotra, located in the Arabian Sea. This unique plant is found in the arid and semi-arid regions of Socotra, which is known for its distinct flora and fauna. It thrives in rocky and coastal areas, adapting to the harsh environmental conditions of the island. Acacia harala is part of the endemic plant species that make Socotra a biodiversity hotspot. Its distribution is limited to this specific region, highlighting its ecological significance.",
    "distribution_introduced_art_desc": "Acacia harala was mainly introduced to areas with dry and semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, including countries like Kenya, Tanzania, and Somalia. This plant is often used for its hardy nature, providing shade and soil stabilization in degraded landscapes. Due to its rapid growth, it has been introduced for reforestation and afforestation projects. However, its spread can sometimes lead to competition with native species, raising concerns about its ecological impact."
}
