{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acutata",
    "plant_slug": "acacia-acutata",
    "plant_name_scientific": "acacia acutata",
    "intro": "Acacia acutata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, narrow leaflets. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. Acacia acutata is well adapted to arid and semi-arid environments, showing drought tolerance and a capacity for rapid growth after rainfall. It plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia acutata"
    },
    "taxonomy_art_desc": "Acacia acutata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a secondary cell wall and the ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and flowering plants, and is distinguished by the presence of true roots, stems, and leaves. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which includes plants with legumes, such as peas and beans, and is known for its symbiotic relationship with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, which is recognized for its distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their phyllodes and nitrogen-fixing abilities. Its species is Acacia acutata, a specific type of acacia characterized by its slender, spiny stems and narrow, linear leaves, typically found in regions with a dry climate.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acutata is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in sandy or gravelly soils along coastal areas and inland regions. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia acutata plays an important ecological role in the local flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia acutata was mainly introduced to control soil erosion and as a windbreak in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its rapid growth and hardiness make it suitable for large-scale planting in degraded landscapes. However, it has raised concerns about potential invasiveness in some ecosystems."
}
