{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gerrardi var. calvescens",
    "plant_slug": "acacia-gerrardi-var-calvescens",
    "plant_name_scientific": "acacia gerrardi var. calvescens",
    "intro": "Acacia gerrardi var. calvescens, commonly known as the slender wattle, is a shrub or small tree native to the arid regions of southern Australia. It is characterized by its slender, wiry branches and phyllodes that are typically linear to narrowly elliptic in shape. The plant produces yellow flowers in dense, cylindrical spikes, which appear during the warmer months. It is adapted to drought conditions and can thrive in sandy or rocky soils. The species is often used in ecological restoration due to its hardiness and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gerrardi var. calvescens is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant of Acacia gerrardi thrives in sandy soils and is commonly found in savanna and shrubland ecosystems. It is well adapted to the harsh climatic conditions of its native range, including high temperatures and low rainfall. The plant plays an important ecological role by providing habitat and food for various local wildlife species. Its distribution is largely restricted to the specific environmental conditions found in these regions.",
    "distribution_introduced_art_desc": "Acacia gerrardi var. calvescens was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly found in regions with arid and semi-arid climates due to its drought tolerance. This plant is often used in reforestation and land rehabilitation projects. Its introduction has helped restore ecological balance in areas affected by desertification. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
