{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aureocrinita",
    "plant_slug": "acacia-aureocrinita",
    "plant_name_scientific": "acacia aureocrinita",
    "intro": "Acacia aureocrinita, commonly known as the golden hairpin acacia, is a shrub or small tree native to arid regions of Australia. It is characterized by its slender, hair-covered stems and bipinnate leaves that are often covered in fine, golden hairs. The plant produces yellow flowers in globular clusters, which are followed by flat, pod-like fruits. It is well adapted to drought conditions, with a deep root system that allows it to survive in nutrient-poor soils. Acacia aureocrinita is also known for its ability to fix nitrogen, contributing to soil fertility in its native environment.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia aureocrinita"
    },
    "taxonomy_art_desc": "Acacia aureocrinita belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns, horsetails, and other primitive vascular plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive umbrella-shaped flower clusters and often used in traditional medicine. Its species is Acacia aureocrinita, a specific type of acacia known for its yellow flowers and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aureocrinita is primarily native to New South Wales. It is commonly found in the coastal regions and sandy soils of the state. This plant thrives in dry, open habitats such as heathlands and sand dunes. It is well adapted to the local climate and soil conditions of New South Wales. Its distribution is largely restricted to the southern and western parts of the state.",
    "distribution_introduced_art_desc": "Acacia aureocrinita was mainly introduced to Australia as an ornamental plant due to its unique appearance and hardy nature. It is commonly found in regions with dry climates, particularly in the northern parts of the country. The plant is often cultivated in gardens and used for erosion control because of its ability to thrive in poor soil conditions. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasive behavior. Despite its aesthetic value, careful management is recommended to prevent its spread beyond cultivated areas."
}
