{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia auriculata",
    "plant_slug": "acacia-auriculata",
    "plant_name_scientific": "acacia auriculata",
    "intro": "Acacia auriculata, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and distinctive yellow flowers that bloom in late winter to early spring. The plant is well adapted to arid and semi-arid environments, with a deep root system that allows it to thrive in poor soils. Its flowers are often visited by nectar-feeding birds and insects, making it an important component of local ecosystems. The species is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia auriculata is primarily native to Southeast Asia, including countries such as Thailand, Malaysia, Indonesia, and the Philippines. It is commonly found in tropical and subtropical regions, particularly in lowland areas with well-drained soils. This species thrives in open habitats like grasslands, savannas, and coastal areas. It is also present in parts of northern Australia and some Pacific islands. Its natural range extends across a variety of ecosystems, making it an adaptable and widespread native plant in the region.",
    "distribution_introduced_art_desc": "Acacia auriculata was mainly introduced to tropical and subtropical regions for its ornamental value and potential for soil stabilization. It is commonly found in areas with warm climates and well-drained soils. The plant has been introduced to parts of Southeast Asia, Australia, and the Pacific Islands. Due to its rapid growth and adaptability, it has sometimes become invasive in non-native habitats. Its introduction has raised concerns about ecological impacts in some regions."
}
