{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia inops",
    "plant_slug": "acacia-inops",
    "plant_name_scientific": "acacia inops",
    "intro": "Acacia inops, commonly known as the narrow-leaved wattle, is a small shrub native to southern Australia. It is characterized by its slender, often spiny stems and narrow, feather-like leaves. The plant produces yellow flowers in late winter to early spring, which are arranged in compact, globular clusters. Acacia inops is well adapted to arid and semi-arid environments, with deep roots that help it survive in dry conditions. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia inops"
    },
    "taxonomy_art_desc": "Acacia inops belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorn-like branches and small, bipinnate leaves. Its species is Acacia inops, a specific type of acacia known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia inops is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the Geraldton area. This plant typically grows in sandy soils and is often found in coastal and inland shrublands. It is well adapted to the arid and semi-arid climates of its native range. Acacia inops plays an important role in the local ecosystem by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia inops was mainly introduced to South Africa as an ornamental plant due to its unique appearance and hardy nature. It is commonly found in gardens and along roadsides in regions with a Mediterranean climate. The plant has also been reported in parts of Australia and New Zealand, where it has occasionally become naturalized. Its introduction has raised concerns about its potential to spread beyond cultivated areas. Despite its aesthetic appeal, its ecological impact remains under study in native ecosystems."
}
