{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bullockii",
    "plant_slug": "acacia-bullockii",
    "plant_name_scientific": "acacia bullockii",
    "intro": "Acacia bullockii, commonly known as the coastal wattle, is a shrub or small tree native to coastal regions of southern Australia. It is characterized by its yellow flowers and bipinnate leaves, which are divided into small, feather-like segments. The plant thrives in sandy soils and is often found in dune environments, where it plays a role in stabilizing sand dunes. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its ability to colonize new areas. Acacia bullockii is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bullockii is primarily native to Australia, specifically found in the arid and semi-arid regions of the central and western parts of the country. It is commonly found in areas such as Queensland, New South Wales, and South Australia. This plant thrives in sandy or gravelly soils and is often seen in shrublands and woodland communities. It is well adapted to the harsh conditions of the Australian outback. Acacia bullockii is an important component of the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia bullockii was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. This plant is often used for land rehabilitation and as a source of fodder for livestock. Its introduction has helped in restoring degraded lands across parts of Australia. However, it can also become invasive in certain environments if not managed properly."
}
