{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sieberiana f. eusieberiana",
    "plant_slug": "acacia-sieberiana-f-eusieberiana",
    "plant_name_scientific": "acacia sieberiana f. eusieberiana",
    "intro": "Acacia sieberiana f. eusieberiana, commonly known as the white acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often thornless stems and bipinnate leaves that are delicate and feathery in appearance. The plant produces yellow flowers in globular or cylindrical clusters, which are highly attractive to pollinators such as bees and birds. Its small, woody pods contain seeds that are dispersed by wind, contributing to its ability to colonize open areas. The plant is adapted to arid and semi-arid environments, making it a hardy species suitable for dryland restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sieberiana f. eusieberiana is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Sudan, South Sudan, Uganda, and the Democratic Republic of the Congo. This subspecies thrives in savannas, woodlands, and along riverbanks, where it forms part of the native vegetation. It is commonly found in areas with seasonal rainfall and well-drained soils. The plant is well-adapted to dry climates and can tolerate moderate grazing pressure. Its distribution is closely linked to the ecological zones of central and eastern Africa.",
    "distribution_introduced_art_desc": "Acacia sieberiana f. eusieberiana was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate rainfall. It is commonly found in savannas, woodlands, and along riverbanks in parts of Africa, including countries like Kenya, Tanzania, and Uganda. This plant is valued for its hardy nature and ability to thrive in degraded soils, making it useful for land rehabilitation and afforestation projects. Its introduction has also supported local communities by providing timber, fuelwood, and forage for livestock. However, its spread requires careful management to prevent it from becoming invasive in new environments."
}
