{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ascendens",
    "plant_slug": "acacia-ascendens",
    "plant_name_scientific": "acacia ascendens",
    "intro": "Acacia ascendens, commonly known as the weeping acacia, is a medium-sized evergreen tree native to southern Africa. It is characterized by its drooping branches and feathery, bipinnate leaves that give it a distinctive, elegant appearance. The plant produces yellow flowers in spherical clusters, which are followed by long, slender pods containing seeds. It thrives in well-drained soils and is often found in savanna and woodland habitats. Acacia ascendens is valued for its ornamental beauty and its ability to provide shade and habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ascendens"
    },
    "taxonomy_art_desc": "Acacia ascendens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are important for nitrogen fixation. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often having symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of flowering plants commonly known as wattles, which are found in various habitats, especially in Australia. Its species is Acacia ascendens, a specific type of acacia known for its upright growth habit and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ascendens is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This species thrives in sandy soils and is often associated with coastal and inland habitats. It is well adapted to the dry and arid conditions typical of its native range. Acacia ascendens plays an important ecological role in the local flora and is part of the diverse Acacia species found in Western Australia.",
    "distribution_introduced_art_desc": "Acacia ascendens was mainly introduced to urban and suburban areas in South Africa, where it is commonly planted for its ornamental value and ability to thrive in various soil conditions. It is often used in landscaping due to its fast growth rate and drought tolerance. However, it has become an invasive species in some regions, outcompeting native vegetation and altering local ecosystems. The plant is also found in parts of Australia and has been introduced to other areas with similar climates. Its spread has raised concerns among conservationists due to its potential to dominate native plant communities."
}
