{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gloeotricha",
    "plant_slug": "acacia-gloeotricha",
    "plant_name_scientific": "acacia gloeotricha",
    "intro": "Acacia gloeotricha, commonly known as the yellow wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, yellowish-green foliage and produces small, fluffy seed pods. The plant is well adapted to arid and semi-arid environments, showing resilience to drought conditions. It has small, yellow flowers that bloom in spring, attracting various pollinators. The bark is typically smooth and greyish, with a tendency to flake off in strips.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gloeotricha"
    },
    "taxonomy_art_desc": "Acacia gloeotricha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees found mainly in Africa and Australia, known for their acorn-like seed pods and often used for timber or as ornamental plants. Its species is Acacia gloeotricha, a specific type of acacia native to Australia, known for its distinctive leaf structure and ecological significance in its habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gloeotricha is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This plant thrives in dry, sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia gloeotricha plays an important ecological role in its habitat by providing food and shelter for various native animals.",
    "distribution_introduced_art_desc": "Acacia gloeotricha was mainly introduced to control soil erosion and for its ability to thrive in arid conditions. It is commonly found in degraded lands and is used for land rehabilitation in semi-arid regions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has been part of afforestation programs in several African countries. However, it requires careful management to prevent it from becoming invasive in non-target areas."
}
