{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spathulifolia",
    "plant_slug": "acacia-spathulifolia",
    "plant_name_scientific": "acacia spathulifolia",
    "intro": "Acacia spathulifolia, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often zigzagging stems and bipinnate leaves composed of small, rounded leaflets. The plant produces yellow flowers in cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia spathulifolia is also valued for its ornamental appeal and is used in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spathulifolia"
    },
    "taxonomy_art_desc": "Acacia spathulifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and complex reproductive systems. Its order is Fabales, which consists of flowering plants with distinctive flowers and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic acorn-like pods and often used in traditional medicine and as sources of timber. Its species is Acacia spathulifolia, a specific type of acacia known for its unique leaf shape and habitat preferences, typically found in arid or semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spathulifolia is primarily native to Western Australia. It is commonly found in the coastal and inland regions of the state, particularly in sandy soils. This species is often associated with dry and arid environments, thriving in well-drained soils. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife. Its distribution is largely restricted to the southern and western parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia spathulifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, adapting well to disturbed habitats. The plant is known for its distinctive broad, flat leaves and yellow flowers, which attract various pollinators. Despite its ornamental value, it has raised concerns due to its potential invasive tendencies in some ecosystems. Its distribution continues to expand, prompting further ecological studies to assess its impact."
}
