{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia divergens",
    "plant_slug": "acacia-divergens",
    "plant_name_scientific": "acacia divergens",
    "intro": "Acacia divergens, commonly known as the slender wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers in clusters, which are followed by cylindrical pods containing seeds. Acacia divergens is adapted to arid and semi-arid environments, exhibiting drought tolerance. It plays an important ecological role by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia divergens"
    },
    "taxonomy_art_desc": "Acacia divergens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and ferns, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pods and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acicular leaves and often complex flower structures. Its species is Acacia divergens, a specific type of acacia known for its unique branching pattern and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia divergens is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in dry, sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia divergens plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia divergens was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and parts of the Free State. The plant thrives in sandy or rocky soils and is often seen along roadsides and in open woodlands. Its introduction has led to its spread beyond its original range, sometimes competing with native vegetation. Despite its invasive potential in some areas, it is also valued for its ornamental qualities and use in traditional medicine."
}
