{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tucumanensis",
    "plant_slug": "acacia-tucumanensis",
    "plant_name_scientific": "acacia tucumanensis",
    "intro": "Acacia tucumanensis, commonly known as the Tucumán acacia, is a shrub or small tree native to South America, particularly Argentina and Chile. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant features bipinnate leaves and produces yellow to golden flowers, which are often clustered in inflorescences. Acacia tucumanensis is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions. It is also valued for its ornamental qualities and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tucumanensis is primarily native to Argentina, specifically the central and northern regions of the country. It is commonly found in the provinces of Tucumán, Santiago del Estero, and Catamarca. This species thrives in dry, arid environments and is often associated with shrublands and dry forests. It is well adapted to the semi-desert conditions of its native range. Acacia tucumanensis plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia tucumanensis was mainly introduced to South America, particularly in Argentina and Chile, as an ornamental plant due to its attractive foliage and drought tolerance. It has also been introduced to parts of the United States, including California and Texas, where it is cultivated in gardens and as a landscape plant. The plant's rapid growth and ability to thrive in poor soil conditions have led to its spread beyond cultivated areas. It is considered an invasive species in some regions, outcompeting native vegetation and altering local ecosystems. Due to its adaptability, it has become established in various climates with warm, dry conditions."
}
