{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia malloclada",
    "plant_slug": "acacia-malloclada",
    "plant_name_scientific": "acacia malloclada",
    "intro": "Acacia malloclada, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often spiny stems and bipinnate leaves that are narrow and clustered. The plant produces yellow flowers in globular or cylindrical spikes, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, open habitats. Acacia malloclada is also valued for its ornamental appeal and is used in landscaping due to its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia malloclada"
    },
    "taxonomy_art_desc": "Acacia malloclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which encompasses vascular plants with a wide range of forms, including ferns and some primitive seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like flower heads and often used for timber or in traditional medicine. Its species is Acacia malloclada, a specific type of acacia found in certain regions of Australia, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia malloclada is primarily native to the Northern Territory. It is commonly found in the arid and semi-arid regions of this area. This species thrives in sandy soils and is often seen along roadsides and in open woodlands. It is well adapted to the harsh climate of the Northern Territory. The plant plays an important role in the local ecosystem and is a characteristic feature of the region's flora.",
    "distribution_introduced_art_desc": "Acacia malloclada was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in land restoration projects due to its ability to thrive in harsh environmental conditions. The plant is also valued for its nitrogen-fixing properties, which enhance soil fertility. Its introduction has been particularly beneficial in areas with degraded land and limited vegetation. However, it requires careful management to prevent it from becoming invasive in native ecosystems."
}
