{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fusicarpa",
    "plant_slug": "acacia-fusicarpa",
    "plant_name_scientific": "acacia fusicarpa",
    "intro": "Acacia fusicarpa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, often twisted branches and small, feathery leaves that are adapted to reduce water loss. The plant produces yellow flowers in late winter to early spring, which are arranged in cylindrical spikes. Acacia fusicarpa is drought-tolerant and thrives in sandy or loamy soils. It plays an important ecological role by providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fusicarpa is primarily native to eastern and southern Africa, including countries such as Tanzania, Kenya, Uganda, and South Africa. It thrives in dry, open habitats such as savannas, woodlands, and rocky outcrops. This species is commonly found in regions with a tropical or subtropical climate. It prefers well-drained soils and is often part of the vegetation in degraded or disturbed landscapes. Acacia fusicarpa is an important plant in the ecosystem, providing habitat and food for various animals.",
    "distribution_introduced_art_desc": "Acacia fusicarpa was mainly introduced to areas with a tropical and subtropical climate, particularly in regions with well-drained soils. It is commonly found in parts of Australia, including Queensland and the Northern Territory. This plant thrives in open habitats such as grasslands, woodlands, and along riverbanks. It is often used for its hardy nature and ability to withstand drought conditions. Its introduction has also been noted in some parts of Southeast Asia and the Pacific Islands."
}
