{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rupestris",
    "plant_slug": "acacia-rupestris",
    "plant_name_scientific": "acacia rupestris",
    "intro": "Acacia rupestris, commonly known as the rock acacia, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its spiny stems and small, bean-like pods that contain seeds. The plant has small, feathery leaves that help reduce water loss in hot, dry environments. It produces yellow flowers that attract pollinators such as bees and birds. Acacia rupestris is well adapted to rocky soils and can thrive in areas with low rainfall.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rupestris is primarily native to southern Africa, including countries such as Namibia, South Africa, and Botswana. It is commonly found in rocky and sandy soils, often growing on mountain slopes and in arid regions. This plant thrives in dry, well-drained environments and is adapted to the harsh conditions of the African savanna. It is often seen in shrublands and along riverbanks in its native range. Acacia rupestris plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia rupestris was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and ability to fix nitrogen, improving soil fertility. Its introduction has helped in restoring degraded lands in various parts of Africa and Australia. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
