{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sulcata",
    "plant_slug": "acacia-sulcata",
    "plant_name_scientific": "acacia sulcata",
    "intro": "Acacia sulcata, commonly known as the African screwpod acacia, is a shrub or small tree native to Africa. It is characterized by its distinctive, ridged, and often spiny stems. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits containing seeds. Acacia sulcata is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. Its leaves are small and feathery, contributing to its overall drought-resistant morphology.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sulcata is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the interior parts of the country, including the Northern Territory, South Australia, and Western Australia. This plant thrives in sandy soils and is well adapted to the harsh, dry conditions of its native habitat. It is often seen in coastal and inland dune environments. Acacia sulcata plays an important ecological role in stabilizing soil and providing habitat for various desert species.",
    "distribution_introduced_art_desc": "Acacia sulcata was mainly introduced to control soil erosion and for land stabilization in arid and semi-arid regions. It is commonly used in reclamation projects due to its deep root system and ability to thrive in poor soils. The plant is also valued for its timber and as a source of fodder for livestock. However, its rapid growth and spread have led to concerns about its invasiveness in some ecosystems. Its introduction has had both beneficial and problematic ecological impacts depending on the region."
}
