{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia asplenioides",
    "plant_slug": "acacia-asplenioides",
    "plant_name_scientific": "acacia asplenioides",
    "intro": "Acacia asplenioides, commonly known as the narrow-leaf acacia, is a shrub native to eastern Australia. It is characterized by its slender, often zigzagging stems and small, feathery leaves that are arranged in pairs. The plant produces yellow flowers in compact spikes, which are followed by flat, pod-like fruits. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia asplenioides is valued for its ornamental appeal and ability to tolerate harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia asplenioides is primarily native to eastern Australia, including regions in New South Wales, Queensland, and the Australian Capital Territory. It is commonly found in dry, open forests, woodlands, and heathlands. This species thrives in well-drained soils and is often associated with sclerophyllous vegetation. It is adapted to the Mediterranean climate of the region, characterized by hot, dry summers and mild, wet winters. Acacia asplenioides plays an important ecological role in providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Acacia asplenioides was mainly introduced to New Zealand, where it has become naturalized in certain regions. It is commonly found in coastal and lowland areas, often growing in disturbed soils. The plant is known for its ability to thrive in a variety of environmental conditions, which contributes to its spread. It is considered an invasive species in some parts of its introduced range due to its competitive nature. However, it also plays a role in stabilizing soils and providing habitat for native wildlife."
}
