{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia taxifolia",
    "plant_slug": "acacia-taxifolia",
    "plant_name_scientific": "acacia taxifolia",
    "intro": "Acacia taxifolia, commonly known as the narrow-leaved acacia, is a flowering plant native to the Mediterranean region. It is characterized by its feathery, bipinnate leaves that give it a distinctive appearance. The plant produces yellow globular flower heads that bloom in spring, attracting pollinators such as bees and butterflies. It thrives in well-drained soils and full sun, making it suitable for coastal and dry garden environments. Acacia taxifolia is often used in landscaping for its ornamental value and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia taxifolia is primarily native to the Mediterranean region, including parts of southern Europe, northern Africa, and western Asia. It is commonly found in coastal areas and limestone soils, particularly in countries such as France, Spain, Italy, and Morocco. This species thrives in temperate climates with mild winters and warm, dry summers. It is often associated with scrubland and woodland habitats. Due to its adaptability, it has also been introduced to other regions outside its native range.",
    "distribution_introduced_art_desc": "Acacia taxifolia was mainly introduced to coastal and riparian areas in California, USA, as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread beyond its initial planting sites, establishing itself in disturbed soils and along waterways. The plant's rapid growth and ability to thrive in a variety of conditions have led to its invasion of native habitats. It competes with native vegetation, altering local ecosystems and reducing biodiversity. Management efforts are ongoing to control its spread and mitigate its ecological impact."
}
