{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia enterocarpa",
    "plant_slug": "acacia-enterocarpa",
    "plant_name_scientific": "acacia enterocarpa",
    "intro": "Acacia enterocarpa, commonly known as the black wattle, is a shrub or small tree native to Australia. It is characterized by its compound leaves, which are often feathery and arranged in a spiral pattern. The plant produces small, yellow flowers that are clustered in spikes, followed by woody pods containing seeds. It is well adapted to dry conditions and is often found in arid or semi-arid regions. The bark and pods of Acacia enterocarpa have been used traditionally by Indigenous Australians for various purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia enterocarpa"
    },
    "taxonomy_art_desc": "Acacia enterocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that often have legume fruits and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acacia-like foliage and often used in traditional medicine. Its species is Acacia enterocarpa, a specific type of acacia known for its unique fruit structure and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia enterocarpa is primarily native to South Australia and Victoria. This species is commonly found in arid and semi-arid regions within these states. It typically grows in sandy soils and is often associated with open woodlands and shrublands. The plant is well adapted to the dry climate and can thrive with minimal water. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia enterocarpa was mainly introduced to areas with suitable climate conditions, such as tropical and subtropical regions, where it can thrive in well-drained soils. It is often found in disturbed habitats, including roadsides, degraded lands, and near human settlements. This plant has been introduced to several countries in the Pacific, including Hawaii, where it has become naturalized. Its rapid growth and ability to colonize open areas make it a potential invasive species in some regions. However, it is also valued for its ecological role in stabilizing soil and providing habitat for native wildlife."
}
