{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macracantha var. glabrens",
    "plant_slug": "acacia-macracantha-var-glabrens",
    "plant_name_scientific": "acacia macracantha var. glabrens",
    "intro": "Acacia macracantha var. glabrens, commonly known as the smooth wattle, is a shrub native to Australia. It is characterized by its slender, often twisted stems and small, greenish-yellow flowers arranged in globular clusters. The leaves are bipinnate, with numerous tiny leaflets that give the plant a feathery appearance. It thrives in well-drained soils and is adapted to arid and semi-arid environments. This variety is notable for its lack of thorns, distinguishing it from other acacia species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macracantha var. glabrens is primarily native to northern Australia, including the Northern Territory, Queensland, and Western Australia. It is commonly found in arid and semi-arid regions, particularly in areas with sandy or rocky soils. This plant thrives in open woodlands, shrublands, and along coastal dunes. It is well adapted to hot, dry climates and can tolerate poor soil conditions. Its distribution is largely restricted to the northern parts of the Australian continent.",
    "distribution_introduced_art_desc": "Acacia macracantha var. glabrens was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coast and in open woodlands. The plant is valued for its rapid growth and ability to stabilize soil, making it useful for erosion control. However, it can also become invasive in some areas, outcompeting native vegetation. Its introduction has had both positive and negative ecological impacts depending on the local environment."
}
