{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tanganyikensis",
    "plant_slug": "acacia-tanganyikensis",
    "plant_name_scientific": "acacia tanganyikensis",
    "intro": "Acacia tanganyikensis, commonly known as the East African wattle, is a shrub or small tree native to the eastern African region. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow globular inflorescences, which are typical of the Acacia genus. It thrives in dry, sandy soils and is adapted to arid and semi-arid environments. The species is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tanganyikensis is primarily native to the eastern African region, specifically Tanzania and the neighboring areas of Lake Tanganyika. It is commonly found in the coastal and lowland areas of Tanzania, particularly in the southern and central parts of the country. This species thrives in sandy or loamy soils and is often associated with coastal vegetation. It is also present in parts of Burundi, the Democratic Republic of the Congo, and Zambia. Acacia tanganyikensis is an important component of the local flora and plays a role in stabilizing coastal dunes.",
    "distribution_introduced_art_desc": "Acacia tanganyikensis was mainly introduced to areas with tropical and subtropical climates, where it thrives in well-drained soils. It is commonly found in regions with high temperatures and low rainfall, such as parts of East Africa and the Arabian Peninsula. This plant is often used for its hardy nature and ability to withstand harsh environmental conditions. It has been introduced to various parts of the world for ornamental purposes and as a potential source of timber. However, its introduction has raised concerns about its potential invasiveness in non-native ecosystems."
}
