{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia floydii",
    "plant_slug": "acacia-floydii",
    "plant_name_scientific": "acacia floydii",
    "intro": "Acacia floydii, commonly known as the Floyd's acacia, is a shrub or small tree native to the arid regions of southwestern United States and northwestern Mexico. It is characterized by its slender, often multi-branched stems and small, bipinnate leaves that are adapted to reduce water loss in hot, dry environments. The plant produces yellow, spherical flower heads that bloom in spring, attracting pollinators such as bees and birds. Acacia floydii is drought-tolerant and thrives in well-drained soils, making it a hardy species suitable for xeriscaping. Its ecological importance includes providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia floydii"
    },
    "taxonomy_art_desc": "Acacia floydii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns, horsetails, and their relatives. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in landscaping and traditional medicine. Its species is Acacia floydii, a specific type of acacia found in certain regions, recognized for its unique botanical features and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia floydii is primarily native to New South Wales. It is commonly found in the coastal regions and surrounding areas of the state. This plant typically grows in sandy or rocky soils along the coastlines. It is well adapted to the temperate and coastal climates of New South Wales. Acacia floydii is a hardy shrub that thrives in the natural habitats of the region.",
    "distribution_introduced_art_desc": "Acacia floydii was mainly introduced to areas with dry, well-drained soils and full sun exposure. It is commonly found in disturbed sites such as roadsides, abandoned fields, and along riverbanks. This plant is known for its ability to thrive in arid and semi-arid environments. Its introduction has led to its establishment in several regions outside its native range. However, it is considered a potential invasive species in some areas due to its rapid growth and competitive nature."
}
