{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia koa var. weimeae",
    "plant_slug": "acacia-koa-var-weimeae",
    "plant_name_scientific": "acacia koa var. weimeae",
    "intro": "Acacia koa var. weimeae, commonly known as the Koa tree, is a species native to the Hawaiian Islands. It is a member of the legume family, Fabaceae, and is characterized by its distinctive bipinnate leaves and yellow to golden flower clusters. The tree is known for its rapid growth and ability to thrive in various soil types, though it prefers well-drained soils. Its wood is highly valued for its strength and aesthetic qualities, making it important in both ecological and cultural contexts. However, it is also considered an invasive species in some regions outside Hawaii.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia koa var. weimeae is primarily native to the islands of Hawaii, specifically found in the wetter and more mesic habitats of the Hawaiian archipelago. This variant of Acacia koa is typically associated with the lowland to montane rainforests of Oahu, Maui, and Hawaii. It thrives in areas with high rainfall and well-drained soils, often growing in mixed hardwood forests. The plant is an important component of the native flora and plays a role in the ecological balance of these ecosystems. However, it is considered endangered due to habitat loss and invasive species competition.",
    "distribution_introduced_art_desc": "Acacia koa var. weimeae was mainly introduced to Hawaii. It is a variant of the native Acacia koa, which is already well established in the region. This introduction likely occurred through human activity, such as horticultural cultivation or accidental transport. While it may have been introduced for ornamental or ecological reasons, its presence has raised concerns about potential impacts on native ecosystems. Further study is needed to determine its role in the local flora."
}
