{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. bylongensis",
    "plant_slug": "acacia-longifolia-var-bylongensis",
    "plant_name_scientific": "acacia longifolia var. bylongensis",
    "intro": "Acacia longifolia var. bylongensis, commonly known as the coastal wattle, is a shrub or small tree native to southern Australia. It is characterized by its slender, often multi-branched stems and phyllodes that are linear to narrowly elliptic in shape. The plant produces yellow globular flower heads during the spring and summer months, which are highly attractive to pollinators. It thrives in well-drained soils and is often found in coastal dunes and sandy areas. Due to its hardiness and ornamental value, it is cultivated in gardens and used for soil stabilization in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. bylongensis is primarily native to southern Australia, including parts of Western Australia, South Australia, and Victoria. This variety is commonly found in coastal and sandy soils, often in heathlands and open woodlands. It thrives in regions with a Mediterranean climate, characterized by dry summers and wet winters. The plant is well adapted to harsh environmental conditions, making it a resilient species in its native range. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia longifolia var. bylongensis was mainly introduced to Australia as an ornamental plant due to its attractive foliage and hardy nature. It has since become naturalized in several regions, particularly in coastal and sandy soils along the eastern and southern coasts. The plant is often found in disturbed areas, roadsides, and open woodlands, where it can spread aggressively. Its introduction has raised concerns due to its potential to invade native vegetation and compete with indigenous species. Despite its ornamental value, it is considered a weed in some areas and requires careful management to prevent its spread."
}
