{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ericifolia var. glaucescens",
    "plant_slug": "acacia-ericifolia-var-glaucescens",
    "plant_name_scientific": "acacia ericifolia var. glaucescens",
    "intro": "Acacia ericifolia var. glaucescens, commonly known as the silver wattle, is a shrub native to Australia. It features narrow, silvery-green leaves that are covered in fine hairs, giving it a distinctive appearance. The plant produces yellow flowers in late winter to early spring, which are clustered in racemes. It thrives in well-drained soils and is often found in coastal and semi-arid regions. Due to its ornamental value and hardy nature, it is cultivated in gardens and landscapes across southern Australia.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ericifolia var. glaucescens is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in savanna woodlands and rocky outcrops where it thrives in dry, well-drained soils. It is adapted to withstand high temperatures and low rainfall, making it a resilient plant in its native habitat. The species is often used as a source of timber and forage by local communities. Its distribution is closely linked to specific ecological zones that provide the necessary conditions for its growth.",
    "distribution_introduced_art_desc": "Acacia ericifolia var. glaucescens was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality. This variety is valued for its hardy nature and ability to thrive in harsh environmental conditions. It has been introduced to several regions in Australia and parts of the Mediterranean. Its introduction has helped in land rehabilitation and ecological restoration efforts."
}
