{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drewiana subsp. pungens",
    "plant_slug": "acacia-drewiana-subsp-pungens",
    "plant_name_scientific": "acacia drewiana subsp. pungens",
    "intro": "Acacia drewiana subsp. pungens, commonly known as the stinging acacia, is a shrub native to southern Africa. It features bipinnate leaves with small, oval leaflets that are covered in fine, stinging hairs. The plant produces yellow globular flowers in late summer, which are clustered in dense inflorescences. Its woody pods contain seeds that are dispersed by wind, contributing to its ability to thrive in arid environments. The plant is adapted to withstand drought and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drewiana subsp. pungens is primarily native to eastern Australia, specifically the coastal regions of New South Wales and southern Queensland. It thrives in sandy soils along the coast and in heathlands. This subspecies is commonly found in areas with a temperate climate and mild winters. It is often associated with coastal dunes and sandplain ecosystems. Its distribution is limited to these specific habitats within the eastern part of the country.",
    "distribution_introduced_art_desc": "Acacia drewiana subsp. pungens was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and surrounding areas, thriving in coastal and semi-arid environments. This subspecies is often cultivated for its ornamental value due to its distinctive foliage and resilience to drought. However, it has also been reported to spread beyond cultivation, potentially impacting local ecosystems. Its introduction has raised concerns about its invasive potential in some regions."
}
