{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. dissitiflora",
    "plant_slug": "acacia-longifolia-var-dissitiflora",
    "plant_name_scientific": "acacia longifolia var. dissitiflora",
    "intro": "Acacia longifolia var. dissitiflora, commonly known as the coastal acacia or silver wattle, is a shrub or small tree native to southern Australia. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves that are grey-green in color. The plant produces yellow globular flower heads that appear in spring, adding ornamental value to its appearance. It thrives in coastal regions and sandy soils, showing some tolerance to salt spray. This variety is often used in landscaping due to its hardiness and aesthetic appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. dissitiflora is primarily native to southern Australia, including the states of South Australia, Western Australia, and Victoria. It is commonly found in coastal and sandy areas, as well as in heathlands and open woodlands. This variety is adapted to dry, well-drained soils and is often part of the understorey vegetation in these habitats. It is also known to occur in Tasmania, where it grows in similar environmental conditions. The plant is well-suited to Mediterranean climates with hot, dry summers and mild, wet winters.",
    "distribution_introduced_art_desc": "Acacia longifolia var. dissitiflora was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along the edges of forests, particularly in the Western and Eastern Cape provinces. This plant is often used in landscaping due to its hardy nature and attractive foliage. However, it has also been identified as an invasive species in some areas, outcompeting native vegetation. Its introduction has led to ecological concerns, prompting management efforts to control its spread."
}
