{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia caurina",
    "plant_slug": "acacia-caurina",
    "plant_name_scientific": "acacia caurina",
    "intro": "Acacia caurina, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in globular heads. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. It belongs to the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. Acacia caurina is often used in landscaping for its ornamental value and hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia caurina is primarily native to northern Australia, including the Northern Territory, Queensland, and Western Australia. It is commonly found in arid and semi-arid regions, particularly in sandplain and sandy soils. This species thrives in dry, open habitats such as shrublands and woodlands. It is often seen growing along roadsides and in disturbed areas. Acacia caurina is well adapted to the harsh climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia caurina was mainly introduced to areas with a Mediterranean climate, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal regions and open woodlands. This plant has been introduced to parts of California, Oregon, and other regions with similar climatic conditions. Its rapid growth and ability to tolerate poor soil conditions have made it a potential invasive species in some areas. However, it is also valued for its ornamental qualities and use in erosion control."
}
