{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bidwillii var. typica",
    "plant_slug": "acacia-bidwillii-var-typica",
    "plant_name_scientific": "acacia bidwillii var. typica",
    "intro": "Acacia bidwillii var. typica, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often spiny stems and narrow, bipinnate leaves. The plant produces yellow flowers in winter, which are clustered in cylindrical spikes. It thrives in well-drained soils and is often found in dry, rocky habitats. Acacia bidwillii var. typica is a hardy species that is well adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bidwillii var. typica is primarily native to the arid and semi-arid regions of southern Australia, including parts of Western Australia, South Australia, and the Northern Territory. This variety is commonly found in sandy soils and is adapted to the harsh, dry conditions of these environments. It is often seen growing in shrublands and along riverbanks in these areas. The plant is well-known for its distinctive, flat, bipinnate leaves and its ability to thrive in nutrient-poor soils. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia bidwillii var. typica was mainly introduced to regions with dry, warm climates, particularly in parts of Australia and the Mediterranean. It thrives in well-drained soils and is often found in open woodlands and along coastal areas. This plant is valued for its hardy nature and ability to withstand drought conditions. It has been cultivated for ornamental purposes due to its attractive foliage and flowering. However, it can become invasive in certain environments if not managed properly."
}
