{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia trisperma",
    "plant_slug": "acacia-trisperma",
    "plant_name_scientific": "acacia trisperma",
    "intro": "Acacia trisperma, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and small, feathery leaves. The plant produces yellow flowers in clusters, which are followed by cylindrical, woody pods containing seeds. Acacia trisperma is adapted to arid and semi-arid environments, showing drought resistance. It plays an important role in local ecosystems and is sometimes used in horticulture for its ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia trisperma is primarily native to northern Australia, including regions of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, such as sandy soils and open woodlands. This plant thrives in areas with low rainfall and is often associated with coastal dunes and inland sandplains. It plays an important ecological role by providing habitat and food for native wildlife. Its distribution is largely restricted to the tropical and subtropical zones of northern Australia.",
    "distribution_introduced_art_desc": "Acacia trisperma was mainly introduced to areas where it can thrive in arid and semi-arid environments, particularly in regions with well-drained soils. It is commonly found in parts of Australia, including Queensland, New South Wales, and the Northern Territory. This plant is often used for soil stabilization and as a source of timber and forage. Its introduction has had both ecological and economic impacts in the regions where it has been established. However, it can also become invasive in some areas, requiring management to prevent its spread."
}
