{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia compta",
    "plant_slug": "acacia-compta",
    "plant_name_scientific": "acacia compta",
    "intro": "Acacia compta, commonly known as the slender acacia, is a shrub native to southern Africa. It is characterized by its slender, multi-branched stems and small, feathery leaves. The plant produces yellow flowers in compact spikes, which are followed by flat, triangular seed pods. It thrives in well-drained soils and is often found in rocky or sandy habitats. Acacia compta is valued for its ornamental appeal and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia compta is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, South Africa, and Zimbabwe. It is commonly found in savannas, shrublands, and rocky outcrops where it thrives in dry, well-drained soils. This species is adapted to withstand high temperatures and low rainfall, making it a resilient component of the local flora. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia compta is also sometimes cultivated in regions with similar climatic conditions for its ornamental and practical value.",
    "distribution_introduced_art_desc": "Acacia compta was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. However, it has been noted to spread aggressively, sometimes becoming invasive in certain regions. Its introduction has had both positive ecological impacts and some unintended consequences on local biodiversity."
}
