{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obscura var. preissiana",
    "plant_slug": "acacia-obscura-var-preissiana",
    "plant_name_scientific": "acacia obscura var. preissiana",
    "intro": "Acacia obscura var. preissiana, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features narrow, linear leaves that are often hairy, and it produces yellow flowers in winter. It is adapted to arid and semi-arid environments, making it drought-tolerant. This species is valued for its ornamental appeal and ecological role in supporting local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obscura var. preissiana is primarily native to arid and semi-arid regions of Australia, particularly in the southern and western parts of the country. It is commonly found in areas such as South Australia, Western Australia, and parts of New South Wales. This species thrives in sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the harsh environmental conditions of its native habitat. The plant plays an important role in the local ecosystem by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia obscura var. preissiana was mainly introduced to areas with well-drained soils and moderate to high rainfall, typically found in coastal and inland regions of southern Australia. It thrives in full sun and is commonly found in open woodlands and along roadsides. This plant is well adapted to withstand drought conditions once established. It is often used in reclamation projects due to its fast growth and ability to stabilize soil. However, it can become invasive in certain environments if not managed properly."
}
