{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spinescens",
    "plant_slug": "acacia-spinescens",
    "plant_name_scientific": "acacia spinescens",
    "intro": "Acacia spinescens, commonly known as the prickly acacia, is a shrub native to arid and semi-arid regions of Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow, globular flower heads that bloom during the rainy season, attracting various pollinators. Its deep root system allows it to thrive in poor soils and withstand drought conditions. Acacia spinescens plays an important role in stabilizing soils and providing shelter for wildlife in its native habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spinescens"
    },
    "taxonomy_art_desc": "Acacia spinescens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by their complex structures and photosynthetic capabilities. Its class is Equisetopsida, which comprises ferns, horsetails, and their relatives, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often thorny structures. Its species is Acacia spinescens, a specific type of acacia known for its spiny appearance and adapted to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia spinescens is primarily native to South Australia and Victoria. This species is commonly found in arid and semi-arid regions within these states. It thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. The plant is well adapted to the hot, dry climate of its native range. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia spinescens was mainly introduced to India as an ornamental plant due to its unique spiny foliage and drought-resistant characteristics. It has been cultivated in various regions across the country, particularly in southern and western states where the climate is arid or semi-arid. Although it is not native to India, it has been occasionally found escaping cultivation and establishing itself in natural habitats. Its introduction has raised concerns about its potential impact on local ecosystems and native plant species. Despite its ornamental value, careful monitoring is recommended to prevent its spread into sensitive ecological areas."
}
