{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fulgens",
    "plant_slug": "acacia-fulgens",
    "plant_name_scientific": "acacia fulgens",
    "intro": "Acacia fulgens, commonly known as the golden wattle, is a flowering plant native to Australia. It is characterized by its bright yellow flowers, which are clustered in spherical heads and bloom in spring. The plant has slender, bipinnate leaves that are covered in fine hairs. It thrives in well-drained soils and is often found in open woodlands and heathlands. Acacia fulgens is an important species in Australian ecosystems, providing food and habitat for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fulgens is primarily native to eastern Australia, including regions in Queensland, New South Wales, and the Australian Capital Territory. It thrives in dry, open habitats such as woodlands, grasslands, and rocky outcrops. This species is commonly found in areas with well-drained soils and a Mediterranean climate. It plays an important ecological role by providing food and shelter for various native animals. Acacia fulgens is also known for its striking yellow flowers, which attract pollinators like bees and birds.",
    "distribution_introduced_art_desc": "Acacia fulgens was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in coastal dunes and sandy soils, where it thrives in harsh environmental conditions. This plant is often used for erosion control due to its extensive root system and ability to stabilize soil. It has also been introduced as an ornamental plant in gardens and landscapes for its attractive yellow flowers. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
