{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fitzgeraldii var. brevior",
    "plant_slug": "acacia-fitzgeraldii-var-brevior",
    "plant_name_scientific": "acacia fitzgeraldii var. brevior",
    "intro": "Acacia fitzgeraldii var. brevior, commonly known as the Fitzgerald's wattle, is a shrub native to the arid regions of Western Australia. It is characterized by its small, feathery leaves and yellow flowers that bloom in spring. The plant is adapted to dry conditions, with a deep root system that helps it survive in nutrient-poor soils. It plays an important role in stabilizing sandy soils and providing habitat for local wildlife. Due to its hardy nature, it is sometimes cultivated in gardens in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fitzgeraldii var. brevior is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Angola, and South Africa. This variant is typically found in shrublands and grasslands characterized by low rainfall and high temperatures. It thrives in sandy or rocky soils and is often associated with other drought-tolerant flora. The plant is well adapted to harsh environmental conditions, making it a common sight in these regions. Its distribution is largely limited to areas where it can receive sufficient sunlight and minimal water availability.",
    "distribution_introduced_art_desc": "Acacia fitzgeraldii var. brevior was mainly introduced to specific regions of Australia, particularly in the Northern Territory and Western Australia. It is commonly found in arid and semi-arid environments, often growing in sandy soils. This variety is known for its small, rounded leaves and yellow flowers, which make it a distinctive plant in its native habitat. It has been used in ecological restoration projects due to its ability to stabilize soil and provide habitat for local wildlife. However, its introduction has raised concerns about its potential to become invasive in certain areas."
}
