{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia unijuga",
    "plant_slug": "acacia-unijuga",
    "plant_name_scientific": "acacia unijuga",
    "intro": "Acacia unijuga, commonly known as the single-lobed wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features small, yellow flowers arranged in clustered inflorescences, typical of many wattles. Its leaves are bipinnate, with numerous tiny leaflets that give it a feathery appearance. Acacia unijuga is often found in sandy soils and is adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia unijuga is primarily native to eastern Australia, specifically the coastal regions of New South Wales and Queensland. It thrives in sandy soils and is commonly found in coastal heathlands and dune systems. This species is well adapted to the harsh coastal environment, including salt spray and strong winds. It plays an important ecological role in stabilizing dunes and providing habitat for native wildlife. Acacia unijuga is also known for its distinctive yellow flowers that bloom in spring.",
    "distribution_introduced_art_desc": "Acacia unijuga was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is particularly problematic in the Western Cape and parts of the Eastern Cape. The plant spreads rapidly through its seeds, which are dispersed by wind and animals. It outcompetes native vegetation, leading to a decline in biodiversity. Due to its aggressive growth, it requires ongoing management to prevent further spread."
}
