{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia roxburghii",
    "plant_slug": "acacia-roxburghii",
    "plant_name_scientific": "acacia roxburghii",
    "intro": "Acacia roxburghii, commonly known as the Indian acacia, is a deciduous shrub or small tree native to the arid and semi-arid regions of India and Pakistan. It is characterized by its bipinnate leaves, which are typically gray-green in color and shed during the dry season. The plant produces yellow globular flowers that bloom in clusters, attracting various pollinators such as bees and birds. Its seeds are encased in a woody pod and are often used in traditional medicine. Acacia roxburghii is also valued for its hard, durable wood and is used in local construction and crafts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia roxburghii is primarily native to the Indian subcontinent, including countries such as India, Pakistan, Nepal, and Bangladesh. It thrives in arid and semi-arid regions, commonly found in scrublands, rocky hills, and along riverbanks. This plant is well adapted to hot and dry climates, often growing in regions with poor soil conditions. It is commonly found in the Thar Desert and other desert fringes of northern India. Acacia roxburghii plays an important ecological role by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia roxburghii was mainly introduced to regions with arid or semi-arid climates, particularly in parts of Africa, the Middle East, and South Asia. It is commonly found in areas with well-drained soils and low rainfall, making it suitable for reclamation of degraded lands. The plant is often used for its hardy nature and ability to fix nitrogen, which improves soil fertility. It has been introduced for purposes such as afforestation, soil stabilization, and as a source of timber and fodder. However, in some regions, it has become an invasive species, outcompeting native vegetation and altering local ecosystems."
}
