{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia disticha",
    "plant_slug": "acacia-disticha",
    "plant_name_scientific": "acacia disticha",
    "intro": "Acacia disticha, commonly known as the silver wattle, is a shrub or small tree native to southern and eastern Australia. It is characterized by its feathery, bipinnate leaves that are often covered in a fine, silvery or grayish pubescence. The plant produces yellow flowers in globular or cylindrical clusters, which appear in spring and attract various pollinators. Acacia disticha is well adapted to dry, sandy soils and is drought-tolerant. It is also valued for its ornamental appeal and is often used in horticulture and landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia disticha"
    },
    "taxonomy_art_desc": "Acacia disticha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which comprises flowering plants that are often legumes and include well-known genera like Vicia and Pisum. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acicular leaves and often used in traditional medicine. Its species is Acacia disticha, a specific type of acacia found in certain regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia disticha is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the dry climate and can survive with minimal water. The plant is an important component of the local ecosystem and provides habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia disticha was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was first brought to the country in the 19th century by European settlers who admired its unique foliage and ability to thrive in various conditions. Despite its ornamental value, it has since become an invasive species, outcompeting native vegetation in certain areas. Its rapid growth and ability to colonize disturbed soils have led to concerns over its ecological impact. Efforts are now being made to control its spread and prevent further invasion of natural habitats."
}
