{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia luederitzii var. retinens",
    "plant_slug": "acacia-luederitzii-var-retinens",
    "plant_name_scientific": "acacia luederitzii var. retinens",
    "intro": "Acacia luederitzii var. retinens, commonly known as the Luederitz acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are composed of numerous small, opposite leaflets. The plant produces yellow to golden flowers in cylindrical inflorescences, which appear during the warmer months. Its seed pods are long, slender, and woody, containing several seeds. This species is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia luederitzii var. retinens is primarily native to southern Africa, specifically South Africa, Namibia, and Botswana. It is commonly found in the arid and semi-arid regions of these countries, particularly in the Kalahari Desert and surrounding areas. This variant of Acacia luederitzii thrives in sandy soils and is often seen along riverbanks and in rocky outcrops. It is well adapted to the harsh climate of its native habitat, with its small leaves and deep root system helping it survive in low-water conditions. The plant plays an important ecological role in its native range, providing habitat and food for various local wildlife species.",
    "distribution_introduced_art_desc": "Acacia luederitzii var. retinens was mainly introduced to regions with arid or semi-arid climates, particularly in southern Africa. It thrives in sandy soils and is often found in savanna and woodland habitats. This plant is commonly used for its hardy nature and ability to withstand drought conditions. It has been introduced for ecological restoration and as a source of timber and fuelwood. Its distribution is largely limited to areas where it can establish itself in disturbed or degraded landscapes."
}
