{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tanjorensis",
    "plant_slug": "acacia-tanjorensis",
    "plant_name_scientific": "acacia tanjorensis",
    "intro": "Acacia tanjorensis, commonly known as the Indian acacia, is a flowering plant native to the Indian subcontinent. It is a small to medium-sized tree or shrub that typically grows in tropical and subtropical regions. The plant is characterized by its bipinnate leaves and yellow to orange flowers that bloom in clusters. It is often found in dry, rocky soils and is adapted to withstand drought conditions. Acacia tanjorensis is also valued for its use in traditional medicine and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tanjorensis is primarily native to the southern parts of the Arabian Peninsula, including countries such as Saudi Arabia, Yemen, and Oman. It thrives in arid and semi-arid environments, often found in rocky soils and along coastal areas. This species is commonly associated with dry woodlands and scrublands, where it plays a role in stabilizing soil and providing habitat for local wildlife. Its distribution is also observed in parts of the Horn of Africa, particularly in Somalia and Eritrea. Acacia tanjorensis is well adapted to withstand high temperatures and low rainfall, making it a resilient plant in its native range.",
    "distribution_introduced_art_desc": "Acacia tanjorensis was mainly introduced to tropical and subtropical regions for its ornamental value and potential use in agroforestry. It is commonly found in countries such as India, Sri Lanka, and parts of Southeast Asia. The plant thrives in well-drained soils and requires full sun exposure for optimal growth. Its ability to fix nitrogen makes it beneficial for soil improvement in degraded lands. However, it is considered an invasive species in some areas where it outcompetes native vegetation."
}
