{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dealbata subsp. dealbata",
    "plant_slug": "acacia-dealbata-subsp-dealbata",
    "plant_name_scientific": "acacia dealbata subsp. dealbata",
    "intro": "Acacia dealbata subsp. dealbata, commonly known as the silver wattle, is a shrub or small tree native to southeastern Australia. It is characterized by its feathery, bipinnate leaves that are often covered in a fine, silvery down. The plant produces yellow globular flower heads that appear in late autumn to early spring. It thrives in well-drained soils and is drought-tolerant once established. The species is also valued for its ornamental appeal and is often used in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dealbata"
    },
    "taxonomy_art_desc": "Acacia dealbata subsp. dealbata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often associated with a wide range of ecological roles. Its order is Fabales, which includes plants with distinctive flowers that have a papilionaceous structure, commonly found in legumes. Its family is Fabaceae, also known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia dealbata, commonly known as the silver wattle, a tree native to Australia recognized for its white flowers and flaky bark.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [
        "Albania",
        "Amsterdam-St.Paul Is.",
        "Argentina Northeast",
        "Assam",
        "Azores",
        "Brazil South",
        "California",
        "Canary Is.",
        "Cape Provinces",
        "Chile Central",
        "Chile South",
        "China South-Central",
        "China Southeast",
        "Costa Rica",
        "Desventurados Is.",
        "DR Congo",
        "East Himalaya",
        "Easter Is.",
        "Ecuador",
        "Eswatini",
        "Ethiopia",
        "France",
        "Free State",
        "Guatemala",
        "Haiti",
        "India",
        "Italy",
        "Jamaica",
        "Juan Fernández Is.",
        "KwaZulu-Natal",
        "Lesotho",
        "Madagascar",
        "Madeira",
        "Mauritius",
        "Mozambique",
        "Myanmar",
        "Nepal",
        "New Zealand North",
        "New Zealand South",
        "Norfolk Is.",
        "Northern Provinces",
        "NW. Balkan Pen.",
        "Oregon",
        "Palestine",
        "Portugal",
        "Romania",
        "Réunion",
        "Sardegna",
        "Sicilia",
        "South Australia",
        "Spain",
        "Sri Lanka",
        "Taiwan",
        "Tanzania",
        "Transcaucasus",
        "Uganda",
        "Uruguay",
        "West Himalaya",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acacia dealbata subsp. dealbata is primarily native to New South Wales, Tasmania, and Victoria. This subspecies is commonly found in open woodlands and grasslands within these regions. It thrives in temperate climates with well-drained soils. The plant is known for its distinctive silver foliage and yellow flowers. It plays an important ecological role in supporting local wildlife and biodiversity.",
    "distribution_introduced_art_desc": "Acacia dealbata subsp. dealbata was mainly introduced to a wide range of regions across the globe, including Albania, Amsterdam-St. Paul Is., Argentina Northeast, Assam, Azores, Brazil South, California, Canary Is., Cape Provinces, Chile Central, Chile South, China South-Central, China Southeast, Costa Rica, Desventurados Is., DR Congo, East Himalaya, Easter Is., Ecuador, Eswatini, Ethiopia, France, Free State, Guatemala, Haiti, India, Italy, Jamaica, Juan Fernández Is., KwaZulu-Natal, Lesotho, Madagascar, Madeira, Mauritius, Mozambique, Myanmar, Nepal, New Zealand North, New Zealand South, Norfolk Is., Northern Provinces, NW. Balkan Pen., Oregon, Palestine, Portugal, Romania, Réunion, Sardegna, Sicilia, South Australia, Spain, Sri Lanka, Taiwan, Tanzania, Transcaucasus, Uganda, Uruguay, West Himalaya, and Zimbabwe. This plant has been widely distributed due to its adaptability and ornamental value. It is commonly found in both natural and cultivated environments. Its introduction has often been for horticultural purposes, leading to its establishment in various ecosystems. However, in some regions, it has become invasive, impacting native flora and fauna."
}
