{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia assimilis subsp. atroviridis",
    "plant_slug": "acacia-assimilis-subsp-atroviridis",
    "plant_name_scientific": "acacia assimilis subsp. atroviridis",
    "intro": "Acacia assimilis subsp. atroviridis, commonly known as the black thorn acacia, is a shrub or small tree native to eastern and southern Africa. It is characterized by its dark, thorn-covered stems and compound leaves with small, serrated leaflets. The plant produces yellow flowers arranged in cylindrical spikes, which are followed by elongated, flat pods containing seeds. It thrives in arid and semi-arid environments, often found in savannas and rocky areas. The species is valued for its hardiness and is sometimes used in traditional medicine and as a source of wood.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia assimilis"
    },
    "taxonomy_art_desc": "Acacia assimilis subsp. atroviridis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their complex flower structures and diverse habitats. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or bean family, and is recognized for its distinctive pod-like fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and the production of legume pods. Its species is Acacia assimilis, a particular species within the Acacia genus that includes several subspecies, with atroviridis being one of them, distinguished by its specific morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia assimilis subsp. atroviridis is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This subspecies thrives in coastal and semi-arid environments. It is often associated with shrublands and open woodlands. Its distribution is limited to specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acacia assimilis subsp. atroviridis was mainly introduced to Australia as a potential ornamental and potentially useful plant for soil stabilization. It was introduced during the early 20th century, primarily for its hardy nature and ability to thrive in arid and semi-arid environments. However, it has since become invasive in some regions, outcompeting native flora and altering ecosystem dynamics. Its rapid growth and seed dispersal mechanisms contribute to its spread across various landscapes. Despite its ecological impact, it remains valued for its drought tolerance and nitrogen-fixing capabilities."
}
