{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cundinamarcae",
    "plant_slug": "acacia-cundinamarcae",
    "plant_name_scientific": "acacia cundinamarcae",
    "intro": "Acacia cundinamarcae, commonly known as the Colombian acacia, is a deciduous shrub native to the Andes mountains of Colombia. It is characterized by its feathery, bipinnate leaves and produces yellow flowers in clusters. The plant is adapted to high-altitude environments and is often found in rocky soils. It is also valued for its ornamental appeal and is used in traditional medicine. Its ecological role includes providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cundinamarcae is primarily native to Colombia, specifically in the Andean regions of the country. It is commonly found in the departments of Cundinamarca, Boyacá, and parts of the Eastern Andes. This species thrives in high-altitude grasslands and dry forests, often in areas with moderate to high rainfall. It is an important component of the local flora and is adapted to the unique climate and soil conditions of its native habitat. The plant is also occasionally found in adjacent regions of Venezuela and Ecuador.",
    "distribution_introduced_art_desc": "Acacia cundinamarcae was mainly introduced to ornamental horticulture and reforestation projects due to its attractive foliage and ability to thrive in arid conditions. It is commonly found in regions with dry climates, such as parts of Central and South America. The plant has been cultivated for its ecological benefits, including soil stabilization and providing habitat for local wildlife. However, its introduction has raised concerns about potential invasiveness in non-native environments. Despite these concerns, it remains a popular choice for landscaping and environmental restoration efforts."
}
