{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia plautella",
    "plant_slug": "acacia-plautella",
    "plant_name_scientific": "acacia plautella",
    "intro": "Acacia plautella, commonly known as the coastal acacia, is a shrub native to the coastal regions of southern Africa. It is characterized by its slender, often multi-branched stems and small, bipinnate leaves. The plant produces yellow flowers in dense, globular inflorescences, which are typically visited by bees and other pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by wind. Acacia plautella is well-suited to coastal environments due to its tolerance of salt spray and sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia plautella"
    },
    "taxonomy_art_desc": "Acacia plautella belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often compound leaves. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive acicular leaves and often thorny structures. Its species is Acacia plautella, a specific type within the Acacia genus, native to certain regions of Australia, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia plautella is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This plant thrives in arid and semi-arid environments, often growing in sandy soils. It is part of the larger Acacia species that are well-adapted to the harsh conditions of the Australian landscape. Its distribution is largely restricted to the native flora of Western Australia.",
    "distribution_introduced_art_desc": "Acacia plautella was mainly introduced to areas with suitable climate conditions, including regions with warm temperatures and well-drained soils. It has been reported in several countries in the Mediterranean Basin, parts of Africa, and some regions in Asia. This plant is often found in disturbed habitats such as roadsides, abandoned fields, and urban areas. Its introduction is likely due to its adaptability and rapid growth rate, which can lead to ecological impacts in native ecosystems. However, its distribution is still limited compared to other invasive species."
}
