{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia × gladiata",
    "plant_slug": "acacia-×-gladiata",
    "plant_name_scientific": "acacia × gladiata",
    "intro": "Acacia × gladiata, commonly known as the hybrid wattle, is a deciduous shrub or small tree native to Australia. It is a hybrid species resulting from the cross between Acacia aneura (mulga) and Acacia longifolia (coast wattle). The plant is characterized by its narrow, feather-like leaves and yellow flowers that bloom in late spring or early summer. It thrives in well-drained soils and is often found in arid or semi-arid regions. Acacia × gladiata is valued for its hardiness and is sometimes cultivated for ornamental purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia × gladiata is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Botswana, and South Africa. It is commonly found in savannas and rocky outcrops where it thrives in dry, well-drained soils. This hybrid species is known for its distinctive foliage and is often used in ornamental horticulture due to its hardy nature. It plays a role in local ecosystems by providing habitat and food for various animals. Its distribution is closely linked to the specific climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia × gladiata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often forming dense thickets. This hybrid species is valued for its rapid growth and ability to thrive in harsh environmental conditions. It has been used for erosion control and as a source of timber and fodder. However, its invasive potential has raised concerns in some areas where it competes with native vegetation."
}
