{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brasiliensis",
    "plant_slug": "acacia-brasiliensis",
    "plant_name_scientific": "acacia brasiliensis",
    "intro": "Acacia brasiliensis, commonly known as the Brazilian acacia, is a flowering plant native to South America, particularly Brazil. It is a small to medium-sized tree or shrub that can grow up to 10 meters in height. The plant is characterized by its bipinnate leaves, which are composed of numerous small leaflets arranged in a feathery pattern. Its flowers are typically yellow or golden in color, forming dense, globular clusters. Acacia brasiliensis is often found in tropical and subtropical regions, where it thrives in well-drained soils and full sunlight.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brasiliensis is primarily native to Brazil, specifically the Atlantic Forest region. It is found in the northeastern part of the country, including the states of Bahia, Pernambuco, and Piauí. This species thrives in humid tropical climates and is commonly found in secondary forests and along riverbanks. It plays an important ecological role in its native habitat by providing food and shelter for various wildlife species. Due to habitat loss, it is also considered a vulnerable species in some areas.",
    "distribution_introduced_art_desc": "Acacia brasiliensis was mainly introduced to South America, particularly in Brazil, as an ornamental plant due to its unique appearance and ability to thrive in various climates. It has also been introduced to parts of Africa and Australia, where it has sometimes become invasive. The plant is valued for its hardy nature and ability to grow in poor soils, making it a popular choice for landscaping and reforestation projects. However, its rapid spread in some regions has raised concerns about its impact on native ecosystems. Despite its benefits, careful management is needed to prevent it from becoming a weed in non-native environments."
}
