{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aegyptiaca",
    "plant_slug": "acacia-aegyptiaca",
    "plant_name_scientific": "acacia aegyptiaca",
    "intro": "Acacia aegyptiaca, commonly known as the Egyptian acacia or sacred thorn, is a shrub or small tree native to the hot, arid regions of Africa and the Middle East. It is characterized by its slender, thorny stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers in dense, globular clusters, followed by woody pods containing flat, fibrous seeds. It is well adapted to drought conditions, with a deep root system that allows it to survive in poor soil and extreme temperatures. Acacia aegyptiaca has been used traditionally for its timber, gum, and medicinal properties.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aegyptiaca is primarily native to North Africa, the Middle East, and parts of the Arabian Peninsula. It is commonly found in arid and semi-arid regions, including countries such as Egypt, Sudan, Saudi Arabia, and Israel. This plant thrives in sandy or rocky soils and is well adapted to hot, dry climates. It is often seen growing along roadsides, in deserts, and in scrublands. Acacia aegyptiaca is also known as the \"Egyptian thorn\" due to its sharp spines and historical significance in the region.",
    "distribution_introduced_art_desc": "Acacia aegyptiaca was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality due to its drought tolerance. This plant is often used for land rehabilitation and as a source of timber and fodder. Its introduction has helped in restoring degraded lands in various parts of Africa and the Middle East. However, it can sometimes become invasive if not managed properly."
}
