{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adenocarpa",
    "plant_slug": "acacia-adenocarpa",
    "plant_name_scientific": "acacia adenocarpa",
    "intro": "Acacia adenocarpa, commonly known as the desert acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Middle East. It is characterized by its slender, often spiny branches and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in dense, globular clusters, which are followed by elongated, woody pods containing seeds. Acacia adenocarpa is well adapted to harsh environments, with deep roots and the ability to fix nitrogen through symbiotic bacteria. It plays an important ecological role in stabilizing soils and providing habitat for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adenocarpa is primarily native to northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This species thrives in open woodlands and shrublands, often along creek lines and in coastal areas. It is well adapted to harsh environmental conditions, including high temperatures and low rainfall. The plant plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia adenocarpa was mainly introduced to areas with sandy or loamy soils and a warm, dry climate. It thrives in regions with low rainfall and full sun exposure. This plant is often used for soil stabilization and as a source of timber and fuelwood. It has been introduced to several parts of Australia and the Mediterranean. Its rapid growth and adaptability make it a common invasive species in some regions."
}
