{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassistipula",
    "plant_slug": "acacia-crassistipula",
    "plant_name_scientific": "acacia crassistipula",
    "intro": "Acacia crassistipula, commonly known as the broad-tipped acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often branching stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow flowers in globular clusters, which are typically followed by woody, pod-like fruits containing several seeds. It thrives in dry, sandy soils and is often found in coastal and inland regions of southern Australia. Acacia crassistipula is adapted to arid conditions and plays a role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia crassistipula"
    },
    "taxonomy_art_desc": "Acacia crassistipula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex flower structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its unique pod-like fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid regions, known for their distinctive compound leaves and thorn-like structures. Its species is Acacia crassistipula, a specific type of acacia native to Australia, characterized by its long, slender leaflets and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassistipula is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the Cape Le Grand National Park. This species thrives in sandy soils and is often associated with coastal and near-coastal environments. It is well adapted to the arid and semi-arid climates of its native range. Acacia crassistipula plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia crassistipula was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since become naturalized in various regions, particularly in the North Island, where it thrives in a wide range of soil types. The plant is known for its ability to spread rapidly, often outcompeting native vegetation in disturbed areas. Its introduction has led to ecological concerns, as it can form dense thickets that alter local ecosystems. Despite its invasive tendencies, it remains a popular choice for landscaping in the region."
}
