{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia irrorata",
    "plant_slug": "acacia-irrorata",
    "plant_name_scientific": "acacia irrorata",
    "intro": "Acacia irrorata, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, lace-like appearance. The plant produces yellow flowers in globular clusters, which bloom in spring and attract various pollinators. Acacia irrorata is adapted to arid and semi-arid environments, making it drought-tolerant and resilient. Its seeds are encased in hard pods and are often dispersed by wind or animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia irrorata"
    },
    "taxonomy_art_desc": "Acacia irrorata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Fabales, which includes plants with characteristic flowers that have a single pistil and stamens in groups of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and compound leaves. Its species is Acacia irrorata, a specific type of acacia found in arid regions, known for its feathery foliage and ability to thrive in harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia irrorata is primarily native to New South Wales, Queensland, and Victoria. This plant is commonly found in dry, open habitats such as woodlands, grasslands, and along riverbanks. It thrives in regions with a temperate to sub-tropical climate. Acacia irrorata is well adapted to withstand drought conditions. Its distribution reflects its preference for well-drained soils and full sun exposure.",
    "distribution_introduced_art_desc": "Acacia irrorata was mainly introduced to areas with dry, sandy soils and a warm climate, typically found in arid and semi-arid regions. It is commonly found in regions such as parts of Australia, South Africa, and the southwestern United States. This plant is often used for erosion control due to its deep root system and ability to thrive in poor soil conditions. It has also been introduced as an ornamental plant in some parts of the world. However, in certain regions, it has become invasive, outcompeting native vegetation."
}
