{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia enervia",
    "plant_slug": "acacia-enervia",
    "plant_name_scientific": "acacia enervia",
    "intro": "Acacia enervia, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, linear leaves and yellow flowers. The plant is typically found in arid and semi-arid regions, often growing on rocky soils. Acacia enervia has a deep root system, allowing it to thrive in harsh, drought-prone environments. Its flowers are important for pollinators and contribute to the ecological diversity of its habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia enervia"
    },
    "taxonomy_art_desc": "Acacia enervia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of a group of vascular plants that includes horsetails and includes some of the oldest known plant lineages. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which comprises plants that typically have flowers with five petals and are often legumes, including many nitrogen-fixing species. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its pod-like fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny foliage and the production of pod fruits. Its species is Acacia enervia, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia enervia is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas around the Fitzgerald River National Park and the Geraldton area. This plant thrives in dry, sandy soils and is often found in coastal and inland regions. It is an important component of the local flora and is adapted to the arid and semi-arid climates of the region. Acacia enervia is also known for its distinctive yellow flowers and its role in providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia enervia was mainly introduced to areas with well-drained soils and a warm, temperate climate. It is commonly found in regions with low to moderate rainfall. This plant thrives in full sun and is often used in landscaping due to its hardy nature. It has been introduced to several parts of the United States, particularly in the southern and western states. Its ability to tolerate drought makes it a popular choice for erosion control and ornamental purposes."
}
