{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia latescens var. grandifolia",
    "plant_slug": "acacia-latescens-var-grandifolia",
    "plant_name_scientific": "acacia latescens var. grandifolia",
    "intro": "Acacia latescens var. grandifolia, commonly known as the large-flowered acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its slender, multi-branched stems and small, glandular leaves that are often covered in a whitish, powdery coating. The plant produces yellow, globular inflorescences that bloom during the warmer months, attracting pollinators such as bees and birds. Its seeds are enclosed in woody pods and are adapted for dispersal by wind or through animal activity. This species is well-suited to harsh environments due to its drought tolerance and ability to fix nitrogen through its root nodules.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia latescens var. grandifolia is primarily native to the arid and semi-arid regions of central and western Australia. This variety is commonly found in areas with low rainfall and well-drained soils, such as the Simpson Desert and the Great Sandy Desert. It is often associated with sandy or gravelly soils and thrives in open, sunny environments. The plant is well adapted to harsh climatic conditions, making it a resilient component of the local flora. It plays an important ecological role in stabilizing soil and providing habitat for native fauna.",
    "distribution_introduced_art_desc": "Acacia latescens var. grandifolia was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and central parts of the continent. This plant is often used for soil stabilization and as a source of browse for livestock. Its introduction has been associated with land rehabilitation efforts in degraded landscapes. However, its spread can sometimes lead to ecological impacts in native ecosystems."
}
