{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acutifolia",
    "plant_slug": "acacia-acutifolia",
    "plant_name_scientific": "acacia acutifolia",
    "intro": "Acacia acutifolia, commonly known as the sharp-leaved acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its slender, often spiny stems and compound leaves that are trifoliate or pinnate. The plant produces yellow flowers in globular or cylindrical inflorescences, which are typical of the Acacia genus. Its adaptations include deep root systems and waxy leaf surfaces to reduce water loss in dry environments. Acacia acutifolia is also known for its role in providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acutifolia is primarily native to the arid and semi-arid regions of the Middle East, North Africa, and parts of the Arabian Peninsula. It thrives in harsh desert environments with low rainfall and high temperatures. This species is commonly found in rocky soils and along coastal dunes. It plays an important ecological role in stabilizing sand dunes and providing habitat for local wildlife. Its adaptability makes it a resilient plant in extreme climates.",
    "distribution_introduced_art_desc": "Acacia acutifolia was mainly introduced to arid and semi-arid regions for its potential in soil stabilization and as a source of timber and fodder. It has been widely planted in areas of Australia, the Middle East, and parts of Africa due to its drought tolerance and rapid growth. However, its introduction has sometimes led to ecological concerns, as it can outcompete native species in certain environments. The plant is often used in reforestation projects and land restoration efforts in degraded landscapes. Its distribution is now expanding beyond its original range due to human intervention and climate change."
}
