{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adoxa var. adoxa",
    "plant_slug": "acacia-adoxa-var-adoxa",
    "plant_name_scientific": "acacia adoxa var. adoxa",
    "intro": "Acacia adoxa var. adoxa, commonly known as the narrow-leaved wattle, is a shrub native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces bright yellow flowers in globular or cylindrical inflorescences, typically during the summer months. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its striking floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia adoxa"
    },
    "taxonomy_art_desc": "Acacia adoxa var. adoxa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia adoxa, a specific variety within the Acacia genus, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adoxa var. adoxa is primarily native to the Northern Territory and Western Australia. This variant of the species is commonly found in the arid and semi-arid regions of these areas. It thrives in sandy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia adoxa var. adoxa was mainly introduced to regions with warm, arid climates and well-drained soils, often as an ornamental or for erosion control. It is commonly found in disturbed areas such as roadsides, abandoned fields, and urban landscapes. This plant thrives in full sun and is drought-tolerant, making it adaptable to a variety of environmental conditions. Its ability to spread through seeds and vegetative growth has led to its establishment in non-native areas. However, its invasive potential varies depending on local ecological conditions and management practices."
}
