{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia salicina var. typica",
    "plant_slug": "acacia-salicina-var-typica",
    "plant_name_scientific": "acacia salicina var. typica",
    "intro": "Acacia salicina var. typica, commonly known as the weeping acacia, is a fast-growing, deciduous shrub or small tree native to Australia. It is characterized by its pendulous, feathery foliage that gives it a distinctive, cascading appearance. The plant produces yellow flowers in winter, which are clustered in spherical inflorescences. It thrives in well-drained soils and is often used in landscaping for its ornamental value. However, it can be prone to root rot in poorly drained conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia salicina var. typica is primarily native to eastern Australia, including regions such as New South Wales, Queensland, and the northern parts of Victoria. It is commonly found in coastal areas, sandy soils, and open woodlands. This variety is adapted to a range of climatic conditions, including temperate and subtropical climates. It is often seen growing in coastal dunes and along the edges of forests. Its distribution is closely linked to the availability of well-drained soils and sufficient sunlight.",
    "distribution_introduced_art_desc": "Acacia salicina var. typica was mainly introduced to stabilize sand dunes and prevent soil erosion in coastal and arid regions. It is commonly used in revegetation projects due to its rapid growth and ability to thrive in poor soil conditions. This plant is also valued for its ornamental qualities, including its attractive yellow flowers and feathery foliage. It has been introduced to several parts of Australia, including Western Australia and South Australia. However, its spread can sometimes lead to the displacement of native vegetation if not managed properly."
}
