{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ligulata var. minor",
    "plant_slug": "acacia-ligulata-var-minor",
    "plant_name_scientific": "acacia ligulata var. minor",
    "intro": "Acacia ligulata var. minor, commonly known as the narrow-leaved wattle, is a shrub native to southern Australia. It is characterized by its small, narrow leaves and yellow flowers that appear in winter. The plant produces seed pods that mature into a hard, woody structure. It is often found in dry, sandy soils and is adapted to arid environments. This variety is valued for its ornamental appeal and ecological importance in supporting native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ligulata var. minor is primarily native to southern Australia, including regions in Western Australia, South Australia, and Victoria. It is commonly found in dry, sandy soils and is often associated with shrublands and open woodlands. This variety is adapted to arid and semi-arid environments, thriving in areas with low rainfall and high temperatures. It plays an important role in local ecosystems by providing habitat and food for various wildlife species. The plant is also known for its small, narrow leaves and yellow flowers, which bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia ligulata var. minor was mainly introduced to control soil erosion and stabilize degraded lands in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in poor soil conditions and withstand harsh climates. This plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped restore vegetation in areas affected by desertification. However, it requires careful management to prevent it from becoming invasive in non-target environments."
}
