{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gonocarpa var. lasiocalyx",
    "plant_slug": "acacia-gonocarpa-var-lasiocalyx",
    "plant_name_scientific": "acacia gonocarpa var. lasiocalyx",
    "intro": "Acacia gonocarpa var. lasiocalyx, commonly known as the rough-barked acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its pale green, bipinnate leaves and yellow spherical flowerheads that appear in winter. The plant has a woody, fissured bark that becomes rough and flaky with age. It is well adapted to drought conditions and can thrive in poor soils. The seeds are encased in a hard pod and are often dispersed by animals or through wind.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gonocarpa var. lasiocalyx is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This variety is often associated with dry woodland and shrubland habitats. It is well adapted to the harsh environmental conditions of its native range. The plant plays an important role in the ecological systems of these regions.",
    "distribution_introduced_art_desc": "Acacia gonocarpa var. lasiocalyx was mainly introduced to areas with a Mediterranean climate, characterized by mild, wet winters and warm, dry summers. It thrives in well-drained soils and is commonly found in coastal regions and inland valleys. This variety is known for its distinctive silver-blue foliage and is often used in landscaping for its ornamental value. It has been introduced to parts of California, Oregon, and other regions with similar climatic conditions. However, it requires careful management due to its potential to become invasive in certain environments."
}
