{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia celsa",
    "plant_slug": "acacia-celsa",
    "plant_name_scientific": "acacia celsa",
    "intro": "Acacia celsa, commonly known as the golden wattle, is a flowering plant native to Australia. It is a small shrub or tree that typically grows in dry, sandy soils. The plant is characterized by its feathery leaves and bright yellow flowers, which bloom in spring. Acacia celsa is a member of the legume family and has a deep root system that helps it survive in arid conditions. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia celsa"
    },
    "taxonomy_art_desc": "Acacia celsa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which comprises plants with flowers that typically have two sets of petals and includes legumes, which are known for their nitrogen-fixing ability. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their phyllodes (modified leaves) and often used in traditional medicine and as sources of timber. Its species is Acacia celsa, a specific type of acacia found in certain regions, known for its unique morphology and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia celsa is primarily native to Queensland. It is commonly found in the eastern and central regions of the state. This plant thrives in dry, open habitats such as woodlands and grasslands. It is well adapted to the tropical and subtropical climates of Queensland. Acacia celsa plays an important role in the local ecosystem and is often used in landscaping due to its hardy nature.",
    "distribution_introduced_art_desc": "Acacia celsa was mainly introduced to control soil erosion and stabilize degraded lands in arid and semi-arid regions. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped restore degraded ecosystems in several parts of Africa and the Middle East. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
