{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longiphyllodinea",
    "plant_slug": "acacia-longiphyllodinea",
    "plant_name_scientific": "acacia longiphyllodinea",
    "intro": "Acacia longiphyllodinea, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often drooping stems and bipinnate leaves composed of numerous small, linear leaflets. The plant produces yellow, globular flower heads that appear in late summer to early autumn. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia longiphyllodinea is valued for its ornamental appeal and is often used in landscaping and revegetation projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia longiphyllodinea"
    },
    "taxonomy_art_desc": "Acacia longiphyllodinea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive umbrella-like flower clusters and often used in traditional medicine. Its species is Acacia longiphyllodinea, a specific type of acacia with long, narrow leaves and is native to certain regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longiphyllodinea is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the areas of the Fitzgerald River National Park and the coastal regions of the South West. This species typically grows in sandy soils and is often found in heathlands and coastal dunes. It is well adapted to the dry and warm climate of its native habitat. The plant plays an important role in the local ecosystem by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia longiphyllodinea was mainly introduced to New Zealand as an ornamental plant due to its unique foliage and drought tolerance. It has since become naturalized in several regions, particularly in the North Island, where it thrives in disturbed soils and open habitats. The plant's rapid growth and ability to colonize bare ground have led to concerns about its potential to become invasive. Despite its aesthetic appeal, its spread has raised ecological issues due to its competitive nature. Monitoring and management strategies are being developed to control its spread and mitigate its impact on native ecosystems."
}
