{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia podalyriifolia var. viridis",
    "plant_slug": "acacia-podalyriifolia-var-viridis",
    "plant_name_scientific": "acacia podalyriifolia var. viridis",
    "intro": "Acacia podalyriifolia var. viridis, commonly known as the green acacia, is a variant of the acacia species native to certain regions of Australia. It is characterized by its slender, erect growth habit and narrow, linear leaves that are typically a vibrant green. The plant produces small, yellow flowers arranged in clusters, which are followed by distinctive, flat, pod-like fruits. It thrives in well-drained soils and is often found in dry, open habitats. Due to its ornamental value, it is occasionally cultivated in gardens, though it requires careful management to prevent it from becoming invasive.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia podalyriifolia var. viridis is primarily native to eastern Australia, specifically the coastal regions of New South Wales and southeastern Queensland. It thrives in sandy soils and is commonly found in heathlands and open forests. This variant is known for its distinctive green foliage, which sets it apart from other acacia species. It is well adapted to the temperate climate of its native range. The plant is often used in landscaping due to its ornamental value and hardy nature.",
    "distribution_introduced_art_desc": "Acacia podalyriifolia var. viridis was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and unique appearance. However, it has since become invasive, outcompeting native species in certain areas. The plant spreads rapidly through seed dispersal, often along disturbed soils and in coastal regions. Its introduction has led to ecological concerns, prompting management efforts to control its spread."
}
