{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia linifolia var. prominens",
    "plant_slug": "acacia-linifolia-var-prominens",
    "plant_name_scientific": "acacia linifolia var. prominens",
    "intro": "Acacia linifolia var. prominens, commonly known as the coastal wattle, is a shrub native to coastal regions of southeastern Australia. It is characterized by its slender, often prostrate stems and small, yellow floral spikes that appear in late winter to early spring. The plant has bipinnate leaves, with each leaflet being narrow and linear, contributing to its overall delicate appearance. It thrives in sandy or well-drained soils and is often found in dunes or coastal heathlands. Due to its hardy nature and ornamental value, it is sometimes cultivated in gardens, though it is considered invasive in some areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia linifolia var. prominens is primarily native to southeastern Australia, including parts of New South Wales, Victoria, and South Australia. It is commonly found in coastal regions and sandy soils along the southern coast of Australia. This variety is often associated with heathland and open woodlands, thriving in well-drained soils. It is particularly common in areas such as the South Coast and the Otway Ranges. Due to its hardy nature, it is also found in some introduced areas outside its native range.",
    "distribution_introduced_art_desc": "Acacia linifolia var. prominens was mainly introduced to coastal and sandy areas of southern Australia, particularly in New South Wales and Victoria. It is commonly found in dunes, heathlands, and open woodlands where it thrives in well-drained soils. This plant is valued for its ability to stabilize sand dunes and prevent erosion. It is also popular in horticulture due to its attractive foliage and hardy nature. However, it can become invasive in certain environments if not managed properly."
}
