{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chamaeleon",
    "plant_slug": "acacia-chamaeleon",
    "plant_name_scientific": "acacia chamaeleon",
    "intro": "Acacia chamaeleon, commonly known as the dwarf acacia, is a small, shrub-like plant native to southern Africa. It is characterized by its dense, thorny foliage and yellow flowers that bloom in clusters. The plant has small, oval-shaped leaves that are often covered in fine hairs. It thrives in arid and semi-arid environments, making it well adapted to drought conditions. Acacia chamaeleon is often used in landscaping due to its hardy nature and attractive appearance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia chamaeleon"
    },
    "taxonomy_art_desc": "Acacia chamaeleon belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse growth forms and habitats. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species found in arid and tropical regions. Its species is Acacia chamaeleon, a specific type of acacia that is native to certain regions and is recognized for its unique characteristics within the genus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chamaeleon is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils and dry climates. This plant thrives in coastal and inland regions, often growing in shrublands and open woodlands. It is well adapted to the arid and semi-arid conditions of its native habitat. Acacia chamaeleon plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia chamaeleon was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for dryland environments. This plant has been introduced to parts of Australia, the Middle East, and certain regions of Africa. Its introduction has sometimes led to ecological concerns due to its invasive potential in non-native habitats. Despite this, it is valued for its hardy nature and ability to stabilize soils in challenging environments."
}
