{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia axillaris var. macrophylla",
    "plant_slug": "acacia-axillaris-var-macrophylla",
    "plant_name_scientific": "acacia axillaris var. macrophylla",
    "intro": "Acacia axillaris var. macrophylla, commonly known as the large-leaf golden wattle, is a shrub or small tree native to Australia. It is characterized by its compound leaves, which are typically long and narrow with a distinctive golden-yellow floral display. The plant produces small, fluffy pods that contain seeds, and it thrives in well-drained soils in full sun. It is often used in landscaping for its ornamental value and hardy nature. The species is also valued for its role in ecological systems, providing food and habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia axillaris var. macrophylla is primarily native to the eastern and southern regions of Australia, including the states of New South Wales, Victoria, and South Australia. It is commonly found in dry, open habitats such as woodlands, grasslands, and rocky outcrops. This variety is adapted to arid and semi-arid environments, often growing in well-drained soils. It is a shrub or small tree that plays an important role in local ecosystems. Its distribution is closely associated with areas that have a Mediterranean climate with hot, dry summers and mild, wet winters.",
    "distribution_introduced_art_desc": "Acacia axillaris var. macrophylla was mainly introduced to regions with warm, dry climates and well-drained soils, often found in coastal areas and rocky outcrops. It is commonly used in landscaping due to its hardy nature and attractive, feathery foliage. This variety is particularly suited for areas with low rainfall and high sunlight exposure. It has been introduced to several parts of Australia, including New South Wales and Queensland, where it thrives in both urban and rural settings. However, its spread has raised concerns due to its potential to become invasive in certain environments."
}
