{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dawsonii",
    "plant_slug": "acacia-dawsonii",
    "plant_name_scientific": "acacia dawsonii",
    "intro": "Acacia dawsonii, commonly known as the Dawson's wattle, is a small shrub native to the arid regions of central Australia. It is characterized by its feathery, yellow flowers that bloom in spring, adding a striking visual contrast to its grey-green foliage. The plant has phyllodes, which are flattened leaf stalks that function as leaves, a common adaptation in arid environments. It is highly drought-tolerant and thrives in well-drained soils. Acacia dawsonii plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dawsonii"
    },
    "taxonomy_art_desc": "Acacia dawsonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is known for its complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their showy flowers and diverse growth forms. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive umbrella-shaped flower clusters and often used in traditional medicine and as ornamental plants. Its species is Acacia dawsonii, a specific type of acacia native to certain regions of Australia, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dawsonii is primarily native to New South Wales, Queensland, and Victoria. This species is commonly found in the arid and semi-arid regions of these Australian states. It thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. Acacia dawsonii is well adapted to the dry climate and can tolerate poor soil conditions. It plays an important ecological role in providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia dawsonii was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and central parts of the continent. This plant is often used for erosion control due to its ability to stabilize soil with its deep root system. It also provides habitat and food for various native wildlife species. However, its introduction has sometimes led to competition with native vegetation in certain ecosystems."
}
