{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia richardsii",
    "plant_slug": "acacia-richardsii",
    "plant_name_scientific": "acacia richardsii",
    "intro": "Acacia richardsii, commonly known as the desert acacia, is a shrub native to arid regions of the southwestern United States and northern Mexico. It is characterized by its slender, multi-branched stems and small, compound leaves that reduce water loss in hot, dry environments. The plant produces yellow flowers in spring, which are followed by long, flat pods containing edible seeds. Acacia richardsii is well adapted to harsh conditions, making it a resilient component of desert ecosystems. Its ability to fix nitrogen in the soil also contributes to soil fertility in nutrient-poor environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia richardsii"
    },
    "taxonomy_art_desc": "Acacia richardsii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acacia-like leaves and often used in traditional medicine. Its species is Acacia richardsii, a specific type of acacia native to the southwestern United States, known for its ecological importance and unique adaptations to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia richardsii is primarily native to the Northern Territory and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often seen in shrublands and along coastal dunes. Acacia richardsii is well adapted to the harsh environmental conditions of its native range. It plays an important role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia richardsii was mainly introduced to areas with arid or semi-arid climates, particularly in the southwestern United States and parts of Mexico. It thrives in well-drained soils and is commonly found in desert environments. This plant is often used for erosion control due to its extensive root system. It is also known for its ability to fix nitrogen, which can improve soil fertility. However, it can become invasive in some regions, outcompeting native vegetation."
}
