{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spinosissima",
    "plant_slug": "acacia-spinosissima",
    "plant_name_scientific": "acacia spinosissima",
    "intro": "Acacia spinosissima, commonly known as the spinous acacia, is a shrub or small tree native to arid regions of southern Africa. It is characterized by its spiny, thorn-like structures that provide defense against herbivores. The plant produces yellow flowers in globular clusters, which bloom during the rainy season. Its leaves are small, bipinnate, and often covered in fine hairs. Acacia spinosissima is well adapted to drought and can thrive in poor soil conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spinosissima"
    },
    "taxonomy_art_desc": "Acacia spinosissima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for their nitrogen-fixing ability. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of shrubs and trees found mainly in Africa, Australia, and the Americas, known for their phyllodes and often for their ability to fix nitrogen. Its species is Acacia spinosissima, a specific type of acacia known for its spiny appearance and adaptation to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spinosissima is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in dry, sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia spinosissima plays an important role in the local ecosystem and is a characteristic species of the region.",
    "distribution_introduced_art_desc": "Acacia spinosissima was mainly introduced to areas with arid or semi-arid climates, particularly in regions of Australia and parts of southern Africa. It thrives in well-drained soils and is commonly found in savannas and open woodlands. This plant is often used for its hardy nature and ability to stabilize soils in degraded landscapes. Its introduction has been associated with both ecological benefits and potential invasiveness in certain environments. It is also valued for its ornamental appeal and use in traditional medicine."
}
