{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia resinistipulea",
    "plant_slug": "acacia-resinistipulea",
    "plant_name_scientific": "acacia resinistipulea",
    "intro": "Acacia resinistipulea, commonly known as the resinous acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, branching structure and small, bipinnate leaves that are often covered in a fine, silky pubescence. The plant produces yellow flowers in globular inflorescences, which are followed by woody pods containing lens-shaped seeds. Acacia resinistipulea is notable for secreting a resinous substance from its stems and leaves, which has been used traditionally by indigenous communities. Its ability to thrive in harsh, dry environments makes it an important component of its ecosystem.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia resinistipulea"
    },
    "taxonomy_art_desc": "Acacia resinistipulea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often featuring jointed stems and spore-producing structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods as fruits and often having nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are typically shrubs or trees with phyllodes and often produce pods. Its species is Acacia resinistipulea, a specific type of acacia known for its unique characteristics, including resinous structures and distinctive stipules.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia resinistipulea is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the areas of the Geraldton and Shark Bay regions. This species thrives in sandy soils and is commonly found in coastal and inland areas. It is an important component of the local flora in these regions. The plant is well adapted to the arid and semi-arid climates of Western Australia.",
    "distribution_introduced_art_desc": "Acacia resinistipulea was mainly introduced to areas with a warm, temperate climate and well-drained soils, typically found in regions with seasonal rainfall. It thrives in open landscapes such as grasslands, savannas, and disturbed sites where it can establish itself quickly. The plant is often used for soil stabilization due to its extensive root system and ability to tolerate drought conditions. Its introduction has been associated with both ecological benefits and potential invasiveness in certain environments. Careful management is recommended to prevent unintended spread in non-native regions."
}
