{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia russelliana",
    "plant_slug": "acacia-russelliana",
    "plant_name_scientific": "acacia russelliana",
    "intro": "Acacia russelliana, commonly known as Russell's wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often spiny stems and bipinnate leaves that are divided into numerous small leaflets. The plant produces yellow flowers in cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, open habitats. Russell's wattle is valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia russelliana is primarily native to northern Australia, including regions of Queensland, the Northern Territory, and Western Australia. It thrives in arid and semi-arid environments, often found in dry woodlands, shrublands, and rocky areas. This species is well adapted to the harsh climate of its native range, with characteristics such as deep root systems and waxy leaves that help it conserve water. It plays an important ecological role in supporting local wildlife and maintaining biodiversity. Acacia russelliana is also known for its distinctive yellow flowers, which bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia russelliana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or rocky soils. The plant is known for its ability to withstand drought and poor soil conditions, which contributes to its successful establishment. It has been reported in the Western Cape and KwaZulu-Natal provinces. Due to its rapid growth and spread, it is considered a potential invasive species in some areas."
}
