{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bolei",
    "plant_slug": "acacia-bolei",
    "plant_name_scientific": "acacia bolei",
    "intro": "Acacia bolei, commonly known as the yellow acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow to golden flowers in globular or cylindrical clusters, which bloom during the rainy season. Acacia bolei is adapted to survive in harsh, drought-prone environments, with deep root systems and a high tolerance for heat and low soil moisture. It is often used in traditional medicine and as a source of fuelwood in its native habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bolei is primarily native to the arid regions of southern Africa, including Namibia, Botswana, and parts of South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and desert ecosystems. This plant is well adapted to dry climates and can survive with minimal rainfall. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia bolei is also sometimes cultivated in gardens for its ornamental value.",
    "distribution_introduced_art_desc": "Acacia bolei was mainly introduced to the Mediterranean region for its ornamental value and ability to thrive in dry climates. It is commonly found in gardens and landscaped areas where it provides shade and aesthetic appeal. The plant is well adapted to poor soils and can tolerate drought conditions, making it a popular choice for xeriscaping. However, it has also become invasive in some areas, outcompeting native vegetation. Proper management is necessary to prevent its spread in sensitive ecosystems."
}
