{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spondylophylla",
    "plant_slug": "acacia-spondylophylla",
    "plant_name_scientific": "acacia spondylophylla",
    "intro": "Acacia spondylophylla, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, yellow flowers and feathery leaves that are often mistaken for those of other acacia species. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. It produces small, woody pods that contain seeds, which are dispersed by wind. The species is valued for its ornamental appeal and its role in stabilizing soil in degraded landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spondylophylla"
    },
    "taxonomy_art_desc": "Acacia spondylophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, often featuring vascular tissues and a distinct life cycle. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like acacia pods and often used in traditional medicine. Its species is Acacia spondylophylla, a specific type of acacia found in certain regions, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spondylophylla is primarily native to Northern Territory, Queensland, and Western Australia. It is commonly found in arid and semi-arid regions across these areas. This plant thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distribution is closely linked to the environmental conditions of the regions it inhabits.",
    "distribution_introduced_art_desc": "Acacia spondylophylla was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with low rainfall. It thrives in open habitats such as grasslands, woodlands, and disturbed soils where it can establish quickly. This plant is commonly used for erosion control due to its rapid growth and deep root system. It has also been introduced as an ornamental plant in some parts of the world for its attractive foliage and flowers. However, in certain regions, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
