{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hirtella",
    "plant_slug": "acacia-hirtella",
    "plant_name_scientific": "acacia hirtella",
    "intro": "Acacia hirtella, commonly known as the hairy wattle, is a small shrub native to Australia. It is characterized by its yellow flowers and feathery leaves, which are often covered in fine hairs. The plant produces small, flat pods that contain seeds, and it thrives in dry, sandy soils. Acacia hirtella is well adapted to arid environments and is often found in coastal and inland regions. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hirtella is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, rocky outcrops, and sandy soils where it thrives in dry conditions. This plant is well adapted to the harsh climate of its native habitat, with its small leaves and deep root system helping it conserve water. It plays an important role in the local ecosystem by providing food and shelter for various wildlife species. Acacia hirtella is also known for its ability to fix nitrogen in the soil, improving soil fertility in its environment.",
    "distribution_introduced_art_desc": "Acacia hirtella was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with seasonal rainfall. It is commonly established in disturbed sites such as roadsides, clearings, and abandoned fields. The plant thrives in full sun and is known for its ability to tolerate drought conditions. Its introduction has led to its spread in several parts of the United States, particularly in the southern and western regions. Due to its rapid growth and adaptability, it is considered an invasive species in some areas."
}
