{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia marramamba",
    "plant_slug": "acacia-marramamba",
    "plant_name_scientific": "acacia marramamba",
    "intro": "Acacia marramamba, commonly known as the red acacia, is a shrub native to parts of Africa. It belongs to the Fabaceae family, which is characterized by its leguminous properties and ability to fix nitrogen in the soil. The plant features compound leaves with small, oval-shaped leaflets and produces yellow or pale yellow flowers clustered in spherical inflorescences. It is often found in dry, sandy or rocky soils and is adapted to arid environments. The plant is also valued for its ornamental appeal and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia marramamba"
    },
    "taxonomy_art_desc": "Acacia marramamba belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants with distinctive flowers and includes legumes, which are known for nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species native to Australia and other parts of Africa and Asia. Its species is Acacia marramamba, a specific type of acacia that is likely native to a particular region and may have unique ecological or morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia marramamba is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the Esperance and Fitzgerald regions. This plant thrives in sandy soils and is often found in coastal and semi-arid areas. It is well adapted to the dry and hot climate of its native habitat. Acacia marramamba plays an important role in the local ecosystem by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia marramamba was mainly introduced to control soil erosion and stabilize degraded lands in arid and semi-arid regions. It is commonly found in areas with low rainfall and poor soil quality due to its ability to thrive in harsh conditions. The plant is often used in reforestation projects because of its rapid growth and nitrogen-fixing capabilities. However, its introduction has sometimes led to the displacement of native vegetation in certain ecosystems. Despite its benefits, careful management is required to prevent it from becoming invasive in non-target areas."
}
