{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia jucunda",
    "plant_slug": "acacia-jucunda",
    "plant_name_scientific": "acacia jucunda",
    "intro": "Acacia jucunda, commonly known as the sweet acacia, is a small shrub native to southern Africa. It is characterized by its slender, upright growth habit and dense clusters of small, feathery leaves. The plant produces yellow flowers in winter, which are followed by flat, pod-like fruits containing several seeds. Acacia jucunda is adapted to arid and semi-arid environments, making it a hardy species in dry climates. It is often used in landscaping for its ornamental value and ability to thrive in poor soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia jucunda"
    },
    "taxonomy_art_desc": "Acacia jucunda belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, characterized by their diverse floral structures and evolutionary relationships. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include many legumes, known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its characteristic pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which includes many species with distinctive thorned stems and small, often fragrant flowers. Its species is Acacia jucunda, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia jucunda is primarily native to New South Wales and Queensland in Australia. It is commonly found in the arid and semi-arid regions of these states. This plant typically grows in sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the dry climate and can survive with minimal water. Acacia jucunda plays an important role in the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia jucunda was mainly introduced to New Zealand. It was brought there for its ornamental value and ability to thrive in a variety of soil conditions. The plant has since spread beyond cultivated areas, establishing itself in native ecosystems. Its introduction has raised concerns due to its potential to become invasive. However, it is currently managed through targeted control programs to limit its spread."
}
