{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adoxa",
    "plant_slug": "acacia-adoxa",
    "plant_name_scientific": "acacia adoxa",
    "intro": "Acacia adoxa, commonly known as the black acacia, is a shrub native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often spiny stems and bipinnate leaves that are divided into numerous small leaflets. The plant produces yellow flowers arranged in dense, globular inflorescences, which are typical of the Fabaceae family. Its seeds are encased in hard, woody pods, and the plant is adapted to arid and semi-arid environments. Acacia adoxa is also known for its ability to fix nitrogen, contributing to soil fertility in its native habitats.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia adoxa"
    },
    "taxonomy_art_desc": "Acacia adoxa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often associated with aromatic compounds. Its order is Fabales, which includes plants such as legumes and vetches, known for their symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a group of flowering plants commonly known as wattles, which are often found in arid and tropical regions. Its species is Acacia adoxa, a specific type of acacia known for its unique characteristics and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adoxa is primarily native to the Northern Territory and Western Australia. This shrub is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often seen in open woodlands and coastal dunes. The plant is well adapted to the harsh climatic conditions of its native habitat. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia adoxa was mainly introduced to areas with a Mediterranean climate, characterized by mild, wet winters and hot, dry summers. It thrives in well-drained soils and is commonly found in coastal regions and open woodlands. This plant has been introduced to several parts of California, where it has become naturalized in disturbed and urban environments. Its rapid growth and ability to fix nitrogen make it a potential invasive species in some regions. However, it is also valued for its ornamental qualities and ecological benefits in certain habitats."
}
