{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia atrox subsp. atrox",
    "plant_slug": "acacia-atrox-subsp-atrox",
    "plant_name_scientific": "acacia atrox subsp. atrox",
    "intro": "Acacia atrox subsp. atrox, commonly known as the black wattle, is a shrub or small tree native to southern Australia. It is characterized by its dark, fissured bark and compound leaves with phyllodes that are narrow and linear. The plant produces yellow globular flowers in late winter to early spring, followed by woody pods containing seeds. It is adapted to dry, sandy soils and is often found in coastal and inland regions. The species is known for its rapid growth and is used in horticulture and for soil stabilization.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia atrox"
    },
    "taxonomy_art_desc": "Acacia atrox subsp. atrox belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that are often legumes and are known for their ability to fix nitrogen. Its family is Fabaceae, commonly known as the legume or bean family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia atrox, a specific subspecies known for its robust growth and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia atrox subsp. atrox is primarily native to New South Wales. It is commonly found in the eastern regions of the state, particularly in areas with sandy or rocky soils. This subspecies is often associated with dry, open habitats such as woodlands and grasslands. It thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. The plant is well adapted to the environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia atrox subsp. atrox was mainly introduced to New Zealand. It was brought there during the 19th century as part of early European settlement efforts. The plant has since established itself in various habitats, including coastal areas and disturbed soils. It is considered an environmental weed in some regions due to its aggressive growth and ability to outcompete native species. Its distribution is now widespread across the North Island and parts of the South Island."
}
