{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia prunifolia",
    "plant_slug": "acacia-prunifolia",
    "plant_name_scientific": "acacia prunifolia",
    "intro": "Acacia prunifolia, commonly known as the sweet acacia, is a flowering plant native to South America. It is characterized by its slender, often branched stems and small, delicate leaves that are pinnately divided. The plant produces yellowish-green flowers that are clustered in spherical inflorescences, which bloom during the warmer months. Acacia prunifolia is adapted to dry environments and is often found in arid or semi-arid regions. Its unique appearance and ecological significance make it an interesting subject for botanical study.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia prunifolia is primarily native to northern Australia, including regions of Western Australia, Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This species thrives in coastal dunes and inland plains where it forms dense shrubs or small trees. It is well adapted to hot, dry climates and can tolerate saline conditions. Acacia prunifolia plays an important ecological role in stabilizing soils and providing habitat for native fauna.",
    "distribution_introduced_art_desc": "Acacia prunifolia was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential ecological benefits. It is commonly found in coastal regions and along roadsides, thriving in sandy or well-drained soils. The plant is known for its attractive, small yellow flowers and its ability to withstand harsh environmental conditions. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns about its impact on local biodiversity and ecosystem balance."
}
