{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tenuinervis",
    "plant_slug": "acacia-tenuinervis",
    "plant_name_scientific": "acacia tenuinervis",
    "intro": "Acacia tenuinervis, commonly known as the narrow-veined acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It is characterized by its slender, often thornless stems and bipinnate leaves with fine, parallel veins. The plant produces yellow or pale yellow flowers in compact clusters, which are followed by flat, pod-like fruits containing several seeds. Acacia tenuinervis is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. Its botanical features make it an important component of local ecosystems and a potential source of medicinal or ecological value.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tenuinervis"
    },
    "taxonomy_art_desc": "Acacia tenuinervis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their relatives, known for their ancient lineage and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which comprises plants with flowers that have a distinctive structure and includes legumes and other related families. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often used in traditional medicine. Its species is Acacia tenuinervis, a specific type of acacia known for its delicate, narrow leaves and is native to certain regions in Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tenuinervis is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This species thrives in open woodlands and grasslands with well-drained soils. It is often seen in the northeastern parts of Queensland, including areas near the coast and inland. Acacia tenuinervis plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia tenuinervis was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It has been widely planted for its ability to stabilize soils and provide forage for livestock. The plant is also valued for its hardy nature and capacity to withstand drought conditions. However, its introduction has sometimes led to ecological concerns due to its potential to outcompete native species. It is commonly found in parts of Australia, Africa, and the Middle East where it has been intentionally introduced for agricultural and environmental purposes."
}
