{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gemina",
    "plant_slug": "acacia-gemina",
    "plant_name_scientific": "acacia gemina",
    "intro": "Acacia gemina, commonly known as the slender acacia, is a shrub native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are composed of numerous small, oval-shaped leaflets. The plant produces small, yellowish-green flowers that are clustered in spherical inflorescences, which are highly attractive to pollinators such as bees and birds. Acacia gemina is well adapted to arid and semi-arid environments, with a deep root system that allows it to access water from deeper soil layers. Its wood is durable and has been used traditionally for various purposes, including construction and fuel.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gemina"
    },
    "taxonomy_art_desc": "Acacia gemina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true root system and a complex life cycle involving alternation of generations. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume family, which is recognized for its nitrogen-fixing abilities and the characteristic pod-like fruits. Its genus is Acacia, a group of shrubs and trees known for their distinctive umbrella-shaped flower clusters and often used in traditional medicine. Its species is Acacia gemina, a specific type of acacia that is likely adapted to particular environmental conditions and may have unique ecological or medicinal properties.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gemina is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important role in the local ecosystem by providing habitat and food for native wildlife. Acacia gemina is well adapted to the harsh climate of Western Australia.",
    "distribution_introduced_art_desc": "Acacia gemina was mainly introduced to areas with arid or semi-arid climates due to its adaptability to harsh environmental conditions. It thrives in regions with low rainfall and high temperatures, making it suitable for reclamation of degraded lands. The plant is often used in afforestation projects to prevent soil erosion and improve land productivity. Its introduction has also been linked to ornamental purposes in some regions where it is cultivated for its attractive foliage. However, its spread has raised concerns about potential invasiveness in non-native ecosystems."
}
