{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. latifolia",
    "plant_slug": "acacia-longifolia-var-latifolia",
    "plant_name_scientific": "acacia longifolia var. latifolia",
    "intro": "Acacia longifolia var. latifolia, commonly known as the narrow-leaved wattle, is a flowering plant native to southern Australia. It is characterized by its slender, yellow flowers that appear in late winter to early spring. The leaves are bipinnate, meaning they are divided into small, feathery leaflets, giving the plant a delicate appearance. It thrives in well-drained soils and is often found in coastal areas and sandy soils. This variety is sometimes used in ornamental gardening due to its attractive foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. latifolia is primarily native to southern Australia, including the states of South Australia, Western Australia, and Victoria. It is commonly found in coastal and sandy regions, particularly in the southern parts of the continent. This variety is adapted to dry, well-drained soils and is often seen in heathlands and shrublands. It thrives in areas with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. The plant is also occasionally found in New Zealand, where it has been introduced and naturalized.",
    "distribution_introduced_art_desc": "Acacia longifolia var. latifolia was mainly introduced to Australia as an ornamental plant due to its attractive foliage and hardy nature. It has since spread beyond cultivation and is now considered a weed in several regions, particularly in coastal areas. The plant thrives in a variety of soil types and is highly adaptable to different climates, contributing to its invasive potential. It is commonly found in disturbed areas, such as roadsides and urban environments, where it can outcompete native vegetation. Its rapid growth and ability to form dense thickets make it a significant ecological concern in invaded habitats."
}
