{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia piligera",
    "plant_slug": "acacia-piligera",
    "plant_name_scientific": "acacia piligera",
    "intro": "Acacia piligera, commonly known as the silky acacia, is a shrub native to the arid regions of Australia. It is characterized by its slender, branching structure and small, feathery leaves that are covered in fine, silky hairs. The plant produces yellow flowers that appear in globular clusters, typically during the warmer months. Its seeds are enclosed in woody pods and are adapted to disperse in dry conditions. Acacia piligera is well-suited to harsh environments and plays a role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia piligera"
    },
    "taxonomy_art_desc": "Acacia piligera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, a group of vascular plants that includes ferns and their allies, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants with a wide range of morphological diversity, often characterized by their primitive floral structures. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with rhizobia. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, characterized by their phyllodes and often used in ecological and commercial contexts. Its species is Acacia piligera, a specific type of acacia found in certain regions, known for its unique morphological traits and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia piligera is primarily native to New South Wales. It is commonly found in the dry, inland regions of the state, particularly in areas with sandy or gravelly soils. This plant is well adapted to arid and semi-arid environments, often growing in open woodlands or shrublands. It is an important component of the local flora and provides habitat for various native fauna. Its distribution is largely restricted to the central and western parts of New South Wales.",
    "distribution_introduced_art_desc": "Acacia piligera was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for rehabilitation of degraded lands. This plant is often used in reforestation projects due to its ability to fix nitrogen and improve soil fertility. Its introduction has also been associated with the expansion of agricultural activities in marginal lands. However, its spread can sometimes lead to ecological imbalances in native ecosystems."
}
