{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lycopodiifolia",
    "plant_slug": "acacia-lycopodiifolia",
    "plant_name_scientific": "acacia lycopodiifolia",
    "intro": "Acacia lycopodiifolia, commonly known as the fern-leaf acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its delicate, fern-like foliage, which consists of narrow, bipinnate leaves that give it a unique appearance. The plant produces small, yellow flowers arranged in compact, globular inflorescences, which are often visited by bees and other pollinators. Acacia lycopodiifolia is adapted to harsh, dry environments and has a deep root system to access water. It is also valued for its ornamental appeal and is sometimes cultivated in gardens in suitable climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lycopodiifolia"
    },
    "taxonomy_art_desc": "Acacia lycopodiifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their primitive structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in tropical and subtropical regions, known for their distinctive acorn-like pods and often used for timber or in traditional medicine. Its species is Acacia lycopodiifolia, a specific type of acacia that is native to certain regions and is distinguished by its unique leaf structure resembling that of lycopods.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lycopodiifolia is primarily native to the Northern Territory and Western Australia. This species is found in the arid and semi-arid regions of these areas. It typically grows in sandy or rocky soils, often in open woodlands or shrublands. The plant is well adapted to the dry climate and can survive with minimal water. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia lycopodiifolia was mainly introduced to regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is commonly found in coastal areas and rocky soils where it thrives in well-drained conditions. This plant was introduced for its ornamental value due to its distinctive foliage and ability to withstand drought. It has also been used in erosion control in disturbed soils. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
