{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lirellata subsp. compressa",
    "plant_slug": "acacia-lirellata-subsp-compressa",
    "plant_name_scientific": "acacia lirellata subsp. compressa",
    "intro": "Acacia lirellata subsp. compressa, commonly known as the narrowleaf wattle, is a shrub native to southern Australia. It features narrow, linear leaves that are often densely arranged along the stems. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. It is well adapted to dry, sandy soils and can thrive in full sun. The species is valued for its ornamental appeal and is often used in landscaping for its hardy nature.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lirellata"
    },
    "taxonomy_art_desc": "Acacia lirellata subsp. compressa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and are often found in tropical and temperate regions. Its order is Fabales, which includes plants with distinctive flowers that have five petals and are often associated with nitrogen-fixing symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, which are native to Australia and parts of Africa. Its species is Acacia lirellata, a specific type of acacia that has a subspecies, compressa, distinguished by its compressed or flattened leaves and specific geographic distribution.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lirellata subsp. compressa is primarily native to Western Australia. This subspecies is found in the southern and western regions of the state, particularly in areas with sandy soils. It thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. The plant is well adapted to the hot and dry climate of its native habitat. It plays an important ecological role in supporting local biodiversity.",
    "distribution_introduced_art_desc": "Acacia lirellata subsp. compressa was mainly introduced to New Zealand. It was brought there as part of the broader Acacia species introduction during the 19th century for ornamental and potentially useful purposes. This subspecies is known for its distinctive compressed, cylindrical leaves and is often found in coastal and lowland areas. It has since become naturalized and is now considered a weed in some parts of New Zealand. Its spread has raised concerns due to its ability to invade native habitats and compete with indigenous plant species."
}
