{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pruinescens var. luchunensis",
    "plant_slug": "acacia-pruinescens-var-luchunensis",
    "plant_name_scientific": "acacia pruinescens var. luchunensis",
    "intro": "Acacia pruinescens var. luchunensis, commonly known as the Luchun acacia, is a shrub or small tree native to China. It is characterized by its slender, often thornless stems and bipinnate leaves that are covered in a distinctive whitish, powdery coating. The plant produces yellow flowers in dense, globular clusters, which are followed by elongated, flat pods containing seeds. It thrives in dry, rocky habitats and is adapted to arid and semi-arid environments. This variety is notable for its ornamental value and ecological importance in its native region.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pruinescens var. luchunensis is primarily native to the Yunnan Province in southwestern China. This plant is found in the mountainous regions of this area, particularly in the Hengduan Mountains. It thrives in subtropical and temperate climates with well-drained soils. The species is adapted to high altitude environments, often growing in forested or rocky habitats. Its native distribution is limited to specific ecological zones within Yunnan.",
    "distribution_introduced_art_desc": "Acacia pruinescens var. luchunensis was mainly introduced to areas with a subtropical climate characterized by mild winters and warm, dry summers. It thrives in well-drained soils and is commonly found in open woodlands and rocky habitats. This variety is known for its distinctive grayish-green foliage and yellow flowers, making it an ornamental plant in gardens. It has been introduced to parts of southern China, particularly in Yunnan Province, where it grows in naturalized settings. Due to its hardy nature, it has become a notable species in ecological restoration projects in the region."
}
