{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tomentella var. chrysocoma",
    "plant_slug": "acacia-tomentella-var-chrysocoma",
    "plant_name_scientific": "acacia tomentella var. chrysocoma",
    "intro": "Acacia tomentella var. chrysocoma, commonly known as the golden acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, greyish-white pubescent foliage and small, yellow flowers that appear in clusters. The plant produces flat, pod-like fruits that contain several seeds. It thrives in well-drained soils and is often found in coastal and sandy environments. The species is valued for its ornamental appeal and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tomentella var. chrysocoma is primarily native to the island of Madagascar. This variant is found in the eastern and southern regions of the island, particularly in areas with dry to semi-arid climates. It typically grows in rocky soils and is often found in coastal and limestone habitats. The plant is well adapted to the unique ecological conditions of Madagascar, which support a high degree of endemism. It plays an important role in the local ecosystem and is a characteristic species of the region's flora.",
    "distribution_introduced_art_desc": "Acacia tomentella var. chrysocoma was mainly introduced to areas with a warm, arid climate and well-drained soils, commonly found in regions of southern Africa. It is often cultivated for its ornamental value due to its attractive golden foliage and ability to thrive in harsh conditions. This plant is also used in reforestation projects because of its fast growth and nitrogen-fixing capabilities. However, it can become invasive in some environments if not managed properly. Its introduction has led to both ecological benefits and potential challenges in local ecosystems."
}
