{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia graciliformis",
    "plant_slug": "acacia-graciliformis",
    "plant_name_scientific": "acacia graciliformis",
    "intro": "Acacia graciliformis, commonly known as the slender wattle, is a small to medium-sized shrub or tree native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant is known for its delicate, feathery foliage and produces yellow flowers in clusters, which attract pollinators such as bees and birds. Acacia graciliformis is typically found in sandy soils and is adapted to arid or semi-arid environments. It plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia graciliformis"
    },
    "taxonomy_art_desc": "Acacia graciliformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which includes plants with legume fruits and nitrogen-fixing abilities, such as beans and peas. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive thorned stems and flower heads. Its species is Acacia graciliformis, a specific type of acacia known for its slender, branching form and is typically found in arid or semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia graciliformis is primarily native to Western Australia. It is found in the coastal and inland regions of the state, particularly in areas with sandy soils. This species is commonly associated with dry and semi-arid environments. It thrives in regions with low rainfall and is often seen in open woodlands and shrublands. Its distribution is largely restricted to the southern and western parts of Western Australia.",
    "distribution_introduced_art_desc": "Acacia graciliformis was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with low to moderate rainfall. It thrives in open, sunny environments and is often found in disturbed or degraded landscapes. The plant is commonly used for soil stabilization and as a source of timber and forage. Its introduction has been associated with ecological changes in native plant communities. However, it is considered an invasive species in some regions where it outcompetes native vegetation."
}
