{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obtriangularis",
    "plant_slug": "acacia-obtriangularis",
    "plant_name_scientific": "acacia obtriangularis",
    "intro": "Acacia obtriangularis, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, triangular-shaped leaves that are often covered in fine hairs. The plant produces yellow flower spikes that bloom in spring, attracting pollinators such as bees and birds. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia obtriangularis is also valued for its hardy nature and ability to stabilize soil in degraded areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia obtriangularis"
    },
    "taxonomy_art_desc": "Acacia obtriangularis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive phyllodes and often used for timber or as ornamental plants. Its species is Acacia obtriangularis, a specific type of acacia known for its unique leaf shape and habitat preferences in arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obtriangularis is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of the region. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia obtriangularis was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was originally from Australia and was likely introduced for its ornamental value or for soil stabilization purposes. The plant thrives in a variety of soil types and can grow in both full sun and partial shade. Due to its rapid growth and ability to outcompete native vegetation, it has posed a threat to local ecosystems. Management efforts are ongoing to control its spread and mitigate its impact on native flora."
}
