{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia taitensis",
    "plant_slug": "acacia-taitensis",
    "plant_name_scientific": "acacia taitensis",
    "intro": "Acacia taitensis, commonly known as the Taiti acacia, is a flowering plant native to the Pacific islands, particularly Tahiti and Moorea. It is a small shrub or tree that typically grows in coastal and lowland areas. The plant produces yellow flowers that are clustered in globular inflorescences, which are often visited by native pollinators. Its leaves are bipinnate, meaning they are divided into small, feather-like segments. Acacia taitensis plays an important ecological role in its native habitat, providing food and shelter for various species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia taitensis is primarily native to the islands of the South Pacific, particularly Tonga, Samoa, and Fiji. It is commonly found in coastal areas and lowland forests, where it thrives in humid, tropical climates. This species is well adapted to sandy soils and can tolerate salt spray from the sea. Acacia taitensis plays an important ecological role in its native habitat, providing food and shelter for local wildlife. It is also culturally significant to the indigenous peoples of these regions.",
    "distribution_introduced_art_desc": "Acacia taitensis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in a variety of soil conditions. It has since become naturalized in certain regions, particularly in the North Island, where it spreads through seed dispersal by wind and animals. Although it is not considered a major invasive species, it can outcompete native vegetation in disturbed areas. The plant is often found in coastal and urban environments, where it is used for erosion control and landscaping. Its introduction has raised concerns about its potential impact on local ecosystems, though its effects remain relatively limited compared to other invasive species."
}
