{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens var. leichhardtii",
    "plant_slug": "acacia-decurrens-var-leichhardtii",
    "plant_name_scientific": "acacia decurrens var. leichhardtii",
    "intro": "Acacia decurrens var. leichhardtii, commonly known as the Leichhardt wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers in spikes, which are typically arranged in dense, cylindrical inflorescences. It is well adapted to arid and semi-arid environments, often found in sandy soils. The species is notable for its ecological importance, providing habitat and food for various native wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decurrens var. leichhardtii is primarily native to eastern Australia, including parts of Queensland, New South Wales, and the Australian Capital Territory. It thrives in a variety of habitats such as woodlands, grasslands, and rocky outcrops. This variant is commonly found in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is well adapted to drought conditions and can tolerate poor soil quality. The plant plays an important ecological role in its native range, providing food and habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia decurrens var. leichhardtii was mainly introduced to areas with well-drained soils and moderate to high rainfall, typically found in regions of eastern Australia. It thrives in open habitats such as grasslands, woodlands, and disturbed sites where it can establish quickly. This variety is often used for land stabilization due to its deep root system and ability to fix nitrogen. Its introduction has sometimes led to the displacement of native vegetation in invaded areas. However, it is valued for its ornamental qualities and as a source of browse for livestock."
}
