{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia julifera",
    "plant_slug": "acacia-julifera",
    "plant_name_scientific": "acacia julifera",
    "intro": "Acacia julifera, commonly known as the Jerusalem acacia, is a flowering plant native to the Mediterranean region. It is characterized by its slender, branching stems and compound leaves that are often covered in fine hairs. The plant produces yellow flowers in clusters, which bloom in the spring and attract pollinators such as bees and butterflies. Acacia julifera is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid environments. It is also valued for its ornamental appeal and has been used in traditional medicine in some cultures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia julifera"
    },
    "taxonomy_art_desc": "Acacia julifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and their relatives, known for their jointed stems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with pea-like petals and include legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing symbiosis with bacteria. Its genus is Acacia, a large genus of shrubs and trees primarily found in arid regions, known for their unique, often thorn-like structures and nitrogen-fixing capabilities. Its species is Acacia julifera, a specific type of acacia native to certain regions of Africa, characterized by its branching structure and ability to thrive in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia julifera is primarily native to Queensland. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen along coastal areas and inland dunes. It plays an important role in stabilizing sand dunes and providing habitat for native wildlife. Acacia julifera is well adapted to the harsh environmental conditions of Queensland's inland regions.",
    "distribution_introduced_art_desc": "Acacia julifera was mainly introduced to stabilize soil and provide shade in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its hardy nature and ability to withstand drought. Its introduction has helped in preventing desertification in several parts of the world. However, in some areas, it has become invasive, outcompeting native vegetation."
}
