{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia jurema",
    "plant_slug": "acacia-jurema",
    "plant_name_scientific": "acacia jurema",
    "intro": "Acacia jurema, commonly known as the sacred acacia or raiz de palma, is a flowering plant native to South America, particularly Brazil. It is a shrub or small tree that can grow up to 5 meters tall, characterized by its dense, thorny branches and compound leaves. The plant produces yellow flowers that bloom in clusters, followed by long, flat pods containing seeds. It is well adapted to arid and semi-arid environments, making it a resilient species in tropical and subtropical regions. Acacia jurema is also known for its cultural and medicinal significance in various indigenous communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia jurema is primarily native to northeastern South America, including countries such as Brazil, Venezuela, and Guyana. It is commonly found in the Amazon Basin and surrounding regions. This plant thrives in tropical and subtropical climates, often growing in open areas with well-drained soil. It is well adapted to the humid and warm conditions of the region. Acacia jurema is an important component of the local flora and plays a role in the ecosystem of its native habitat.",
    "distribution_introduced_art_desc": "Acacia jurema was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Brazil, particularly in the Cerrado and Caatinga biomes. This plant is often used for its hardy nature and ability to withstand drought conditions. It has also been introduced to other parts of South America and even some regions in Africa. Its introduction has sometimes led to ecological impacts due to its invasive potential in non-native environments."
}
