{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fragrans",
    "plant_slug": "acacia-fragrans",
    "plant_name_scientific": "acacia fragrans",
    "intro": "Acacia fragrans, commonly known as the sweet acacia, is a flowering plant native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often branched stems and feathery, bipinnate leaves. The plant produces clusters of small, yellowish-green flowers that are fragrant and attract pollinators such as bees and birds. Acacia fragrans is often used in traditional medicine for its purported health benefits. It thrives in arid and semi-arid environments, making it an important species in desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fragrans is primarily native to eastern Australia, including regions such as New South Wales and Queensland. It is commonly found in dry, open habitats like woodlands, heaths, and along riverbanks. The plant thrives in sandy or loamy soils and is often associated with sclerophyllous vegetation. It is well adapted to the seasonal rainfall patterns of its native range. Acacia fragrans is also known for its fragrant flowers, which attract a variety of pollinators.",
    "distribution_introduced_art_desc": "Acacia fragrans was mainly introduced to New Zealand as an ornamental plant due to its attractive flowers and hardy nature. It was first brought to the country in the 19th century by European settlers who admired its aesthetic value. However, it has since become naturalized and is now found growing in various habitats across the North Island. The plant has adapted well to the local climate and has spread beyond its original cultivation areas. Despite its beauty, it is considered a potential weed in some regions due to its invasive tendencies."
}
