{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pentagona",
    "plant_slug": "acacia-pentagona",
    "plant_name_scientific": "acacia pentagona",
    "intro": "Acacia pentagona, commonly known as the Five-angled Wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and small, bright yellow flowers that appear in globular clusters. The leaves are phyllodes, which are flattened leaf stalks that function as leaves, and they are typically narrow and five-angled in cross-section. The plant produces small, woody pods that contain seeds, and it is adapted to thrive in dry, sandy soils. Acacia pentagona is an important component of coastal and inland ecosystems, providing habitat and food for various native animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pentagona is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the areas of the Great Southern and the South-West. This species thrives in sandy soils and is often associated with coastal and inland heathlands. It is well adapted to the dry and temperate climate of its native range. Acacia pentagona is an important component of the local flora and provides habitat for various native wildlife species.",
    "distribution_introduced_art_desc": "Acacia pentagona was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with low to moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland regions of Australia. It has been introduced to several parts of the world, including parts of the United States and South Africa. Due to its adaptability, it is often used in landscaping and erosion control."
}
