{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia jacksonioides",
    "plant_slug": "acacia-jacksonioides",
    "plant_name_scientific": "acacia jacksonioides",
    "intro": "Acacia jacksonioides, commonly known as the Jackson's wattle, is a shrub native to the arid regions of Western Australia. It is characterized by its slender, multi-branched stems and small, feathery leaves that are often covered in fine hairs. The plant produces yellow flowers in globular clusters, which bloom during the warmer months. It is well adapted to dry conditions, with a deep root system that allows it to survive in nutrient-poor soils. Acacia jacksonioides plays an important ecological role by providing habitat and food for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia jacksonioides"
    },
    "taxonomy_art_desc": "Acacia jacksonioides belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and some gymnosperms. Its subclass is Magnoliidae, which includes flowering plants with a diverse array of forms and includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often spiny foliage and flower heads. Its species is Acacia jacksonioides, a specific type of acacia native to certain regions, known for its unique morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia jacksonioides is primarily native to Western Australia. It is found in the southern and central regions of the state, particularly in the Geraldton and Shark Bay areas. This species typically grows in sandy soils and is often found in coastal and inland habitats. It is well adapted to the arid and semi-arid climates of its native range. Acacia jacksonioides is an important component of the local flora and plays a role in stabilizing sandy soils.",
    "distribution_introduced_art_desc": "Acacia jacksonioides was mainly introduced to areas with well-drained soils and full sun exposure, often in arid or semi-arid regions. It is commonly found in disturbed soils, such as along roadsides, degraded lands, and near human settlements. This plant has been reported in several states in the southwestern United States, including Texas, New Mexico, and Arizona. Due to its rapid growth and ability to thrive in harsh conditions, it has become a common invasive species in some regions. Its introduction has led to concerns about its impact on native plant communities and ecosystem dynamics."
}
