{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cernua",
    "plant_slug": "acacia-cernua",
    "plant_name_scientific": "acacia cernua",
    "intro": "Acacia cernua, commonly known as the weeping acacia, is a flowering plant native to parts of Africa and the Arabian Peninsula. It is characterized by its distinctive drooping branches and feathery, bipinnate leaves. The plant produces yellow flowers that bloom in clusters, adding a striking visual element to its appearance. Acacia cernua thrives in arid and semi-arid environments, often growing in rocky or sandy soils. It is valued for its ornamental beauty and has been introduced to other regions for landscaping purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cernua is primarily native to eastern Australia, including regions such as New South Wales, Queensland, and the Australian Capital Territory. It is commonly found in dry, sandy soils along coastal areas and in open woodlands. This species thrives in temperate to subtropical climates and is often associated with disturbed or degraded habitats. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia cernua is also known for its ability to fix nitrogen, contributing to soil fertility in its native range.",
    "distribution_introduced_art_desc": "Acacia cernua was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has helped in restoring degraded lands across several countries in Africa and Australia. However, it has raised concerns about its potential to become invasive in some ecosystems."
}
