{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella leucothrix",
    "plant_slug": "acaciella-leucothrix",
    "plant_name_scientific": "acaciella leucothrix",
    "intro": "Acaciella leucothrix, commonly known as the white-thread acacia, is a small shrub native to the arid regions of South America. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant features delicate, feathery leaves and produces small, yellowish flowers that bloom in clusters. Its seeds are encased in slender, pod-like fruits, and it is adapted to survive in dry, nutrient-poor soils. Due to its unique appearance and ecological role, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella leucothrix is primarily native to the Caribbean region, particularly the Greater Antilles. It is found in countries such as Cuba, Hispaniola, Jamaica, and the Bahamas. This plant typically grows in coastal areas and on limestone soils. It thrives in humid, tropical climates with well-drained soil. Its distribution is limited to specific islands where the environmental conditions match its ecological requirements.",
    "distribution_introduced_art_desc": "Acaciella leucothrix was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive white flowers and hardy nature. However, it has since become invasive, outcompeting native species in coastal and lowland areas. Its rapid growth and ability to thrive in disturbed soils have led to its spread across various habitats. Conservation efforts are now underway to control its population and protect local biodiversity."
}
