{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bombycina",
    "plant_slug": "acacia-bombycina",
    "plant_name_scientific": "acacia bombycina",
    "intro": "Acacia bombycina, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often pendulous branches and small, feathery leaves that are covered in fine, silky hairs. The plant produces yellow flowers that are clustered in cylindrical inflorescences, which are highly attractive to pollinators such as bees and birds. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its ecological role in arid and semi-arid regions. Acacia bombycina is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bombycina is primarily native to eastern Australia, including regions such as New South Wales, Queensland, and the Australian Capital Territory. It thrives in a variety of habitats, including dry sclerophyll forests, heathlands, and rocky outcrops. This species is commonly found in areas with well-drained soils and a temperate to warm climate. It is often associated with coastal and inland regions where it forms part of the native vegetation. Acacia bombycina is well adapted to the environmental conditions of its native range, making it a resilient and widespread plant species.",
    "distribution_introduced_art_desc": "Acacia bombycina was mainly introduced to areas with well-drained soils and a warm, temperate climate, often found in regions with moderate rainfall. It thrives in open landscapes such as grasslands, woodlands, and disturbed sites where it can establish quickly. This plant is commonly used for erosion control due to its deep root system and ability to fix nitrogen. It has also been introduced as an ornamental plant in some parts of the world for its attractive foliage and floral display. However, its introduction has sometimes led to ecological concerns in non-native regions."
}
