{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bispinosa",
    "plant_slug": "acacia-bispinosa",
    "plant_name_scientific": "acacia bispinosa",
    "intro": "Acacia bispinosa, commonly known as the two-spined acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are divided into numerous small, feather-like segments. The plant produces yellow globular flowers that bloom in summer, attracting pollinators such as bees and birds. Its seeds are encased in hard pods that split open when mature, dispersing the seeds through the environment. Acacia bispinosa is adapted to arid and semi-arid conditions, making it a resilient species in harsh environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia bispinosa is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This species is well adapted to the harsh climate of its native habitat, with its spiny foliage and deep root system helping it survive in low-water conditions. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia bispinosa is also known for its ability to fix nitrogen, contributing to soil fertility in its native environment.",
    "distribution_introduced_art_desc": "Acacia bispinosa was mainly introduced to Australia as a potential source of timber and for its ability to thrive in arid conditions. It was also introduced for its ornamental value and as a forage plant for livestock. However, it has since become invasive in some regions, outcompeting native vegetation and altering local ecosystems. Its rapid growth and seed dispersal have made it a challenge for land managers. Despite its benefits, its introduction has led to significant ecological concerns in certain areas."
}
