{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brunnescens",
    "plant_slug": "acacia-brunnescens",
    "plant_name_scientific": "acacia brunnescens",
    "intro": "Acacia brunnescens, commonly known as the yellow wattle, is a shrub or small tree native to Australia. It is characterized by its yellow flowers, which bloom in late winter to early spring. The plant has bipinnate leaves that are often covered in fine hairs. It thrives in a variety of soil types but prefers well-drained conditions. Acacia brunnescens is also known for its ability to fix nitrogen, making it an important plant in ecological restoration efforts.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brunnescens is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia, Angola, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland ecosystems. This species is well adapted to dry climates and can tolerate high temperatures and limited rainfall. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia brunnescens is also known for its distinctive yellow flowers and thorny structure.",
    "distribution_introduced_art_desc": "Acacia brunnescens was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped in restoring degraded lands in parts of Africa and Australia. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
