{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lanigera var. brachyphylla",
    "plant_slug": "acacia-lanigera-var-brachyphylla",
    "plant_name_scientific": "acacia lanigera var. brachyphylla",
    "intro": "Acacia lanigera var. brachyphylla, commonly known as the broad-leaved acacia, is a shrub native to the arid and semi-arid regions of southern Africa. It is characterized by its dense, rounded growth habit and its distinctive, small, spherical pods that contain edible seeds. The plant has compound leaves with multiple pairs of small, rounded leaflets, and it produces yellow flowers during the rainy season. It is well adapted to drought conditions, with deep root systems that allow it to survive in poor soils. This species is often used in traditional medicine and as a source of fodder for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lanigera var. brachyphylla is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Botswana, and South Africa. This variety is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry and hot climates. It is well adapted to low rainfall and can tolerate poor soil conditions. The plant is often seen growing along riverbanks and in areas with sparse vegetation. Its distribution is closely linked to the ecological zones characterized by high temperatures and limited water availability.",
    "distribution_introduced_art_desc": "Acacia lanigera var. brachyphylla was mainly introduced to regions with a Mediterranean climate, characterized by mild, wet winters and hot, dry summers. It thrives in well-drained soils and is commonly found in coastal and inland areas where it can tolerate moderate drought conditions. This plant is often used in landscaping for its ornamental value, including its feathery foliage and yellow flowers. It has been introduced to parts of California, Oregon, and other western United States states. However, it is considered invasive in some areas due to its rapid growth and ability to outcompete native vegetation."
}
