{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ericifolia var. crassa",
    "plant_slug": "acacia-ericifolia-var-crassa",
    "plant_name_scientific": "acacia ericifolia var. crassa",
    "intro": "Acacia ericifolia var. crassa, commonly known as the thick-leaved wattle, is a shrub native to Australia. It is characterized by its dense, leathery leaves that are broader and more robust than those of the typical species. The plant produces yellow floral spikes, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, inland areas. Due to its hardy nature, it is sometimes cultivated as an ornamental plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ericifolia var. crassa is primarily native to the arid and semi-arid regions of southern Africa, particularly in Namibia, Angola, and parts of South Africa. This variant is commonly found in sandy soils and rocky outcrops, thriving in environments with low rainfall. It is often associated with shrublands and savanna ecosystems where it plays a role in stabilizing soil and providing habitat for local wildlife. The plant is well adapted to withstand drought conditions due to its deep root system and waxy leaf coatings. Its distribution is largely restricted to specific ecological zones that match its environmental requirements.",
    "distribution_introduced_art_desc": "Acacia ericifolia var. crassa was mainly introduced to control soil erosion and as a windbreak in arid and semi-arid regions. It is commonly used for its hardy nature and ability to thrive in poor soil conditions. This plant has been introduced in several parts of Australia and the United States. It is valued for its rapid growth and potential in land rehabilitation projects. However, it can become invasive if not managed properly."
}
