{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia eremophila var. variabilis",
    "plant_slug": "acacia-eremophila-var-variabilis",
    "plant_name_scientific": "acacia eremophila var. variabilis",
    "intro": "Acacia eremophila var. variabilis, commonly known as the variable acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its slender, often twisted branches and phyllodes that are typically narrow and linear. The plant produces yellow flowers in late summer, which are clustered in dense, globular inflorescences. It is adapted to survive in dry conditions with deep root systems and waxy foliage to reduce water loss. This species is often used in landscaping for its hardiness and ornamental value in drought-prone areas.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia eremophila"
    },
    "taxonomy_art_desc": "Acacia eremophila var. variabilis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which includes plants with showy flowers and often symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through root nodules. Its genus is Acacia, a large group of shrubs and trees found mainly in tropical and subtropical regions, known for their compound leaves and often thorny structures. Its species is Acacia eremophila, a specific type of acacia known for its adaptation to arid environments and its variability in form, with the varietal name variabilis indicating this morphological diversity.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia eremophila var. variabilis is primarily native to Western Australia. It is found in the arid and semi-arid regions of the state, particularly in the southern and central areas. This plant typically grows in sandy soils and is adapted to the harsh, dry conditions of its native environment. It is commonly seen in coastal dunes and inland shrublands. Its distribution is limited to specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acacia eremophila var. variabilis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions with low rainfall and high temperatures, such as parts of Australia and the Mediterranean. This plant is often used for soil stabilization due to its deep root system and ability to survive in harsh conditions. Its introduction has sometimes led to ecological impacts, including competition with native flora. Despite this, it remains a valuable species for revegetation projects in degraded landscapes."
}
