{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oxyclada",
    "plant_slug": "acacia-oxyclada",
    "plant_name_scientific": "acacia oxyclada",
    "intro": "Acacia oxyclada, commonly known as the white acacia, is a deciduous shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures in mature plants. The plant produces yellow to golden flowers in dense, cylindrical spikes, which bloom during the rainy season. Its seeds are encased in elongated, woody pods that split open to release the seeds. Acacia oxyclada is adapted to survive in harsh, dry environments and is often used for its hardy nature and potential medicinal properties.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia oxyclada"
    },
    "taxonomy_art_desc": "Acacia oxyclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their acicular leaves and often used in traditional medicine and as ornamental plants. Its species is Acacia oxyclada, a specific type of acacia known for its unique leaf structure and found in arid regions of Africa and the Arabian Peninsula.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oxyclada is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in arid and semi-arid environments, often growing in sandy soils. It is a shrub or small tree that is well adapted to the harsh climatic conditions of the region. Acacia oxyclada plays an important role in the local ecosystem and is often used in landscaping due to its hardy nature.",
    "distribution_introduced_art_desc": "Acacia oxyclada was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, the Middle East, and parts of Africa. This plant is often cultivated for its ornamental value due to its distinctive foliage and ability to withstand drought conditions. It has also been introduced to other parts of the world as a potential source of timber and for soil stabilization. However, in some regions, it has become invasive, outcompeting native vegetation."
}
