{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia exilis",
    "plant_slug": "acacia-exilis",
    "plant_name_scientific": "acacia exilis",
    "intro": "Acacia exilis, commonly known as the slender acacia, is a small shrub native to tropical regions of Africa. It is characterized by its slender, branching stems and bipinnate leaves composed of numerous small, linear leaflets. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits containing edible seeds. Acacia exilis thrives in well-drained soils and is often found in dry, open habitats. It is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia exilis is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and Angola. It is commonly found in sandy soils and rocky outcrops within these areas. This plant thrives in environments with low rainfall and high temperatures. It is often seen in savannas and shrublands, contributing to the local vegetation structure. Due to its hardy nature, it plays an important role in stabilizing soil and providing habitat for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia exilis was mainly introduced to areas with arid or semi-arid climates where it can thrive in poor soils. It is commonly found in regions of Africa, the Middle East, and parts of Australia. This plant is often used for its hardy nature and ability to provide shade and forage for livestock. Its introduction has sometimes led to ecological impacts in non-native regions. It is also valued for its use in traditional medicine and as a source of timber."
}
