{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia f. sophorae",
    "plant_slug": "acacia-longifolia-f-sophorae",
    "plant_name_scientific": "acacia longifolia f. sophorae",
    "intro": "Acacia longifolia f. sophorae, commonly known as the Narrow-leaf Acacia, is a shrub native to southern Australia. It is characterized by its slender, upright stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow globular flower heads that bloom in spring, attracting a variety of pollinators. It is adapted to arid and coastal environments, showcasing drought tolerance and salt resistance. This form is often used in horticulture for its ornamental value and ability to thrive in challenging conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia f. sophorae is primarily native to southern Australia, including the states of Western Australia, South Australia, and Victoria. This subspecies is commonly found in coastal areas and sandy soils, particularly in regions with a Mediterranean climate. It thrives in dry, well-drained environments and is often associated with heathlands and coastal dunes. The plant is well adapted to the local climate and can tolerate salt spray and sandy conditions. It plays an important ecological role in its native habitat, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia longifolia f. sophorae was mainly introduced to control soil erosion and for ornamental purposes in coastal and sandy areas. It is commonly found in regions such as southern California, Oregon, and parts of the Pacific Northwest. This plant thrives in well-drained soils and full sun, making it suitable for dune stabilization and landscape planting. However, it has become an invasive species in some areas, outcompeting native vegetation. Its rapid growth and ability to form dense stands have led to its classification as a noxious weed in several states."
}
