{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia clunies-rossiae",
    "plant_slug": "acacia-clunies-rossiae",
    "plant_name_scientific": "acacia clunies-rossiae",
    "intro": "Acacia clunies-rossiae, commonly known as the Clunies-Ross acacia, is a small, evergreen shrub native to the arid regions of Western Australia. It is characterized by its narrow, linear leaves and distinctive yellow flowers that bloom in winter. The plant is adapted to harsh, dry environments and has a deep root system to access groundwater. It is often found in rocky outcrops and sandy soils, thriving in low-nutrient conditions. Due to its unique appearance and habitat, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia clunies-rossiae"
    },
    "taxonomy_art_desc": "Acacia clunies-rossiae belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of spore-producing plants that includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Fabales, which consists of flowering plants that typically have leaves with pinnate venation and include legumes. Its family is Fabaceae, commonly known as the legume family, which is characterized by the presence of pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorned appearance and association with nitrogen-fixing bacteria. Its species is Acacia clunies-rossiae, a specific type of acacia found in Australia, known for its ecological importance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia clunies-rossiae is primarily native to New South Wales. It is found in the coastal regions of the state, particularly in areas with sandy soils. This species is commonly associated with heathlands and coastal dunes. It is a small shrub that thrives in well-drained, sunny conditions. Its distribution is limited to specific habitats within New South Wales, making it a regionally significant plant.",
    "distribution_introduced_art_desc": "Acacia clunies-rossiae was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It was first recorded in the 19th century and has since spread beyond cultivated areas into native ecosystems. The plant is now considered invasive in some regions, outcompeting native vegetation and altering local habitats. Its rapid growth and ability to thrive in various soil types contribute to its successful establishment. Conservation efforts are ongoing to manage its spread and mitigate its ecological impact."
}
