{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia catechu subsp. sundra",
    "plant_slug": "acacia-catechu-subsp-sundra",
    "plant_name_scientific": "acacia catechu subsp. sundra",
    "intro": "Acacia catechu subsp. sundra, commonly known as the Indian blackwood, is a deciduous shrub or small tree native to Southeast Asia. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow flowers followed by pod-like fruits that contain hard, dark seeds. It is valued for its durable wood and has been traditionally used in the production of medicinal products and dyes. The species is also noted for its ability to thrive in tropical and subtropical climates with well-drained soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia catechu subsp. sundra is primarily native to Southeast Asia, including countries such as India, Thailand, Malaysia, Indonesia, and the Philippines. It thrives in tropical and subtropical regions, often found in dry deciduous forests and along riverbanks. This subspecies is well adapted to sandy or loamy soils and can tolerate seasonal droughts. It plays an important ecological role in stabilizing soil and providing habitat for various wildlife species. The plant is also valued for its timber and has traditional uses in local communities.",
    "distribution_introduced_art_desc": "Acacia catechu subsp. sundra was mainly introduced to areas with tropical and subtropical climates, particularly in Southeast Asia and parts of Africa. It thrives in regions with high humidity and well-drained soils, making it suitable for coastal and lowland environments. This subspecies is often found in secondary forests and disturbed sites due to its adaptability and rapid growth. Its introduction has been associated with both ecological and economic benefits, including soil stabilization and the production of tannins. However, it can also become invasive in some regions, outcompeting native vegetation if not managed properly."
}
