{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia santosii",
    "plant_slug": "acacia-santosii",
    "plant_name_scientific": "acacia santosii",
    "intro": "Acacia santosii, commonly known as the Santos acacia, is a flowering plant native to the tropical regions of South America. It is characterized by its slender, branching stems and feathery, bipinnate leaves. The plant produces small, yellowish-green flowers that are clustered in dense, globular inflorescences. It thrives in well-drained soils and is often found in savannas and dry forests. Due to its ornamental value, it is cultivated in gardens and landscapes in warmer climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia santosii is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Malawi, Mozambique, and South Africa. It thrives in savanna and woodland habitats, often found in areas with seasonal rainfall. This plant is commonly associated with rocky soils and is well adapted to arid and semi-arid environments. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia santosii is also valued for its hardiness and is sometimes used in reforestation efforts.",
    "distribution_introduced_art_desc": "Acacia santosii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, particularly in the eastern and southern parts of the country. The plant thrives in sandy soils and is often associated with disturbed habitats. Due to its rapid growth and ability to spread through seed dispersal, it has become a potential invasive species in some areas. However, it is also valued for its ecological role in stabilizing soils and providing habitat for local wildlife."
}
