{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia visneoides",
    "plant_slug": "acacia-visneoides",
    "plant_name_scientific": "acacia visneoides",
    "intro": "Acacia visneoides, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging stems and bipinnate leaves that are composed of numerous small, linear leaflets. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, spherical inflorescences. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia visneoides is also valued for its ability to fix nitrogen, contributing to soil fertility in degraded landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia visneoides is primarily native to the tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in dry savannas and woodlands, where it adapts well to seasonal rainfall patterns. This species is also found in parts of the Arabian Peninsula, including southern Saudi Arabia and Yemen. It prefers well-drained soils and is often found in open habitats with some shade. Acacia visneoides plays an important ecological role in its native range, providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia visneoides was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since spread into natural ecosystems, posing a threat to native vegetation by outcompeting local species for resources. The plant is particularly invasive in grassland and shrubland habitats, where it forms dense thickets that reduce biodiversity. Its rapid growth and seed dispersal mechanisms contribute to its success in establishing new populations. Management efforts are ongoing to control its spread and mitigate its ecological impact."
}
