{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stricta var. pleiocephala",
    "plant_slug": "acacia-stricta-var-pleiocephala",
    "plant_name_scientific": "acacia stricta var. pleiocephala",
    "intro": "Acacia stricta var. pleiocephala, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, upright growth habit and small, feathery leaves. The plant produces yellow flowers in cylindrical spikes, which bloom during the warmer months. It thrives in well-drained soils and is often found in coastal and sandy environments. This variety is noted for its ecological importance, providing nectar for native pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stricta var. pleiocephala is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. This variety is commonly found in savannah and grassland habitats, often growing along riverbanks and in rocky outcrops. It is well adapted to dry conditions and can thrive in poor soils. The plant is known for its distinctive appearance, with its narrow, twisted trunk and dense foliage. It plays an important ecological role in providing shelter and food for various wildlife species in its native range.",
    "distribution_introduced_art_desc": "Acacia stricta var. pleiocephala was mainly introduced to New Zealand. It was brought there as part of the broader introduction of acacia species for agricultural and ecological purposes. This variety is known for its hardy nature and ability to thrive in a range of soil conditions. It has since become established in certain regions, particularly in the North Island. However, its spread has raised concerns due to its potential to invade native ecosystems."
}
