{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aphanoclada",
    "plant_slug": "acacia-aphanoclada",
    "plant_name_scientific": "acacia aphanoclada",
    "intro": "Acacia aphanoclada, commonly known as the ghost acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, often twisted branches and small, greenish-yellow flowers that appear in spikes. The plant has phyllodes, which are flattened leaf stalks that perform the function of true leaves. It is adapted to survive in dry conditions with a deep root system and low water requirements. Acacia aphanoclada is also known for its ability to fix nitrogen in the soil, making it ecologically significant in its habitat.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia aphanoclada"
    },
    "taxonomy_art_desc": "Acacia aphanoclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as stomata and vascular tissue. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and diverse forms. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that are typically legumes, often having compound leaves and specialized nitrogen-fixing root nodules. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, characterized by their phyllodes and often used in landscaping and traditional medicine. Its species is Acacia aphanoclada, a specific type of acacia native to Australia, known for its small, clustered flowers and unique ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aphanoclada is primarily native to Western Australia. It is commonly found in the coastal and inland regions of the state, particularly in sandy soils. This species thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the harsh climate of Western Australia, showing resilience to drought and high temperatures. The plant is an important component of the local flora and plays a role in the ecosystem of the region.",
    "distribution_introduced_art_desc": "Acacia aphanoclada was mainly introduced to areas with dry, sandy soils and low rainfall, typically in arid and semi-arid regions. It thrives in environments with high temperatures and minimal moisture, making it well-suited for regions such as parts of Australia, Africa, and the southwestern United States. This plant is often found in disturbed or degraded landscapes, where it can quickly establish itself and outcompete native vegetation. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain regions. However, it is also valued for its hardiness and ability to stabilize soil in harsh conditions."
}
