{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tenuifolia",
    "plant_slug": "acacia-tenuifolia",
    "plant_name_scientific": "acacia tenuifolia",
    "intro": "Acacia tenuifolia, commonly known as the narrow-leaf acacia, is a shrub native to southern Africa. It is characterized by its slender, feathery leaves that are often covered in a fine layer of white or grey hairs. The plant produces yellow, globular flowerheads that appear in late winter or early spring. It is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for xeriscaping. Acacia tenuifolia is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tenuifolia is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the western and southern parts of the country, including Western Australia, South Australia, and parts of Victoria. This species thrives in sandy soils and is often found in coastal dunes and inland shrublands. It is well adapted to drought conditions and can survive in areas with low rainfall. The plant plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia tenuifolia was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. Its introduction has been both intentional and unintentional, with some populations established through seed dispersal by animals. However, it is not considered invasive in most of its introduced ranges."
}
