{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia schweinfurthii",
    "plant_slug": "acacia-schweinfurthii",
    "plant_name_scientific": "acacia schweinfurthii",
    "intro": "Acacia schweinfurthii, commonly known as the fever tree, is a medium-sized deciduous tree native to eastern and southern Africa. It is characterized by its smooth, gray bark and long, slender, feathery leaves that are often shed during the dry season. The tree produces yellow flowers in dense, globular clusters, which attract a variety of pollinators. Its seeds are enclosed in woody pods and dispersed by wind, contributing to its natural spread. Acacia schweinfurthii is often found in savannas and woodland areas, where it plays a role in soil stabilization and provides habitat for wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia schweinfurthii is primarily native to the dry savannas and grasslands of eastern and southern Africa. It is found in countries such as Kenya, Tanzania, Uganda, and Mozambique. This plant thrives in arid and semi-arid environments, often growing along riverbanks and in rocky soils. It plays an important ecological role by providing food and shelter for various wildlife species. Its distribution is closely linked to the availability of water and soil conditions in these regions.",
    "distribution_introduced_art_desc": "Acacia schweinfurthii was mainly introduced to regions of sub-Saharan Africa, particularly in countries like Sudan, Ethiopia, and Kenya. It was introduced for its potential as a source of firewood, timber, and forage for livestock. The plant thrives in arid and semi-arid environments, making it suitable for reclamation of degraded lands. However, its introduction has raised concerns about its impact on native ecosystems and biodiversity. Despite its benefits, careful management is required to prevent it from becoming invasive."
}
