{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ovata",
    "plant_slug": "acacia-ovata",
    "plant_name_scientific": "acacia ovata",
    "intro": "Acacia ovata, commonly known as the oval acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branched stems and bipinnate leaves that are composed of numerous small, oval-shaped leaflets. The plant produces yellow flowers in globular inflorescences, which are typically arranged in clusters at the ends of the branches. Acacia ovata is well adapted to arid and semi-arid environments, making it a resilient species in dry landscapes. Its bark and leaves have been used traditionally for medicinal purposes by local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ovata is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and Mozambique. It thrives in dry, open woodlands and savanna regions where it can tolerate high temperatures and low rainfall. This species is often found growing on rocky outcrops and in sandy soils, adapting well to arid and semi-arid environments. Acacia ovata plays an important ecological role by providing habitat and food for various wildlife species. Its distribution is closely linked to the specific climatic and soil conditions of these regions.",
    "distribution_introduced_art_desc": "Acacia ovata was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility over time. Its introduction has helped in restoring degraded lands across several countries in Africa and the Middle East. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
