{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sclerophylla var. pilosa",
    "plant_slug": "acacia-sclerophylla-var-pilosa",
    "plant_name_scientific": "acacia sclerophylla var. pilosa",
    "intro": "Acacia sclerophylla var. pilosa, commonly known as the hairy wattle, is a shrub or small tree native to Australia. It is characterized by its dense, wiry foliage and yellow flowers that appear in cylindrical spikes. The plant thrives in dry, sandy soils and is adapted to arid and semi-arid environments. Its leaves are small, leathery, and covered in fine, soft hairs, giving it a distinctive appearance. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sclerophylla"
    },
    "taxonomy_art_desc": "Acacia sclerophylla var. pilosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and produce legume-like fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their sharp thorns and floral structures, often found in arid environments. Its species is Acacia sclerophylla, a specific type of acacia known for its sclerophyllous leaves and the varietal form pilosa, which refers to its hairy or fuzzy appearance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sclerophylla var. pilosa is primarily native to Western Australia. It is commonly found in the southern and southwestern regions of the state. This plant typically grows in sandy or gravelly soils within coastal and inland areas. It is well adapted to the dry and arid conditions of its native habitat. Its distribution is largely restricted to specific ecological zones within Western Australia.",
    "distribution_introduced_art_desc": "Acacia sclerophylla var. pilosa was mainly introduced to specific regions of Australia, particularly in South Australia and parts of Western Australia. It was introduced for its ornamental value due to its dense, feathery foliage and ability to thrive in dry conditions. This plant is commonly found in disturbed soils and along roadsides where it can establish quickly. It has become naturalized in some areas, sometimes outcompeting native vegetation. Due to its invasive potential, it is now considered a weed in certain regions."
}
