{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pulviniformis",
    "plant_slug": "acacia-pulviniformis",
    "plant_name_scientific": "acacia pulviniformis",
    "intro": "Acacia pulviniformis, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are often covered in a fine, silvery pubescence. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, cylindrical inflorescences. Its seeds are encased in a hard, pod-like structure that splits open when mature. Acacia pulviniformis is adapted to arid and semi-arid environments, making it a resilient species in dry climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia pulviniformis"
    },
    "taxonomy_art_desc": "Acacia pulviniformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their acorn-like seed pods and often used in landscaping and traditional medicine. Its species is Acacia pulviniformis, a specific type of acacia found in certain regions, characterized by its unique pulvinate (swollen) stipules and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pulviniformis is primarily native to Western Australia. It is commonly found in the coastal regions and surrounding areas of the state. This species thrives in sandy soils and is often seen in dune systems and open woodlands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. The plant is well adapted to the arid and semi-arid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia pulviniformis was mainly introduced to South America, particularly in regions with arid or semi-arid climates. It was brought there for its ability to thrive in poor soils and its potential for soil stabilization. The plant has since spread beyond its initial introduction sites, becoming an invasive species in some areas. It is commonly found in disturbed habitats such as roadsides, grazing lands, and abandoned pastures. Its rapid growth and adaptability have led to concerns about its impact on native ecosystems."
}
