{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decussata",
    "plant_slug": "acacia-decussata",
    "plant_name_scientific": "acacia decussata",
    "intro": "Acacia decussata, commonly known as the mountain acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its distinctive, flat, bipinnate leaves that are often covered in fine hairs. The plant produces yellow flowers arranged in dense, globular clusters, which are typically visited by various pollinators. Its woody stems are often branched and can form dense thickets, providing habitat for small animals. Acacia decussata is well adapted to harsh environments, thriving in poor soils and with minimal water availability.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decussata is primarily native to the arid and semi-arid regions of Australia, particularly in the states of Western Australia, South Australia, and Northern Territory. It is commonly found in coastal dunes, sandy soils, and open woodlands. This plant is well adapted to dry conditions and can thrive in areas with low rainfall. It plays an important role in stabilizing sand dunes and providing habitat for native wildlife. Acacia decussata is also known as the coastal wattle and is a hardy, drought-resistant species.",
    "distribution_introduced_art_desc": "Acacia decussata was mainly introduced to stabilize soil and prevent erosion in degraded lands, particularly in arid and semi-arid regions. It is commonly used in reforestation and afforestation projects due to its hardy nature and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing capabilities, which improve soil fertility over time. Its introduction has helped restore ecological balance in areas affected by desertification. However, in some regions, it has become invasive, outcompeting native species and altering local ecosystems."
}
