{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia holcocarpa",
    "plant_slug": "acacia-holcocarpa",
    "plant_name_scientific": "acacia holcocarpa",
    "intro": "Acacia holcocarpa, commonly known as the sweet acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched trunk and compound leaves that are bipinnate, giving it a feathery appearance. The plant produces yellow flowers in globular clusters, which are followed by distinctive, woody pods containing edible seeds. It thrives in arid and semi-arid environments, often growing on rocky soils. The species is valued for its ornamental appeal and has been used traditionally for its seeds, which are a source of food and oil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia holcocarpa is primarily native to eastern Australia, including the states of New South Wales, Queensland, and Victoria. It is commonly found in dry, sandy soils within woodlands and open forests. This species thrives in regions with a temperate climate and is often associated with sclerophyllous vegetation. It is also present in parts of South Australia and the southernmost areas of Western Australia. Acacia holcocarpa plays an important ecological role in its native habitat by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia holcocarpa was mainly introduced to areas with well-drained soils and a warm, temperate to subtropical climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland areas where it can establish itself quickly. It is often used for erosion control due to its extensive root system. However, it can become invasive in some environments if not managed properly."
}
