{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia falcata var. minor",
    "plant_slug": "acacia-falcata-var-minor",
    "plant_name_scientific": "acacia falcata var. minor",
    "intro": "Acacia falcata var. minor, commonly known as the slender wattle, is a shrub native to eastern Australia. It is characterized by its narrow, feather-like leaves and yellow flowers that bloom in spikes. The plant thrives in well-drained soils and is often found in coastal and dry inland regions. It plays an important role in local ecosystems by providing food and shelter for various wildlife. Due to its hardy nature, it is also used in horticulture for ornamental purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia falcata var. minor is primarily native to southern Australia, including parts of New South Wales, Victoria, and South Australia. It thrives in dry, sandy soils and is commonly found in open woodlands and shrublands. This variety is adapted to arid and semi-arid environments, making it a resilient species in these regions. It is often associated with coastal and inland areas where the climate is warm and dry. The plant plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia falcata var. minor was mainly introduced to control soil erosion and stabilize sandy soils in coastal and inland areas. It is commonly used in reclamation projects due to its rapid growth and ability to thrive in poor soil conditions. The plant is also valued for its ornamental qualities, including its distinctive leaf structure and yellow flowers. However, its introduction has led to concerns about its potential invasiveness in certain ecosystems. It is primarily found in regions with a Mediterranean climate, including parts of southern Australia and California."
}
