{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sertiformis",
    "plant_slug": "acacia-sertiformis",
    "plant_name_scientific": "acacia sertiformis",
    "intro": "Acacia sertiformis, commonly known as the slender acacia, is a shrub or small tree native to southern Africa. It is characterized by its bipinnate leaves, which are composed of numerous small, needle-like leaflets. The plant produces yellow, globular flower heads that are arranged in clusters, typical of the Acacia genus. It thrives in arid and semi-arid environments, often found in sandy or rocky soils. The species is valued for its ornamental appeal and is sometimes cultivated for erosion control in degraded landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sertiformis"
    },
    "taxonomy_art_desc": "Acacia sertiformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that are typically characterized by their showy flowers and a wide variety of growth forms. Its order is Fabales, which includes plants with distinctive flowers that have a papilionaceous structure, commonly known as butterfly pea flowers. Its family is Fabaceae, also known as the legume family, which is recognized for its nitrogen-fixing ability and pod-like fruits. Its genus is Acacia, a large genus of shrubs and trees known for their characteristic phyllodes and often for their ability to thrive in arid environments. Its species is Acacia sertiformis, a specific type of acacia known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sertiformis is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, sandy soils across these regions. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the climate and soil conditions of its native range. The plant is an important component of the local flora and ecosystem in these areas.",
    "distribution_introduced_art_desc": "Acacia sertiformis was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Queensland. This plant is often used for soil stabilization due to its deep root system and ability to withstand drought. It also provides habitat and food for various native wildlife species. Its introduction has been both beneficial for ecological restoration and a concern for invasive spread in some regions."
}
