{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia flagellaris",
    "plant_slug": "acacia-flagellaris",
    "plant_name_scientific": "acacia flagellaris",
    "intro": "Acacia flagellaris, commonly known as the slender acacia, is a shrub or small tree native to the arid regions of Australia. It is characterized by its narrow, flagelliform branches that give it its common name, and it produces small, yellowish-green flowers during the warmer months. The plant has phyllodes rather than true leaves, which are narrow and strap-like, adapted to reduce water loss in its harsh environment. Acacia flagellaris is also known for its ability to fix nitrogen through symbiotic relationships with rhizobia bacteria in its root nodules. Its seeds are often dispersed by animals, contributing to its ecological role in arid ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia flagellaris is primarily native to the arid regions of central and western Australia. It is commonly found in the states of Western Australia, South Australia, and parts of Queensland. This plant thrives in sandy or rocky soils and is well adapted to the harsh, dry climate of its native habitat. It is often seen growing in shrublands and along riverbanks in these areas. Its distribution is closely tied to the availability of water and the specific soil conditions that support its growth.",
    "distribution_introduced_art_desc": "Acacia flagellaris was mainly introduced to control soil erosion and provide shade in degraded lands. It is commonly found in arid and semi-arid regions where it establishes quickly and forms dense thickets. This plant is known for its ability to thrive in poor soil conditions and withstand drought. However, its rapid growth can lead to the displacement of native vegetation. It is often used in rehabilitation projects due to its hardiness and low maintenance requirements."
}
