{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia merinthophora",
    "plant_slug": "acacia-merinthophora",
    "plant_name_scientific": "acacia merinthophora",
    "intro": "Acacia merinthophora, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small, lance-shaped leaflets. The plant produces yellow flowers in dense, cylindrical spikes, which bloom from late autumn to early spring. Its seeds are encased in woody pods that split open when mature, dispersing the seeds by wind. Acacia merinthophora is well adapted to dry, sandy soils and is often found in coastal and inland regions of southern Australia.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia merinthophora"
    },
    "taxonomy_art_desc": "Acacia merinthophora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume family, characterized by the pod-like fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in various ecological and economic contexts. Its species is Acacia merinthophora, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia merinthophora is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal and inland regions of the state. This plant thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. Its distribution is largely restricted to the southern and western parts of Western Australia. It is an important component of the local flora and plays a role in stabilizing sandy soils.",
    "distribution_introduced_art_desc": "Acacia merinthophora was mainly introduced to regions with arid or semi-arid climates due to its drought tolerance and ability to thrive in poor soils. It has been widely planted for soil stabilization and as a source of timber and fodder. The plant's rapid growth and adaptability have made it a common invasive species in several parts of Africa and the Middle East. However, its spread has raised concerns about its impact on native ecosystems and biodiversity. Proper management is essential to control its spread and mitigate ecological damage."
}
