{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oxycedrus var. microstachys",
    "plant_slug": "acacia-oxycedrus-var-microstachys",
    "plant_name_scientific": "acacia oxycedrus var. microstachys",
    "intro": "Acacia oxycedrus var. microstachys, commonly known as the Mediterranean acacia, is a shrub or small tree native to the Mediterranean region. It features narrow, elongated leaves that are often covered in fine hairs, and it produces yellowish-green flowers arranged in dense, globular clusters. The plant is characterized by its ability to thrive in dry, rocky soils and is well adapted to coastal and semi-arid environments. It is also known for its aromatic properties and has been used in traditional herbal remedies. The species is notable for its ecological importance in stabilizing soil and providing habitat for various insects and birds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oxycedrus var. microstachys is primarily native to the Mediterranean region, specifically southern Europe, northern Africa, and western Asia. It is found in countries such as Spain, Portugal, Morocco, Algeria, Tunisia, and Turkey. This variety thrives in rocky and arid environments, often growing on limestone soils. It is commonly found in woodlands, scrublands, and along coastal areas. Its distribution is closely associated with the Mediterranean climate, characterized by hot, dry summers and mild, wet winters.",
    "distribution_introduced_art_desc": "Acacia oxycedrus var. microstachys was mainly introduced to regions with Mediterranean climates characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is often found in coastal areas and rocky terrains. This plant is commonly used in landscaping for its hardiness and ornamental value. It has been introduced to parts of California, southern Europe, and Australia. However, it can become invasive in some areas if not managed properly."
}
