{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia disparrima",
    "plant_slug": "acacia-disparrima",
    "plant_name_scientific": "acacia disparrima",
    "intro": "Acacia disparrima, commonly known as the narrowleaf wattle, is a small shrub native to western Australia. It is characterized by its slender, often spiny stems and bipinnate leaves composed of numerous small, linear leaflets. The plant produces yellow flowers in late summer, which are clustered in dense, cylindrical spikes. It thrives in sandy or gravelly soils and is adapted to arid and semi-arid environments. Acacia disparrima is also valued for its ornamental appeal and its role in stabilizing coastal dunes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia disparrima"
    },
    "taxonomy_art_desc": "Acacia disparrima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some modern flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Fabales, which consists of flowering plants that are often legumes and include plants like beans and peas. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their thorny stems and pod-like fruits, commonly found in arid regions. Its species is Acacia disparrima, a specific type of acacia native to Australia, known for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia disparrima is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry, sandy soils across these regions. This plant thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of its native range. Acacia disparrima plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia disparrima was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and the Eastern Cape provinces. This plant thrives in sandy soils and is often seen along roadsides and in disturbed areas. Its introduction has led to concerns about its potential invasiveness in some ecosystems. However, it is not considered a major invasive species in the regions where it is established."
}
