{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia neobrachycarpa",
    "plant_slug": "acacia-neobrachycarpa",
    "plant_name_scientific": "acacia neobrachycarpa",
    "intro": "Acacia neobrachycarpa, commonly known as the narrow-leaf wattle, is a small to medium-sized shrub or tree native to Australia. It is characterized by its compound leaves, which are usually narrow and have a feathery appearance. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in a variety of soil types but prefers well-drained conditions. Acacia neobrachycarpa is often used in landscaping due to its ornamental value and ability to withstand drought.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia neobrachycarpa"
    },
    "taxonomy_art_desc": "Acacia neobrachycarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which includes legumes and related plants, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in tropical and subtropical regions, known for their distinctive foliage and sometimes spiny thorns. Its species is Acacia neobrachycarpa, a specific type of acacia found in certain regions of Australia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia neobrachycarpa is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This plant typically grows in open forests, woodlands, and along riverbanks. It is well adapted to the local climate and soil conditions of Queensland. Its distribution is largely restricted to specific areas within the state's northeastern regions.",
    "distribution_introduced_art_desc": "Acacia neobrachycarpa was mainly introduced to areas with semi-arid to arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the continent. This plant is often used for soil stabilization and as a source of timber due to its hardy nature. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. It is also valued for its ability to fix nitrogen, improving soil fertility in degraded lands."
}
