{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia balsamea",
    "plant_slug": "acacia-balsamea",
    "plant_name_scientific": "acacia balsamea",
    "intro": "Acacia balsamea, commonly known as the balsam acacia, is a small, deciduous shrub native to the arid regions of the southwestern United States and northern Mexico. It is characterized by its compound leaves, which are typically trifoliate, and its yellow to orange-pink flowers that bloom in spring. The plant produces small, woody pods that contain seeds, and it is well adapted to drought conditions. Acacia balsamea is often used in xeriscaping due to its low water requirements and ornamental value. It also has historical uses in traditional medicine by some indigenous communities.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia balsamea"
    },
    "taxonomy_art_desc": "Acacia balsamea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns, horsetails, and flowering plants, and is distinguished by the presence of vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, which is characterized by the presence of pod fruits and nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a group of shrubs and trees known for their distinctive acorn-like seed pods and often used for timber or as ornamental plants. Its species is Acacia balsamea, a specific type of acacia known for its aromatic properties and often found in arid or semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia balsamea is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in dry, sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia balsamea plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia balsamea was mainly introduced to areas with dry, sandy soils and a warm climate, often as an ornamental plant or for erosion control. It has been found in parts of the southwestern United States and northern Mexico. The plant thrives in full sun and requires minimal water once established. Its introduction has led to concerns about its potential to become invasive in certain ecosystems. Due to its hardiness, it is sometimes used in xeriscaping and landscaping projects."
}
