{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia diaphyllodinea",
    "plant_slug": "acacia-diaphyllodinea",
    "plant_name_scientific": "acacia diaphyllodinea",
    "intro": "Acacia diaphyllodinea, commonly known as the white-leaf acacia, is a flowering plant native to parts of Africa and the Middle East. It is characterized by its slender, branching stems and small, bipinnate leaves that are often covered in a fine, white pubescence. The plant produces yellow, globular flower heads that are clustered in dense, rounded inflorescences. It thrives in arid and semi-arid environments, often growing on rocky soils. Acacia diaphyllodinea is valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia diaphyllodinea"
    },
    "taxonomy_art_desc": "Acacia diaphyllodinea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like acorn-shaped seed pods and often used in traditional medicine. Its species is Acacia diaphyllodinea, a specific type of acacia native to certain regions of Africa, distinguished by its unique leaf and flower morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia diaphyllodinea is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the areas of the Geraldton and Shark Bay regions. This plant typically grows in sandy soils and is commonly found in coastal and inland habitats. It is well adapted to the arid and semi-arid conditions of its native range. Acacia diaphyllodinea plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia diaphyllodinea was mainly introduced to areas with disturbed soils and open habitats, often as a result of human activity such as land clearing or agricultural expansion. It thrives in regions with a warm climate and low rainfall, making it common in semi-arid and arid environments. The plant is known for its ability to establish quickly and form dense stands, which can alter local ecosystems. Its introduction has been documented in several countries across Africa, the Middle East, and parts of Asia. Due to its invasive potential, it is often considered a weed in areas where it is not native."
}
