{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sericocarpa",
    "plant_slug": "acacia-sericocarpa",
    "plant_name_scientific": "acacia sericocarpa",
    "intro": "Acacia sericocarpa, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow flowers in globular clusters, which are followed by flat, leathery pods containing seeds. It thrives in arid and semi-arid environments, often growing on rocky soils. The silky acacia is valued for its ornamental appeal and has been used traditionally for various purposes, including medicine and basket weaving.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sericocarpa"
    },
    "taxonomy_art_desc": "Acacia sericocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of parts. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their thorn-like structures and often used in traditional medicine and as sources of timber. Its species is Acacia sericocarpa, a specific type of acacia found in certain regions, noted for its silky-hairy leaves and ecological importance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sericocarpa is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This species is often associated with shrublands and coastal habitats. It thrives in arid and semi-arid environments, adapting well to the harsh climate of the region. The plant plays an important ecological role in supporting local wildlife and stabilizing soil in its native range.",
    "distribution_introduced_art_desc": "Acacia sericocarpa was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the southern and western parts of the continent. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. It has also been introduced to parts of New Zealand and South Africa for similar ecological purposes. However, its spread can sometimes lead to invasion of native vegetation in these regions."
}
