{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hirta var. glabrior",
    "plant_slug": "acacia-hirta-var-glabrior",
    "plant_name_scientific": "acacia hirta var. glabrior",
    "intro": "Acacia hirta var. glabrior, commonly known as the silky wattle, is a shrub native to Australia. It is characterized by its slender, wiry stems and small, bright yellow flowers that appear in cylindrical clusters. The leaves are simple, linear, and covered in fine, silky hairs, giving the plant its common name. It thrives in well-drained soils and is often found in coastal and sandy areas. This plant is valued for its ornamental appeal and is sometimes cultivated in gardens for its delicate floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hirta var. glabrior is primarily native to northern Australia, including regions of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This variety is often associated with coastal and inland dunes, as well as rocky outcrops. It thrives in areas with low rainfall and is well adapted to the harsh conditions of the Australian inland. Its distribution is largely confined to the northern parts of the continent where it plays a significant role in local ecosystems.",
    "distribution_introduced_art_desc": "Acacia hirta var. glabrior was mainly introduced to South Africa, where it has established itself in various habitats. It is commonly found in coastal areas and along roadsides, thriving in sandy or well-drained soils. This plant is often used for soil stabilization due to its extensive root system and ability to tolerate saline conditions. It has also been introduced to other regions in southern Africa for ornamental purposes. However, its spread has raised concerns about its potential impact on native ecosystems."
}
