{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stereophylla var. cylindrata",
    "plant_slug": "acacia-stereophylla-var-cylindrata",
    "plant_name_scientific": "acacia stereophylla var. cylindrata",
    "intro": "Acacia stereophylla var. cylindrata, commonly known as the cylindrical wattle, is a shrub native to Western Australia. It is characterized by its slender, cylindrical phyllodes that are typically green with a pale midrib. The plant produces yellow globular flower heads during the warmer months, which attract various pollinators. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The species is valued for its ornamental appeal and ecological benefits in native landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stereophylla"
    },
    "taxonomy_art_desc": "Acacia stereophylla var. cylindrata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their unique acorn-like seed pods and often used in landscaping and traditional medicine. Its species is Acacia stereophylla, a specific type of acacia that has a varietal form called cylindrata, distinguished by its cylindrical seed pods and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stereophylla var. cylindrata is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy or gravelly soils. This variety thrives in coastal and Mediterranean climate zones, often growing in open woodlands or heathlands. It is well adapted to the dry and sunny conditions typical of its native habitat. The plant is also known for its distinctive cylindrical pods and is a valuable component of the local flora.",
    "distribution_introduced_art_desc": "Acacia stereophylla var. cylindrata was mainly introduced to New South Wales, Australia, as part of early colonial land clearing and agricultural development. It was commonly used for soil stabilization and as a source of timber and fuelwood due to its hardy nature. The plant thrives in dry, sandy soils and is often found in coastal and inland regions with low rainfall. Its introduction has led to its naturalization in several areas, sometimes outcompeting native vegetation. Despite its invasive potential in some regions, it remains an important historical and ecological component of the local flora."
}
