{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia × hirtipes",
    "plant_slug": "acacia-×-hirtipes",
    "plant_name_scientific": "acacia × hirtipes",
    "intro": "Acacia × hirtipes, commonly known as the silver wattle, is a hybrid shrub native to Australia. It is characterized by its slender, often serpentine branches and its distinctive, feathery, bipinnate leaves. The plant produces yellow globular flowers in late winter to early spring, which are followed by flat, pod-like seedpods. Acacia × hirtipes is drought-tolerant and thrives in well-drained soils, making it suitable for coastal and sandy environments. It is widely cultivated for its ornamental value and as a source of nectar for wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia × hirtipes is primarily native to northern Australia, including regions of Queensland, Western Australia, and the Northern Territory. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This hybrid species is often seen in coastal and inland areas where it forms part of the local vegetation. It thrives in regions with a warm, dry climate and is well adapted to the harsh conditions of the Australian outback. Its distribution is also influenced by its parent species, Acacia aneura and Acacia longifolia.",
    "distribution_introduced_art_desc": "Acacia × hirtipes was mainly introduced to areas with a warm, dry climate and well-drained soils, often in regions with Mediterranean or subtropical characteristics. It thrives in environments with full sun exposure and is commonly found in disturbed or cultivated landscapes. This plant is often used in ornamental horticulture due to its attractive foliage and ability to tolerate poor soil conditions. It has been introduced to several parts of the world, including the United States, Australia, and parts of Europe. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
