{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia paolii subsp. paucijuga",
    "plant_slug": "acacia-paolii-subsp-paucijuga",
    "plant_name_scientific": "acacia paolii subsp. paucijuga",
    "intro": "Acacia paolii subsp. paucijuga, commonly known as the Enderby Island acacia, is a shrub native to the Enderby Islands in the southern Indian Ocean. It is characterized by its slender, often multi-branched stems and small, compound leaves. The plant produces yellow flowers arranged in cylindrical spikes, which are typical of the Acacia genus. It thrives in coastal environments and is adapted to saline and well-drained soils. Due to its restricted distribution and habitat specificity, it is considered a rare and vulnerable species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia paolii subsp. paucijuga is primarily native to the island of Socotra, located in the Arabian Sea. This subspecies is found in the arid and semi-arid regions of Socotra, which is known for its unique and endemic flora. It thrives in rocky and coastal areas, often growing in association with other endemic plant species. The plant is adapted to the harsh environmental conditions of the island, including high temperatures and limited rainfall. Its distribution is restricted to Socotra, making it a rare and important component of the island's biodiversity.",
    "distribution_introduced_art_desc": "Acacia paolii subsp. paucijuga was mainly introduced to areas with well-drained soils and a warm, dry climate. It is commonly found in regions with low rainfall and high sunlight exposure. This subspecies is often cultivated for its ornamental value and ability to thrive in arid environments. It has been introduced to several parts of Australia and the Mediterranean. Its distribution is limited to specific ecological niches where it can establish and persist."
}
