{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia bivenosa",
    "plant_slug": "acacia-bivenosa",
    "plant_name_scientific": "acacia bivenosa",
    "intro": "Acacia bivenosa, commonly known as the slender acacia, is a shrub native to southern Africa. It is characterized by its slender, upright stems and bipinnate leaves that are finely divided. The plant produces small, yellowish-green flowers arranged in cylindrical spikes, which are often clustered at the ends of the branches. Acacia bivenosa is adapted to arid and semi-arid environments, showing drought tolerance and a preference for well-drained soils. Its ecological importance includes providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia bivenosa"
    },
    "taxonomy_art_desc": "Acacia bivenosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their thorny stems and acacia-like leaves, often found in arid regions. Its species is Acacia bivenosa, a specific type of acacia native to certain regions of Africa, known for its unique morphological features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia bivenosa is primarily native to the Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions across these areas. It typically grows in sandy or rocky soils and is well adapted to the harsh climatic conditions of its native range. Acacia bivenosa is often seen in open woodlands and shrublands. Its distribution reflects its ability to thrive in the dry environments of northern Australia.",
    "distribution_introduced_art_desc": "Acacia bivenosa was mainly introduced to India for its ornamental value and potential use in soil stabilization. It is commonly found in coastal and semi-arid regions where it thrives in sandy or saline soils. The plant has been used in afforestation projects due to its fast growth and ability to withstand harsh environmental conditions. However, its introduction has raised concerns about its potential invasiveness in local ecosystems. Despite its benefits, careful monitoring is recommended to prevent ecological disruption."
}
