{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nigripilosa",
    "plant_slug": "acacia-nigripilosa",
    "plant_name_scientific": "acacia nigripilosa",
    "intro": "Acacia nigripilosa, commonly known as the black-haired wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant has slender, wiry stems with a distinctive dark reddish-brown color. Its flowers are typically arranged in cylindrical spikes and are pollinated by insects. Acacia nigripilosa is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia nigripilosa"
    },
    "taxonomy_art_desc": "Acacia nigripilosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their ancient lineage and unique reproductive structures. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which comprises plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found primarily in arid and semi-arid regions, known for their phyllodes and nitrogen-fixing capabilities. Its species is Acacia nigripilosa, a specific type of acacia characterized by its black-hairy seeds and adapted to grow in dry, nutrient-poor soils.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nigripilosa is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy or gravelly soils. This species thrives in dry, coastal environments and is often associated with sandplain and heathland communities. It is well adapted to the arid and semi-arid climates of its native range. Acacia nigripilosa plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia nigripilosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along the edges of forests, particularly in the Eastern and Western Cape provinces. This plant thrives in sandy or well-drained soils and is often associated with disturbed habitats. Due to its rapid growth and adaptability, it has spread beyond its original introduction sites. However, it is not considered invasive and does not pose a significant threat to native ecosystems."
}
