{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia genistifolia",
    "plant_slug": "acacia-genistifolia",
    "plant_name_scientific": "acacia genistifolia",
    "intro": "Acacia genistifolia, commonly known as the silky acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often twisted branches and small, feathery leaves that are covered in fine hairs, giving them a silky texture. The plant produces yellow flowers in clusters, which are followed by long, narrow pods containing seeds. It thrives in arid and semi-arid environments, showing adaptability to poor soil conditions. The species is also valued for its ornamental appeal and has been used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia genistifolia"
    },
    "taxonomy_art_desc": "Acacia genistifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their spore-based reproduction and vascular systems. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acicular leaves and often used for timber or as ornamental plants. Its species is Acacia genistifolia, a specific type of acacia known for its small, leaf-like stipules and is native to certain regions of Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "South Australia",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia genistifolia is primarily native to New South Wales, South Australia, Tasmania, and Victoria. It is commonly found in dry, open habitats such as woodlands, heathlands, and coastal areas. This species thrives in well-drained soils and is adapted to the temperate to semi-arid climates of these regions. It plays an important role in local ecosystems by providing food and shelter for various wildlife. Its distribution is largely confined to the southeastern part of Australia.",
    "distribution_introduced_art_desc": "Acacia genistifolia was mainly introduced to areas with a warm, dry climate and well-drained soils, often as an ornamental plant or for erosion control. It thrives in regions with full sun and moderate to high temperatures, making it suitable for arid and semi-arid environments. Its ability to grow in poor soils has led to its introduction in several parts of the world, including the Mediterranean, parts of Africa, and the southwestern United States. However, in some regions, it has become invasive, outcompeting native vegetation and altering local ecosystems. Despite its ecological impact, it remains popular for its fast growth and drought tolerance."
}
