{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brachyclada",
    "plant_slug": "acacia-brachyclada",
    "plant_name_scientific": "acacia brachyclada",
    "intro": "Acacia brachyclada, commonly known as the narrow-leaved acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in compact, globular inflorescences, which are typically visited by bees and other pollinators. Its seeds are encased in hard pods and are often dispersed by wind or animals. Acacia brachyclada is adapted to survive in harsh environments with low rainfall and high temperatures.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia brachyclada"
    },
    "taxonomy_art_desc": "Acacia brachyclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, often with unique structural features. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing capabilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive umbrella-like flower heads and often used in various ecological and economic contexts. Its species is Acacia brachyclada, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brachyclada is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This plant thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the hot and dry climate of its native habitat. Acacia brachyclada plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia brachyclada was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, particularly in sandy and rocky soils. The plant is often used in reforestation projects due to its ability to thrive in poor soil conditions. However, it has also been reported to spread aggressively, posing a threat to native vegetation in some areas. Its introduction has led to both ecological benefits and challenges in local ecosystems."
}
