{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia prainii var. linearis",
    "plant_slug": "acacia-prainii-var-linearis",
    "plant_name_scientific": "acacia prainii var. linearis",
    "intro": "Acacia prainii var. linearis, commonly known as the narrow-leaved acacia, is a shrub native to parts of Southeast Asia. It is characterized by its slender, linear leaves that are often arranged in a spiral pattern along the stems. The plant produces yellow flowers in compact spherical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is adapted to tropical and subtropical climates. Due to its ornamental value and hardy nature, it is sometimes cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia prainii var. linearis is primarily native to northern Australia, including the Northern Territory, Western Australia, and parts of Queensland. It is commonly found in arid and semi-arid regions, particularly in sandplain and lateritic soils. This variety is often associated with shrublands and woodland ecosystems. It thrives in well-drained soils and is adapted to the harsh climatic conditions of its native range. The plant is well-known for its distinctive linear leaves and yellow flowers.",
    "distribution_introduced_art_desc": "Acacia prainii var. linearis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, particularly in the Western and Eastern Cape provinces. The plant is often used in ornamental horticulture due to its attractive foliage and ability to thrive in dry conditions. However, it has also been reported to spread beyond cultivated areas, raising concerns about its potential invasiveness. Its introduction has led to discussions about its ecological impact and management in local ecosystems."
}
