{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens",
    "plant_slug": "acacia-decurrens",
    "plant_name_scientific": "acacia decurrens",
    "intro": "Acacia decurrens, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its feathery, bipinnate leaves and yellow floral spikes that bloom in spring. The plant is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid regions. Its seeds are encased in pods and are often used in traditional Aboriginal practices. Acacia decurrens plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia decurrens"
    },
    "taxonomy_art_desc": "Acacia decurrens belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies. Its subclass is Magnoliidae, a group of flowering plants that are primarily dicotyledons and are known for their diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often spiny foliage and pod-like fruits. Its species is Acacia decurrens, a specific type of acacia known for its slender, drooping leaves and is commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [
        "Angola",
        "Assam",
        "California",
        "Cameroon",
        "Cape Provinces",
        "China South-Central",
        "China Southeast",
        "Colombia",
        "Dominican Republic",
        "East Himalaya",
        "Ecuador",
        "Eswatini",
        "Ethiopia",
        "Free State",
        "Haiti",
        "India",
        "Jawa",
        "KwaZulu-Natal",
        "Leeward Is.",
        "Lesotho",
        "New Caledonia",
        "New Zealand North",
        "New Zealand South",
        "Northern Provinces",
        "Pakistan",
        "Puerto Rico",
        "Queensland",
        "South Australia",
        "Sri Lanka",
        "Tanzania",
        "Tasmania",
        "Venezuela",
        "Victoria",
        "West Himalaya",
        "Western Australia"
    ],
    "distribution_native_art_desc": "Acacia decurrens is primarily native to New South Wales. It is commonly found in the coastal and inland regions of the state. This plant thrives in a variety of soil types but prefers well-drained soils. It is often seen in open woodlands and along roadsides. Acacia decurrens plays an important ecological role in supporting local wildlife and stabilizing soils.",
    "distribution_introduced_art_desc": "Acacia decurrens was mainly introduced to a wide range of regions across Africa, Asia, and the Americas, including Angola, Cameroon, Ethiopia, and Tanzania, among others. It has been established in various ecological zones, from the humid climates of Assam and the East Himalaya to the drier regions of California and Queensland. The plant's adaptability has allowed it to thrive in diverse environments, contributing to its widespread distribution. It is also found in parts of the Caribbean, such as the Dominican Republic and Puerto Rico, as well as in the southern islands of New Zealand and Tasmania. Its introduction to these areas has been largely due to its ornamental value and potential for ecological and agricultural use."
}
