{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verticillata subsp. ruscifolia",
    "plant_slug": "acacia-verticillata-subsp-ruscifolia",
    "plant_name_scientific": "acacia verticillata subsp. ruscifolia",
    "intro": "Acacia verticillata subsp. ruscifolia, commonly known as the narrow-leaf wattle, is a shrub native to Western Australia. It is characterized by its slender, zigzagging stems and narrow, feather-like leaves that are arranged in whorls. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It thrives in well-drained soils and is often found in coastal and sandy habitats. This subspecies is valued for its ornamental appeal and is used in reforestation and erosion control efforts.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia verticillata"
    },
    "taxonomy_art_desc": "Acacia verticillata subsp. ruscifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and whisk ferns. Its subclass is Magnoliidae, a group of flowering plants that includes many primitive angiosperms with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have small flowers and are often legumes, with a significant role in nitrogen fixation. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and horticulture. Its species is Acacia verticillata, a specific type within the Acacia genus, with the subspecies ruscifolia exhibiting unique characteristics such as its leaf structure and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verticillata subsp. ruscifolia is primarily native to Tasmania and Victoria. This subspecies is commonly found in the coastal and sandy regions of these areas. It thrives in well-drained soils and is often seen in open woodlands and heathlands. The plant is well adapted to the temperate climate of southern Australia. It plays an important role in the local ecosystem by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia verticillata subsp. ruscifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along coastal areas and in open woodlands. This subspecies is valued for its ability to thrive in harsh, dry environments. It has also been reported in parts of Australia and the Mediterranean region. However, its introduction has raised concerns about potential ecological impacts on native flora."
}
