{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rigens var. humilis",
    "plant_slug": "acacia-rigens-var-humilis",
    "plant_name_scientific": "acacia rigens var. humilis",
    "intro": "Acacia rigens var. humilis, commonly known as the dwarf acacia, is a shrub native to the arid regions of Australia. It features small, narrow leaves that are often clustered at the base of the stems, reducing water loss in its harsh environment. The plant produces yellow flowers in dense, globular clusters, which attract a variety of pollinators. Its woody structure and drought-resistant characteristics make it well adapted to sandy soils and low rainfall. Due to its hardiness, it is often used in landscaping for erosion control and as an ornamental plant in dry gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rigens var. humilis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant thrives in sandy soils and is commonly found in shrublands and savanna ecosystems. It is well adapted to drought conditions and can tolerate high temperatures. The plant is often seen growing in open areas with low vegetation cover. Its distribution is closely linked to the specific climatic and edaphic conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia rigens var. humilis was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in coastal dunes and sandy soils along the southern and western coasts of Australia. This plant is often used for erosion control due to its extensive root system and ability to thrive in harsh conditions. It has also been introduced to other parts of the world for ornamental purposes and as a potential source of timber. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
