{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia albida",
    "plant_slug": "acacia-albida",
    "plant_name_scientific": "acacia albida",
    "intro": "Acacia albida, commonly known as the white acacia, is a shrub or small tree native to Africa. It is characterized by its pale yellow to white flowers that bloom in clusters, adding a striking visual contrast to its green foliage. The plant has feathery, bipinnate leaves that help reduce water loss, adapting it to arid environments. Its seed pods are elongated and woody, containing seeds that are dispersed by animals or wind. Acacia albida is often used in traditional medicine and as a source of timber and fodder.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northeast"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia albida is primarily native to the northeastern region of Argentina. This species thrives in the tropical and subtropical climates of this area. It is commonly found in savannas and open woodlands where it can receive ample sunlight. The plant is well adapted to the local soil conditions and seasonal rainfall patterns. Its native distribution is limited to this specific geographic region in Argentina.",
    "distribution_introduced_art_desc": "Acacia albida was mainly introduced to regions where its drought-resistant properties and ability to thrive in poor soils make it valuable for land rehabilitation and livestock feed. It is commonly found in semi-arid and arid areas of Africa, particularly in countries like Sudan, Ethiopia, and Somalia. The plant has been introduced to new areas for its ecological benefits, including soil stabilization and providing shade. However, its introduction has sometimes led to competition with native species and overgrazing by livestock. Despite these challenges, it remains an important plant in many parts of the world for both environmental and agricultural purposes."
}
