{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia myrtifolia",
    "plant_slug": "acacia-myrtifolia",
    "plant_name_scientific": "acacia myrtifolia",
    "intro": "Acacia myrtifolia, commonly known as the myrtle-leaved wattle, is a flowering plant native to Australia. It is characterized by its slender, upright shrub form and its distinctive leaves, which are narrow and resemble those of myrtle. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical heads. Acacia myrtifolia is adapted to dry, sandy soils and is often found in coastal and inland regions. It is a valuable plant for ecological restoration due to its ability to fix nitrogen and provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia myrtifolia"
    },
    "taxonomy_art_desc": "Acacia myrtifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants that includes ferns, horsetails, and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and as timber. Its species is Acacia myrtifolia, a specific type of acacia found in certain regions, known for its particular morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "South Australia",
        "Tasmania",
        "Victoria",
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia myrtifolia is primarily native to New South Wales, Queensland, South Australia, Tasmania, Victoria, and Western Australia. This plant is commonly found in a variety of habitats, including dry sclerophyll forests and rocky outcrops. It is well adapted to the dry and often nutrient-poor soils of these regions. Acacia myrtifolia typically grows in open woodland and shrubland environments. Its distribution reflects its ability to thrive in the diverse climatic conditions across these Australian states.",
    "distribution_introduced_art_desc": "Acacia myrtifolia was mainly introduced to India. It is commonly found in the western and southern regions of the country. The plant thrives in arid and semi-arid environments, making it well-suited for the climatic conditions of these areas. It is often used for soil stabilization and as a source of timber and fodder. Its introduction has contributed to ecological restoration efforts in degraded landscapes."
}
