{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia personioides",
    "plant_slug": "acacia-personioides",
    "plant_name_scientific": "acacia personioides",
    "intro": "Acacia personioides, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging branches and phyllodes that are narrow and linear. The plant produces yellow flowers in late summer, which are clustered in cylindrical spikes. It is well adapted to arid and semi-arid environments, showing resilience to drought. The species is also valued for its ornamental appeal and is used in reforestation efforts in suitable climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia personioides is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in shrublands, grasslands, and rocky outcrops where it thrives in hot and dry conditions. This species is well adapted to low rainfall and poor soil conditions, making it a resilient component of the local ecosystem. It plays an important role in providing habitat and food for various wildlife species. Its distribution is largely restricted to the southwestern and central parts of the African continent.",
    "distribution_introduced_art_desc": "Acacia personioides was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and parts of the Eastern Cape, growing in coastal and semi-arid environments. This plant is often used for ornamental purposes due to its attractive yellow flowers and hardy nature. However, it has also been reported to spread into native vegetation, potentially displacing local plant species. Its introduction has raised concerns among conservationists due to its invasive potential in certain ecosystems."
}
