{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mutabilis subsp. incurva",
    "plant_slug": "acacia-mutabilis-subsp-incurva",
    "plant_name_scientific": "acacia mutabilis subsp. incurva",
    "intro": "Acacia mutabilis subsp. incurva, commonly known as the variable wattle, is a shrub native to South Africa. It is characterized by its distinctive, feathery, yellow flowers that appear in spring. The plant has compound leaves with small, paired leaflets and produces long, thin pods that contain seeds. It thrives in well-drained soils and is often found in coastal and mountainous regions. The species is known for its rapid growth and adaptability to various environmental conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia mutabilis"
    },
    "taxonomy_art_desc": "Acacia mutabilis subsp. incurva belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and their ability to thrive in arid environments. Its species is Acacia mutabilis, a specific type of acacia that exhibits variability in its morphology, hence the subspecies incurva.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mutabilis subsp. incurva is primarily native to Western Australia. This subspecies is found in the southern regions of the state, particularly in the southwestern and central areas. It typically grows in sandy soils and is commonly associated with coastal and inland heathlands. The plant is well adapted to the arid and semi-arid climates of its native range. It is an important component of the local flora and contributes to the ecological diversity of the region.",
    "distribution_introduced_art_desc": "Acacia mutabilis subsp. incurva was mainly introduced to New Zealand. It was brought there during the 19th century as part of the introduction of exotic plant species for ornamental and horticultural purposes. This subspecies is known for its ability to thrive in a variety of soil types and its tolerance to both drought and frost. It has since become naturalized in several regions of New Zealand, often growing in open areas and along roadsides. However, its spread has raised concerns due to its potential to become invasive in certain ecosystems."
}
