{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia menabeensis",
    "plant_slug": "acacia-menabeensis",
    "plant_name_scientific": "acacia menabeensis",
    "intro": "Acacia menabeensis, commonly known as the Madagascar acacia, is a shrub or small tree native to Madagascar. It is characterized by its slender, often multi-branched structure and its distinctive yellow flowers that bloom in dense, globular clusters. The plant has phyllodes, which are modified leaf stalks that function as leaves, and these are typically narrow and linear. Acacia menabeensis is adapted to the dry, arid conditions of its native habitat, showing resilience to drought. It plays an important role in the local ecosystem, providing food and shelter for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Senegalia",
        "species": "Senegalia menabeensis"
    },
    "taxonomy_art_desc": "Acacia menabeensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by its complex floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Senegalia, a group of flowering plants native to Africa and Madagascar, known for their acacia-like appearance and ecological importance. Its species is Senegalia menabeensis, a specific plant found in Madagascar, recognized for its unique morphology and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Madagascar"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia menabeensis is primarily native to Madagascar. It is found in the eastern part of the island, particularly in the northeastern region. This plant thrives in dry, arid environments and is commonly found in scrublands and dry forests. It plays an important ecological role in its native habitat. Acacia menabeensis is adapted to the unique climate and soil conditions of Madagascar.",
    "distribution_introduced_art_desc": "Acacia menabeensis was mainly introduced to Madagascar, where it has become naturalized in certain regions. It is commonly found in dry, rocky habitats and along riverbanks. The plant is valued for its hardy nature and ability to thrive in arid conditions. However, it has also been reported as an invasive species in some areas, outcompeting native vegetation. Its introduction has raised concerns about its ecological impact on local ecosystems."
}
