{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gonoclada",
    "plant_slug": "acacia-gonoclada",
    "plant_name_scientific": "acacia gonoclada",
    "intro": "Acacia gonoclada, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often zigzagging stems and small, narrow leaves. The plant produces yellow flowers in globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in arid or semi-arid regions. Acacia gonoclada is also valued for its hardy nature and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia gonoclada"
    },
    "taxonomy_art_desc": "Acacia gonoclada belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pods as fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in various ecological and commercial contexts. Its species is Acacia gonoclada, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gonoclada is primarily native to Northern Territory, Queensland, and Western Australia. It is commonly found in arid and semi-arid regions within these states. This plant thrives in sandy or rocky soils and is often seen in open woodlands and shrublands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distinctive yellow flowers make it a notable feature of the landscape in its native range.",
    "distribution_introduced_art_desc": "Acacia gonoclada was mainly introduced to South Africa, where it has become an invasive species. It was originally from Australia and was brought to South Africa for ornamental purposes due to its attractive foliage and ability to thrive in dry conditions. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to concerns about its impact on biodiversity and land management. Efforts are being made to control its spread and mitigate its ecological effects."
}
