{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia peregrina",
    "plant_slug": "acacia-peregrina",
    "plant_name_scientific": "acacia peregrina",
    "intro": "Acacia peregrina, commonly known as the sacred acacia or the Arabian thorn tree, is a flowering plant native to the Arabian Peninsula. It is a small, spiny shrub that typically grows in arid and semi-arid environments. The plant produces yellow flowers and has small, bean-like pods that contain seeds. Its leaves are bipinnate, consisting of many tiny leaflets, and it is well adapted to survive in hot, dry climates. Acacia peregrina is also known for its cultural and historical significance in the region.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia peregrinalis"
    },
    "taxonomy_art_desc": "Acacia peregrina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which is a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of flower structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive umbrella-shaped acacia pods. Its species is Acacia peregrinalis, a specific type of acacia known for its unique characteristics and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia peregrina is primarily native to New Guinea. It is found in various regions across the island, including the highlands and lowland areas. This plant thrives in tropical and subtropical climates, often growing in dry or semi-arid environments. It is commonly found in open woodlands and grasslands. Acacia peregrina plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia peregrina was mainly introduced to regions with arid or semi-arid climates, where it thrives in hot and dry environments. It is commonly found in areas with well-drained soils, making it suitable for degraded or disturbed lands. The plant is often used for its hardy nature and ability to prevent soil erosion. Its introduction has been primarily for ecological restoration and as an ornamental species. However, in some regions, it has become invasive, outcompeting native vegetation."
}
