{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia jupunba",
    "plant_slug": "acacia-jupunba",
    "plant_name_scientific": "acacia jupunba",
    "intro": "Acacia jupunba, commonly known as the black wattle, is a shrub or small tree native to Australia. It is characterized by its dark, fissured bark and compound leaves composed of multiple narrow, pointed leaflets. The plant produces yellow flowers in globular clusters, which are followed by elongated, woody pods containing seeds. Acacia jupunba is well adapted to dry and arid environments, making it a resilient species in its native habitat. It is also known for its use in the production of tannins and as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia jupunba is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the states of Western Australia, South Australia, and parts of New South Wales. This plant thrives in sandy or loamy soils and is often seen in shrublands and open woodlands. It is well adapted to harsh environmental conditions, including drought and high temperatures. Acacia jupunba plays an important role in the ecosystem, providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia jupunba was mainly introduced to areas with dry, semi-arid climates, particularly in parts of Australia and other regions with similar environmental conditions. It thrives in well-drained soils and is commonly found in open woodlands and shrublands. This plant is often used for erosion control due to its extensive root system and ability to withstand drought. It has also been introduced to other parts of the world as an ornamental or for land rehabilitation purposes. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
