{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia concolorans",
    "plant_slug": "acacia-concolorans",
    "plant_name_scientific": "acacia concolorans",
    "intro": "Acacia concolorans, commonly known as the yellow acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, branching structure and yellowish-green foliage. The plant produces small, fluffy pods that contain seeds, which are dispersed by wind. Acacia concolorans thrives in well-drained soils and is often found in savanna and woodland habitats. It is valued for its ornamental appeal and ability to tolerate drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia concolorans"
    },
    "taxonomy_art_desc": "Acacia concolorans belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes horsetails and other ancient plant lineages. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that are often legumes and include plants with symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is known for its distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in various ecological and economic contexts. Its species is Acacia concolorans, a specific type of acacia known for its unique characteristics and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia concolorans is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the Pilbara and Great Sandy Desert areas. This plant thrives in sandy soils and is often seen along roadsides and in open woodlands. It is well adapted to the harsh climatic conditions of the region. Its distribution is largely restricted to the western parts of Australia.",
    "distribution_introduced_art_desc": "Acacia concolorans was mainly introduced to areas with well-drained soils and a warm, temperate climate. It thrives in regions with moderate rainfall and full sun exposure. This plant is commonly found in coastal and inland regions where it can establish itself easily. It has been introduced to several countries in the Mediterranean and parts of southern Africa. Due to its rapid growth and adaptability, it has become naturalized in many of these regions."
}
