{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pinifolia",
    "plant_slug": "acacia-pinifolia",
    "plant_name_scientific": "acacia pinifolia",
    "intro": "Acacia pinifolia, commonly known as the needle-leaved acacia, is a shrub native to the arid regions of Australia. It is characterized by its slender, needle-like phyllodes that are typically gray-green in color. The plant produces yellow flowers in dense, globular clusters, which bloom during the warmer months. Acacia pinifolia is adapted to survive in dry conditions with its deep root system and water-storing stems. It is often used in landscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pinifolia is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the inland areas of Western Australia, South Australia, and parts of Queensland. This plant thrives in sandy or gravelly soils and is often seen in open woodlands and shrublands. It is well adapted to withstand drought and high temperatures. Its distribution is closely linked to the availability of well-drained soils and minimal rainfall.",
    "distribution_introduced_art_desc": "Acacia pinifolia was mainly introduced to areas with sandy soils and arid climates, particularly in regions of Australia and the Mediterranean. It is often used for soil stabilization and as a source of timber and fuelwood. The plant's rapid growth and adaptability make it a common choice for reforestation and land rehabilitation projects. However, its introduction has sometimes led to ecological concerns due to its aggressive growth and competition with native species. Despite these issues, it remains an important species in certain agricultural and environmental contexts."
}
