{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ramulosa var. ramulosa",
    "plant_slug": "acacia-ramulosa-var-ramulosa",
    "plant_name_scientific": "acacia ramulosa var. ramulosa",
    "intro": "Acacia ramulosa var. ramulosa, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its delicate, feathery foliage and yellow flowers that bloom in late summer. The plant has small, oval-shaped leaves that are often covered in fine hairs. It thrives in well-drained soils and full sun, making it suitable for coastal and sandy environments. Its ecological importance includes providing nectar for native pollinators and habitat for small fauna.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ramulosa"
    },
    "taxonomy_art_desc": "Acacia ramulosa var. ramulosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a secondary cell wall in their cells. Its class is Equisetopsida, which comprises ferns, horsetails, and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with pea-like petals and include legumes that form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like flower heads and often used for timber, fodder, and traditional medicine. Its species is Acacia ramulosa, a specific type of acacia known for its branching structure and is a variant of the species with specific morphological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ramulosa var. ramulosa is primarily native to New South Wales, Northern Territory, Queensland, South Australia, and Western Australia. This shrub is commonly found in arid and semi-arid regions across these states. It thrives in sandy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of the Australian interior. Its distribution reflects its ability to survive in dry, nutrient-poor environments.",
    "distribution_introduced_art_desc": "Acacia ramulosa var. ramulosa was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and hardy nature. The species has since become naturalized in certain regions, particularly in coastal and lowland areas. It is commonly found in gardens and along roadsides throughout the country. However, its spread has raised concerns due to its potential to invade native ecosystems."
}
