{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spadicigera",
    "plant_slug": "acacia-spadicigera",
    "plant_name_scientific": "acacia spadicigera",
    "intro": "Acacia spadicigera, commonly known as the broad-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its compound leaves, which are often bipinnate and covered in fine hairs. The plant produces yellow flowers in globular or cylindrical clusters, which are highly attractive to pollinators. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The wood of Acacia spadicigera is hard and durable, historically used by Indigenous Australians for tool-making and construction.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spadicigera is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in savanna and woodland habitats, often found in areas with well-drained soils. This species is commonly associated with dry to semi-arid regions, where it plays a role in stabilizing soil and providing habitat for local wildlife. It is also known to grow in open grasslands and along riverbanks. Acacia spadicigera is well adapted to the climatic conditions of its native range, showing resilience to drought and heat.",
    "distribution_introduced_art_desc": "Acacia spadicigera was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread beyond cultivated areas and is now found in naturalized habitats across the region. The plant is particularly common in coastal and semi-arid regions, where it thrives in disturbed soils and open landscapes. Its rapid growth and ability to colonize new areas have led to concerns about its potential invasiveness. However, it is not currently classified as a major invasive species in the region."
}
