{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vulcanica",
    "plant_slug": "acacia-vulcanica",
    "plant_name_scientific": "acacia vulcanica",
    "intro": "Acacia vulcanica, commonly known as the volcanic acacia, is a unique plant species adapted to extreme environments. It thrives in volcanic soils and high-altitude regions, showcasing remarkable resilience to harsh conditions. The plant features feathery, bipinnate leaves that help reduce water loss in arid climates. Its small, yellow flowers are clustered in dense inflorescences, attracting various pollinators. Acacia vulcanica plays a vital ecological role in stabilizing soil and supporting local biodiversity in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia vulcanica is primarily native to the volcanic regions of Eastern Africa, including countries such as Kenya, Tanzania, and Uganda. It thrives in nutrient-rich soils found in areas with recent volcanic activity. This plant is commonly found in savannas and woodland areas near volcanic slopes. It plays an important ecological role in stabilizing soil and providing habitat for various wildlife species. Its distribution is closely linked to the unique environmental conditions created by volcanic landscapes.",
    "distribution_introduced_art_desc": "Acacia vulcanica was mainly introduced to areas with volcanic soil and high temperatures, typically found in arid and semi-arid regions. It thrives in environments where other plants struggle due to its ability to tolerate extreme heat and poor soil conditions. This plant has been introduced to several regions in Australia and parts of the Middle East for its potential in land reclamation and as a source of timber. Its rapid growth and adaptability make it a useful species for ecological restoration projects. However, it can also become invasive if not managed properly, posing a risk to native biodiversity."
}
