{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia arabica var. adansonii",
    "plant_slug": "acacia-arabica-var-adansonii",
    "plant_name_scientific": "acacia arabica var. adansonii",
    "intro": "Acacia arabica var. adansonii, commonly known as the Sudanese acacia, is a deciduous shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its compound leaves, which are typically arranged in a flat, fan-like pattern, and its distinctive yellow to orange flowers. The plant is well adapted to dry climates, with a deep root system that allows it to access water from deeper soil layers. It produces small, woody pods that contain seeds, which are dispersed by wind or animals. This species is also valued for its hardy nature and is sometimes used in traditional medicine or as a source of timber.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia arabica var. adansonii is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is commonly found in arid and semi-arid regions, often growing in rocky soils and along coastal areas. This variety is well adapted to dry climates and can thrive in areas with low rainfall. It is often used for its timber and has cultural significance in local communities. The plant plays an important role in the ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia arabica var. adansonii was mainly introduced to regions with a Mediterranean climate, characterized by dry summers and wet winters. It thrives in well-drained soils and full sun exposure, making it suitable for coastal and urban landscapes. This variety is often used in landscaping for its ornamental value and drought tolerance. It has been introduced to parts of southern Europe, the United States, and Australia. However, its invasive potential in non-native environments requires careful management."
}
