{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia horridula",
    "plant_slug": "acacia-horridula",
    "plant_name_scientific": "acacia horridula",
    "intro": "Acacia horridula, commonly known as the rough acacia, is a shrub or small tree native to southern Africa. It is characterized by its thorny stems and bipinnate leaves, which are composed of numerous small leaflets. The plant produces yellow flowers in globular inflorescences, followed by woody pod fruits containing flat, kidney-shaped seeds. It thrives in arid and semi-arid environments, often found in savannas and rocky areas. Acacia horridula is adapted to drought conditions and plays a role in providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia horridula"
    },
    "taxonomy_art_desc": "Acacia horridula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of plants that includes ferns and their allies, often featuring vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, often with complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia horridula, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia horridula is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in arid and semi-arid environments, often growing in sandy or gravelly soils. It is well adapted to the harsh climatic conditions of the region. Acacia horridula is an important component of the local flora and plays a role in the ecological balance of its habitat.",
    "distribution_introduced_art_desc": "Acacia horridula was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its hardy nature and ability to provide shade and forage for livestock. Its introduction has helped in reclaiming degraded lands across several parts of Australia. However, it is important to manage its spread to prevent it from becoming invasive in non-target areas."
}
