{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia borneensis",
    "plant_slug": "acacia-borneensis",
    "plant_name_scientific": "acacia borneensis",
    "intro": "Acacia borneensis, commonly known as the Bornean acacia, is a flowering plant native to the tropical regions of Borneo. It is a small to medium-sized tree or shrub that typically grows in lowland and hill forest areas. The plant is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. Its yellow to golden flowers are arranged in cylindrical inflorescences and bloom during the wet season. Acacia borneensis plays a role in local ecosystems and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia borneensis is primarily native to Borneo, including parts of Malaysia, Indonesia, and Brunei. It is commonly found in lowland and hill forest areas, often growing in secondary and disturbed habitats. This species thrives in tropical climates with high humidity and well-drained soils. It is an important component of the local flora and is often used in traditional medicine. Its distribution is closely linked to the unique ecological conditions of the island.",
    "distribution_introduced_art_desc": "Acacia borneensis was mainly introduced to regions with tropical and subtropical climates, particularly in parts of Southeast Asia and the Pacific Islands. It thrives in well-drained soils and full sun exposure, making it suitable for coastal and degraded lands. The plant is often used for its hardy nature and ability to stabilize soil, contributing to reforestation efforts. Its introduction has also been associated with ornamental gardening due to its attractive foliage and flowering. However, in some areas, it has become invasive, outcompeting native species and altering local ecosystems."
}
