{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella angustissima var. angustissima",
    "plant_slug": "acaciella-angustissima-var-angustissima",
    "plant_name_scientific": "acaciella angustissima var. angustissima",
    "intro": "Acaciella angustissima var. angustissima, commonly known as the narrowleaf acaciella, is a shrub native to arid and semi-arid regions of southern Africa. It typically grows to a height of 1 to 2 meters, featuring slender, angular stems covered in a layer of fine, white hairs. The leaves are small, linear, and often clustered at the base of the plant, with a distinctive grayish-green color. Its flowers are yellow and clustered in dense, cylindrical inflorescences, which appear during the rainy season. The plant is adapted to withstand drought and is often found in rocky or sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella angustissima"
    },
    "taxonomy_art_desc": "Acaciella angustissima var. angustissima belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acaciella, a group of flowering plants native to South America, often found in arid and semi-arid regions. Its species is Acaciella angustissima, a specific variety within the genus, known for its narrow leaves and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Argentina Northwest",
        "Arizona",
        "Arkansas",
        "Belize",
        "Colombia",
        "Costa Rica",
        "Ecuador",
        "El Salvador",
        "Florida",
        "Guatemala",
        "Honduras",
        "Kansas",
        "Louisiana",
        "Mexico Central",
        "Mexico Gulf",
        "Mexico Northeast",
        "Mexico Northwest",
        "Mexico Southeast",
        "Mexico Southwest",
        "Missouri",
        "New Mexico",
        "Nicaragua",
        "Oklahoma",
        "Panamá",
        "Peru",
        "Texas",
        "Venezuela"
    ],
    "distribution_introduced": [
        "Cuba",
        "New Guinea",
        "Philippines",
        "Queensland",
        "Thailand"
    ],
    "distribution_native_art_desc": "Acaciella angustissima var. angustissima is primarily native to Argentina Northwest, Arizona, Arkansas, Belize, Colombia, Costa Rica, Ecuador, El Salvador, Florida, Guatemala, Honduras, Kansas, Louisiana, Mexico Central, Mexico Gulf, Mexico Northeast, Mexico Northwest, Mexico Southeast, Mexico Southwest, Missouri, New Mexico, Nicaragua, Oklahoma, Panamá, Peru, Texas, and Venezuela. This plant thrives in a variety of habitats, including dry forests, savannas, and rocky soils. It is commonly found in regions with warm, semi-arid to tropical climates. The species is well adapted to low-nutrient soils and can tolerate periods of drought. Its wide distribution across multiple countries highlights its ecological significance in these diverse environments.",
    "distribution_introduced_art_desc": "Acaciella angustissima var. angustissima was mainly introduced to Cuba, New Guinea, Philippines, Queensland, and Thailand. It is primarily found in tropical and subtropical regions, where it thrives in well-drained soils. This plant is often cultivated for its ornamental value due to its unique foliage and adaptability. Its introduction to these areas has been largely through horticultural trade and intentional planting. However, its spread in some regions has raised concerns about its potential impact on local ecosystems."
}
