{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macrocephala var. siamensis",
    "plant_slug": "acacia-macrocephala-var-siamensis",
    "plant_name_scientific": "acacia macrocephala var. siamensis",
    "intro": "Acacia macrocephala var. siamensis, commonly known as the Siam acacia, is a shrub or small tree native to Southeast Asia. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow to golden yellow inflorescences, which are clustered and attract various pollinators. Its seeds are encased in woody pods, and the plant is adapted to tropical and subtropical climates. It is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macrocephala var. siamensis is primarily native to Southeast Asia, particularly Thailand and southern Vietnam. It is commonly found in lowland tropical forests and along riverbanks. This plant thrives in humid climates with well-drained soils. It is often associated with secondary growth and disturbed habitats. Its distribution is also reported in parts of Malaysia and Indonesia.",
    "distribution_introduced_art_desc": "Acacia macrocephala var. siamensis was mainly introduced to South East Asia, particularly in countries like Thailand, Vietnam, and Malaysia. It was introduced for its ornamental value due to its attractive foliage and ability to thrive in tropical climates. The plant is often used in landscaping and as a shade tree in urban and rural settings. It has also been introduced to parts of Australia for reforestation and soil stabilization efforts. However, its spread has raised concerns about potential ecological impacts in non-native regions."
}
