{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glomerosa var. parviflora",
    "plant_slug": "acacia-glomerosa-var-parviflora",
    "plant_name_scientific": "acacia glomerosa var. parviflora",
    "intro": "Acacia glomerosa var. parviflora, commonly known as the small-flowered wattle, is a shrub native to Australia. It is characterized by its slender, wiry stems and small, yellow, globular flowers that appear in clusters. The leaves are bipinnate, consisting of numerous tiny, oval-shaped leaflets. It thrives in well-drained soils and is often found in coastal and inland regions. This plant is valued for its ornamental appeal and is sometimes cultivated in gardens for its delicate floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glomerosa var. parviflora is primarily native to northern Australia, including regions of Queensland, the Northern Territory, and Western Australia. It is commonly found in arid and semi-arid environments, particularly in sandplains and rocky outcrops. This variety is well adapted to dry climates and can thrive in poor soil conditions. It is often seen growing in shrublands and woodlands, contributing to the local vegetation structure. Its distribution is closely linked to the ecological zones where it can receive sufficient water during the wet season.",
    "distribution_introduced_art_desc": "Acacia glomerosa var. parviflora was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. This plant is known for its small, yellow flowers and its ability to withstand harsh environmental conditions. It is often used for stabilizing dunes and preventing soil erosion. However, it can also become invasive in some areas if not managed properly."
}
