{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drummondii subsp. drummondii",
    "plant_slug": "acacia-drummondii-subsp-drummondii",
    "plant_name_scientific": "acacia drummondii subsp. drummondii",
    "intro": "Acacia drummondii subsp. drummondii, commonly known as the Drummond's wattle, is a shrub native to the arid and semi-arid regions of Australia. It is characterized by its slender, zigzagging stems and bright yellow flowers that appear in clusters during the warmer months. The plant produces small, flat, elliptical leaves that are often covered in fine hairs. It is well adapted to drought conditions, with deep root systems that help it survive in poor soil. The species is also notable for its role in stabilizing sandy soils and providing nectar for native pollinators.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia drummondii"
    },
    "taxonomy_art_desc": "Acacia drummondii subsp. drummondii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and diverse morphological features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is characterized by pod fruits and often nitrogen-fixing symbiotic relationships with bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and as ornamental plants. Its species is Acacia drummondii, a specific type of acacia that is native to Australia and is known for its ecological importance and adaptability to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drummondii subsp. drummondii is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This subspecies thrives in dry, sandy soils and is often associated with shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of its native range. The plant plays an important ecological role in supporting local wildlife and maintaining biodiversity in its habitat.",
    "distribution_introduced_art_desc": "Acacia drummondii subsp. drummondii was mainly introduced to areas with well-drained soils and a Mediterranean climate, typically found in regions of southern California and parts of western North America. It thrives in full sun and is commonly found in coastal sage scrub and chaparral ecosystems. This plant is often used in landscaping due to its drought tolerance and ornamental value. However, it can become invasive in certain environments if not managed properly. Its introduction has led to concerns about its impact on native plant communities in some regions."
}
