{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia provincialis",
    "plant_slug": "acacia-provincialis",
    "plant_name_scientific": "acacia provincialis",
    "intro": "Acacia provincialis, commonly known as the Cape ash, is a small to medium-sized evergreen shrub or tree native to South Africa. It is characterized by its dense, dark green foliage and produces small, yellowish flowers arranged in cylindrical inflorescences. The plant is well adapted to arid and semi-arid environments, with a deep root system that allows it to access groundwater. Its bark is smooth and greyish, often peeling in thin layers, and it is sometimes used in traditional medicine. Acacia provincialis plays an important role in local ecosystems by providing habitat and food for various insects and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia provincialis"
    },
    "taxonomy_art_desc": "Acacia provincialis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of plants with distinctive flowers and includes legumes that often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their unique foliage and often used in traditional medicine and land restoration. Its species is Acacia provincialis, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia",
        "Victoria"
    ],
    "distribution_introduced": [
        "Tasmania"
    ],
    "distribution_native_art_desc": "Acacia provincialis is primarily native to South Australia and Victoria. This species is commonly found in arid and semi-arid regions within these states. It typically grows in sandy or rocky soils and is well adapted to the harsh climatic conditions of the region. The plant is often seen in open woodlands and along riverbanks. Its distribution is limited to specific ecological zones within South Australia and Victoria.",
    "distribution_introduced_art_desc": "Acacia provincialis was mainly introduced to Tasmania for its ornamental value and potential for soil stabilization. It is commonly found in coastal and sandy areas, where it thrives in well-drained soils. The plant has been used in landscaping and reforestation projects due to its hardy nature and ability to tolerate harsh environmental conditions. However, it has also been noted to spread aggressively, raising concerns about its impact on native flora. Its introduction has led to increased monitoring to manage its ecological effects."
}
