{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia melanoceras",
    "plant_slug": "acacia-melanoceras",
    "plant_name_scientific": "acacia melanoceras",
    "intro": "Acacia melanoceras, commonly known as the blackwood acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and Australia. It is characterized by its dark, fissured bark and bipinnate leaves that are often reduced to small, needle-like structures. The plant produces yellow to golden flowers in globular or cylindrical clusters, which are followed by woody, pod-like fruits containing seeds. Acacia melanoceras is drought-tolerant and thrives in poor soils, making it well adapted to harsh environmental conditions. It is also valued for its hard wood and has been used traditionally for various purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia melanoceras is primarily native to eastern and southern Africa, including countries such as Kenya, Tanzania, Malawi, and Mozambique. It thrives in dry, tropical, and subtropical regions, often found in woodlands and savannas. This species is well adapted to arid and semi-arid environments, making it a common sight in these ecosystems. It plays an important role in local biodiversity and is sometimes used for its timber and medicinal properties. The plant's distribution is closely linked to areas with well-drained soils and moderate to high sunlight exposure.",
    "distribution_introduced_art_desc": "Acacia melanoceras was mainly introduced to control soil erosion and provide shade in degraded landscapes. It is commonly found in arid and semi-arid regions where it forms dense thickets. The plant is known for its rapid growth and ability to thrive in poor soil conditions. However, its introduction has led to the displacement of native vegetation in some areas. Due to its invasive potential, it is now considered a weed in several regions."
}
