{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ruscifolia",
    "plant_slug": "acacia-ruscifolia",
    "plant_name_scientific": "acacia ruscifolia",
    "intro": "Acacia ruscifolia, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its feathery, bipinnate leaves that are narrow and often covered in fine hairs. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia ruscifolia is valued for its ornamental appeal and its ability to fix nitrogen, benefiting surrounding vegetation.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ruscifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, rocky outcrops, and sandy soils where it thrives in dry, well-drained conditions. This species is well adapted to the harsh climate of its native habitat, showing resilience to drought and high temperatures. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is largely confined to the Kalahari Desert and surrounding areas, where it is a characteristic component of the local vegetation.",
    "distribution_introduced_art_desc": "Acacia ruscifolia was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically in regions with low rainfall. It thrives in open habitats such as grasslands, woodlands, and disturbed sites. The plant is often found in coastal areas and sandy soils due to its tolerance for drought and salt. Its introduction has led to its establishment in several regions outside its native range. However, it is considered a potential invasive species in some areas where it can outcompete native vegetation."
}
