{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustissima var. leucothrix",
    "plant_slug": "acacia-angustissima-var-leucothrix",
    "plant_name_scientific": "acacia angustissima var. leucothrix",
    "intro": "Acacia angustissima var. leucothrix, commonly known as the white-stemmed wattle, is a shrub native to southern Australia. It is characterized by its slender, often greyish stems and bipinnate leaves that are finely divided. The plant produces yellow globular inflorescences, which are typical of the Acacia genus. It thrives in well-drained soils and is adapted to dry, sunny conditions. This variety is notable for its ornamental value and is sometimes cultivated in gardens for its distinctive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustissima var. leucothrix is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils and rocky outcrops, often growing in association with other drought-tolerant shrubs. It is well adapted to the harsh climatic conditions of its native habitat, including high temperatures and low rainfall. The plant plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to the southwestern and central parts of the African continent.",
    "distribution_introduced_art_desc": "Acacia angustissima var. leucothrix was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It has been established in several regions of Australia, particularly in the southern and western parts of the country. This plant is often found in rocky outcrops and along roadsides where it can thrive with minimal water. Its introduction has been associated with both ornamental horticulture and ecological restoration efforts. However, it is important to monitor its spread due to its potential to become invasive in certain environments."
}
