{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia intorta",
    "plant_slug": "acacia-intorta",
    "plant_name_scientific": "acacia intorta",
    "intro": "Acacia intorta, commonly known as the weeping acacia, is a shrub or small tree native to southern Africa. It is characterized by its pendulous, feathery foliage that gives it a distinctive, elegant appearance. The plant produces yellow flowers in clusters, which bloom in spring and attract pollinators such as bees and birds. Its leaves are bipinnate, consisting of multiple small leaflets, and it has a woody, sometimes thorny stem. Acacia intorta is often used in ornamental gardening for its unique form and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia intorta"
    },
    "taxonomy_art_desc": "Acacia intorta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with a unique structure and often include legumes. Its family is Fabaceae, known as the legume family, which is characterized by the presence of pods as fruit and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their distinctive, often thorned appearance. Its species is Acacia intorta, a specific type of acacia that is native to certain regions of Australia and is recognized for its unique morphology and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia intorta is primarily native to Western Australia. It is commonly found in the coastal regions and sandy soils of the southern and southwestern parts of the state. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the dry climate and can withstand periods of drought. Acacia intorta plays an important ecological role in its native habitat by providing food and shelter for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia intorta was mainly introduced to areas with Mediterranean climates, characterized by hot, dry summers and mild, wet winters. It thrives in well-drained soils and is often found in coastal regions and inland valleys. This plant is commonly used in landscaping due to its drought tolerance and attractive foliage. It has also been introduced to parts of California and Oregon in the United States. However, it can become invasive in some regions if not managed properly."
}
