{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia diminuta",
    "plant_slug": "acacia-diminuta",
    "plant_name_scientific": "acacia diminuta",
    "intro": "Acacia diminuta, commonly known as the dwarf acacia, is a small shrub native to the arid regions of southern Africa. It is characterized by its slender, branching stems and small, feathery leaves that are often covered in a fine layer of white powder. The plant produces yellow flowers in compact, globular clusters, which are followed by small, woody pods containing seeds. Acacia diminuta is adapted to survive in harsh, dry environments, with deep roots that allow it to access water from underground sources. It is often used in traditional medicine and is valued for its hardiness and ornamental appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia diminuta"
    },
    "taxonomy_art_desc": "Acacia diminuta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive, often thorny appearance and ability to thrive in arid environments. Its species is Acacia diminuta, a small shrub native to Australia, recognized for its small leaves and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia diminuta is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state. This plant typically grows in sandy soils and is often seen in shrublands and open woodlands. It is well adapted to the harsh climatic conditions of the region. Its small size and hardy nature make it a resilient component of the local flora.",
    "distribution_introduced_art_desc": "Acacia diminuta was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in regions with low rainfall. It thrives in environments where it can receive full sunlight and has minimal competition from other vegetation. This plant is commonly found in disturbed sites such as roadsides, abandoned fields, and along creek banks. Its rapid growth and ability to establish itself quickly make it a successful invader in new habitats. However, its introduction can lead to the displacement of native plant species and alter local ecosystems."
}
