{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia retinens",
    "plant_slug": "acacia-retinens",
    "plant_name_scientific": "acacia retinens",
    "intro": "Acacia retinens, commonly known as the white acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often thornless stems and bipinnate leaves that are finely divided. The plant produces small, pale yellow flowers arranged in dense, globular inflorescences. Acacia retinens is adapted to arid and semi-arid environments, making it a resilient species in dry climates. It is also valued for its hard, durable wood and has traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia retinens is primarily native to tropical and subtropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in savanna and woodland habitats, often found in areas with well-drained soils. This species is also present in parts of the Arabian Peninsula and the Indian subcontinent. It is commonly associated with dry, open environments and can tolerate seasonal droughts. Acacia retinens plays an important ecological role in these regions, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia retinens was mainly introduced to areas with dry, warm climates, particularly in regions with well-drained soils. It thrives in arid and semi-arid environments, making it a common invasive species in parts of Australia and the southwestern United States. The plant's rapid growth and ability to fix nitrogen contribute to its competitive advantage over native vegetation. Its introduction has led to ecological concerns due to its potential to alter soil chemistry and outcompete local flora. Despite its invasive tendencies, Acacia retinens is sometimes used for erosion control and as a source of timber."
}
