{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia eriopoda",
    "plant_slug": "acacia-eriopoda",
    "plant_name_scientific": "acacia eriopoda",
    "intro": "Acacia eriopoda, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, gray-green leaves that are covered in fine, white hairs, giving it a silvery appearance. The plant produces yellow globular flowerheads that bloom in late winter to early spring. Acacia eriopoda is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for rehabilitation of degraded soils. It plays an important ecological role by providing food and habitat for various native wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia eriopoda"
    },
    "taxonomy_art_desc": "Acacia eriopoda belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which is known for plants that often have compound leaves and produce legume-like fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine. Its species is Acacia eriopoda, a specific type of acacia known for its hairy leaves and ecological importance in arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia eriopoda is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in arid and semi-arid environments, often growing in sandy soils. It is well adapted to the harsh climate conditions of the region. Acacia eriopoda plays an important role in the local ecosystem and is a characteristic species of the area.",
    "distribution_introduced_art_desc": "Acacia eriopoda was mainly introduced to control soil erosion and as a source of timber and fuelwood in areas with degraded land. It is commonly found in savannas and semi-arid regions where it forms dense thickets. The plant's rapid growth and ability to thrive in poor soils make it a valuable species for land rehabilitation projects. However, its invasive nature can lead to the displacement of native vegetation if not managed properly. It is often used in reforestation efforts due to its hardiness and ecological adaptability."
}
