{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verticillata var. ulicina",
    "plant_slug": "acacia-verticillata-var-ulicina",
    "plant_name_scientific": "acacia verticillata var. ulicina",
    "intro": "Acacia verticillata var. ulicina, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging stems and small, clustered leaves that are often narrow and twisted. The plant produces yellow flowers in late winter to early spring, which are grouped in cylindrical spikes. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. The species is also valued for its ornamental appeal and ability to stabilize soil in sandy or rocky areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verticillata var. ulicina is primarily native to the coastal regions of southern Australia, including Western Australia, South Australia, and parts of Victoria. It is commonly found in sandy soils along the coastline, often growing in dunes or near the shore. This variety is adapted to the harsh, salty conditions of the coastal environment. It plays an important role in stabilizing dunes and providing habitat for local wildlife. Its distribution is largely restricted to the southern and western coastal areas of the continent.",
    "distribution_introduced_art_desc": "Acacia verticillata var. ulicina was mainly introduced to ornamental horticulture and reforestation projects due to its attractive foliage and adaptability to various soil types. It is commonly cultivated in regions with warm climates and low rainfall, such as parts of Australia and the Mediterranean. The plant's rapid growth and ability to thrive in disturbed soils make it a popular choice for erosion control. However, its invasive potential has raised concerns in some areas where it outcompetes native vegetation. Despite its benefits, careful management is required to prevent ecological imbalances."
}
