{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ulicina var. oxyclada",
    "plant_slug": "acacia-ulicina-var-oxyclada",
    "plant_name_scientific": "acacia ulicina var. oxyclada",
    "intro": "Acacia ulicina var. oxyclada, commonly known as the narrow-leaf acacia, is a shrub native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often drooping branches and narrow, phyllodes that are typically green and hairless. The plant produces small yellow flowers in dense, globular inflorescences, which appear during the warmer months. It thrives in arid and semi-arid environments, making it well adapted to drought conditions. The species is valued for its ornamental appeal and its ability to stabilize soil in degraded landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ulicina var. oxyclada is primarily native to the coastal regions of southern Africa, including South Africa, Namibia, and parts of Mozambique. It thrives in sandy soils along the shoreline and is commonly found in dune ecosystems. This variety is adapted to arid and semi-arid climates, making it a resilient plant in these environments. It is often seen growing in open vegetation types such as savannas and coastal grasslands. Its distribution is closely linked to the availability of well-drained soils and proximity to the sea.",
    "distribution_introduced_art_desc": "Acacia ulicina var. oxyclada was mainly introduced to areas with warm, dry climates and well-drained soils, often in regions where it is used for erosion control and as a source of timber. It is commonly found in coastal and inland areas of Australia, where it has been planted for its hardy nature and ability to thrive in poor soil conditions. This plant is also cultivated in parts of Southeast Asia and the Pacific Islands for its ornamental value and utility in reforestation projects. Its introduction has sometimes led to it becoming invasive in certain ecosystems, outcompeting native vegetation. Despite its benefits, careful management is required to prevent its spread into sensitive ecological zones."
}
