{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lowei",
    "plant_slug": "acacia-lowei",
    "plant_name_scientific": "acacia lowei",
    "intro": "Acacia lowei, commonly known as the yellow acacia, is a shrub or small tree native to the arid regions of South Africa. It is characterized by its slender, often spiny stems and dense clusters of yellow flowers that bloom in winter. The leaves are small, feathery, and often shed during dry periods, a feature common in drought-resistant plants. Its flowers are pollinated by insects, particularly bees, and the plant produces small, woody pods that contain seeds. Acacia lowei is valued for its ornamental appeal and ability to thrive in harsh, low-nutrient soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lowei is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and Angola. It is commonly found in rocky outcrops, sandy soils, and along riverbanks in these areas. This species thrives in dry climates with low rainfall, often growing in association with other drought-resistant plants. Its distribution is limited to specific ecological niches that provide the right balance of sunlight, temperature, and soil conditions. Acacia lowei plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia lowei was mainly introduced to Hawaii. It was brought there as an ornamental plant due to its attractive appearance and hardy nature. However, it has since become invasive, outcompeting native species for resources. The plant spreads rapidly through seeds dispersed by wind and animals. Its introduction has led to ecological concerns and efforts to control its spread."
}
