{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kydrensis",
    "plant_slug": "acacia-kydrensis",
    "plant_name_scientific": "acacia kydrensis",
    "intro": "Acacia kydrensis, commonly known as the red acacia, is a shrub or small tree native to parts of Africa. It is characterized by its slender, often spiny branches and small, fern-like leaves. The plant produces yellow flowers in clusters, which are followed by long, flat pods containing seeds. Acacia kydrensis is adapted to arid and semi-arid environments, making it a resilient species in harsh conditions. It is often used in traditional medicine and for its hard, durable wood.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia kydrensis"
    },
    "taxonomy_art_desc": "Acacia kydrensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and some primitive seed plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are typically characterized by their legume fruits and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is known for its distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid and tropical regions, known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia kydrensis, a specific type of Acacia that is likely adapted to particular environmental conditions and may have unique ecological roles within its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kydrensis is primarily native to New South Wales. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen in open woodlands and scrublands. Acacia kydrensis is well adapted to the harsh climatic conditions of the region. It plays an important role in the local ecosystem and is a characteristic plant of the area.",
    "distribution_introduced_art_desc": "Acacia kydrensis was mainly introduced to South Africa, where it has been cultivated for its ornamental value and ecological benefits. It is commonly found in gardens and along roadsides, thriving in arid and semi-arid regions. The plant is known for its hardy nature and ability to withstand drought conditions, making it suitable for xeriscaping. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasiveness. Its introduction has led to increased interest in its use for soil stabilization and as a source of timber."
}
