{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kulinensis",
    "plant_slug": "acacia-kulinensis",
    "plant_name_scientific": "acacia kulinensis",
    "intro": "Acacia kulinensis, commonly known as the Kulin acacia, is a shrub or small tree native to southeastern Australia. It is characterized by its dense, feathery foliage and produces yellow flowers in spring. The plant has phyllodes, which are flattened leaf stalks that function as leaves, a common adaptation in acacia species. It thrives in well-drained soils and is often found in woodland and heathland environments. Acacia kulinensis is valued for its ornamental appeal and plays a role in local ecosystems by providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia kulinensis"
    },
    "taxonomy_art_desc": "Acacia kulinensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of growth forms. Its order is Fabales, which consists of flowering plants that are typically characterized by flowers with a distinctive structure and often include legumes. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its nitrogen-fixing ability and diverse floral morphology. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acicular leaves and often yellow or white flowers. Its species is Acacia kulinensis, a specific type of acacia native to Australia, known for its ecological significance and unique adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kulinensis is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area around the Fitzgerald River National Park. This species is adapted to the arid and semi-arid environments of the region. It typically grows in open woodlands and heathlands. Acacia kulinensis is an important component of the local flora and is often found in association with other native shrubs and trees.",
    "distribution_introduced_art_desc": "Acacia kulinensis was mainly introduced to South Australia and the Riverina region of New South Wales. It is commonly found in sandy soils along riverbanks and in open woodlands. The plant is often used in revegetation projects due to its ability to stabilize soil and provide habitat for native wildlife. It has also been introduced to some parts of Victoria and Queensland as part of ecological restoration efforts. However, its spread is generally limited to areas with suitable environmental conditions."
}
