{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hystrix subsp. hystrix",
    "plant_slug": "acacia-hystrix-subsp-hystrix",
    "plant_name_scientific": "acacia hystrix subsp. hystrix",
    "intro": "Acacia hystrix subsp. hystrix, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often zigzagging stems and bipinnate leaves composed of numerous small, linear leaflets. The plant produces yellow globular flower heads, which are typical of the legume family, Fabaceae. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia hystrix subsp. hystrix is also known for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hystrix"
    },
    "taxonomy_art_desc": "Acacia hystrix subsp. hystrix belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as vascular tissues. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular systems and often possessing jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have legumes as fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine. Its species is Acacia hystrix, a specific type of acacia known for its spiny appearance and adapted to arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hystrix subsp. hystrix is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the south-western Pilbara. This subspecies thrives in sandy soils and is commonly found in coastal and inland habitats. It is often associated with open woodlands and heathlands. The plant is well adapted to the arid and semi-arid climates of its native range.",
    "distribution_introduced_art_desc": "Acacia hystrix subsp. hystrix was mainly introduced to regions with warm, dry climates and well-drained soils, often as an ornamental or for soil stabilization. It is commonly found in areas with low rainfall and high sunlight exposure, such as parts of Australia and the Mediterranean. This subspecies is known for its distinctive, spiny foliage and yellow flowers, making it a popular choice for landscaping. However, it can become invasive in certain environments if not managed properly. Its introduction has raised concerns about its potential impact on native ecosystems."
}
