{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia concinna var. rugata",
    "plant_slug": "acacia-concinna-var-rugata",
    "plant_name_scientific": "acacia concinna var. rugata",
    "intro": "Acacia concinna var. rugata, commonly known as the rough-barked acacia, is a shrub or small tree native to Australia. It is characterized by its distinctive, rough, fissured bark that peels in strips, giving it a rugged appearance. The plant produces yellow flowers in globular clusters, which are typically pollinated by birds and insects. Its leaves are bipinnate, consisting of multiple pairs of small, oval-shaped leaflets. This species is adapted to arid and semi-arid environments, making it a resilient plant in dry climates.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia concinna var. rugata is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and woodland ecosystems. This variant is well adapted to drought conditions and can withstand high temperatures. It is often seen growing along riverbanks and in open grasslands. Its distribution is closely linked to the availability of water and well-drained soil conditions.",
    "distribution_introduced_art_desc": "Acacia concinna var. rugata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, thriving in sandy and rocky soils. This plant is often used in reclamation projects due to its ability to stabilize soil and tolerate harsh environmental conditions. However, it has also been reported to spread aggressively in some areas, raising concerns about its ecological impact. Its introduction has led to both positive and negative effects on local ecosystems."
}
