{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brevispica var. dregeana",
    "plant_slug": "acacia-brevispica-var-dregeana",
    "plant_name_scientific": "acacia brevispica var. dregeana",
    "intro": "Acacia brevispica var. dregeana, commonly known as the narrow-leaved acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often thornless stems and bipinnate leaves that are dense and finely divided. The plant produces yellow globular flower heads, which are clustered in terminal spikes, typical of the Acacia genus. It thrives in arid and semi-arid environments, often found in rocky soils and along coastal regions. The species is valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brevispica var. dregeana is primarily native to South Africa. It is found in the Eastern Cape Province, particularly in the region around the Sundays River. This variant thrives in sandy soils and is commonly associated with coastal and inland grassland habitats. It is a shrub or small tree that plays an important role in local ecosystems. The plant is well adapted to the semi-arid climate of its native range.",
    "distribution_introduced_art_desc": "Acacia brevispica var. dregeana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, thriving in coastal and semi-arid environments. This variety is often associated with rocky soils and is adapted to Mediterranean climates. Its introduction has led to its establishment in both natural and disturbed habitats. However, it is not considered invasive and is primarily valued for its ornamental and ecological roles."
}
