{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cuneata var. glabra",
    "plant_slug": "acacia-cuneata-var-glabra",
    "plant_name_scientific": "acacia cuneata var. glabra",
    "intro": "Acacia cuneata var. glabra, commonly known as the smooth acacia, is a shrub native to southern Africa. It is characterized by its slender, often multi-branched stems and small, pale green leaves that are typically covered in fine hairs. The plant produces yellow flowers in globular or cylindrical inflorescences, which attract a variety of pollinators. Its seeds are encased in hard, woody pods that split open to release the seeds. This species is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cuneata var. glabra is primarily native to the arid and semi-arid regions of southern Africa, including parts of Namibia, Botswana, and South Africa. This variety thrives in sandy or rocky soils and is commonly found in savanna and shrubland habitats. It is well adapted to the harsh climatic conditions of its native range, including high temperatures and low rainfall. The plant is often seen growing along riverbanks and in open grasslands. Its distribution is closely linked to the ecological zones where it can access sufficient sunlight and water.",
    "distribution_introduced_art_desc": "Acacia cuneata var. glabra was mainly introduced to New Zealand. It was brought there for its ornamental value and potential for soil stabilization. The plant is commonly found in coastal and dry inland areas. It has since become naturalized in several regions of the country. However, it is considered a potential weed in some parts of its introduced range."
}
