{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lamprocarpa",
    "plant_slug": "acacia-lamprocarpa",
    "plant_name_scientific": "acacia lamprocarpa",
    "intro": "Acacia lamprocarpa, commonly known as the yellow wattle, is a shrub or small tree native to southern Australia. It is characterized by its yellow, globular flower heads that appear in late summer to early autumn. The plant has phyllodes, which are flattened leaf stalks that perform the function of true leaves. It thrives in well-drained soils and is often found in dry, open habitats. Acacia lamprocarpa is also valued for its ornamental appeal and ability to provide habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lamprocarpa"
    },
    "taxonomy_art_desc": "Acacia lamprocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia lamprocarpa, a specific type of acacia found in arid regions of Australia, known for its slender, spiny stems and yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lamprocarpa is primarily native to the Northern Territory, Queensland, and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant typically grows in sandy or gravelly soils and is often seen in shrublands and open woodlands. It plays an important ecological role in its native habitat by providing shelter and food for various wildlife species. Its distribution reflects its adaptation to the dry and harsh environments of northern Australia.",
    "distribution_introduced_art_desc": "Acacia lamprocarpa was mainly introduced to South Australia and Western Australia for its ornamental value and ability to thrive in arid conditions. It is commonly found in coastal and semi-arid regions, where it forms dense thickets. The plant is also used in rehabilitation projects due to its hardy nature and capacity to stabilize soils. However, it has become invasive in some areas, outcompeting native vegetation. Its distribution is now largely restricted to the regions where it was initially introduced."
}
