{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spirocarpa var. major",
    "plant_slug": "acacia-spirocarpa-var-major",
    "plant_name_scientific": "acacia spirocarpa var. major",
    "intro": "Acacia spirocarpa var. major, commonly known as the large-flowered acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its bipinnate leaves, which are often reduced to spines in mature plants, and its yellow, globular flower heads that bloom in summer. The plant produces flat, woody pods that contain seeds with tufts of silky hair, aiding in wind dispersal. It is well adapted to dry conditions, with deep roots and a capacity to fix nitrogen through symbiotic bacteria. This acacia is often used in revegetation projects due to its resilience and ability to thrive in poor soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spirocarpa var. major is primarily native to the arid and semi-arid regions of central and western Australia. It is commonly found in areas such as the Northern Territory, South Australia, and Western Australia. This plant thrives in sandy or loamy soils and is often associated with shrublands and open woodlands. It is well adapted to drought and high temperatures, making it a resilient species in its native habitat. Its distribution is largely restricted to specific ecological zones within the Australian continent.",
    "distribution_introduced_art_desc": "Acacia spirocarpa var. major was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the coastal and semi-arid areas of the country. This plant is often associated with disturbed habitats such as roadsides, abandoned fields, and urban environments. Its introduction has led to its spread along the eastern and southern coasts. Due to its adaptability, it has become a common weed in agricultural and natural landscapes."
}
