{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subporosa",
    "plant_slug": "acacia-subporosa",
    "plant_name_scientific": "acacia subporosa",
    "intro": "Acacia subporosa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its feathery, bipinnate leaves. The plant produces yellow flowers in globular heads, which are typically visited by nectar-feeding birds and insects. Acacia subporosa is adapted to arid and semi-arid environments, often growing in sandy or rocky soils. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia subporosa"
    },
    "taxonomy_art_desc": "Acacia subporosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have showy flowers and a wide variety of growth forms. Its order is Fabales, which includes plants with compound leaves and flowers that have a distinctive structure with a single pistil and stamens. Its family is Fabaceae, commonly known as the legume family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive flattened or cylindrical pods and often spiny foliage. Its species is Acacia subporosa, a specific type of acacia found in certain regions, distinguished by its unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subporosa is primarily native to New South Wales and Victoria. It is commonly found in dry, sandy soils across these regions. This plant thrives in arid and semi-arid environments. It is often seen in open woodlands and along coastal areas. Its distribution is closely linked to the specific climatic and soil conditions of these areas.",
    "distribution_introduced_art_desc": "Acacia subporosa was mainly introduced to control soil erosion and as a source of fuelwood in arid and semi-arid regions. It is commonly found in degraded lands and has been widely planted in Australia and parts of Southeast Asia. The plant thrives in poor soils and can tolerate drought conditions, making it suitable for reclamation projects. However, its rapid growth and spreading habit have led to concerns about its invasiveness in some areas. Despite its benefits, careful management is required to prevent it from becoming a weed."
}
