{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia saltuum",
    "plant_slug": "acacia-saltuum",
    "plant_name_scientific": "acacia saltuum",
    "intro": "Acacia saltuum, commonly known as the saltbush acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its small, green, bean-like pods and feathery, bipinnate leaves. The plant is well adapted to saline and drought-prone soils, making it a hardy species in harsh environments. Its flowers are typically yellow or golden in color, adding a striking visual element to its habitat. Acacia saltuum plays a role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia saltuum is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and shrubland habitats, often growing in association with other drought-resistant plants. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important role in stabilizing soil and providing habitat for local wildlife. Due to its resilience, it is sometimes used in reforestation and land rehabilitation projects in its native range.",
    "distribution_introduced_art_desc": "Acacia saltuum was mainly introduced to the Mediterranean region for its ornamental value and ability to thrive in arid conditions. It is commonly found in urban landscapes, parks, and along roadsides due to its hardy nature and low maintenance requirements. The plant has been reported in several countries including Spain, Italy, and Greece, where it has established itself in both natural and human-altered environments. Despite its benefits, it has raised concerns due to its potential to become invasive in certain ecosystems. Its distribution highlights the challenges of managing non-native species in ecological and agricultural contexts."
}
