{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia longifolia var. phlebophylla",
    "plant_slug": "acacia-longifolia-var-phlebophylla",
    "plant_name_scientific": "acacia longifolia var. phlebophylla",
    "intro": "Acacia longifolia var. phlebophylla, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, often zigzagging stems and bipinnate leaves composed of numerous small, needle-like leaflets. The plant produces yellow globular flower heads that appear in late winter to early spring. It is adapted to dry, sandy soils and is often found in coastal and inland regions. This variety is valued for its ornamental appeal and is used in landscaping and erosion control.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia longifolia var. phlebophylla is primarily native to southern Australia, including parts of New South Wales, Victoria, and South Australia. This variety is commonly found in coastal and sandy soils along the southern coastline. It thrives in coastal dunes and heathlands, often forming dense shrubs. The plant is well adapted to salty and wind-swept environments. It plays an important ecological role in stabilizing dunes and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia longifolia var. phlebophylla was mainly introduced to South Australia for its ornamental value and its ability to thrive in arid conditions. It is commonly found in coastal areas and sandy soils, where it forms dense thickets. This plant has been used in landscaping and for erosion control due to its hardy nature. However, it is considered a weed in some regions because of its aggressive growth and ability to outcompete native vegetation. Its introduction has led to concerns about its impact on local ecosystems and biodiversity."
}
