{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ibirocayensis",
    "plant_slug": "acacia-ibirocayensis",
    "plant_name_scientific": "acacia ibirocayensis",
    "intro": "Acacia ibirocayensis, commonly known as the Ibirocayensis acacia, is a species of flowering plant in the legume family Fabaceae. It is native to specific regions in South America, particularly Brazil, where it thrives in tropical and subtropical climates. The plant is characterized by its slender, branching stems and bipinnate leaves that are often covered in fine hairs. Its flowers are typically yellow or golden in color, arranged in compact spherical or cylindrical inflorescences. Acacia ibirocayensis is also noted for its ability to fix nitrogen, contributing to soil fertility in its natural habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ibirocayensis is primarily native to the Atlantic Forest region of Brazil. This species is found in the states of Espírito Santo, Rio de Janeiro, and São Paulo. It thrives in humid, tropical climates with well-drained soils. The plant is commonly found in secondary growth areas and along riverbanks. Due to habitat loss, it is considered a threatened species within its native range.",
    "distribution_introduced_art_desc": "Acacia ibirocayensis was mainly introduced to areas with tropical and subtropical climates, particularly in regions with well-drained soils and moderate to high rainfall. It thrives in open habitats such as savannas, grasslands, and disturbed sites where it can establish quickly. This plant is often used for soil stabilization and as a source of timber and fodder due to its hardy nature. Its introduction has been noted in parts of South America and Africa, where it has adapted well to local conditions. However, it requires careful management to prevent potential invasiveness in non-native environments."
}
