{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia linifolia",
    "plant_slug": "acacia-linifolia",
    "plant_name_scientific": "acacia linifolia",
    "intro": "Acacia linifolia, commonly known as the coastal wattles, is a shrub native to southern Australia. It is characterized by its slender, wiry stems and small, yellow flowers that bloom in late winter to early spring. The leaves are bipinnate, consisting of numerous tiny leaflets, and the plant is well adapted to coastal and sandy soils. It is often used in coastal landscaping due to its hardiness and ability to withstand salt spray. The plant also plays a role in stabilizing dunes and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia linifolia"
    },
    "taxonomy_art_desc": "Acacia linifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, which comprises flowering plants with a wide range of morphological diversity and includes many economically important species. Its order is Fabales, a group of flowering plants that includes legumes and other plants with characteristic flowers and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive acacia-like foliage and often used in traditional medicine and as a source of timber. Its species is Acacia linifolia, a specific type of acacia native to Australia, known for its delicate foliage and yellow flowers, commonly used in horticulture and ecological restoration.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [
        "India",
        "Jawa"
    ],
    "distribution_native_art_desc": "Acacia linifolia is primarily native to New South Wales. It is commonly found in coastal and sandy areas along the eastern coast of Australia. This species thrives in dry, well-drained soils and is often seen in open woodlands and heathlands. It is also known as the coastal wattle due to its preference for coastal environments. Acacia linifolia plays an important role in stabilizing dunes and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia linifolia was mainly introduced to India and Jawa. It is commonly found in coastal areas and sandy soils. This plant is known for its hardy nature and ability to thrive in arid conditions. It has been used for ornamental purposes and in soil stabilization efforts. Its introduction has had both ecological and economic impacts in the regions where it has been established."
}
