{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia maranoensis",
    "plant_slug": "acacia-maranoensis",
    "plant_name_scientific": "acacia maranoensis",
    "intro": "Acacia maranoensis, commonly known as the Maranoa wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves. The plant produces yellow globular flowers in late spring to early summer, which are arranged in compact clusters. Acacia maranoensis is adapted to dry, sandy soils and is found in the semi-arid regions of Queensland. It plays an important ecological role in providing nectar for native pollinators and habitat for small fauna.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia maranoensis"
    },
    "taxonomy_art_desc": "Acacia maranoensis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which comprises plants that are often legumes, characterized by their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or bean family, known for their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their thorny stems and small, often compound leaves. Its species is Acacia maranoensis, a specific type of acacia native to certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia maranoensis is primarily native to Queensland. It is found in the tropical and subtropical regions of the state, particularly in the northern and central areas. This species typically grows in open woodlands and grasslands with well-drained soils. It is well adapted to the climate and environmental conditions of Queensland. Acacia maranoensis plays an important role in the local ecosystem and is often used in restoration projects.",
    "distribution_introduced_art_desc": "Acacia maranoensis was mainly introduced to South Africa, where it has been cultivated for its ornamental value and potential for soil stabilization. It is commonly found in regions with a Mediterranean climate, such as the Western Cape. The plant thrives in well-drained soils and full sun, making it suitable for both urban and rural landscapes. Due to its rapid growth and adaptability, it has been used in reforestation and erosion control projects. However, its introduction has also raised concerns about its potential to become invasive in certain environments."
}
