{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia impressa var. tortuosa",
    "plant_slug": "acacia-impressa-var-tortuosa",
    "plant_name_scientific": "acacia impressa var. tortuosa",
    "intro": "Acacia impressa var. tortuosa, commonly known as the twisted wattle, is a shrub native to eastern Australia. It is characterized by its zigzagging, twisted stems and small, feathery leaves. The plant produces yellow flowers in cylindrical spikes, which bloom in spring. It thrives in well-drained soils and is often found in coastal and sandy habitats. Due to its unique appearance, it is valued in horticulture for ornamental purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia impressa var. tortuosa is primarily native to the arid and semi-arid regions of southern Africa, particularly Namibia and Angola. This variant thrives in sandy soils and is commonly found in savanna and shrubland ecosystems. It is well adapted to the harsh environmental conditions of its native habitat, including high temperatures and low rainfall. The plant is often used as a source of timber and has cultural significance in local communities. Its distribution is largely restricted to the specific ecological zones where it can survive and reproduce successfully.",
    "distribution_introduced_art_desc": "Acacia impressa var. tortuosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal and inland areas, particularly in the Western and Eastern Cape provinces. This plant thrives in sandy or gravelly soils and is often seen growing along roadsides and in disturbed habitats. Its introduction has led to its spread beyond its original range, sometimes competing with native vegetation. Due to its adaptability, it is considered a potential invasive species in some areas."
}
