{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia neglecta",
    "plant_slug": "acacia-neglecta",
    "plant_name_scientific": "acacia neglecta",
    "intro": "Acacia neglecta, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It features slender, often twisted stems and small, feathery leaves that are typically green with a slight blue or grey tinge. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Acacia neglecta is drought-tolerant and thrives in well-drained soils, making it suitable for coastal and sandy environments. It is also valued for its ornamental appeal and ability to attract native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia neglecta is primarily native to southeastern Australia, including parts of New South Wales, Victoria, and South Australia. It is commonly found in dry, sandy soils along the coast and in open woodlands. This species thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. It is often seen growing in coastal heathlands and along the edges of forests. Acacia neglecta is well adapted to arid and semi-arid environments, making it a resilient plant in its native range.",
    "distribution_introduced_art_desc": "Acacia neglecta was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since become naturalized in several regions, particularly in coastal and disturbed areas. The plant spreads through seed dispersal, often aided by wind and animals. Its introduction has raised concerns due to its potential to outcompete native species in certain ecosystems. Despite its invasive tendencies, it is still cultivated for its aesthetic value in some gardens."
}
