{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tomentella",
    "plant_slug": "acacia-tomentella",
    "plant_name_scientific": "acacia tomentella",
    "intro": "Acacia tomentella, commonly known as the silky acacia, is a small shrub native to southern Africa. It is characterized by its dense, velvety foliage that gives it a soft, fuzzy appearance. The plant produces small, yellow flowers that bloom in clusters, adding a striking contrast to its hairy leaves. Acacia tomentella is adapted to arid and semi-arid environments, making it drought-tolerant and resilient. It is often used in landscaping for its ornamental value and ability to thrive in poor soil conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tomentella is primarily native to the tropical and subtropical regions of Africa, including countries such as Kenya, Tanzania, and Uganda. It is commonly found in dry savannas, woodland areas, and along riverbanks. This plant thrives in regions with well-drained soils and is often part of the vegetation in arid and semi-arid environments. It is also present in parts of the Arabian Peninsula and southern Arabia. Acacia tomentella is known for its ability to adapt to harsh climatic conditions, making it a resilient species in its native range.",
    "distribution_introduced_art_desc": "Acacia tomentella was mainly introduced to control soil erosion and as a windbreak in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing capabilities, which improve soil fertility. Its introduction has been widespread in countries like Australia, South Africa, and parts of the Middle East. However, in some areas, it has become invasive, raising concerns about its ecological impact."
}
