{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dentifera var. parvifolia",
    "plant_slug": "acacia-dentifera-var-parvifolia",
    "plant_name_scientific": "acacia dentifera var. parvifolia",
    "intro": "Acacia dentifera var. parvifolia, commonly known as the narrow-leaved wattle, is a shrub or small tree native to southern Australia. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small, pointed leaflets. The plant produces yellow globular flowers in late summer, which are clustered in dense, cylindrical spikes. It thrives in well-drained soils and is adapted to dry, sunny environments. This variety is distinguished from the typical A. dentifera by its smaller, more delicate leaves.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dentifera var. parvifolia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. This variant is commonly found in savannas and rocky outcrops where it thrives in well-drained soils. It is particularly adapted to the harsh climate conditions of the region, including high temperatures and low rainfall. The plant plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is limited to specific habitats that match its ecological requirements.",
    "distribution_introduced_art_desc": "Acacia dentifera var. parvifolia was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly used in reforestation projects due to its rapid growth and ability to thrive in poor soil conditions. This plant is also valued for its nitrogen-fixing properties, which enhance soil fertility. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation. Its distribution is now expanding beyond its original range due to human intervention and climate change."
}
