{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia storyi",
    "plant_slug": "acacia-storyi",
    "plant_name_scientific": "acacia storyi",
    "intro": "Acacia storyi, commonly known as the coastal acacia, is a shrub or small tree native to the coastal regions of southern Africa. It is characterized by its slender, often multi-branched stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in dense, globular clusters, which are typically visited by various pollinators. Acacia storyi is adapted to saline and arid environments, making it a hardy species found in coastal dunes and sandy soils. It plays an important ecological role in stabilizing sand dunes and providing habitat for coastal wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia storyi"
    },
    "taxonomy_art_desc": "Acacia storyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species, such as roses and magnolias, and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny foliage and the production of pods containing seeds. Its species is Acacia storyi, a specific type of acacia that is likely adapted to particular environmental conditions and may have unique characteristics that distinguish it from other species within the genus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia storyi is primarily native to Queensland. This species is found in the northeastern regions of the state, particularly in the wetter tropical and subtropical areas. It typically grows in open woodlands and rainforests, often along riverbanks and in disturbed soils. Acacia storyi is well adapted to the warm and humid climate of Queensland. Its distribution is closely linked to the availability of water and suitable soil conditions in this region.",
    "distribution_introduced_art_desc": "Acacia storyi was mainly introduced to areas with well-drained soils and a Mediterranean climate, particularly in regions of southern California and parts of Australia. It thrives in full sun and is often found in coastal scrub and chaparral ecosystems. This plant is known for its ability to tolerate drought and poor soil conditions, making it a common invasive species in disturbed habitats. Its rapid growth and seed dispersal contribute to its spread across new environments. However, it can outcompete native vegetation, leading to ecological concerns in some regions."
}
