{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia platensis",
    "plant_slug": "acacia-platensis",
    "plant_name_scientific": "acacia platensis",
    "intro": "Acacia platensis, commonly known as the quebracho blanco, is a deciduous tree native to South America, particularly Argentina and Paraguay. It is characterized by its distinctive bipinnate leaves and yellow flowers that bloom in spring. The tree produces hard, dense wood that is highly valued for its durability and resistance to decay. It thrives in arid and semi-arid environments, often found in dry forests and scrublands. Acacia platensis plays an important ecological role by providing habitat and food for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia platensis is primarily native to South America, specifically Argentina, Bolivia, and Paraguay. It thrives in the dry grasslands and shrublands of these regions. This plant is well adapted to arid and semi-arid environments. It is commonly found in the Pampas and Chaco regions. Acacia platensis plays an important ecological role in these ecosystems.",
    "distribution_introduced_art_desc": "Acacia platensis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in diverse environmental conditions. It has since spread beyond cultivated areas and is now found in various habitats, including coastal regions and disturbed soils. The plant's rapid growth and seed dispersal mechanisms have contributed to its establishment in native ecosystems. However, its invasive potential has raised concerns among conservationists. Despite its ecological impact, Acacia platensis remains a popular choice for landscaping in the region."
}
