{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glomerosa",
    "plant_slug": "acacia-glomerosa",
    "plant_name_scientific": "acacia glomerosa",
    "intro": "Acacia glomerosa, commonly known as the globular acacia, is a shrub or small tree native to the arid and semi-arid regions of southern Africa. It is characterized by its dense, globular crown and small, rounded phyllodes that are typically gray-green in color. The plant produces yellow flowers in globular clusters, which are a distinctive feature of the species. Acacia glomerosa is well adapted to drought conditions, with a deep root system that allows it to survive in poor soils. It is often used in landscaping due to its ornamental appearance and resilience.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glomerosa is primarily native to northern Australia, including regions of Western Australia, the Northern Territory, and parts of Queensland. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This species thrives in coastal and inland dune systems, often forming dense thickets. It is well adapted to the harsh climatic conditions of its native range, including high temperatures and low rainfall. Acacia glomerosa plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia glomerosa was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was first brought to the country in the 19th century by European settlers who sought to introduce exotic flora. Despite its aesthetic value, it has since become invasive in some regions, outcompeting native vegetation. The plant thrives in a variety of soil types and can tolerate both drought and poor soil conditions. Its rapid growth and ability to spread through seed dispersal have made it a concern for ecological management in certain areas."
}
