{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia jensenii",
    "plant_slug": "acacia-jensenii",
    "plant_name_scientific": "acacia jensenii",
    "intro": "Acacia jensenii, commonly known as Jensen's wattle, is a flowering plant native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, woody stems and bipinnate leaves. The plant produces yellow globular flowers that bloom in late winter to early spring. It is often found in sandy soils and is adapted to dry, arid environments. Acacia jensenii is valued for its ornamental appeal and its ability to thrive in challenging conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia jensenii"
    },
    "taxonomy_art_desc": "Acacia jensenii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like flower clusters and thorned stems. Its species is Acacia jensenii, a specific type of acacia found in certain regions, notable for its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia jensenii is primarily native to the Northern Territory and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often seen in open woodlands and shrublands. Acacia jensenii is well adapted to the harsh climatic conditions of its native range. Its distribution is largely restricted to the specific ecological zones of the Northern Territory and Western Australia.",
    "distribution_introduced_art_desc": "Acacia jensenii was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is commonly found in coastal areas and on sandy soils, often outcompeting native vegetation. The plant spreads rapidly through seed dispersal, both by wind and by animals. Due to its aggressive growth, it poses a threat to local biodiversity and ecosystem stability. Management efforts are ongoing to control its spread and mitigate its impact on native flora."
}
