{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rostellata",
    "plant_slug": "acacia-rostellata",
    "plant_name_scientific": "acacia rostellata",
    "intro": "Acacia rostellata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in spring. The plant is adapted to arid and semi-arid environments, making it drought-tolerant. Its seeds are enclosed in woody pods and are dispersed by animals and wind. Acacia rostellata plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rostellata"
    },
    "taxonomy_art_desc": "Acacia rostellata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, including horsetails and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with fused petals and include legumes and vetches. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used for timber or as ornamental plants. Its species is Acacia rostellata, a specific type of acacia found in certain regions, characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rostellata is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state, particularly in the southern and central parts. This species thrives in sandy soils and is often seen along coastal dunes and inland plains. It plays an important role in the local ecosystem by providing habitat and food for various wildlife. Acacia rostellata is well adapted to the harsh climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia rostellata was mainly introduced to areas with sandy or gravelly soils, particularly in arid and semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it well-suited for dryland ecosystems. This plant is often found in coastal dunes and inland plains where it helps stabilize soil and prevent erosion. Its introduction has been documented in parts of Australia, the Middle East, and some regions of Africa. Due to its hardy nature, it has become an invasive species in certain areas outside its native range."
}
