{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia coriacea var. angustior",
    "plant_slug": "acacia-coriacea-var-angustior",
    "plant_name_scientific": "acacia coriacea var. angustior",
    "intro": "Acacia coriacea var. angustior, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, angular stems and narrow, dark green leaves with a leathery texture. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense inflorescences. It thrives in well-drained soils and is adapted to arid and semi-arid environments. The species is often used in revegetation projects due to its resilience and ability to fix nitrogen.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia coriacea var. angustior is primarily native to northern Australia, including parts of Queensland and the Northern Territory. This variant is commonly found in arid and semi-arid regions, particularly in sandy soils. It thrives in open woodlands and shrublands, often growing in association with other drought-tolerant species. The plant is well adapted to the harsh climate of its native range, with a deep root system and thick foliage to conserve water. It plays an important ecological role in stabilizing soil and providing habitat for native fauna.",
    "distribution_introduced_art_desc": "Acacia coriacea var. angustior was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of timber due to its hardy nature. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. However, it also plays a role in supporting local wildlife and providing habitat in degraded landscapes."
}
