{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gageana",
    "plant_slug": "acacia-gageana",
    "plant_name_scientific": "acacia gageana",
    "intro": "Acacia gageana, commonly known as the coastal acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny branches and feathery, bipinnate leaves. The plant produces yellow flowers in late summer, which are clustered in spherical inflorescences. It thrives in coastal and sandy environments, often forming dense thickets. Acacia gageana is well adapted to saline and arid conditions, making it a resilient species in its native habitat.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gageana is primarily native to South Africa, specifically the Eastern Cape Province. It is commonly found in coastal and lowland areas, including the Overberg and Garden Route regions. This species thrives in sandy or gravelly soils and is often associated with fynbos vegetation. It is also present in parts of KwaZulu-Natal and the Western Cape. Acacia gageana is well adapted to the Mediterranean climate of these regions, characterized by wet winters and dry summers.",
    "distribution_introduced_art_desc": "Acacia gageana was mainly introduced to stabilize soil and prevent erosion in degraded landscapes. It is commonly used in reforestation and land rehabilitation projects due to its rapid growth and hardy nature. The plant thrives in arid and semi-arid environments, making it suitable for areas with low rainfall. Its introduction has helped in restoring degraded lands across several regions in Africa and Australia. However, it requires careful management to prevent it from becoming invasive in non-native ecosystems."
}
