{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia undosa",
    "plant_slug": "acacia-undosa",
    "plant_name_scientific": "acacia undosa",
    "intro": "Acacia undosa, commonly known as the undulating acacia, is a shrub native to southern Africa. It is characterized by its slender, branching stems and phyllodes that are narrow and undulating in appearance. The plant produces yellow flowers in winter, which are arranged in cylindrical spikes. Its leaves are modified into phyllodes, a common adaptation in the Acacia genus to reduce water loss. Acacia undosa is often found in sandy or rocky soils and is adapted to arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia undosa"
    },
    "taxonomy_art_desc": "Acacia undosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female reproductive structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume family, which is recognized for its distinctive pod-like fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their needle-like leaves and often fragrant flowers. Its species is Acacia undosa, a specific type of acacia characterized by its unique morphology and ecological adaptations to its native environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia undosa is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the areas around the Fitzgerald River National Park and the Jarrahdale region. This species thrives in sandy soils and is often associated with coastal and inland habitats. It is well adapted to the dry and semi-arid conditions of its native range. Acacia undosa plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia undosa was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread beyond cultivated areas and is now considered a potential weed in some regions. The plant thrives in coastal and disturbed habitats, which has contributed to its rapid establishment. Its introduction has raised concerns about its impact on native ecosystems and biodiversity. Monitoring and management strategies are being developed to control its spread and mitigate ecological risks."
}
