{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia angustissima var. suffrutescens",
    "plant_slug": "acacia-angustissima-var-suffrutescens",
    "plant_name_scientific": "acacia angustissima var. suffrutescens",
    "intro": "Acacia angustissima var. suffrutescens, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It typically grows in dry, sandy soils and is adapted to arid and semi-arid environments. The plant features slender, angular stems and bipinnate leaves that are narrow and often covered in fine hairs. It produces small, yellow flowers arranged in cylindrical spikes, which bloom in spring. This variety is valued for its ornamental appeal and is sometimes used in landscaping due to its hardy nature.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia angustissima var. suffrutescens is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in rocky outcrops, sandy soils, and along riverbanks in these areas. It thrives in environments with low rainfall and high temperatures, adapting well to the harsh conditions of the African savanna. The plant is often used for its hardy nature and has cultural significance in local communities. Its distribution is closely linked to the availability of well-drained soil and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Acacia angustissima var. suffrutescens was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the southern and western parts of the country. This plant is often used for erosion control due to its ability to establish quickly and form dense vegetation. It is also valued for its hardy nature and ability to tolerate drought conditions. Its introduction has been primarily for ecological restoration and land stabilization purposes."
}
