{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia guadalajarana",
    "plant_slug": "acacia-guadalajarana",
    "plant_name_scientific": "acacia guadalajarana",
    "intro": "Acacia guadalajarana, commonly known as the Guadalajara acacia, is a shrub or small tree native to Mexico. It is characterized by its compound leaves and yellow flowers that bloom in clusters. The plant is adapted to arid and semi-arid environments, making it resilient to drought conditions. It belongs to the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. Its bark and leaves have been used traditionally for various purposes, including medicinal applications.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia guadalajarana is primarily native to the arid and semi-arid regions of northern Mexico, particularly in the states of Chihuahua, Coahuila, and Nuevo León. It is commonly found in rocky soils and scrublands, often growing in association with other drought-tolerant plant species. This plant is well adapted to the harsh climate of the Chihuahuan Desert, where it thrives in full sun and low precipitation. It plays an important ecological role by providing habitat and food for local wildlife. Due to its limited range, it is considered a rare and endemic species within its native habitat.",
    "distribution_introduced_art_desc": "Acacia guadalajarana was mainly introduced to areas with arid or semi-arid climates, particularly in regions of Mexico and parts of the southwestern United States. It thrives in well-drained soils and is often found in desert scrub and rocky habitats. The plant is commonly used for erosion control due to its deep root system and ability to withstand drought conditions. It has also been introduced to other parts of the world as an ornamental species because of its attractive foliage and resilience. However, its introduction has raised concerns about its potential to become invasive in non-native environments."
}
