{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kauaiensis",
    "plant_slug": "acacia-kauaiensis",
    "plant_name_scientific": "acacia kauaiensis",
    "intro": "Acacia kauaiensis, commonly known as Kauai acacia, is a flowering plant native to the Hawaiian island of Kauai. It is a small tree or shrub that typically grows in wet, forested areas. The plant produces bright yellow flowers that bloom in clusters, attracting various pollinators. Its leaves are compound, consisting of multiple small leaflets arranged along a central stem. Acacia kauaiensis plays an important ecological role in its native habitat, contributing to the biodiversity of the region.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kauaiensis is primarily native to the island of Kauai in Hawaii. It is found in the wet and mesic forests of the island's interior. This species is typically associated with areas of high rainfall and well-drained soils. It plays an important ecological role in the native Hawaiian ecosystem. Unfortunately, it is now considered extinct in the wild, with only a few known living specimens remaining.",
    "distribution_introduced_art_desc": "Acacia kauaiensis was mainly introduced to Hawaii for ornamental purposes due to its unique appearance and hardy nature. It has since become an invasive species, outcompeting native plants and altering local ecosystems. The plant thrives in disturbed soils and can spread rapidly through seed dispersal by wind and animals. Its introduction has led to increased management efforts to control its spread and protect native biodiversity. Conservationists are working to limit its impact while exploring sustainable control methods."
}
