{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chordophylla",
    "plant_slug": "acacia-chordophylla",
    "plant_name_scientific": "acacia chordophylla",
    "intro": "Acacia chordophylla, commonly known as the coastal wattle, is a shrub native to southern Australia. It is characterized by its compound leaves, which are often covered in fine hairs, and its yellow flowers that bloom in late spring. The plant thrives in sandy soils and is often found along coastal areas and inland dunes. It plays an important role in stabilizing soils and providing habitat for native wildlife. Acacia chordophylla is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chordophylla is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the central and western parts of the country, including areas such as South Australia, Western Australia, and the Northern Territory. This plant thrives in sandy or gravelly soils and is often seen in shrublands and open woodlands. It is well adapted to the harsh climate with its deep root system and water-storing capabilities. Acacia chordophylla plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia chordophylla was mainly introduced to areas with well-drained soils and full sun exposure, typically in arid or semi-arid regions. It is commonly found in disturbed sites such as roadsides, quarries, and degraded landscapes. This plant has a spreading habit and can form dense thickets, which can impact native vegetation. It is often used for soil stabilization and as a windbreak due to its hardy nature. However, its invasive potential requires careful management in certain ecosystems."
}
