{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia multifoliolata",
    "plant_slug": "acacia-multifoliolata",
    "plant_name_scientific": "acacia multifoliolata",
    "intro": "Acacia multifoliolata, commonly known as the many-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and compound leaves with numerous small leaflets. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in coastal and sandy regions. The species is valued for its ornamental appeal and ability to tolerate saline conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Dominican Republic"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia multifoliolata is primarily native to the Dominican Republic. It is commonly found in the tropical and subtropical regions of the country. This plant thrives in open woodland and savanna habitats. It is well adapted to the warm and humid climate of the Dominican Republic. Its distribution is largely restricted to this geographic area.",
    "distribution_introduced_art_desc": "Acacia multifoliolata was mainly introduced to Australia as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread beyond cultivated areas and is now considered a weed in some regions, particularly in Queensland and New South Wales. The plant thrives in disturbed soils and can colonize open habitats such as roadsides, forests, and riverbanks. Its rapid growth and ability to produce large quantities of seed contribute to its invasive potential. Management efforts often focus on early detection and control to prevent further spread."
}
