{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia schweinfurthii var. sericea",
    "plant_slug": "acacia-schweinfurthii-var-sericea",
    "plant_name_scientific": "acacia schweinfurthii var. sericea",
    "intro": "Acacia schweinfurthii var. sericea, commonly known as the silver acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, often twisted branches and bipinnate leaves that are covered in fine, silvery hairs, giving it a distinctive appearance. The plant produces yellow globular flowers that bloom in winter, attracting pollinators such as bees and birds. Its seed pods are elongated and contain numerous small, hard seeds. Acacia schweinfurthii var. sericea is well adapted to drought and is often used in traditional medicine and as a source of firewood.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia schweinfurthii var. sericea is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is also found in parts of Sudan and South Sudan. This plant thrives in arid and semi-arid environments, often growing in savannas and rocky soils. It is well adapted to dry climates and can tolerate high temperatures and low rainfall. The species plays an important ecological role in these regions, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia schweinfurthii var. sericea was mainly introduced to regions with semi-arid to arid climates, particularly in sub-Saharan Africa. It is commonly found in countries such as Sudan, Ethiopia, and Kenya. This plant thrives in sandy or loamy soils and is often used for soil stabilization and as a source of firewood. Its introduction has helped in combating desertification in these areas. However, it can become invasive in certain environments if not managed properly."
}
