{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obesa",
    "plant_slug": "acacia-obesa",
    "plant_name_scientific": "acacia obesa",
    "intro": "Acacia obesa, commonly known as the bottle tree, is a distinctive shrub or small tree native to the arid regions of Australia. It is characterized by its thick, bottle-shaped trunk that stores water, allowing it to survive in dry environments. The plant has compound leaves that are often modified into spines, reducing water loss and deterring herbivores. Its yellow flowers are clustered in spherical heads and bloom during the warmer months. Acacia obesa plays an important ecological role by providing shelter and food for various desert animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia obesa"
    },
    "taxonomy_art_desc": "Acacia obesa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and showy petals, often associated with nitrogen-fixing capabilities. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and the ability to form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive thorn-like structures and nitrogen-fixing capabilities. Its species is Acacia obesa, a specific type of acacia known for its swollen, bottle-shaped trunk and is native to arid regions of southern Africa.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obesa is primarily native to Western Australia. It is commonly found in the coastal regions of the state, particularly in the south-western area. This plant thrives in sandy soils and is often associated with coastal dunes and heathlands. It is well adapted to the arid and semi-arid conditions of its native habitat. Acacia obesa is an important component of the local flora and plays a role in stabilizing coastal ecosystems.",
    "distribution_introduced_art_desc": "Acacia obesa was mainly introduced to South Africa, where it has become a common sight in the region's unique landscapes. This plant is known for its distinctive bottle-shaped trunk and is often found in rocky areas and arid environments. It is commonly cultivated for ornamental purposes due to its striking appearance. However, it has also been reported to spread into natural habitats, raising concerns about its invasive potential. Despite its beauty, its introduction has led to ecological challenges in some areas."
}
