{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia genistoides",
    "plant_slug": "acacia-genistoides",
    "plant_name_scientific": "acacia genistoides",
    "intro": "Acacia genistoides, commonly known as the slender wattle, is a shrub native to Australia. It belongs to the Fabaceae family and is characterized by its small, yellow flowers arranged in cylindrical spikes. The plant has feathery, bipinnate leaves that are often mistaken for those of the genus Acacia. It thrives in sandy or loamy soils and is drought-tolerant, making it well adapted to arid environments. The plant is also valued for its ornamental appeal and is sometimes cultivated in gardens.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia genistoides is primarily native to the eastern and southern regions of Africa, including countries such as Kenya, Tanzania, Uganda, and South Africa. It thrives in arid and semi-arid environments, often found in savannas and rocky areas. This plant is well adapted to drought conditions and can tolerate poor soil quality. It plays an important role in local ecosystems by providing food and shelter for various wildlife species. Acacia genistoides is also sometimes cultivated for its ornamental value and traditional uses.",
    "distribution_introduced_art_desc": "Acacia genistoides was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since become naturalized in several regions, particularly in the northern and central parts of the country. The plant thrives in sunny conditions and is often found in disturbed soils, such as along roadsides and in forest margins. Its rapid growth and ability to spread through seeds have led to concerns about its potential to become invasive in certain ecosystems. Despite its ornamental value, management strategies are being developed to control its spread in sensitive habitats."
}
