{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brachyloba",
    "plant_slug": "acacia-brachyloba",
    "plant_name_scientific": "acacia brachyloba",
    "intro": "Acacia brachyloba, commonly known as the narrow-leaf wattle, is a small evergreen shrub native to Australia. It is characterized by its narrow, leathery leaves and yellow floral spikes that bloom in spring. The plant is part of the Fabaceae family, known for its nitrogen-fixing abilities through symbiotic bacteria in its root nodules. Acacia brachyloba is adapted to arid and semi-arid environments, making it resilient to drought conditions. It is often used in landscaping for its ornamental value and ability to thrive in poor soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brachyloba is primarily native to northern Australia, including regions of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, particularly in areas with sandy or gravelly soils. This species thrives in open woodlands, scrublands, and along riverbanks in its native range. It is well adapted to the harsh climatic conditions of the region, including high temperatures and low rainfall. Acacia brachyloba plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia brachyloba was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in Queensland and New South Wales. This plant is often used for soil stabilization and as a source of timber and fuelwood. Due to its hardy nature, it has been introduced to other parts of the world, including parts of Asia and the Pacific Islands. However, its spread can sometimes lead to ecological concerns in non-native environments."
}
