{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia goetzei",
    "plant_slug": "acacia-goetzei",
    "plant_name_scientific": "acacia goetzei",
    "intro": "Acacia goetzei, commonly known as the Goetze's wattle, is a small evergreen shrub native to southern Africa. It belongs to the Fabaceae family, which is characterized by its pod fruits and nitrogen-fixing abilities. The plant features feathery, bipinnate leaves and produces yellow flowers in clusters, which attract pollinators such as bees and birds. It thrives in well-drained soils and is often found in coastal and rocky habitats. Acacia goetzei is valued for its ornamental appeal and ecological role in supporting local biodiversity.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia goetzei is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, often in association with other drought-tolerant plant species. This shrub is well adapted to hot, dry climates and can thrive with minimal water. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife. Its distribution is largely restricted to specific microhabitats within these regions.",
    "distribution_introduced_art_desc": "Acacia goetzei was mainly introduced to areas with well-drained soils and a warm, temperate climate, often in regions where it is used for erosion control or as a ornamental plant. It thrives in full sun and is commonly found in disturbed soils such as roadsides, clearings, and degraded landscapes. The plant has been reported in several countries in the Mediterranean region and parts of southern Europe. Its rapid growth and ability to fix nitrogen make it a valuable species for reclamation projects. However, it can also become invasive in certain environments if not managed properly."
}
