{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia undulifolia var. humilis",
    "plant_slug": "acacia-undulifolia-var-humilis",
    "plant_name_scientific": "acacia undulifolia var. humilis",
    "intro": "Acacia undulifolia var. humilis, commonly known as the coastal wattle, is a low-growing shrub native to southern Australia. It features slender, wiry stems and produces yellow flowers in late winter to early spring. The leaves are bipinnate, consisting of multiple pairs of small, oval leaflets. It thrives in coastal environments, tolerating salt spray and sandy soils. This variety is valued for its ornamental appeal and ecological role in stabilizing dunes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia undulifolia var. humilis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. This variety is commonly found in sandy soils and rocky outcrops, often growing in open woodlands and shrublands. It is well adapted to dry climates and can survive with minimal rainfall. The plant is also occasionally found in the northern regions of South Africa, particularly in the Karoo andNamaqualand areas. Its distribution is largely restricted to these specific ecological zones within the continent.",
    "distribution_introduced_art_desc": "Acacia undulifolia var. humilis was mainly introduced to specific regions in Australia, particularly in the southern parts of Western Australia and South Australia. It was introduced for its ornamental value and its ability to thrive in arid and semi-arid environments. The plant is commonly found in coastal dunes and sandy soils, where it forms dense shrubs. Its introduction has led to its establishment in native vegetation, sometimes competing with local flora. Due to its adaptability, it has become a common sight in many parts of its introduced range."
}
