{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia botrycephala",
    "plant_slug": "acacia-botrycephala",
    "plant_name_scientific": "acacia botrycephala",
    "intro": "Acacia botrycephala, commonly known as the globular acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, spherical crown and is often found in rocky or sandy soils. The plant produces yellow flowers in clusters, which are followed by flat, pod-like fruits. Its leaves are bipinnately compound, consisting of many small leaflets. Acacia botrycephala is well adapted to arid environments and is often used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia botrycephala is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, shrublands, and rocky outcrops where it thrives in hot and dry conditions. This species is well adapted to withstand long periods of drought and high temperatures. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is largely restricted to the southern part of the African continent.",
    "distribution_introduced_art_desc": "Acacia botrycephala was mainly introduced to South Africa, particularly in the semi-arid regions of the Western Cape and the Northern Cape. It was introduced for its potential as a source of timber and for its ability to stabilize soil in degraded areas. The plant has since become naturalized in several parts of the country, often spreading along roadsides and in disturbed habitats. Its rapid growth and adaptability have led to concerns about its invasive potential in some ecosystems. However, it is also valued for its ecological benefits, including providing habitat for native wildlife."
}
