{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cerastes",
    "plant_slug": "acacia-cerastes",
    "plant_name_scientific": "acacia cerastes",
    "intro": "Acacia cerastes, commonly known as the African thorn acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its slender, spiny stems and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow flowers in compact, globular clusters, which are followed by flat, pod-like fruits containing seeds. It is well adapted to drought conditions, with deep roots that allow it to survive in nutrient-poor soils. Acacia cerastes plays an important role in its ecosystem, providing shelter and food for various animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cerastes"
    },
    "taxonomy_art_desc": "Acacia cerastes belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with a single carpel and include legumes and vetches. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of flowering plants known for their acacia-like appearance, often with phyllodes instead of leaves. Its species is Acacia cerastes, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cerastes is primarily native to Western Australia. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy soils and is often seen in spinifex plains and sand plains. It is well adapted to the harsh climate of the region. Acacia cerastes plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia cerastes was mainly introduced to regions with arid or semi-arid climates, where it thrives in sandy or rocky soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of Australia, Africa, and the Middle East. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It can also serve as a source of fodder for livestock in certain regions. However, its introduction has sometimes led to competition with native plant species in invaded areas."
}
