{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oerfota",
    "plant_slug": "acacia-oerfota",
    "plant_name_scientific": "acacia oerfota",
    "intro": "Acacia oerfota, commonly known as the silver acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and small, fern-like leaves that are typically covered in a fine, silvery or greyish coating. The plant produces yellow flowers arranged in globular or cylindrical heads, which bloom during the warmer months. Acacia oerfota is adapted to arid and semi-arid environments, making it a hardy species suitable for dry climates. It is also valued for its ornamental appeal and ability to thrive in poor soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oerfota is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland ecosystems. This species is well adapted to dry climates and can tolerate high temperatures and low rainfall. It plays an important role in stabilizing soil and providing habitat for local wildlife. Acacia oerfota is also sometimes used in traditional medicine by indigenous communities.",
    "distribution_introduced_art_desc": "Acacia oerfota was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along coastal areas and in the Western Cape. The plant is often used for erosion control due to its ability to thrive in harsh environments. However, it has also been reported to spread aggressively, potentially displacing native vegetation. Its introduction has raised concerns among conservationists due to its invasive potential in some ecosystems."
}
