{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia complanata",
    "plant_slug": "acacia-complanata",
    "plant_name_scientific": "acacia complanata",
    "intro": "Acacia complanata, commonly known as the flat-leaf wattle, is a shrub native to Australia. It belongs to the legume family, Fabaceae, and is characterized by its slender, zigzagging stems and small, flat leaves. The plant produces yellow flowers in spring, which are clustered in cylindrical spikes. Acacia complanata is adapted to dry environments and is often found in coastal and sandy soils. It plays a role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia complanata"
    },
    "taxonomy_art_desc": "Acacia complanata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a true stem and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and often ancient lineage. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive bipinnate leaves and floral structures. Its species is Acacia complanata, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia complanata is primarily native to New South Wales and Queensland in Australia. It is commonly found in the coastal and inland regions of these states. This plant typically grows in sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the warm and dry climate of the regions it inhabits. Acacia complanata plays an important role in the local ecosystem by providing habitat and food for various native animals.",
    "distribution_introduced_art_desc": "Acacia complanata was mainly introduced to new environments as an ornamental plant due to its unique appearance and ability to thrive in arid conditions. It has been widely planted in regions with warm climates, including parts of Australia, South Africa, and the Mediterranean. However, its introduction has led to concerns about its potential to become invasive in certain ecosystems. The plant's rapid growth and seed dispersal mechanisms contribute to its spread beyond cultivated areas. Despite its aesthetic value, careful management is required to prevent ecological disruption."
}
