{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia shirleyana",
    "plant_slug": "acacia-shirleyana",
    "plant_name_scientific": "acacia shirleyana",
    "intro": "Acacia shirleyana, commonly known as Shirley's acacia, is a shrub or small tree native to the arid regions of southern Africa. It is characterized by its slender, often branched stems and feathery, bipinnate leaves that are adapted to reduce water loss in hot, dry climates. The plant produces yellow, globular flower heads that are clustered in dense, spherical inflorescences, which are a striking feature. It thrives in well-drained soils and is often found in rocky or sandy habitats. Due to its drought tolerance and ornamental value, it is cultivated in some regions as a landscape plant.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia shirleyana is primarily native to the island of Madagascar. It is found in the dry and humid regions of the island, particularly in the eastern and southern parts. This plant thrives in a variety of habitats, including dry forests, grasslands, and coastal areas. It is well adapted to the tropical climate of Madagascar. Acacia shirleyana is an important component of the local flora and plays a role in the ecological balance of its native environment.",
    "distribution_introduced_art_desc": "Acacia shirleyana was mainly introduced to South Africa, where it has become naturalized in certain regions. It is often found in coastal areas and along roadsides, adapting well to the local climate. The plant is valued for its ability to thrive in poor soils and its potential for erosion control. However, it has also been reported to spread aggressively in some areas, raising concerns about its impact on native vegetation. Its introduction has led to discussions about its ecological role and management in the region."
}
