{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia brachyphylla var. recurvata",
    "plant_slug": "acacia-brachyphylla-var-recurvata",
    "plant_name_scientific": "acacia brachyphylla var. recurvata",
    "intro": "Acacia brachyphylla var. recurvata, commonly known as the narrow-leaved wattle, is a shrub native to Australia. It is characterized by its slender, often drooping branches and small, feathery leaves. The plant produces yellow flowers in late summer, which are arranged in compact spherical clusters. It is adapted to arid and semi-arid environments, showing drought tolerance. The species is valued for its ornamental appeal and is often used in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia brachyphylla"
    },
    "taxonomy_art_desc": "Acacia brachyphylla var. recurvata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which comprises plants with flowers that typically have five petals and includes legumes, which are known for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod fruits and nitrogen-fixing symbiosis with bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often spiny foliage and pods, and for their ability to thrive in arid environments. Its species is Acacia brachyphylla, a specific type of acacia known for its compact growth and unique leaf structure, with the varietal form recurvata indicating a distinct variation in its morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia brachyphylla var. recurvata is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This variety thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is typically found in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia brachyphylla var. recurvata was mainly introduced to South Australia and parts of Western Australia for its ornamental value and ability to thrive in arid conditions. It is commonly found in coastal and semi-arid regions where it forms dense shrubs or small trees. The plant is well adapted to sandy soils and can tolerate drought, making it suitable for rehabilitation projects. It is also valued for its fragrant flowers and ability to provide habitat for native wildlife. However, its introduction has raised concerns due to its potential to spread aggressively in certain environments."
}
