{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ptychophylla",
    "plant_slug": "acacia-ptychophylla",
    "plant_name_scientific": "acacia ptychophylla",
    "intro": "Acacia ptychophylla, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, feathery leaves and yellow flowers that bloom in clusters. The plant is adapted to arid and semi-arid environments, showcasing drought resistance through its deep root system. It plays an important role in stabilizing soil and providing habitat for native wildlife. Acacia ptychophylla is also valued for its ornamental appeal and is sometimes used in landscaping.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia ptychophylla"
    },
    "taxonomy_art_desc": "Acacia ptychophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which consists of vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises flowering plants that are often legumes, characterized by their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of flowering plants commonly known as wattles, characterized by their phyllodes and often used in landscaping and traditional medicine. Its species is Acacia ptychophylla, a specific type of acacia native to Australia, known for its shrub-like growth and distinctive foliage.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ptychophylla is primarily native to the Northern Territory and Western Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy soils and is often seen in shrublands and open woodlands. It is well adapted to the harsh climate of its native range. Its distribution is largely restricted to these specific regions in northern Australia.",
    "distribution_introduced_art_desc": "Acacia ptychophylla was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and along the eastern coast, thriving in coastal and sandy soils. This plant is often used for erosion control due to its hardy nature and ability to colonize disturbed areas. However, it can sometimes outcompete native vegetation, raising concerns about its ecological impact. Its introduction has been primarily through horticultural activities and accidental spread."
}
