{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia praecox f. hassleri",
    "plant_slug": "acacia-praecox-f-hassleri",
    "plant_name_scientific": "acacia praecox f. hassleri",
    "intro": "Acacia praecox f. hassleri, commonly known as the early acacia or Hassler's acacia, is a shrub native to southern Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features small, yellowish-green flowers arranged in spikes, which bloom during the cooler months. Its woody stems are often covered in a layer of fine, white hairs, providing some protection against herbivores. This species is adapted to arid and semi-arid environments, making it a resilient plant in harsh conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia praecox f. hassleri is primarily native to southern Africa, specifically South Africa. It is found in regions such as the Eastern Cape, Western Cape, and parts of the Northern Cape. This plant thrives in arid and semi-arid environments, often growing in rocky soils and along coastal areas. It is commonly found in fynbos vegetation, which is characteristic of the Cape Floristic Region. Due to its adaptability, it can also be found in some parts of Namibia and Botswana.",
    "distribution_introduced_art_desc": "Acacia praecox f. hassleri was mainly introduced to control erosion and for ornamental purposes in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its rapid growth and ability to thrive in poor soil conditions. This plant is often used in reclamation projects because of its deep root system that stabilizes the soil. However, it can become invasive in some areas if not managed properly. Its introduction has had both positive ecological and potential negative impacts depending on the local environment."
}
