{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dolabriformis",
    "plant_slug": "acacia-dolabriformis",
    "plant_name_scientific": "acacia dolabriformis",
    "intro": "Acacia dolabriformis, commonly known as the narrow-leaf wattle, is a flowering plant native to Australia. It is a shrub or small tree that typically grows in arid and semi-arid regions. The plant is characterized by its slender, compound leaves and yellow, globular flower heads. It produces small, woody pods that contain seeds, which are dispersed by wind. Acacia dolabriformis is well adapted to drought conditions and plays an important role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dolabriformis is primarily native to northern Australia, including regions of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, particularly in areas with sandy or rocky soils. This species thrives in open woodlands and shrublands, often growing along riverbanks and in coastal regions. It is well adapted to the harsh climate of its native range, with features such as small leaves and deep root systems. Acacia dolabriformis plays an important ecological role in its habitat, providing food and shelter for various native animals.",
    "distribution_introduced_art_desc": "Acacia dolabriformis was mainly introduced to control soil erosion and for its ornamental value in landscaping. It is commonly found in disturbed areas such as roadsides, riverbanks, and degraded soils. The plant thrives in arid and semi-arid regions due to its drought tolerance and ability to fix nitrogen. Its rapid growth and dense foliage make it useful for stabilizing soil and preventing further degradation. However, it can become invasive in some environments if not managed properly."
}
