{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chrysotricha",
    "plant_slug": "acacia-chrysotricha",
    "plant_name_scientific": "acacia chrysotricha",
    "intro": "Acacia chrysotricha, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its dense, feathery foliage and yellow flowers that bloom in late winter to early spring. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil through symbiotic relationships with rhizobia bacteria. Its small, pod-like fruits contain seeds that are dispersed by wind, contributing to its spread in arid and semi-arid regions. The plant is also valued for its ornamental appeal and ecological importance in supporting native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia chrysotricha"
    },
    "taxonomy_art_desc": "Acacia chrysotricha belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped flower heads and nitrogen-fixing capabilities. Its species is Acacia chrysotricha, a specific type of acacia found in certain regions, known for its unique features and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chrysotricha is primarily native to New South Wales. It is commonly found in the dry, inland regions of the state, particularly in areas with sandy or gravelly soils. This species is often associated with open woodlands and grasslands, thriving in semi-arid to arid environments. It plays an important role in local ecosystems by providing habitat and food for various wildlife. Due to its hardy nature, it is also sometimes cultivated in gardens and for land rehabilitation projects.",
    "distribution_introduced_art_desc": "Acacia chrysotricha was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in sandy soils along the coast. The plant is often used in ornamental horticulture due to its attractive yellow flowers and feathery foliage. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasiveness. Despite its beauty, management strategies are being developed to control its spread in sensitive ecosystems."
}
