{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subtilis",
    "plant_slug": "acacia-subtilis",
    "plant_name_scientific": "acacia subtilis",
    "intro": "Acacia subtilis, commonly known as the slender wattle, is a shrub native to Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant is distinguished by its narrow, linear leaves and yellow flowers that bloom in spring. It thrives in dry, sandy soils and is often found in coastal and inland regions. Acacia subtilis is valued for its ecological role in providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subtilis is primarily native to eastern Australia, specifically the eastern coast of Queensland and New South Wales. It thrives in a variety of habitats, including dry sclerophyll forests, heathlands, and rocky outcrops. This species is commonly found in areas with well-drained soils and a Mediterranean climate. It is well adapted to the seasonal rainfall patterns of its native range. Due to its ecological significance, it plays an important role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia subtilis was mainly introduced to areas with a Mediterranean climate, characterized by dry summers and mild, wet winters. It thrives in well-drained soils and is commonly found in coastal regions and open woodlands. This plant has been introduced to several regions outside its native range, including parts of California and the Mediterranean Basin. Its rapid growth and ability to tolerate drought make it a potential invasive species in some environments. However, it is also valued for its ornamental qualities and ability to provide habitat for native wildlife."
}
