{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia restiacea",
    "plant_slug": "acacia-restiacea",
    "plant_name_scientific": "acacia restiacea",
    "intro": "Acacia restiacea, commonly known as the slender acacia, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its slender, branching stems and small, bipinnate leaves that are often reduced to spines. The plant produces yellow globular flowers that are clustered in dense inflorescences, attracting a variety of pollinators. Acacia restiacea is well adapted to drought conditions, with deep root systems that allow it to access water from deeper soil layers. It plays an important ecological role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia restiacea"
    },
    "taxonomy_art_desc": "Acacia restiacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used for timber or in traditional medicine. Its species is Acacia restiacea, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia restiacea is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal and inland regions of the state. This plant thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. It is well adapted to the hot, dry climate of the region. Acacia restiacea plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia restiacea was mainly introduced to control erosion and provide shade in degraded landscapes. It is commonly found in areas with sandy or rocky soils, often in arid or semi-arid regions. The plant is valued for its rapid growth and ability to thrive in harsh environmental conditions. However, it can become invasive in some areas, outcompeting native vegetation. Its distribution is primarily limited to regions where it has been intentionally planted for ecological restoration purposes."
}
