{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sibirica",
    "plant_slug": "acacia-sibirica",
    "plant_name_scientific": "acacia sibirica",
    "intro": "Acacia sibirica, commonly known as Siberian acacia, is a deciduous shrub or small tree native to the cold climates of Siberia and Central Asia. It is characterized by its slender, often multi-branched stems and compound leaves that are feather-like in appearance. The plant produces small, yellow flowers that bloom in clusters, typically in the spring or early summer. Its bark is smooth and grayish, and it is adapted to survive in harsh, arid environments. Acacia sibirica is valued for its hardiness and is sometimes used in landscaping in regions with cold winters.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia sibirica"
    },
    "taxonomy_art_desc": "Acacia sibirica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes plants with distinctive flowers and is known for its economic importance, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their acacia-like leaves and often used in traditional medicine. Its species is Acacia sibirica, a specific type of acacia native to Siberia, known for its ecological role and adaptability to harsh environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Northern Territory",
        "Queensland",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sibirica is primarily native to New South Wales, Northern Territory, Queensland, South Australia, and Western Australia. This species is commonly found in arid and semi-arid regions across these states. It thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. The plant is well adapted to the dry climate of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia sibirica was mainly introduced to regions with temperate climates and well-drained soils, often as an ornamental or for erosion control. It thrives in areas with moderate rainfall and full sun exposure, making it suitable for cultivation in parts of Europe and North America. The plant is known for its hardy nature and ability to adapt to various soil types, which contributes to its widespread introduction. However, it can become invasive in certain environments if not managed properly. Its introduction has raised concerns about ecological impact in non-native regions."
}
