{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella lemmonii",
    "plant_slug": "acaciella-lemmonii",
    "plant_name_scientific": "acaciella lemmonii",
    "intro": "Acaciella lemmonii, commonly known as the narrow-leaf acacia, is a shrub native to the southwestern United States and northern Mexico. It is characterized by its slender, often twisted stems and small, pinnate leaves that are gray-green in color. The plant produces yellow flowers that bloom in spring, followed by flat, pod-like fruits containing seeds. It thrives in arid and semi-arid environments, making it well-adapted to drought conditions. Acaciella lemmonii is often found in rocky soils and is a common component of desert ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acaciella",
        "species": "Acaciella lemmonii"
    },
    "taxonomy_art_desc": "Acaciella lemmonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a long evolutionary history, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and produce legume-like fruits. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acaciella, a group of flowering plants native to South America, known for their shrub-like growth and small, often yellow flowers. Its species is Acaciella lemmonii, a specific plant within the genus Acaciella, known for its unique morphology and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Arizona",
        "Mexico Northeast",
        "Mexico Northwest"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella lemmonii is primarily native to Arizona, Mexico Northeast, and Mexico Northwest. This plant is commonly found in the arid and semi-arid regions of these areas. It thrives in rocky soils and is often associated with desert environments. Acaciella lemmonii is well adapted to the harsh climate of its native range. It plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acaciella lemmonii was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is often found in regions with low rainfall and high temperatures, such as parts of Africa, the Middle East, and Australia. This plant is commonly used for erosion control due to its deep root system and ability to stabilize soil. It is also valued for its ornamental qualities, making it a popular choice in landscaping. However, its introduction has sometimes led to ecological concerns in non-native environments."
}
