{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aneura var. ayersiana",
    "plant_slug": "acacia-aneura-var-ayersiana",
    "plant_name_scientific": "acacia aneura var. ayersiana",
    "intro": "Acacia aneura var. ayersiana, commonly known as the River Red Gum, is a flowering plant native to Australia. It is characterized by its slender, drooping branches and small, yellow flowers that appear in winter. The plant produces long, flat pods containing seeds, which are adapted for dispersal by wind and water. It thrives in riparian zones and is well-suited to arid and semi-arid environments. The species is important for both ecological and historical reasons, providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aneura var. ayersiana is primarily native to the arid regions of central Australia, including parts of Queensland, New South Wales, and South Australia. It is commonly found in sandy soils within the Simpson Desert and the Great Sandy Desert. This variety thrives in dry, open habitats such as spinifex plains and sandplain shrublands. It is well adapted to the harsh conditions of the Australian outback, including extreme temperatures and low rainfall. The plant plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia aneura var. ayersiana was mainly introduced to South Australia and parts of Western Australia. It is commonly found in arid and semi-arid regions, growing on rocky soils and in open woodlands. This variety is often used for soil stabilization and as a source of timber due to its hard, durable wood. It has also been introduced for ornamental purposes in some areas. However, its spread is limited due to its specific habitat requirements and climate preferences."
}
