{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciopsis schottii",
    "plant_slug": "acaciopsis-schottii",
    "plant_name_scientific": "acaciopsis schottii",
    "intro": "Acaciopsis schottii, commonly known as the Schott's acaciopsis, is a shrub native to parts of Africa, particularly Tanzania and Kenya. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant is adapted to arid and semi-arid environments, showcasing resilience to drought conditions. Its small, pod-like fruits contain seeds that are dispersed by wind, contributing to its survival in harsh climates. Acaciopsis schottii plays a role in local ecosystems by providing habitat and potentially serving as a source of forage for wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciopsis schottii is primarily native to the tropical regions of Central and South America. It is commonly found in countries such as Brazil, Colombia, and Ecuador. This plant typically grows in humid, lowland areas with rich soil. It thrives in environments with high rainfall and warm temperatures. Its natural habitat includes forests and savannas where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acaciopsis schottii was mainly introduced to areas with disturbed soils and open habitats, such as roadsides, clearings, and degraded forests. It thrives in regions with moderate to high rainfall and well-drained soils. This plant is often found in tropical and subtropical climates, particularly in parts of Africa and Southeast Asia. Its introduction has been associated with human activities like land clearing and agriculture. Due to its rapid growth and adaptability, it can become invasive in certain environments."
}
