{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia colei",
    "plant_slug": "acacia-colei",
    "plant_name_scientific": "acacia colei",
    "intro": "Acacia colei, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its dense, feathery foliage and yellow flowers that bloom in spring. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. Acacia colei plays an important role in stabilizing soils and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia colei"
    },
    "taxonomy_art_desc": "Acacia colei belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their ancient lineage and complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their floral structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and are often associated with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like flower heads and nitrogen-fixing capabilities. Its species is Acacia colei, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [
        "India"
    ],
    "distribution_native_art_desc": "Acacia colei is primarily native to the Northern Territory, Queensland, and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy soils and is often seen in shrublands and woodland communities. Acacia colei is well adapted to the harsh climate conditions of its native range. Its distribution reflects its ability to survive in low-resource environments.",
    "distribution_introduced_art_desc": "Acacia colei was mainly introduced to India. It is commonly found in the western and southern regions of the country. The plant thrives in arid and semi-arid environments, making it well-suited for the climatic conditions in these areas. It is often used for soil stabilization and as a source of timber. Its introduction has contributed to ecological restoration efforts in degraded lands."
}
