{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia undulifolia var. setigera",
    "plant_slug": "acacia-undulifolia-var-setigera",
    "plant_name_scientific": "acacia undulifolia var. setigera",
    "intro": "Acacia undulifolia var. setigera, commonly known as the coastal wattle, is a shrub native to coastal regions of southern Africa. It is characterized by its feathery, bipinnate leaves that are adapted to withstand salt spray and strong winds. The plant produces yellow flowers in spring, which are clustered in cylindrical spikes. It thrives in sandy or gravelly soils and is often found in dune environments. Due to its hardy nature, it is sometimes used in coastal stabilization and landscaping.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia undulifolia var. setigera is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland ecosystems. This variant is adapted to withstand high temperatures and low rainfall, making it a resilient species in its native habitat. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is largely restricted to the specific environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia undulifolia var. setigera was mainly introduced to areas with sandy or loamy soils and a warm, dry climate. It thrives in regions with low rainfall and high sunlight exposure. This plant is commonly found in coastal and inland dunes, as well as disturbed soils. It is often used for erosion control and as a source of timber and fuel. Its introduction has led to its establishment in several regions beyond its native range."
}
