{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia petersiana",
    "plant_slug": "acacia-petersiana",
    "plant_name_scientific": "acacia petersiana",
    "intro": "Acacia petersiana, commonly known as the white wattle, is a flowering plant native to South Africa. It is a small to medium-sized shrub or tree that typically grows in arid and semi-arid regions. The plant is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in winter. It produces long, straight pods that contain seeds used for food and traditional medicine. Acacia petersiana is also valued for its ornamental appeal and ability to thrive in poor soils.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia petersiana is primarily native to southern Africa, specifically South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, including savannas and rocky outcrops. This species thrives in well-drained soils and is often associated with shrublands and grasslands. It is an important component of the local flora and provides habitat and food for various wildlife species. Acacia petersiana is well adapted to the harsh climatic conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia petersiana was mainly introduced to stabilize soils and provide forage in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its hardiness and rapid growth rate, making it suitable for land rehabilitation. However, its introduction has sometimes led to competition with native species in certain ecosystems. Despite its benefits, careful management is necessary to prevent unintended ecological impacts."
}
