{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stipuligera",
    "plant_slug": "acacia-stipuligera",
    "plant_name_scientific": "acacia stipuligera",
    "intro": "Acacia stipuligera, commonly known as the silky wattle, is a shrub or small tree native to Australia. It is characterized by its slender, wiry stems and bright yellow flowers that appear in late winter to early spring. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic organs. Acacia stipuligera is adapted to dry conditions and is often found in sandy soils. It plays an important role in providing nectar for pollinators and habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stipuligera"
    },
    "taxonomy_art_desc": "Acacia stipuligera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and often complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which comprises plants with compound leaves and flowers that typically have a distinctive arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive foliage and often thorn-like structures. Its species is Acacia stipuligera, a specific type of acacia characterized by its unique stipular structures and adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stipuligera is primarily native to the Northern Territory, Queensland, and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in shrublands and woodland communities. The plant is well adapted to the dry climate and can withstand periods of drought. Its distribution reflects its ability to survive in the harsh environmental conditions of these regions.",
    "distribution_introduced_art_desc": "Acacia stipuligera was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for rehabilitation of degraded lands. This plant is often used in agroforestry systems due to its ability to fix nitrogen and improve soil fertility. Its introduction has been particularly noted in parts of Australia and the southwestern United States. However, its spread can sometimes lead to ecological concerns if not managed properly."
}
