{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia nodiflora",
    "plant_slug": "acacia-nodiflora",
    "plant_name_scientific": "acacia nodiflora",
    "intro": "Acacia nodiflora, commonly known as the climbing acacia, is a shrub or small tree native to tropical and subtropical regions of Africa and Asia. It is characterized by its slender, often climbing stems and bipinnate leaves that are finely divided. The plant produces small, yellowish flowers in compact clusters, which are followed by long, flat pods containing seeds. Acacia nodiflora thrives in well-drained soils and is often found in savanna and woodland habitats. It plays a role in local ecosystems and has been used traditionally for various purposes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia nodiflora"
    },
    "taxonomy_art_desc": "Acacia nodiflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods as fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their distinctive foliage and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia nodiflora, a specific type of acacia known for its clustered flowers and is often found in arid or semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia nodiflora is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This species thrives in dry, sandy soils and is often associated with coastal and inland habitats. It is well adapted to the arid and semi-arid climates of the region. Acacia nodiflora plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia nodiflora was mainly introduced to New Zealand as part of ornamental and horticultural plantings. It has since become naturalized in several regions, particularly in coastal and lowland areas. The plant thrives in a variety of soil types but prefers well-drained conditions. Its rapid growth and ability to form dense thickets have led to concerns about its potential invasiveness. Despite its ornamental value, management strategies are being developed to control its spread in native ecosystems."
}
