{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acaciella fisheri",
    "plant_slug": "acaciella-fisheri",
    "plant_name_scientific": "acaciella fisheri",
    "intro": "Acaciella fisheri, commonly known as the Fisher's acaciella, is a small shrub native to the arid regions of southern Africa. It belongs to the Fabaceae family, characterized by its typical legume-like flowers and nitrogen-fixing capabilities. The plant produces small, yellowish-white flowers that are clustered in racemes, often blooming during the rainy season. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. Acaciella fisheri is adapted to survive in harsh, dry environments, with deep root systems that help it access groundwater.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acaciella fisheri is primarily native to the island of Socotra, which is located in the Arabian Sea. This unique plant is found in the arid and rocky habitats of Socotra, a region known for its endemic flora. It thrives in the dry, hot climate of the island, often growing on limestone substrates. Due to its restricted range, Acaciella fisheri is considered a rare and vulnerable species. Conservation efforts are ongoing to protect this plant from habitat loss and environmental changes.",
    "distribution_introduced_art_desc": "Acaciella fisheri was mainly introduced to regions with suitable climatic conditions, including tropical and subtropical areas. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and degraded forests. The plant thrives in well-drained soils and is often associated with human activity. Its introduction has led to its spread in several parts of the world, including Southeast Asia and the Pacific Islands. Due to its rapid growth and adaptability, it is considered an invasive species in some areas."
}
