{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hindsii",
    "plant_slug": "acacia-hindsii",
    "plant_name_scientific": "acacia hindsii",
    "intro": "Acacia hindsii, commonly known as the silver wattle, is a deciduous shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that turn a striking silver-white color during the dry season. The plant produces yellow globular flowers that bloom in late winter to early spring, attracting pollinators such as bees and birds. Its bark is smooth and greyish, often peeling in thin strips, and it has a deep root system that helps prevent soil erosion. Acacia hindsii is well adapted to arid and semi-arid environments, making it a resilient and ornamental plant in native landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hindsii is primarily native to the tropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It thrives in savanna and woodland habitats, often found in areas with well-drained soils. This plant is commonly associated with dry and semi-arid environments, where it plays a role in stabilizing soil and providing habitat for local wildlife. Its distribution extends into parts of southern Arabia and the Horn of Africa as well. Acacia hindsii is well adapted to the climate and ecological conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia hindsii was mainly introduced to tropical and subtropical regions for its ornamental value and potential for soil stabilization. It is commonly found in countries such as Australia, the United States, and parts of Southeast Asia. The plant thrives in well-drained soils and requires full sun exposure to grow optimally. Due to its rapid growth and adaptability, it has been used in reforestation and erosion control projects. However, it is also considered an invasive species in some areas where it outcompetes native vegetation."
}
