{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obovata",
    "plant_slug": "acacia-obovata",
    "plant_name_scientific": "acacia obovata",
    "intro": "Acacia obovata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, obovate leaves that are often covered in a fine layer of whitish hairs. The plant produces yellow flowers arranged in dense, globular clusters, which are typical of the Acacia genus. It thrives in well-drained soils and is often found in dry, open habitats. Acacia obovata is valued for its ornamental appeal and is also used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia obovata"
    },
    "taxonomy_art_desc": "Acacia obovata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse growth forms. Its order is Fabales, which consists of flowering plants that are often legumes, characterized by their distinctive flowers and nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, recognized by their fruit type and nitrogen-fixing symbiosis with bacteria. Its genus is Acacia, a large group of shrubs and trees primarily found in arid and tropical regions, known for their distinctive acicular leaves and pod fruits. Its species is Acacia obovata, a specific type of acacia characterized by its obovate leaves and is typically found in certain geographic regions with specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obovata is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant thrives in dry, sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native habitat. Acacia obovata plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia obovata was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the inland areas of Western Australia and South Australia. This plant is often used for erosion control due to its extensive root system and ability to stabilize soils. It also serves as a valuable source of browse for livestock and wildlife. However, its introduction has sometimes led to competition with native plant species in certain ecosystems."
}
