{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cretacea",
    "plant_slug": "acacia-cretacea",
    "plant_name_scientific": "acacia cretacea",
    "intro": "Acacia cretacea, commonly known as the Cretaceous acacia, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its slender, spiny stems and small, phyllodes that are typically green and strap-shaped. The plant produces yellow flowers in clusters, which are often visited by native pollinators such as bees and birds. Acacia cretacea is well adapted to drought conditions, with deep root systems that allow it to access water from deeper soil layers. Its wood is hard and durable, making it valuable for traditional and contemporary uses.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cretacea"
    },
    "taxonomy_art_desc": "Acacia cretacea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, known as the legume family, which includes plants that form symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a group of flowering plants commonly known as wattles, characterized by their unique bipinnate leaves and flower heads. Its species is Acacia cretacea, a specific type of acacia found in certain regions, distinguished by its morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cretacea is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This plant thrives in sandy soils and is often seen in coastal and inland areas. It plays an important role in the local ecosystem by providing habitat and food for native wildlife. Acacia cretacea is well adapted to the harsh conditions of the Australian outback.",
    "distribution_introduced_art_desc": "Acacia cretacea was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soils and withstand high temperatures. It is commonly found in regions such as parts of Australia, the United States, and other parts of the world with similar environmental conditions. This plant is often used for erosion control due to its extensive root system and ability to stabilize soil. It can also serve as a source of fodder for livestock in certain regions. However, its introduction has sometimes led to ecological concerns due to its potential to outcompete native vegetation."
}
