{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glaucifolia",
    "plant_slug": "acacia-glaucifolia",
    "plant_name_scientific": "acacia glaucifolia",
    "intro": "Acacia glaucifolia, commonly known as the silverleaf acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branching stems and small, rounded leaves that are covered in a whitish, powdery coating. The plant produces yellow flowers in globular or cylindrical clusters, which are typical of the Acacia genus. Its foliage and floral structures are adapted to arid conditions, making it drought-tolerant. Acacia glaucifolia is often found in rocky or sandy soils and is used in traditional medicine in some regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glaucifolia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, South Africa, and Zimbabwe. It thrives in sandy or gravelly soils and is commonly found in savannas and shrublands. This species is well adapted to drought conditions and can tolerate high temperatures. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia glaucifolia is also sometimes cultivated as an ornamental plant due to its attractive foliage and resilience.",
    "distribution_introduced_art_desc": "Acacia glaucifolia was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the northern and western parts of the country. This plant is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has sometimes led to ecological concerns due to its potential to outcompete native species. Despite these challenges, it remains an important plant in certain agricultural and environmental contexts."
}
