{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia symonii",
    "plant_slug": "acacia-symonii",
    "plant_name_scientific": "acacia symonii",
    "intro": "Acacia symonii, commonly known as the Socotra acacia, is a flowering plant native to the Arabian Peninsula and the island of Socotra. It is characterized by its distinctive, flat, thorn-like leaves and yellow, globular flower heads. The plant is adapted to arid environments, with a deep root system that allows it to thrive in dry conditions. Its unique appearance has made it a subject of botanical interest and conservation efforts. Acacia symonii plays an important ecological role in its native habitat, providing food and shelter for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia symonii"
    },
    "taxonomy_art_desc": "Acacia symonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which includes ferns and their allies, known for their vascular systems and often having jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of flower structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes, which are known for nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which is distinguished by its characteristic fruit type, the legume, and often by nitrogen-fixing symbiosis with bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive, often thorned appearance and nitrogen-fixing abilities. Its species is Acacia symonii, a specific type of acacia native to certain regions of Africa, recognized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia symonii is primarily native to the Northern Territory, South Australia, and Western Australia. This shrub or small tree is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often part of the vegetation in open woodlands and shrublands. The plant is well adapted to the harsh climate conditions of its native range. It plays an important role in the local ecosystem and is sometimes used for its hardy nature in landscaping.",
    "distribution_introduced_art_desc": "Acacia symonii was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread into parts of southern Europe, including Spain and Italy, where it thrives in dry, rocky soils. The plant is considered invasive in some areas because of its rapid growth and ability to outcompete native vegetation. Its introduction has led to concerns about ecological impacts in regions where it is not native. Efforts are being made to control its spread and prevent further colonization of natural habitats."
}
