{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cookii",
    "plant_slug": "acacia-cookii",
    "plant_name_scientific": "acacia cookii",
    "intro": "Acacia cookii, commonly known as Cook's wattle, is a shrub native to the coastal regions of eastern Australia. It is characterized by its slender, erect stems and feathery, yellowish-green foliage. The plant produces small, yellow flowers in cylindrical clusters, which bloom during the autumn and winter seasons. Its seeds are encased in hard, woody pods that split open to release the seeds. Acacia cookii is adapted to sandy soils and is often found in coastal dunes and heathlands.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cookii is primarily native to the island of Niihau in Hawaii. This species is found exclusively on this small, uninhabited island in the North Pacific Ocean. It thrives in the dry, arid conditions of Niihau's interior regions. Acacia cookii is part of the legume family and is adapted to the unique ecological conditions of its native habitat. Due to its limited distribution, it is considered a rare and endemic plant species.",
    "distribution_introduced_art_desc": "Acacia cookii was mainly introduced to New Zealand as part of an ecological restoration project aimed at stabilizing degraded soils and providing habitat for native wildlife. It was selected for its rapid growth, drought tolerance, and ability to fix nitrogen, which enhances soil fertility. However, its invasive potential has led to concerns about its impact on local ecosystems and native plant species. Despite its benefits, management strategies are being developed to control its spread and minimize ecological disruption. The plant's distribution now spans several regions across New Zealand, particularly in the South Island."
}
