{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ciliolata",
    "plant_slug": "acacia-ciliolata",
    "plant_name_scientific": "acacia ciliolata",
    "intro": "Acacia ciliolata, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often branched stems and bipinnate leaves that are finely divided and covered in soft, silky hairs. The plant produces yellow flowers in globular heads, which are typically borne in clusters at the ends of branches. Its small, woody pods contain several seeds, and the plant is adapted to arid and semi-arid environments. Acacia ciliolata is often used in traditional medicine and as a source of browse for livestock.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ciliolata is primarily native to the arid and semi-arid regions of Australia. It is commonly found in the southern and central parts of the country, including Western Australia, South Australia, and parts of New South Wales. This plant thrives in sandy soils and is often seen in open woodlands and shrublands. It is well adapted to the harsh climatic conditions of its native habitat. Acacia ciliolata plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia ciliolata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy soils. The plant is known for its ability to tolerate saline conditions, which contributes to its spread in coastal environments. It has also been reported in parts of Australia, where it has been introduced for ornamental purposes. However, its invasive potential remains a concern in some areas."
}
