{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia blakelyi",
    "plant_slug": "acacia-blakelyi",
    "plant_name_scientific": "acacia blakelyi",
    "intro": "Acacia blakelyi, commonly known as the Blakely's wattle, is a shrub native to Western Australia. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant features yellow flowers arranged in cylindrical spikes, which bloom during the winter months. Its bark is smooth and greyish, often exfoliating to reveal a lighter inner layer. Acacia blakelyi is adapted to arid conditions, making it a resilient component of its native ecosystem.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia blakelyi"
    },
    "taxonomy_art_desc": "Acacia blakelyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with complex floral structures. Its order is Fabales, which consists of flowering plants that typically have legume fruits and often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods as fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia blakelyi, a specific type of acacia found in particular regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia blakelyi is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in areas with sandy soils. This species thrives in arid and semi-arid environments, often growing in open woodlands and shrublands. It is well adapted to the hot, dry climate of its native habitat. Acacia blakelyi plays an important ecological role in supporting local wildlife and maintaining the biodiversity of its region.",
    "distribution_introduced_art_desc": "Acacia blakelyi was mainly introduced to areas with well-drained soils and a warm, dry climate, typically found in regions of Australia. It thrives in sandy or gravelly soils and is often found in open woodlands or shrublands. This plant is particularly adapted to withstand drought and high temperatures, making it a resilient species in arid environments. Its introduction has been largely for ornamental purposes due to its attractive foliage and ability to form dense thickets. However, it can sometimes become invasive in certain ecosystems if not managed properly."
}
