{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dolichocephala",
    "plant_slug": "acacia-dolichocephala",
    "plant_name_scientific": "acacia dolichocephala",
    "intro": "Acacia dolichocephala, commonly known as the long-headed acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and compound leaves that are typically bipinnate. The plant produces yellow flowers arranged in cylindrical inflorescences, which are followed by flat, leathery pods containing seeds. It thrives in arid and semi-arid environments, often found in savannas and rocky areas. Acacia dolichocephala is known for its ability to fix nitrogen, contributing to soil fertility in its ecosystem.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dolichocephala is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in savannas, grasslands, and rocky outcrops where it thrives in dry, well-drained soils. This species is also present in parts of eastern and southern regions of the continent, often growing in association with other drought-tolerant flora. It plays an important ecological role by providing habitat and food for various animals and insects. Due to its hardy nature, it is well adapted to the harsh environmental conditions of its native range.",
    "distribution_introduced_art_desc": "Acacia dolichocephala was mainly introduced to areas with semi-arid to arid climates, typically in regions with well-drained soils. It is commonly found in savannas, woodlands, and rocky outcrops where it thrives in full sun. This plant is often used for soil stabilization and as a source of timber and fodder. Its introduction has sometimes led to ecological changes in native plant communities. It is important to manage its spread to prevent potential invasiveness in non-native habitats."
}
