{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vanmeelii",
    "plant_slug": "acacia-vanmeelii",
    "plant_name_scientific": "acacia vanmeelii",
    "intro": "Acacia vanmeelii, commonly known as the Van Meel's acacia, is a small shrub native to the arid regions of southern Africa. It is characterized by its slender, multi-branched stems and small, feathery leaves that help reduce water loss in its harsh environment. The plant produces yellow flowers in clusters, which are typical of the acacia genus and attract various pollinators. It is often found in rocky soils and is adapted to withstand prolonged droughts. Due to its unique morphology and ecological role, it is of interest to botanists and conservationists.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia vanmeelii is primarily native to the arid regions of Western Australia. It is commonly found in the Pilbara and Gascoyne regions, where it thrives in sandy soils. This species is well adapted to the harsh, dry climate of these areas. It often grows in open woodlands and along rocky outcrops. Acacia vanmeelii plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia vanmeelii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and Eastern Cape provinces, growing in sandy soils and coastal areas. This plant is often used in ornamental gardening due to its attractive yellow flowers and hardy nature. However, it has also been reported to spread into native vegetation, raising concerns about its potential invasive behavior. Its distribution is largely limited to areas with a Mediterranean climate, similar to its native range in Australia."
}
