{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia multijuga",
    "plant_slug": "acacia-multijuga",
    "plant_name_scientific": "acacia multijuga",
    "intro": "Acacia multijuga, commonly known as the slender acacia, is a shrub native to southern Africa. It is characterized by its slender, often multi-branched stems and small, bipinnate leaves. The plant produces yellow flowers in compact, globular spikes, which are typical of the Acacia genus. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia multijuga is often used in landscaping due to its drought tolerance and attractive appearance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia multijuga is primarily native to eastern Australia, including regions in New South Wales and Queensland. It is commonly found in dry sclerophyll forests and open woodlands. This species thrives in well-drained soils and is often associated with rocky or sandy substrates. It plays an important ecological role by providing food and habitat for various native animals. Acacia multijuga is also known for its distinctive yellow flowers and is sometimes used in horticulture.",
    "distribution_introduced_art_desc": "Acacia multijuga was mainly introduced to South Africa as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since spread beyond cultivated areas and is now considered an invasive species in several regions. The plant's rapid growth and seed dispersal through animals and wind have contributed to its widespread distribution. It is commonly found in disturbed habitats such as roadsides, farmlands, and riverbanks. Its introduction has led to ecological concerns, including competition with native vegetation and alteration of local ecosystems."
}
