{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia atrox",
    "plant_slug": "acacia-atrox",
    "plant_name_scientific": "acacia atrox",
    "intro": "Acacia atrox, commonly known as the black acacia, is a shrub native to southern Africa. It is characterized by its dark, thorny stems and small, bipinnate leaves. The plant produces yellow flowers that are clustered in cylindrical spikes, which are often visited by bees and other pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by animals. Acacia atrox is notable for its ability to thrive in arid and semi-arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia atrox"
    },
    "taxonomy_art_desc": "Acacia atrox belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinct structure and often produce legume-like fruits. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants that form nitrogen-fixing symbioses with bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing abilities. Its species is Acacia atrox, a specific type of acacia that is native to certain regions and is recognized for its unique characteristics within the genus.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia atrox is primarily native to New South Wales. It is commonly found in the dry inland regions of the state, particularly in the central and western parts. This species thrives in arid and semi-arid environments, often growing on rocky soils and in open woodlands. It is well adapted to the harsh climatic conditions of the region, including high temperatures and low rainfall. Acacia atrox plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia atrox was mainly introduced to control soil erosion and as a source of timber and fuelwood in arid and semi-arid regions. It is commonly found in disturbed sites such as roadsides, abandoned fields, and degraded lands. The plant thrives in poor soils and can tolerate high temperatures and low rainfall. Its rapid growth and ability to fix nitrogen make it an effective pioneer species in ecological restoration projects. However, its aggressive spread can lead to the displacement of native vegetation if not managed properly."
}
