{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia laeta",
    "plant_slug": "acacia-laeta",
    "plant_name_scientific": "acacia laeta",
    "intro": "Acacia laeta, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, zigzagging branches and small, feathery leaves that give it a distinctive appearance. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical inflorescences. Acacia laeta is drought-tolerant and thrives in well-drained soils, making it suitable for arid and semi-arid regions. It is also valued for its ornamental appeal and is often used in landscaping and revegetation projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia laeta is primarily native to the tropical regions of Africa, particularly in countries such as Kenya, Tanzania, and Uganda. It is commonly found in savannas and woodland areas where the climate is warm and semi-arid. This species thrives in well-drained soils and is often associated with rocky or sandy landscapes. Acacia laeta is also present in parts of southern Arabia and the Horn of Africa. Its distribution is closely linked to areas with seasonal rainfall patterns.",
    "distribution_introduced_art_desc": "Acacia laeta was mainly introduced to areas with a warm, dry climate and well-drained soils, often as an ornamental or for soil stabilization. It is commonly found in regions with Mediterranean or subtropical conditions, such as parts of California, Arizona, and southern Australia. The plant has been introduced to various parts of the world due to its hardy nature and ability to thrive in harsh environments. However, it can become invasive in some regions, outcompeting native vegetation. Its introduction has raised concerns about ecological impact in non-native habitats."
}
