{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia rubida",
    "plant_slug": "acacia-rubida",
    "plant_name_scientific": "acacia rubida",
    "intro": "Acacia rubida, commonly known as the red acacia, is a shrub native to the arid regions of the southwestern United States and northern Mexico. It is characterized by its slender, multi-branched stems and clusters of small, yellow flowers that bloom in spring. The plant produces flat, bean-like pods that contain seeds, which are dispersed by wind. Acacia rubida is adapted to drought conditions, with small, waxy leaves that reduce water loss. It plays an important role in stabilizing soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia rubida"
    },
    "taxonomy_art_desc": "Acacia rubida belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which comprises plants with flowers that typically have five petals and include legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and ability to thrive in arid environments. Its species is Acacia rubida, a specific type of acacia known for its red flowers and adapted to specific ecological conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia rubida is primarily native to New South Wales, Queensland, and Victoria. This species is commonly found in dry, open habitats such as grasslands, woodlands, and rocky outcrops. It thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. The plant is well adapted to arid and semi-arid environments, often growing in sandy or loamy soils. It plays an important ecological role by providing food and shelter for various native fauna.",
    "distribution_introduced_art_desc": "Acacia rubida was mainly introduced to control erosion and provide forage for livestock in arid and semi-arid regions. It is commonly found in disturbed soils and along roadsides due to its rapid growth and adaptability. The plant has become invasive in some areas, outcompeting native vegetation and altering local ecosystems. Its introduction has led to both ecological and economic challenges in regions where it has spread unchecked. Management strategies include mechanical removal and the use of herbicides to limit its spread."
}
