{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia whibleyana",
    "plant_slug": "acacia-whibleyana",
    "plant_name_scientific": "acacia whibleyana",
    "intro": "Acacia whibleyana, commonly known as the Whibley's acacia, is a shrub native to Western Australia. It is characterized by its slender, multi-branched stems and small, bipinnate leaves. The plant produces yellow globular flowers that bloom in late winter to early spring. It is adapted to arid environments and has a low water requirement. Acacia whibleyana is often found in sandy soils and is an important component of local ecosystems.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia whibleyana"
    },
    "taxonomy_art_desc": "Acacia whibleyana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and citrus. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by their pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-like flower clusters and often used in traditional medicine. Its species is Acacia whibleyana, a specific type of acacia found in certain regions of Australia, known for its unique ecological and botanical features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia whibleyana is primarily native to South Australia. It is found in the arid and semi-arid regions of the state, particularly in the southern and central parts. This plant typically grows in sandy or gravelly soils and is often found in open woodlands or shrublands. It is well adapted to the harsh climate of the region, with its small leaves and deep root system helping it survive in drought conditions. Due to its limited distribution, it is considered a rare and localized species within South Australia.",
    "distribution_introduced_art_desc": "Acacia whibleyana was mainly introduced to South Australia as part of ecological restoration and land stabilization efforts. It is commonly found in disturbed soils and along roadsides, where it helps prevent erosion. This plant is well adapted to arid and semi-arid environments, making it a useful species for revegetation projects. However, its rapid growth and ability to form dense thickets can sometimes lead to competitive exclusion of native species. Despite its benefits, its introduction has raised concerns about potential invasiveness in certain regions."
}
