{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leprosa var. uninervia",
    "plant_slug": "acacia-leprosa-var-uninervia",
    "plant_name_scientific": "acacia leprosa var. uninervia",
    "intro": "Acacia leprosa var. uninervia, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its narrow, compound leaves with a single vein, giving it a distinctive appearance. The plant produces yellow flowers in spikes, which bloom in spring and attract pollinators such as bees and birds. It thrives in well-drained soils and is often found in coastal and sandy environments. The species is valued for its ornamental qualities and is used in horticulture for its hardy nature and aesthetic appeal.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leprosa"
    },
    "taxonomy_art_desc": "Acacia leprosa var. uninervia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their simple, often primitive structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide variety of floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often associated with nitrogen-fixing symbiotic relationships. Its family is Fabaceae, commonly known as the legume family, which includes plants with distinctive pod fruits and often forms symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large genus of shrubs and trees commonly found in arid and semi-arid regions, known for their distinctive thorn-like structures and nitrogen-fixing abilities. Its species is Acacia leprosa, a specific type of acacia that is further divided into the variety uninervia, which is distinguished by its unique leaf and floral characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leprosa var. uninervia is primarily native to New South Wales and Victoria. This plant is commonly found in dry sclerophyll forests and open woodlands. It thrives in well-drained soils and is often associated with rocky or sandy substrates. The species is well adapted to the temperate climate of these regions. It plays an important role in local ecosystems by providing habitat and food for native wildlife.",
    "distribution_introduced_art_desc": "Acacia leprosa var. uninervia was mainly introduced to South Africa, particularly in the Eastern Cape and KwaZulu-Natal provinces. It was introduced for its ornamental value and potential for erosion control due to its hardy nature. The plant thrives in coastal and sandy soils, making it suitable for coastal dune stabilization. It has also been used in restoration projects to rehabilitate degraded landscapes. However, its invasive potential requires careful management to prevent ecological disruption."
}
