{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mildbraedii",
    "plant_slug": "acacia-mildbraedii",
    "plant_name_scientific": "acacia mildbraedii",
    "intro": "Acacia mildbraedii, commonly known as the Karoo acacia, is a shrub native to southern Africa. It is characterized by its slender, often spiny stems and small, bipinnate leaves. The plant produces yellow flowers in winter, which are clustered in cylindrical inflorescences. It is adapted to arid and semi-arid environments, showing drought tolerance. Its wood is hard and has been historically used for making tools and fencing.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mildbraedii is primarily native to the arid regions of southern Africa, particularly Namibia and South Africa. It thrives in sandy or gravelly soils and is commonly found in savanna and shrubland habitats. This species is well adapted to drought conditions and can survive in areas with low rainfall. It plays an important ecological role by providing shelter and food for local wildlife. Due to its hardy nature, it is also sometimes cultivated in semi-arid regions for its ornamental and practical uses.",
    "distribution_introduced_art_desc": "Acacia mildbraedii was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces, growing in sandy soils and coastal areas. This plant is often used for erosion control due to its hardy nature and ability to thrive in poor soil conditions. It is also valued for its ornamental qualities, with its distinctive foliage and yellow flowers. However, its spread has raised concerns about its potential impact on native plant communities."
}
