{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia clivicola",
    "plant_slug": "acacia-clivicola",
    "plant_name_scientific": "acacia clivicola",
    "intro": "Acacia clivicola, commonly known as the rock acacia, is a shrub native to southern Africa. It is characterized by its slender, often twisted stems and small, bipinnate leaves. The plant produces yellow flowers in globular clusters, which are followed by long, slender pods. It is well adapted to arid and semi-arid environments, thriving in rocky soils. Acacia clivicola plays a role in stabilizing soil and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia clivicola is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in rocky outcrops, cliffs, and dry, sandy soils. This plant thrives in arid and semi-arid environments, often growing in areas with limited rainfall. It is well adapted to harsh conditions, making it a resilient species in its native range. Acacia clivicola is an important component of the local vegetation and provides habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia clivicola was mainly introduced to stabilize soil and prevent erosion in areas with degraded land. It is commonly found in arid and semi-arid regions where it thrives in poor soils. This plant has been introduced to several parts of Africa, including Kenya and Somalia, for its hardy nature and ability to fix nitrogen. It is often used in reforestation projects due to its rapid growth and drought tolerance. However, its invasive potential has raised concerns in some regions where it outcompetes native vegetation."
}
