{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia heterophylla",
    "plant_slug": "acacia-heterophylla",
    "plant_name_scientific": "acacia heterophylla",
    "intro": "Acacia heterophylla, commonly known as the variable acacia, is a shrub or small tree native to southern Africa. It is characterized by its distinctive foliage, which varies in shape and size depending on environmental conditions. The plant produces yellow flowers in globular clusters, which are typically followed by flat, pod-like fruits. Its leaves are often bipinnate, with small, feathery leaflets. Acacia heterophylla is adapted to arid and semi-arid environments, making it a resilient species in harsh climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia heterophylla"
    },
    "taxonomy_art_desc": "Acacia heterophylla belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a diverse group of vascular plants, including ferns and horsetails, and is distinguished by the presence of jointed stems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and include legumes and related plants. Its family is Fabaceae, commonly known as the legume or bean family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as ornamental plants. Its species is Acacia heterophylla, a specific type of acacia known for its variable leaf shapes and found in arid environments, often used in ecological restoration.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Mauritius",
        "Réunion"
    ],
    "distribution_introduced": [
        "Madagascar"
    ],
    "distribution_native_art_desc": "Acacia heterophylla is primarily native to Mauritius and Réunion. This plant is found in the Mascarene Islands, specifically in these two regions. It thrives in coastal and limestone habitats, often growing in dry, sandy soils. Acacia heterophylla is an important component of the local flora and is adapted to the tropical climate of the area. Its distribution is limited to these islands, making it a unique and endemic species.",
    "distribution_introduced_art_desc": "Acacia heterophylla was mainly introduced to Madagascar. It is a species of acacia that has been brought to the island for various purposes, including ecological restoration and ornamental use. This plant is native to Australia and has been cultivated in Madagascar due to its adaptability to local conditions. It thrives in dry and semi-arid environments, making it suitable for reforestation projects. However, its introduction has raised concerns about its potential impact on native ecosystems."
}
