{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subtortuosa",
    "plant_slug": "acacia-subtortuosa",
    "plant_name_scientific": "acacia subtortuosa",
    "intro": "Acacia subtortuosa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It belongs to the Fabaceae family, which is characterized by its legume pods and nitrogen-fixing abilities. The plant features slender, often twisted branches and narrow, feathery leaves that are typically gray-green in color. Its flowers are yellow and appear in clustered spikes, attracting nectar-feeding birds and insects. Acacia subtortuosa is well adapted to dry, sandy soils and is often found in coastal and inland regions of southern Australia.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subtortuosa is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in rocky outcrops, savannas, and thornveld habitats where it thrives in dry conditions. This species is well adapted to withstand high temperatures and low rainfall, making it a characteristic plant of the Namib Desert and surrounding areas. It plays an important ecological role by providing shelter and food for various wildlife species. Due to its hardy nature, it is also sometimes cultivated in dryland regions for its ornamental and ecological value.",
    "distribution_introduced_art_desc": "Acacia subtortuosa was mainly introduced to areas with sandy or loamy soils and a semi-arid to arid climate. It thrives in regions with low rainfall and high temperatures, making it suitable for degraded or disturbed lands. This plant is commonly used for soil stabilization and as a source of timber and fuelwood. Its introduction has helped in reclaiming barren lands and promoting biodiversity in certain ecosystems. However, it requires careful management to prevent it from becoming invasive in non-native habitats."
}
