{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia riceana",
    "plant_slug": "acacia-riceana",
    "plant_name_scientific": "acacia riceana",
    "intro": "Acacia riceana, commonly known as the golden wattle, is a species of flowering plant native to Australia. It is characterized by its distinctive yellow floral spikes and compound leaves composed of multiple small, oval-shaped leaflets. The plant belongs to the Fabaceae family, which includes legumes, and it is known for its ability to fix nitrogen in the soil through symbiotic relationships with bacteria. Acacia riceana thrives in a variety of habitats, including woodlands and coastal areas, and is often used in landscaping due to its ornamental value. It plays an important ecological role by providing food and shelter for various native animals.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia riceana"
    },
    "taxonomy_art_desc": "Acacia riceana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive leaf structures and often used for timber or in traditional medicine. Its species is Acacia riceana, a specific type of acacia found in certain regions, known for its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Tasmania"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia riceana is primarily native to Tasmania. It is found in various regions across the island, including the central and western highlands. This plant typically grows in dry sclerophyll forests and open woodlands. It is well adapted to the cool, temperate climate of Tasmania. Its distribution is largely confined to the native flora of the island.",
    "distribution_introduced_art_desc": "Acacia riceana was mainly introduced to areas with tropical and subtropical climates where it can thrive in well-drained soils. It is commonly found in regions of Southeast Asia, including parts of Indonesia, Malaysia, and the Philippines. This plant is often cultivated for its ornamental value due to its distinctive foliage and ability to withstand drought conditions. It has also been introduced to some parts of Africa and the Caribbean as part of landscaping efforts. However, its spread has raised concerns about its potential to become an invasive species in certain ecosystems."
}
