{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subternata",
    "plant_slug": "acacia-subternata",
    "plant_name_scientific": "acacia subternata",
    "intro": "Acacia subternata, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its narrow, feathery leaves and produces yellow flowers in clusters. The plant is part of the Fabaceae family, which includes many legumes, and it has a symbiotic relationship with nitrogen-fixing bacteria. Acacia subternata is adapted to arid and semi-arid environments, making it a hardy species in dry climates. Its flowers are an important nectar source for various pollinators, including bees and birds.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia subternata"
    },
    "taxonomy_art_desc": "Acacia subternata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive features and often having a distinct morphology. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are often legumes and are recognized for their nitrogen-fixing abilities. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often symbiotic relationships with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acacia-like appearance and often found in arid environments. Its species is Acacia subternata, a specific type of acacia characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subternata is primarily native to the Northern Territory. It is commonly found in arid and semi-arid regions within this area. The plant thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. It plays an important role in the local ecosystem by providing food and shelter for various wildlife species. Acacia subternata is well adapted to the harsh climatic conditions of the Northern Territory.",
    "distribution_introduced_art_desc": "Acacia subternata was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soils and withstand high temperatures. It is commonly found in regions of Australia, particularly in the Northern Territory and Queensland. This plant is often used for its hardy nature and ability to provide shade and forage for livestock. Its introduction has sometimes led to ecological concerns due to its invasive potential in certain environments. However, it also plays a role in soil stabilization and habitat provision for native wildlife."
}
