{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia obliquifolia",
    "plant_slug": "acacia-obliquifolia",
    "plant_name_scientific": "acacia obliquifolia",
    "intro": "Acacia obliquifolia, commonly known as the slender wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often drooping branches and bipinnate leaves composed of numerous small, oval-shaped leaflets. The plant produces yellow flowers in globular clusters, which are followed by distinctive pod-like fruits. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia obliquifolia is valued for its ornamental appeal and its ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia obliquifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy or rocky soils and is commonly found in savanna and shrubland habitats. This species is well adapted to withstand high temperatures and low rainfall, making it a resilient component of the local ecosystem. It plays an important role in stabilizing soil and providing habitat for various wildlife species. Acacia obliquifolia is often used in traditional medicine and has cultural significance among indigenous communities in the region.",
    "distribution_introduced_art_desc": "Acacia obliquifolia was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and adaptability to various soil types. It has since spread beyond cultivated areas and is now considered a potential weed in some regions. The plant thrives in temperate climates and can establish itself in disturbed soils, making it invasive in certain environments. Its rapid growth and ability to form dense thickets pose a threat to native vegetation. Management strategies are being developed to control its spread and mitigate its impact on local ecosystems."
}
