{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia megacephala",
    "plant_slug": "acacia-megacephala",
    "plant_name_scientific": "acacia megacephala",
    "intro": "Acacia megacephala, commonly known as the giant globemallow, is a shrub or small tree native to Australia. It is characterized by its distinctive yellow flowers that appear in globular clusters, typically during the winter months. The plant has compound leaves with small, needle-like leaflets, and it produces long, slender pods that contain seeds. It thrives in well-drained soils and is often found in dry, open habitats. Acacia megacephala is valued for its ornamental appeal and is sometimes cultivated in gardens for its unique floral display.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia megacephala"
    },
    "taxonomy_art_desc": "Acacia megacephala belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and some primitive flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinct structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia megacephala, a specific type of acacia known for its unique features and ecological role in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia megacephala is primarily native to Western Australia. It is commonly found in the coastal and inland regions of the state. This plant thrives in sandy soils and is often seen in shrublands and open woodlands. It is well adapted to the arid and semi-arid climates of the region. Acacia megacephala plays an important role in the local ecosystem and is a characteristic species of the Western Australian flora.",
    "distribution_introduced_art_desc": "Acacia megacephala was mainly introduced to control soil erosion and for its potential use in land rehabilitation. It is commonly found in degraded lands and areas with poor soil quality due to its ability to thrive in harsh conditions. This plant is also valued for its nitrogen-fixing properties, which can improve soil fertility over time. Its introduction has been documented in several regions, including parts of Africa and Southeast Asia. However, it has also raised concerns about its potential invasiveness in certain ecosystems."
}
