{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drepanocarpa subsp. drepanocarpa",
    "plant_slug": "acacia-drepanocarpa-subsp-drepanocarpa",
    "plant_name_scientific": "acacia drepanocarpa subsp. drepanocarpa",
    "intro": "Acacia drepanocarpa subsp. drepanocarpa, commonly known as the narrow-leaf wattle, is a shrub or small tree native to southern Australia. It features slender, often multi-branched stems with phyllodes that are typically narrow and sickle-shaped. The plant produces yellow flowers in globular or cylindrical inflorescences, which appear during the autumn and winter seasons. Its leaves are modified into phyllodes, which are flattened and serve as the primary means of photosynthesis. The species is well adapted to dry, sandy soils and is often found in coastal and inland regions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia drepanocarpa"
    },
    "taxonomy_art_desc": "Acacia drepanocarpa subsp. drepanocarpa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex reproductive structures. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide variety of floral structures. Its order is Fabales, which includes plants that are often legumes and are known for their nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pods and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used for timber or in traditional medicine. Its species is Acacia drepanocarpa, a specific type of acacia known for its spreading habit and is commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drepanocarpa subsp. drepanocarpa is primarily native to Northern Territory, Queensland, and Western Australia. This subspecies is commonly found in arid and semi-arid regions across these areas. It thrives in sandy or loamy soils and is often associated with dry woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia drepanocarpa subsp. drepanocarpa was mainly introduced to areas with well-drained soils and a warm, temperate climate, often in regions where it is cultivated for its ornamental value or for soil stabilization. It is commonly found in coastal and inland regions of southern Australia, where it has been introduced as part of landscaping and revegetation projects. This subspecies is known for its distinctive fern-like foliage and yellow flowers, making it a popular choice for gardens and urban environments. However, it can become invasive in certain areas if not managed properly, posing a threat to native vegetation. Its introduction has been primarily driven by horticultural and ecological restoration efforts."
}
