{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia insolita subsp. efoliolata",
    "plant_slug": "acacia-insolita-subsp-efoliolata",
    "plant_name_scientific": "acacia insolita subsp. efoliolata",
    "intro": "Acacia insolita subsp. efoliolata, commonly known as the narrow-leaf wattle, is a shrub native to arid regions of Australia. It is characterized by its slender, often twisted stems and small, narrow phyllodes that are typically green with a slight whitish bloom. The plant produces yellow globular flower heads, which are clustered in dense, cylindrical spikes. It thrives in well-drained soils and is adapted to withstand drought and high temperatures. Acacia insolita subsp. efoliolata is often used in rehabilitation projects due to its hardy nature and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia insolita subsp. efoliolata is primarily native to the northern parts of Western Australia, specifically in the Pilbara and Gascoyne regions. It is commonly found in sandplain and laterite soils, often in open woodlands and shrublands. This subspecies thrives in arid and semi-arid environments, adapting well to low rainfall and high temperatures. It is a hardy shrub that plays an important ecological role in its native habitat. Its distribution is largely restricted to the western coastal areas of Western Australia.",
    "distribution_introduced_art_desc": "Acacia insolita subsp. efoliolata was mainly introduced to New Zealand. It was brought there during the 19th century as part of early botanical introductions. The plant is now considered an environmental weed in certain regions of the country. It thrives in coastal and disturbed areas, often outcompeting native vegetation. Its spread has led to increased management efforts to control its impact on local ecosystems."
}
