{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ogadensis",
    "plant_slug": "acacia-ogadensis",
    "plant_name_scientific": "acacia ogadensis",
    "intro": "Acacia ogadensis, commonly known as the Somali acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Arabian Peninsula. It is characterized by its slender, straight trunk and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow flowers that are clustered in cylindrical inflorescences, which attract pollinators such as bees and birds. Its seeds are encased in hard, woody pods that split open when mature, dispersing the seeds by wind. Acacia ogadensis is well adapted to drought conditions and plays a role in stabilizing sandy soils in its native habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ogadensis is primarily native to the Horn of Africa, including countries such as Somalia, Ethiopia, and Eritrea. It is commonly found in arid and semi-arid regions, thriving in sandy or rocky soils. This plant is well adapted to dry climates and can often be seen growing along coastal areas and in savanna ecosystems. It plays an important role in local environments by providing habitat and forage for wildlife. Acacia ogadensis is also known for its distinctive yellow flowers and thorny branches.",
    "distribution_introduced_art_desc": "Acacia ogadensis was mainly introduced to regions with arid or semi-arid climates, where it thrives in poor soil conditions. It is commonly found in countries across Africa, particularly in Ethiopia, Sudan, and Somalia. The plant is often used for its hardy nature, providing both ecological benefits and economic value through its wood and foliage. Due to its adaptability, it has been introduced to other parts of the world as a potential drought-resistant species. However, its spread can sometimes lead to ecological concerns if not managed properly."
}
