{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia undulifolia var. sertiformis",
    "plant_slug": "acacia-undulifolia-var-sertiformis",
    "plant_name_scientific": "acacia undulifolia var. sertiformis",
    "intro": "Acacia undulifolia var. sertiformis, commonly known as the wavy-leaf acacia, is a shrub native to southern Africa. It is characterized by its narrow, wavy-edged leaves that are often arranged in a spiral pattern along the stems. The plant produces yellow flowers in summer, which are clustered in cylindrical spikes. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Its foliage is used in traditional medicine, and it also serves as a source of nectar for pollinators.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia undulifolia var. sertiformis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. This variant is commonly found in sandy soils along the coastal fringes and inland dunes of these areas. It thrives in environments with low rainfall and high temperatures, adapting well to harsh desert conditions. The plant is often seen growing in scattered colonies, providing shelter and forage for local wildlife. Its distribution is closely tied to the availability of well-drained soils and minimal competition from other vegetation.",
    "distribution_introduced_art_desc": "Acacia undulifolia var. sertiformis was mainly introduced to New Zealand. It was brought there as part of early European colonization efforts. The plant was likely introduced for its ornamental value and potential use in land stabilization. It has since become naturalized in certain regions of the country. However, it is considered a potential environmental weed in some areas."
}
