{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cavenia",
    "plant_slug": "acacia-cavenia",
    "plant_name_scientific": "acacia cavenia",
    "intro": "Acacia cavenia, commonly known as the yellow wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow globular flowers that appear in late summer. The plant is part of the Fabaceae family, which includes legumes, and it has a symbiotic relationship with nitrogen-fixing bacteria. Acacia cavenia thrives in well-drained soils and is often found in coastal and sandy regions. Its flowers are an important food source for native pollinators and birds.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cavenia is primarily native to South America, specifically Argentina and Chile. It is commonly found in the arid and semi-arid regions of these countries. This plant thrives in sandy or rocky soils and is adapted to the dry climate of its native habitat. It is often seen in coastal areas and along the edges of deserts. Acacia cavenia plays an important ecological role in stabilizing soil and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia cavenia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often along the edges of forests and in disturbed habitats. The plant is known for its ability to thrive in arid and semi-arid conditions, making it adaptable to various environments. It has been used for its timber and as a source of fodder for livestock. However, its invasive potential has raised concerns in some areas where it competes with native vegetation."
}
