{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cordifolia",
    "plant_slug": "acacia-cordifolia",
    "plant_name_scientific": "acacia cordifolia",
    "intro": "Acacia cordifolia, commonly known as the heart-shaped acacia, is a species of flowering plant in the legume family. It is native to the arid and semi-arid regions of Australia, where it thrives in sandy or gravelly soils. The plant is characterized by its narrow, heart-shaped leaves and produces yellow, globular flower heads. Acacia cordifolia is drought-tolerant and has adapted to survive in harsh environmental conditions. Its wood is hard and strong, making it valuable for traditional uses by Indigenous communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cordifolia is primarily native to eastern Australia, including regions such as Queensland, New South Wales, and the Australian Capital Territory. It thrives in a variety of habitats, including dry forests, woodlands, and rocky outcrops. This species is commonly found in areas with well-drained soils and a temperate to subtropical climate. It plays an important ecological role by providing food and shelter for native wildlife. Due to its adaptability, it is also occasionally cultivated in other parts of the world for ornamental or practical purposes.",
    "distribution_introduced_art_desc": "Acacia cordifolia was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, often growing in disturbed or open habitats. The plant is known for its heart-shaped leaves and yellow flowers, which make it an attractive ornamental species. It has been used in horticulture for its aesthetic value and ability to thrive in coastal environments. However, its introduction has raised concerns about its potential to become invasive in some ecosystems."
}
