{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia evenulosa",
    "plant_slug": "acacia-evenulosa",
    "plant_name_scientific": "acacia evenulosa",
    "intro": "Acacia evenulosa, commonly known as the white wattle, is a shrub or small tree native to the arid regions of Australia. It is characterized by its feathery, bipinnate leaves that are often covered in fine, silky hairs. The plant produces yellow flowers in compact, globular clusters, which are typical of the Acacia genus. It is adapted to survive in dry, sandy soils and can withstand periods of drought. Acacia evenulosa plays an important role in stabilizing soil and providing habitat for various desert organisms.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia evenulosa"
    },
    "taxonomy_art_desc": "Acacia evenulosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological adaptations. Its order is Fabales, which consists of flowering plants that are typically legumes, often characterized by their ability to fix nitrogen through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of flowering plants commonly known as wattles, which are found mainly in Australia and have distinctive phyllodes instead of leaves. Its species is Acacia evenulosa, a specific type of acacia known for its unique morphological traits and ecological significance in its native habitat.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia evenulosa is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal and inland regions of the state. This species thrives in arid and semi-arid environments, often growing in open woodlands and heathlands. It is well adapted to the hot, dry climate typical of much of Western Australia. The plant plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia evenulosa was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in sandy soils along the coastal areas and in the fynbos biome. This plant is often used for erosion control due to its ability to thrive in harsh environmental conditions. However, its introduction has led to concerns about its potential invasiveness in some ecosystems. It is also valued for its ornamental qualities and is sometimes cultivated for its unique foliage."
}
