{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subcaerulea var. parvifolia",
    "plant_slug": "acacia-subcaerulea-var-parvifolia",
    "plant_name_scientific": "acacia subcaerulea var. parvifolia",
    "intro": "Acacia subcaerulea var. parvifolia, commonly known as the narrow-leaved wattle, is a shrub native to southern Africa. It features slender, upright stems and small, narrow, dark green leaves that are often clustered at the base of the branches. The plant produces yellow flowers in globular clusters, which appear in late winter to early spring. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. The species is valued for its ornamental appeal and ability to stabilize soil in degraded areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subcaerulea var. parvifolia is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in rocky outcrops, gravel plains, and sandy soils where it thrives in harsh, dry conditions. This variant is known for its small, narrow leaves and pale blue to white flowers, which bloom during the cooler months. It plays an important role in local ecosystems by providing habitat and food for various wildlife species. Due to its adaptability, it is often used in restoration projects in degraded landscapes across its native range.",
    "distribution_introduced_art_desc": "Acacia subcaerulea var. parvifolia was mainly introduced to South Africa, where it has been cultivated for its ornamental value and hardiness. It is commonly found in gardens and along roadsides due to its ability to thrive in various soil types and climates. The plant is also used in reclamation projects because of its drought tolerance and nitrogen-fixing capabilities. However, its introduction has raised concerns about its potential to become invasive in certain ecosystems. Despite these concerns, it remains a popular choice for landscaping in arid and semi-arid regions."
}
