{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia polypyrigenes",
    "plant_slug": "acacia-polypyrigenes",
    "plant_name_scientific": "acacia polypyrigenes",
    "intro": "Acacia polypyrigenes, commonly known as the flame acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often multi-branched stems and feathery, bipinnate leaves. The plant produces small, yellowish-green flowers arranged in spherical inflorescences, which are followed by flat, bean-like pods. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. The plant is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia polypyrigenes is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It thrives in sandy soils and is commonly found in savanna and woodland habitats. This species is well adapted to dry climates and can survive with minimal rainfall. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is largely restricted to the southwestern and central regions of the African continent.",
    "distribution_introduced_art_desc": "Acacia polypyrigenes was mainly introduced to areas with a warm, dry climate and well-drained soils, typically found in regions of southern Africa. It is commonly found in savannas and rocky outcrops where it thrives in full sun and low moisture conditions. This plant is often used for soil stabilization due to its deep root system and ability to tolerate drought. It has been introduced to parts of Australia and the United States as a potential ornamental and erosion control plant. However, its invasive potential in non-native regions remains a topic of ongoing study and management."
}
