{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mollissima",
    "plant_slug": "acacia-mollissima",
    "plant_name_scientific": "acacia mollissima",
    "intro": "Acacia mollissima, commonly known as the silky acacia, is a shrub or small tree native to southern Africa. It is characterized by its dense, feathery foliage composed of small, glandular, and silky-haired leaves. The plant produces yellow, globular inflorescences that bloom during the rainy season, attracting various pollinators. Its seeds are encased in long, thin pods that split open to release the seeds. Acacia mollissima is often used in traditional medicine and is also valued for its ornamental appeal.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mollissima is primarily native to southern Africa, particularly South Africa. It is found in regions such as the Western Cape, Eastern Cape, and parts of KwaZulu-Natal. This species thrives in sandy or gravelly soils and is often found in coastal and mountainous areas. It is commonly associated with fynbos vegetation, which is characteristic of the region's Mediterranean climate. The plant is well adapted to the dry, sunny conditions of its native habitat.",
    "distribution_introduced_art_desc": "Acacia mollissima was mainly introduced to South Africa, where it has become an invasive species in certain regions. It is commonly found in coastal and inland areas, particularly in the Western and Eastern Cape provinces. The plant thrives in a variety of soil types but prefers well-drained soils and full sun exposure. Its rapid growth and ability to form dense thickets have led to its classification as a weed in some areas. Due to its adaptability, it has spread beyond its original introduction range, posing a threat to native vegetation."
}
