{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia conferta",
    "plant_slug": "acacia-conferta",
    "plant_name_scientific": "acacia conferta",
    "intro": "Acacia conferta, commonly known as the coastal acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often twisted branches and bipinnate leaves that are reduced to small, scale-like structures. The plant produces yellow globular flowers that are clustered in dense heads, which bloom from late winter to early spring. Acacia conferta is adapted to coastal environments, tolerating salt spray and sandy soils. It plays an important role in stabilizing dunes and providing habitat for various wildlife species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia conferta"
    },
    "taxonomy_art_desc": "Acacia conferta belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and a specific arrangement of stamens. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often used in traditional medicine. Its species is Acacia conferta, a specific type of acacia found in certain regions, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia conferta is primarily native to New South Wales and Queensland in Australia. It is commonly found in dry sclerophyll forests and woodlands. This species thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Acacia conferta is often associated with rocky soils and can be found along coastal areas. Its distribution is limited to specific ecological zones within these two Australian states.",
    "distribution_introduced_art_desc": "Acacia conferta was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Western Cape and the Eastern Cape provinces. The plant thrives in coastal and sandy soils, often growing along the edges of forests and in open grasslands. Due to its rapid growth and adaptability, it has spread beyond its original introduction sites. However, it is not considered invasive in most areas where it is established."
}
