{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dubia",
    "plant_slug": "acacia-dubia",
    "plant_name_scientific": "acacia dubia",
    "intro": "Acacia dubia, commonly known as the ghost acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Middle East. It is characterized by its slender, often twisted branches and small, feathery leaves that help reduce water loss in its harsh environment. The plant produces yellow flowers in compact clusters, which attract pollinators such as bees and birds. Its seeds are enclosed in woody pods and are dispersed by wind, contributing to its ability to colonize disturbed soils. Acacia dubia is well adapted to survive in low-water conditions, making it a resilient species in desert ecosystems.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dubia is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and shrublands, often in areas with low rainfall. This species is well adapted to harsh environmental conditions, making it a resilient component of the local flora. It plays an important ecological role by providing habitat and food for various wildlife species. Acacia dubia is also sometimes cultivated in dryland areas for its hardy nature and ornamental value.",
    "distribution_introduced_art_desc": "Acacia dubia was mainly introduced to areas with arid or semi-arid climates where it can thrive in poor soils. It is commonly found in regions of Australia, parts of Africa, and some areas of the Middle East. This plant is often used for its hardy nature and ability to provide shade and forage for livestock. Due to its invasive potential, it is sometimes considered a weed in certain ecosystems. Its distribution is largely driven by human activity and climate suitability."
}
