{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dorsenna",
    "plant_slug": "acacia-dorsenna",
    "plant_name_scientific": "acacia dorsenna",
    "intro": "Acacia dorsenna, commonly known as the slender wattle, is a shrub native to Australia. It is characterized by its slender, zigzagging branches and small, phyllodes that are typically narrow and pointed. The plant produces yellow flowers in globular or cylindrical clusters, which appear during the warmer months. Acacia dorsenna is adapted to arid and semi-arid environments, showing drought tolerance and efficient water use. Its ecological role includes providing habitat and food for various native animals and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dorsenna"
    },
    "taxonomy_art_desc": "Acacia dorsenna belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped acacia pods and often used in traditional medicine. Its species is Acacia dorsenna, a specific type of acacia found in certain regions, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dorsenna is primarily native to Western Australia. It is commonly found in the region's arid and semi-arid zones. This plant thrives in sandy soils and is often seen in open woodlands and shrublands. It plays an important role in the local ecosystem by providing habitat and food for various wildlife species. Its distribution is largely restricted to the western parts of the state.",
    "distribution_introduced_art_desc": "Acacia dorsenna was mainly introduced to areas with arid or semi-arid climates, where it can thrive in well-drained soils. It is commonly found in regions with low rainfall and high temperatures, such as parts of Australia and the southwestern United States. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. It has also been introduced as an ornamental plant in some parts of the world for its attractive foliage and resilience. However, in certain regions, it has become invasive, outcompeting native vegetation."
}
