{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia elephantina",
    "plant_slug": "acacia-elephantina",
    "plant_name_scientific": "acacia elephantina",
    "intro": "Acacia elephantina, commonly known as the umbrella thorn acacia, is a shrub or small tree native to arid regions of Africa. It is characterized by its dense, umbrella-like crown of long, thin branches that provide shade and shelter. The plant has small, feathery leaves and produces yellow flowers that attract various pollinators. Its thorny stems and branches make it well adapted to harsh, dry environments. Acacia elephantina is also known for its ability to fix nitrogen in the soil, improving soil fertility in degraded areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia elephantina is primarily native to the arid and semi-arid regions of Africa, particularly in countries such as Sudan, Eritrea, Ethiopia, and Somalia. It thrives in sandy or rocky soils and is commonly found in savannas and shrublands. This plant is well adapted to hot, dry climates and can tolerate poor soil conditions. It plays an important ecological role by providing shelter and food for various wildlife species. Acacia elephantina is also sometimes cultivated in dryland areas for its hardy nature and ornamental value.",
    "distribution_introduced_art_desc": "Acacia elephantina was mainly introduced to South Africa, where it has become an invasive species. It was initially brought in for its potential use in soil stabilization and as a source of timber. However, it has since spread rapidly, outcompeting native vegetation and altering local ecosystems. Its introduction has led to concerns about biodiversity loss and habitat degradation. Efforts are now underway to manage its spread and mitigate its ecological impact."
}
