{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia crassiuscula",
    "plant_slug": "acacia-crassiuscula",
    "plant_name_scientific": "acacia crassiuscula",
    "intro": "Acacia crassiuscula, commonly known as the small-flowered wattle, is a shrub native to Australia. It is characterized by its small, yellow flowers that bloom in globular clusters, typically in spring. The plant has phyllodes, which are flattened leaf stalks that serve as the primary photosynthetic structures. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia crassiuscula is a hardy species that is well adapted to the arid and semi-arid regions of southern Australia.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia crassiuscula"
    },
    "taxonomy_art_desc": "Acacia crassiuscula belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and often producing spores. Its subclass is Magnoliidae, a group of flowering plants that typically have a well-developed vascular system and show a wide range of morphological diversity. Its order is Fabales, which includes plants such as legumes and vetches, known for their symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees found mainly in Australia and Africa, known for their distinctive acicular leaves and floral structures. Its species is Acacia crassiuscula, a small shrub native to Australia, recognized for its dense foliage and small yellow flowers.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia crassiuscula is primarily native to Western Australia. It is commonly found in the southern and western regions of the state. This plant typically grows in dry, sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the arid and semi-arid climates of its native range. Acacia crassiuscula plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia crassiuscula was mainly introduced to Australia as a potential soil stabilizer and for its ornamental value. It was widely planted along roadsides and in urban areas due to its hardy nature and ability to thrive in poor soils. However, its rapid spread has led to it becoming an invasive species in some regions, outcompeting native flora. Despite its ecological impact, it is still used in reclamation projects where its fast growth is beneficial. Its introduction highlights the challenges of managing non-native plants in ecosystems."
}
