{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia mucronata var. linearis",
    "plant_slug": "acacia-mucronata-var-linearis",
    "plant_name_scientific": "acacia mucronata var. linearis",
    "intro": "Acacia mucronata var. linearis, commonly known as the narrow-leaf acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It features narrow, linear leaves that are often arranged in opposite pairs, giving it a distinctive appearance. The plant produces yellow flowers in compact spikes, which are typically followed by flat, pod-like fruits containing seeds. It is adapted to arid and semi-arid environments, making it drought-tolerant and suitable for dryland restoration. The species is also valued for its ability to fix nitrogen, improving soil fertility in degraded areas.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia mucronata var. linearis is primarily native to northern Australia, including parts of Queensland and the Northern Territory. This variety is typically found in arid and semi-arid regions, often growing in sandy soils. It is commonly associated with mulga woodlands and open shrublands. The plant is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role in its native habitat by providing shelter and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia mucronata var. linearis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is often found in coastal areas and sandy soils, thriving in the warm, dry climate. This plant is considered an invasive species in some parts of its range due to its rapid growth and ability to outcompete native vegetation. It is commonly used for erosion control and as a source of timber and fuelwood. However, its spread can pose a threat to local ecosystems if not managed properly."
}
