{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verticillata subsp. verticillata",
    "plant_slug": "acacia-verticillata-subsp-verticillata",
    "plant_name_scientific": "acacia verticillata subsp. verticillata",
    "intro": "Acacia verticillata subsp. verticillata, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, zigzagging stems and small, fern-like leaves that are arranged in whorls of three to five. The plant produces yellow flowers in late summer, which are clustered in cylindrical spikes. It thrives in well-drained soils and is often found in coastal and sandy habitats. This subspecies is valued for its ornamental appeal and its role in stabilizing sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia verticillata"
    },
    "taxonomy_art_desc": "Acacia verticillata subsp. verticillata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their primitive features and vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Fabales, which consists of flowering plants that are typically legumes and often have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and often used in traditional medicine and as sources of timber. Its species is Acacia verticillata, a specific type of acacia known for its clustered leaves and is commonly found in arid and semi-arid regions of Australia.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [
        "California",
        "Colombia",
        "India",
        "Madeira",
        "New Zealand North",
        "New Zealand South"
    ],
    "distribution_native_art_desc": "Acacia verticillata subsp. verticillata is primarily native to New South Wales, Tasmania, and Victoria. This subspecies is commonly found in sandy soils across these regions. It thrives in coastal and inland areas with a temperate climate. The plant is often seen in open woodlands and heathlands. Its distribution is largely restricted to the southeastern part of Australia.",
    "distribution_introduced_art_desc": "Acacia verticillata subsp. verticillata was mainly introduced to California, Colombia, India, Madeira, New Zealand North, and New Zealand South. It has been established in these regions, often in disturbed or cultivated areas. The plant is known for its adaptability to various soil types and climate conditions. It is commonly found in coastal and inland regions, thriving in sunny environments. Its introduction has led to its spread in some areas, sometimes becoming invasive."
}
