{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia penninervis var. lanceolata",
    "plant_slug": "acacia-penninervis-var-lanceolata",
    "plant_name_scientific": "acacia penninervis var. lanceolata",
    "intro": "Acacia penninervis var. lanceolata, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It features feathery, bipinnate leaves that are narrow and lance-shaped, giving it a distinctive appearance. The plant produces yellow flowers in late winter to early spring, which are arranged in cylindrical spikes. It is adapted to dry, sandy soils and is often found in coastal and inland regions. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its hardiness and visual interest.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia penninervis var. lanceolata is primarily native to the arid and semi-arid regions of northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It thrives in sandy soils and is commonly found in coastal dunes and inland shrublands. This variant is adapted to dry climates and is often used as a source of timber and forage by local wildlife. It plays an important ecological role in stabilizing sand dunes and providing habitat for various species. The plant is also known for its distinctive leaf structure and ability to withstand extreme environmental conditions.",
    "distribution_introduced_art_desc": "Acacia penninervis var. lanceolata was mainly introduced to control soil erosion and for its hardy nature in arid and semi-arid environments. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant has also been introduced for ornamental purposes because of its distinctive foliage and drought tolerance. However, its spread can sometimes lead to ecological imbalances in native ecosystems. It is important to monitor its distribution to prevent potential invasiveness in non-native regions."
}
