{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia megaladena var. garrettii",
    "plant_slug": "acacia-megaladena-var-garrettii",
    "plant_name_scientific": "acacia megaladena var. garrettii",
    "intro": "Acacia megaladena var. garrettii, commonly known as the yellow wattle, is a shrub native to Australia. It is characterized by its feathery, yellow-green foliage and produces small, yellow flowers in clusters. The plant is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. It thrives in well-drained soils and is often found in coastal and sandy environments. This variety is prized for its ornamental value and is used in landscaping and restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia megaladena var. garrettii is primarily native to the tropical regions of northern Australia, including the Northern Territory and parts of Queensland. This variant is commonly found in savanna woodlands and open forests where the climate is warm and relatively dry. It thrives in well-drained soils and is often associated with other drought-tolerant plant species. The plant is well adapted to the harsh environmental conditions of its native habitat. Its distribution is largely limited to specific ecological zones within its native range.",
    "distribution_introduced_art_desc": "Acacia megaladena var. garrettii was mainly introduced to enhance soil stability and provide forage in degraded or arid landscapes. It is commonly found in areas with low rainfall and poor soil conditions due to its drought tolerance and nitrogen-fixing ability. This variety is often used in reforestation and land rehabilitation projects. Its introduction has helped in preventing soil erosion and supporting livestock in semi-arid regions. However, it requires careful management to prevent it from becoming invasive in non-target environments."
}
