{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia decurrens var. dealbata",
    "plant_slug": "acacia-decurrens-var-dealbata",
    "plant_name_scientific": "acacia decurrens var. dealbata",
    "intro": "Acacia decurrens var. dealbata, commonly known as the white-flowered wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often multi-branched stems and narrow, feather-like leaves. The plant produces bright yellow flowers in late summer, which are clustered in cylindrical spikes. It thrives in well-drained soils and is often found in coastal and sandy environments. The species is valued for its ornamental appeal and is sometimes cultivated in gardens for its attractive foliage and floral display.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia decurrens var. dealbata is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in arid and semi-arid regions, particularly in savannas and rocky outcrops. This variant is adapted to dry climates and thrives in well-drained soils. It is often used in traditional medicine and as a source of timber and fuelwood. Its distribution is largely restricted to the subcontinent of southern Africa.",
    "distribution_introduced_art_desc": "Acacia decurrens var. dealbata was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy soils. This plant is often used for dune stabilization due to its extensive root system. However, it has also been reported to spread aggressively, potentially displacing native vegetation. Its introduction has raised concerns about its impact on local ecosystems."
}
