{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia warramaba",
    "plant_slug": "acacia-warramaba",
    "plant_name_scientific": "acacia warramaba",
    "intro": "Acacia warramaba, commonly known as the Warramaba acacia, is a flowering plant native to the arid regions of Western Australia. It is a shrub or small tree that typically grows to a height of 1-3 meters, characterized by its dense, thorny branches. The plant produces yellow flowers in globular clusters, which are often visited by nectar-feeding birds and insects. Its leaves are bipinnate, consisting of multiple small, oval-shaped leaflets. Acacia warramaba is well adapted to dry conditions, with deep roots and a capacity to fix atmospheric nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia warramaba"
    },
    "taxonomy_art_desc": "Acacia warramaba belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with specialized structures for pollination. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and ability to thrive in arid environments. Its species is Acacia warramaba, a specific type of acacia native to Australia, recognized for its unique ecological role and adaptations to its environment.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia warramaba is primarily native to Western Australia. It is found in the southern and central regions of the state, particularly in the wheatbelt area. This plant thrives in dry, sandy soils and is commonly found in open woodlands and grasslands. It is well adapted to the arid and semi-arid climates of its native range. Acacia warramaba plays an important ecological role in its habitat by providing food and shelter for various native animals.",
    "distribution_introduced_art_desc": "Acacia warramaba was mainly introduced to South Australia for its potential in soil stabilization and as a source of timber. It is commonly found in disturbed areas such as roadsides, abandoned agricultural land, and along creek lines. The plant thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid regions. It has become naturalized in several parts of the state, often outcompeting native vegetation. Due to its rapid growth and spread, it is considered a weed in some areas, requiring management to prevent ecological harm."
}
