{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia californica subsp. pringlei",
    "plant_slug": "acacia-californica-subsp-pringlei",
    "plant_name_scientific": "acacia californica subsp. pringlei",
    "intro": "Acacia californica subsp. pringlei, commonly known as the California acacia, is a shrub native to coastal regions of California and Baja California. It is characterized by its slender, often multi-branched stems and bipinnate leaves composed of numerous small, needle-like leaflets. The plant produces yellow to golden-green globular flower heads, which are clustered in dense, spherical inflorescences. It thrives in well-drained soils and is adapted to coastal climates with mild, wet winters and dry summers. This subspecies is often used in landscaping due to its drought tolerance and ornamental value.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia californica subsp. pringlei is primarily native to coastal areas of southern California, including the counties of San Luis Obispo, Santa Barbara, and Ventura. This subspecies thrives in a Mediterranean climate characterized by mild, wet winters and hot, dry summers. It is commonly found in open woodlands, chaparral, and along coastal bluffs. The plant is adapted to well-drained soils and is often associated with other coastal scrub vegetation. It plays an important ecological role by providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia californica subsp. pringlei was mainly introduced to specific regions of California, particularly in the coastal and inland valleys. It is commonly found in disturbed soils and open habitats such as roadsides, pastures, and disturbed areas. This subspecies is often associated with Mediterranean climates, characterized by dry summers and wet winters. Its introduction has led to its establishment in various ecological settings, sometimes becoming invasive in certain areas. Due to its adaptability, it has been widely planted for ornamental purposes and erosion control."
}
