{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hassleri",
    "plant_slug": "acacia-hassleri",
    "plant_name_scientific": "acacia hassleri",
    "intro": "Acacia hassleri, commonly known as the silver acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, zigzagging stems and small, pale green leaves that are often covered in a fine layer of white wax. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical inflorescences. It is well adapted to drought conditions, storing water in its succulent stems. Acacia hassleri plays an important role in its ecosystem, providing habitat and food for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hassleri is primarily native to the southwestern United States and northern Mexico. It is commonly found in regions such as Arizona, New Mexico, and parts of Texas. This plant thrives in arid and semi-arid environments, often growing in rocky soils and desert landscapes. It is well adapted to the harsh conditions of its native range, including high temperatures and low rainfall. Acacia hassleri is an important component of the local flora in these regions.",
    "distribution_introduced_art_desc": "Acacia hassleri was mainly introduced to the southwestern United States and northern Mexico. It was brought in for its ornamental value and ability to thrive in arid conditions. The plant is commonly found in disturbed soils and along roadsides in these regions. It has become naturalized in some areas, leading to concerns about its invasive potential. Its distribution is largely limited to regions with a Mediterranean climate."
}
