{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia drummondii var. candolleana",
    "plant_slug": "acacia-drummondii-var-candolleana",
    "plant_name_scientific": "acacia drummondii var. candolleana",
    "intro": "Acacia drummondii var. candolleana, commonly known as the Drummond's acacia, is a shrub native to the arid regions of the southwestern United States and northwestern Mexico. It is characterized by its slender, erect stems and bipinnate leaves that are often covered in fine hairs. The plant produces yellowish-green flowers in clusters, which are typically borne in the axils of the leaves. It is adapted to hot, dry climates and has deep root systems to access groundwater. This variety is valued for its ornamental appeal and is often used in xeriscaping due to its drought tolerance.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia drummondii var. candolleana is primarily native to the arid and semi-arid regions of western and central Australia. It is commonly found in areas such as the Northern Territory, South Australia, and Western Australia. This variant thrives in sandy or rocky soils and is often associated with dry shrublands and grasslands. It is well adapted to the harsh climatic conditions of its native habitat. The plant plays an important ecological role in providing shelter and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia drummondii var. candolleana was mainly introduced to areas with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Australia, particularly in the Northern Territory and Western Australia. This plant is often used for land stabilization due to its extensive root system and ability to tolerate harsh environmental conditions. It has also been introduced to other parts of the world as an ornamental or for ecological restoration purposes. However, its spread can sometimes lead to invasion of native plant communities if not managed properly."
}
