{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia donnaiensis",
    "plant_slug": "acacia-donnaiensis",
    "plant_name_scientific": "acacia donnaiensis",
    "intro": "Acacia donnaiensis, commonly known as the golden wattle, is a flowering plant native to Australia. It is characterized by its striking yellow flowers and bipinnate leaves. The plant belongs to the legume family, Fabaceae, and is known for its ability to fix nitrogen in the soil. It thrives in a variety of soil types and is often found in open woodlands and grasslands. Acacia donnaiensis is not only ecologically important but also holds cultural significance in Australian history.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia donnaiensis is primarily native to the island of Socotra, which is located in the Arabian Sea. It is found in the dry, rocky habitats of Socotra, where it thrives in arid and semi-arid conditions. This species is endemic to Socotra, meaning it is not found naturally anywhere else in the world. It is often found growing on limestone substrates and in coastal areas. Due to its unique appearance and restricted distribution, it is considered a rare and valuable component of Socotra's flora.",
    "distribution_introduced_art_desc": "Acacia donnaiensis was mainly introduced to areas with a warm, dry climate and well-drained soils, typically found in regions of Southeast Asia and parts of Australia. It is commonly found in disturbed habitats such as roadsides, abandoned fields, and along riverbanks. This species has shown a high capacity for spreading through seed dispersal by wind and animals. Its introduction has led to concerns about its potential invasiveness in native ecosystems. Due to its rapid growth and adaptability, it is now considered a weed in some regions where it has been introduced."
}
