{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia spirorbis subsp. solandri",
    "plant_slug": "acacia-spirorbis-subsp-solandri",
    "plant_name_scientific": "acacia spirorbis subsp. solandri",
    "intro": "Acacia spirorbis subsp. solandri, commonly known as the golden wattle, is a shrub native to Australia. It is characterized by its feathery, bipinnate leaves and clusters of yellow flowers. The plant belongs to the Fabaceae family, which is known for its nitrogen-fixing capabilities. It thrives in well-drained soils and is often found in coastal and inland regions. The subspecies solandri is distinguished by its more compact growth and yellow floral spikes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia spirorbis"
    },
    "taxonomy_art_desc": "Acacia spirorbis subsp. solandri belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some algae, characterized by their complex reproductive structures and vascular systems. Its class is Equisetopsida, which comprises ferns and their allies, known for their primitive vascular systems and often spore-producing reproductive methods. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient lineages with a wide range of morphological diversity. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and the ability to fix nitrogen through symbiotic bacteria. Its species is Acacia spirorbis, a specific form within the Acacia genus, distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New Guinea",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia spirorbis subsp. solandri is primarily native to New Guinea and Queensland. This subspecies is found in the tropical and subtropical regions of these areas. It typically grows in open habitats such as savannas, woodland edges, and disturbed sites. The plant is well adapted to the warm and humid climate of its native range. It plays an important ecological role in supporting local wildlife and maintaining soil stability.",
    "distribution_introduced_art_desc": "Acacia spirorbis subsp. solandri was mainly introduced to New Zealand. It was brought there during the 19th century as part of the introduction of exotic plant species for ornamental and horticultural purposes. This subspecies is commonly found in coastal and lowland areas, particularly in the northern parts of the country. It has since become naturalized and is now part of the local flora in many regions. However, it is not considered invasive and does not pose a significant ecological threat."
}
