{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dealbata",
    "plant_slug": "acacia-dealbata",
    "plant_name_scientific": "acacia dealbata",
    "intro": "Acacia dealbata, commonly known as the silver wattle, is a flowering plant native to Australia. It is characterized by its distinctive bipinnate leaves, which are covered in a fine, silvery-white powder, giving it its common name. The plant produces yellow globular flower heads that appear in late autumn to early spring. It thrives in a variety of soil types but prefers well-drained soils and full sun exposure. Acacia dealbata is often cultivated for its ornamental value and is also used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dealbata"
    },
    "taxonomy_art_desc": "Acacia dealbata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and showy petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive umbrella-like flower clusters and often used in traditional medicine. Its species is Acacia dealbata, a specific type of acacia native to Australia, known for its white flowers and ability to thrive in arid environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Tasmania",
        "Victoria"
    ],
    "distribution_introduced": [
        "Albania",
        "Amsterdam-St.Paul Is.",
        "Argentina Northeast",
        "Assam",
        "Azores",
        "Brazil South",
        "California",
        "Canary Is.",
        "Cape Provinces",
        "Chile Central",
        "Chile South",
        "China South-Central",
        "China Southeast",
        "Costa Rica",
        "Desventurados Is.",
        "DR Congo",
        "East Himalaya",
        "Easter Is.",
        "Ecuador",
        "Eswatini",
        "Ethiopia",
        "France",
        "Free State",
        "Guatemala",
        "Haiti",
        "India",
        "Italy",
        "Jamaica",
        "Juan Fernández Is.",
        "KwaZulu-Natal",
        "Lesotho",
        "Madagascar",
        "Madeira",
        "Mauritius",
        "Mozambique",
        "Myanmar",
        "Nepal",
        "New Zealand North",
        "New Zealand South",
        "Norfolk Is.",
        "Northern Provinces",
        "NW. Balkan Pen.",
        "Oregon",
        "Palestine",
        "Portugal",
        "Romania",
        "Réunion",
        "Sardegna",
        "Sicilia",
        "South Australia",
        "Spain",
        "Sri Lanka",
        "Taiwan",
        "Tanzania",
        "Transcaucasus",
        "Uganda",
        "Uruguay",
        "West Himalaya",
        "Zimbabwe"
    ],
    "distribution_native_art_desc": "Acacia dealbata is primarily native to New South Wales, Tasmania, and Victoria. This species is commonly found in coastal areas and open forests within these regions. It thrives in well-drained soils and is often associated with sandy or gravelly habitats. The plant is known for its distinctive white to pale yellow flowers and is a common sight in the Australian landscape. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia dealbata was mainly introduced to a wide range of regions across the globe, including Albania, Amsterdam-St. Paul Is., Argentina Northeast, Assam, Azores, Brazil South, California, Canary Is., Cape Provinces, Chile Central, Chile South, China South-Central, China Southeast, Costa Rica, Desventurados Is., DR Congo, East Himalaya, Easter Is., Ecuador, Eswatini, Ethiopia, France, Free State, Guatemala, Haiti, India, Italy, Jamaica, Juan Fernández Is., KwaZulu-Natal, Lesotho, Madagascar, Madeira, Mauritius, Mozambique, Myanmar, Nepal, New Zealand North, New Zealand South, Norfolk Is., Northern Provinces, NW. Balkan Pen., Oregon, Palestine, Portugal, Romania, Réunion, Sardegna, Sicilia, South Australia, Spain, Sri Lanka, Taiwan, Tanzania, Transcaucasus, Uganda, Uruguay, West Himalaya, and Zimbabwe. It has been widely cultivated for its ornamental value and ecological benefits. The plant's introduction has often been for landscaping purposes, particularly in temperate and subtropical regions. However, in some areas, it has become invasive, outcompeting native vegetation. Its distribution highlights its adaptability to diverse climates and environments."
}
