{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fluminense",
    "plant_slug": "acacia-fluminense",
    "plant_name_scientific": "acacia fluminense",
    "intro": "Acacia fluminense, commonly known as the Brazilian wattle, is a shrub or small tree native to South America, particularly Brazil. It belongs to the legume family, Fabaceae, and is characterized by its compound leaves and yellow flowers. The plant has a deep root system that helps prevent soil erosion, making it ecologically significant in its habitat. It is also valued for its hard wood and is sometimes used in traditional medicine. Acacia fluminense thrives in tropical and subtropical climates, often found in coastal areas and riverbanks.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fluminense is primarily native to Brazil, specifically the Atlantic Forest biome. It is commonly found in the states of Rio de Janeiro, Espírito Santo, and São Paulo. This plant thrives in humid, tropical climates with well-drained soils. It is often seen in coastal areas and near rivers. Acacia fluminense is an important species for both ecological and traditional uses in the region.",
    "distribution_introduced_art_desc": "Acacia fluminense was mainly introduced to stabilize soil and prevent erosion in areas with degraded land. It is commonly used in reforestation projects due to its fast growth and ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its introduction has helped in restoring degraded ecosystems in tropical and subtropical regions. However, it has raised concerns about its potential to become invasive in certain environments."
}
