{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia verticillata var. riceana",
    "plant_slug": "acacia-verticillata-var-riceana",
    "plant_name_scientific": "acacia verticillata var. riceana",
    "intro": "Acacia verticillata var. riceana, commonly known as the Ricean wattle, is a shrub native to arid and semi-arid regions of Australia. It is characterized by its distinctive, feathery, trifoliate leaves that are often covered in fine hairs. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, spherical inflorescences. It is well adapted to drought conditions, with a deep root system that allows it to survive in poor soil. The plant is also valued for its ornamental appeal and is sometimes used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia verticillata var. riceana is primarily native to northern Australia, including parts of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid regions, particularly in sandy soils. This variety is well adapted to harsh environmental conditions, such as high temperatures and low rainfall. It often grows in shrublands and open woodlands, forming dense thickets. Its distribution is closely associated with the inland regions of the continent where it plays a significant ecological role.",
    "distribution_introduced_art_desc": "Acacia verticillata var. riceana was mainly introduced to South Africa. It was introduced to the region as an ornamental plant due to its attractive foliage and adaptability to various soil types. The plant has since spread into natural habitats, posing a threat to local ecosystems. It is commonly found in coastal areas and along roadsides. Its rapid growth and ability to thrive in disturbed environments have made it a potential invasive species in some regions."
}
