{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia amyctica",
    "plant_slug": "acacia-amyctica",
    "plant_name_scientific": "acacia amyctica",
    "intro": "Acacia amyctica, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its slender, twisted branches and small, feathery leaves that give it a distinctive appearance. The plant produces yellow flowers in late winter to early spring, which are clustered in spherical or cylindrical heads. Its seeds are encased in a hard, woody pod, and the plant is adapted to grow in dry, sandy soils. Acacia amyctica is often used in landscaping for its ornamental value and is also valued for its ecological role in supporting native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia amyctica"
    },
    "taxonomy_art_desc": "Acacia amyctica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of complex structures such as roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with a single pistil and stamens in multiples of two or five. Its family is Fabaceae, commonly known as the legume family, which is characterized by the distinctive pod-like fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their acorn-like seed pods and often used for timber or as ornamental plants. Its species is Acacia amyctica, a specific type of acacia found in certain regions, noted for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia amyctica is primarily native to Western Australia. It is commonly found in the southern regions of the state, including the Fitzgerald River National Park and the Avon-Ord River region. This species thrives in dry, sandy soils and is often associated with open woodlands and shrublands. It is well adapted to the arid and semi-arid climates of its native habitat. The plant plays an important ecological role in supporting local wildlife and maintaining biodiversity in these ecosystems.",
    "distribution_introduced_art_desc": "Acacia amyctica was mainly introduced to areas with suitable climatic conditions, including regions with warm, dry climates and well-drained soils. It is commonly found in arid and semi-arid environments, often thriving in disturbed soils and along roadsides. The plant has been introduced to several parts of the world, including Australia, South Africa, and the United States, where it has established itself in native ecosystems. Due to its rapid growth and ability to spread through seeds, it has become an invasive species in some regions. Its introduction has raised concerns about its impact on local biodiversity and ecological balance."
}
