{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia farnesiana subsp. minuta",
    "plant_slug": "acacia-farnesiana-subsp-minuta",
    "plant_name_scientific": "acacia farnesiana subsp. minuta",
    "intro": "Acacia farnesiana subsp. minuta, commonly known as the sweet acacia or mimosa, is a shrub or small tree native to the Mediterranean region and parts of North Africa. It is characterized by its feathery, bipinnate leaves and yellow globular flowers that appear in clusters. The plant produces long, slender pods that contain seeds with a tuft of silky hair. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid and semi-arid environments. The species is also known for its ability to fix nitrogen, contributing to soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia farnesiana subsp. minuta is primarily native to the southern United States, including Texas, Arizona, and New Mexico, as well as parts of northern Mexico. It thrives in arid and semi-arid environments, often found in disturbed soils and along roadsides. This subspecies is adapted to hot, dry climates and can tolerate poor soil conditions. It is commonly seen in desert landscapes and is sometimes referred to as the \"whistling acacia\" due to the sound it makes in the wind. Its distribution is largely restricted to the southwestern regions of the United States and northern Mexico.",
    "distribution_introduced_art_desc": "Acacia farnesiana subsp. minuta was mainly introduced to the Mediterranean region as an ornamental plant due to its attractive foliage and ability to thrive in arid conditions. It has since spread to other parts of Europe, North Africa, and the Middle East, often escaping cultivation and becoming naturalized in local ecosystems. This subspecies is particularly invasive in coastal areas and disturbed soils, where it can outcompete native vegetation. Its rapid growth and ability to fix nitrogen contribute to its success in new environments. However, it is considered a weed in some regions and can have negative impacts on biodiversity and land use."
}
