{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia leptalea",
    "plant_slug": "acacia-leptalea",
    "plant_name_scientific": "acacia leptalea",
    "intro": "Acacia leptalea, commonly known as the slender wattle, is a shrub native to eastern Australia. It is characterized by its delicate, feathery foliage and yellow flowers that appear in summer. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. It thrives in well-drained soils and is often found in dry, open habitats. Acacia leptalea is valued for its ornamental appeal and its role in providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia leptalea"
    },
    "taxonomy_art_desc": "Acacia leptalea belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that often have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pods and a symbiotic relationship with nitrogen-fixing bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing abilities. Its species is Acacia leptalea, a specific type of acacia found in certain regions, characterized by its slender branches and specific ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia leptalea is primarily native to Western Australia. It is commonly found in the southwestern region of the state, particularly in the areas of the Fitzgerald River National Park and the Cape LeGrand National Park. This species thrives in sandy soils and is often associated with coastal and near-coastal environments. It is well adapted to the dry and Mediterranean climate of the region. Acacia leptalea is an important component of the local flora and plays a role in the ecological balance of its habitat.",
    "distribution_introduced_art_desc": "Acacia leptalea was mainly introduced to areas with sandy soils and coastal environments. It thrives in regions with warm, dry climates and is commonly found in Mediterranean-type ecosystems. This plant is often used for erosion control due to its deep root system and ability to stabilize soil. It is also valued for its ornamental qualities, making it a popular choice in landscaping. However, its introduction has sometimes led to ecological concerns in non-native regions."
}
