{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia dimidiata",
    "plant_slug": "acacia-dimidiata",
    "plant_name_scientific": "acacia dimidiata",
    "intro": "Acacia dimidiata, commonly known as the flat-leaf wattle, is a shrub or small tree native to southern Africa. It is characterized by its bipinnate leaves, which are composed of two rows of small, linear leaflets. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. Acacia dimidiata is adapted to arid and semi-arid environments, making it a hardy species in dry regions. It is often used in landscaping due to its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia dimidiata"
    },
    "taxonomy_art_desc": "Acacia dimidiata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their relatives, known for their primitive features and spore-based reproduction. Its subclass is Magnoliidae, a group of flowering plants with diverse forms and often complex flower structures. Its order is Fabales, which includes plants known for their legume fruits and symbiotic nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or bean family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorny appearance and nitrogen-fixing capabilities. Its species is Acacia dimidiata, a specific type of acacia found in certain regions, recognized by its unique morphological and ecological traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia dimidiata is primarily native to the Northern Territory and Queensland of Australia. It is commonly found in arid and semi-arid regions within these areas. This plant thrives in sandy soils and is often seen along roadsides and in open woodlands. It plays an important ecological role by providing habitat and food for local wildlife. Its distribution is closely linked to the environmental conditions of these regions.",
    "distribution_introduced_art_desc": "Acacia dimidiata was mainly introduced to South Africa, where it has become naturalized in various regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or disturbed soils. The plant is often used for soil stabilization due to its deep root system and ability to withstand drought. It has also been introduced to other parts of southern Africa, including Namibia and Botswana. Despite its ecological benefits, it can become invasive in certain environments if not managed properly."
}
