{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia houstonii",
    "plant_slug": "acacia-houstonii",
    "plant_name_scientific": "acacia houstonii",
    "intro": "Acacia houstonii, commonly known as Houston acacia, is a shrub or small tree native to the southern United States. It is characterized by its slender, zigzagging branches and feathery, bipinnate leaves. The plant produces yellow flowers in dense, globular clusters, which are followed by long, thin pods. It thrives in well-drained soils and is drought-tolerant, making it suitable for arid environments. Acacia houstonii is often used in landscaping for its ornamental value and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia houstonii is primarily native to the southeastern United States, specifically Texas and Louisiana. It is commonly found in dry, sandy soils along the coast and in coastal prairies. This plant thrives in arid and semi-arid environments, often growing in open woodlands and scrublands. It is well adapted to the hot, humid climate of its native range. Acacia houstonii is an important component of the local ecosystem, providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia houstonii was mainly introduced to the southeastern United States, particularly in Texas and Florida, as an ornamental plant due to its unique appearance and adaptability. It has been widely planted in urban and suburban landscapes for its ability to thrive in dry conditions. However, its introduction has led to concerns about its potential invasiveness in certain ecosystems. Despite its aesthetic value, it is important to monitor its spread to prevent ecological disruption. This plant is often found in disturbed soils and can outcompete native vegetation if left unchecked."
}
