{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia esculenta",
    "plant_slug": "acacia-esculenta",
    "plant_name_scientific": "acacia esculenta",
    "intro": "Acacia esculenta, commonly known as the sour acacia, is a shrub native to southern Africa. It is characterized by its small, yellow flowers and bipinnate leaves. The plant produces pods that contain edible seeds, which are often used in local cuisines. It thrives in arid and semi-arid environments, making it an important species in dryland ecosystems. The plant is also valued for its ability to fix nitrogen, improving soil fertility.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia esculenta is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It thrives in arid and semi-arid regions, often found in rocky soils and along riverbanks. This species is commonly distributed across the savannas and grasslands of the region. It plays an important ecological role in stabilizing soil and providing habitat for various wildlife. The plant is also known for its edible pods, which have been used by local communities for food and traditional medicine.",
    "distribution_introduced_art_desc": "Acacia esculenta was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reforestation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its edible seeds, which provide a valuable food source in some areas. Its rapid growth and drought tolerance make it an effective choice for land rehabilitation. However, it can become invasive in certain ecosystems if not managed properly."
}
