{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia manubensis",
    "plant_slug": "acacia-manubensis",
    "plant_name_scientific": "acacia manubensis",
    "intro": "Acacia manubensis, commonly known as the slender acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, multi-branched stems and bipinnate leaves that are often reduced to small, scale-like structures. The plant produces yellow or orange globular inflorescences, which are clustered in dense, spherical heads. Its flowers are followed by elongated, woody pods that contain several seeds. Acacia manubensis is often found in rocky or sandy soils and is adapted to arid or semi-arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia manubensis is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in sandy soils and rocky outcrops, often in association with other drought-tolerant shrubs and grasses. This species is well adapted to harsh environmental conditions, including high temperatures and low rainfall. It plays an important ecological role in stabilizing soil and providing shelter for wildlife. Acacia manubensis is also sometimes used in traditional medicine by local communities.",
    "distribution_introduced_art_desc": "Acacia manubensis was mainly introduced to New Zealand as part of ecological restoration and soil stabilization efforts. It was brought in during the 20th century to combat erosion on degraded lands. The plant thrives in a variety of soil types and is drought-tolerant, making it suitable for reforestation projects. However, its rapid growth and ability to outcompete native species have led to concerns about its invasive potential. Despite its ecological benefits, careful management is required to prevent it from becoming a weed in natural ecosystems."
}
