{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia deuteroneura",
    "plant_slug": "acacia-deuteroneura",
    "plant_name_scientific": "acacia deuteroneura",
    "intro": "Acacia deuteroneura, commonly known as the mountain acacia, is a shrub or small tree native to the arid and semi-arid regions of Australia. It is characterized by its slender, often spindly branches and phyllodes that are typically narrow and linear. The plant produces yellow flowers in compact spikes, which bloom during the warmer months. Acacia deuteroneura is adapted to drought conditions, with a deep root system that allows it to survive in nutrient-poor soils. It plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia deuteroneura"
    },
    "taxonomy_art_desc": "Acacia deuteroneura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex structures such as vascular tissues. Its class is Equisetopsida, which encompasses ferns, horsetails, and their relatives, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species, often with primitive floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a distinctive structure, including legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid regions, known for their distinctive foliage and often used for timber or ornamental purposes. Its species is Acacia deuteroneura, a specific type of acacia found in certain regions of Australia, distinguished by its unique morphological and ecological characteristics.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia deuteroneura is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This plant typically grows in open woodlands and grasslands. It is well adapted to the local climate and soil conditions. Its distribution is largely confined to specific habitats within Queensland.",
    "distribution_introduced_art_desc": "Acacia deuteroneura was mainly introduced to areas with sandy or well-drained soils, often in arid or semi-arid regions. It thrives in environments with low rainfall and high temperatures, making it suitable for restoration projects in degraded landscapes. The plant is commonly used for soil stabilization due to its extensive root system and ability to prevent erosion. It is also valued for its hardiness and resistance to drought conditions. However, its introduction has raised concerns about potential invasiveness in certain ecosystems."
}
