{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cockertoniana",
    "plant_slug": "acacia-cockertoniana",
    "plant_name_scientific": "acacia cockertoniana",
    "intro": "Acacia cockertoniana, commonly known as Cockerton's wattle, is a shrub native to South Africa. It belongs to the Fabaceae family, characterized by its compound leaves and pod fruits. The plant produces yellow flowers in spring, which are arranged in cylindrical spikes. Its leaves are bipinnate, meaning they are divided into smaller leaflets, and it has a deep root system. Acacia cockertoniana is adapted to arid environments and is often found in rocky soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cockertoniana"
    },
    "taxonomy_art_desc": "Acacia cockertoniana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Fabales, which consists of flowering plants that typically have legume fruits and are often nitrogen-fixing through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and as sources of timber. Its species is Acacia cockertoniana, a specific type of acacia found in certain regions, known for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cockertoniana is primarily native to Western Australia. It is found in the south-west region of the state, particularly in the area around the Fitzgerald River National Park. This species thrives in sandy soils and is often found in open woodlands and heathlands. It is well adapted to the Mediterranean climate of the region, with a dry summer and wet winter. The plant is also known for its distinctive yellow flowers that bloom during the warmer months.",
    "distribution_introduced_art_desc": "Acacia cockertoniana was mainly introduced to New Zealand as an ornamental plant due to its unique appearance and hardy nature. It has since been found growing in various regions, particularly in the North Island. The plant is often found in disturbed soils and along roadsides, where it can spread rapidly. Its introduction has raised concerns about its potential to become invasive in native ecosystems. Despite its aesthetic appeal, careful management is needed to prevent its spread into sensitive habitats."
}
