{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia delphina",
    "plant_slug": "acacia-delphina",
    "plant_name_scientific": "acacia delphina",
    "intro": "Acacia delphina, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, fern-like appearance. The plant produces yellow flowers in globular clusters, which are highly attractive to pollinators such as bees and birds. Acacia delphina is adapted to thrive in dry, sandy soils and is drought-tolerant. It plays an important ecological role in providing habitat and food for native wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia delphina"
    },
    "taxonomy_art_desc": "Acacia delphina belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and some green algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which encompasses a group of vascular plants that includes horsetails and some fern allies, known for their unique reproductive structures. Its subclass is Magnoliidae, a large group of flowering plants that includes many economically important species, such as roses and magnolias, and is characterized by diverse floral structures. Its order is Fabales, which includes plants with distinctive flowers that have a single pistil and stamens in multiples of two or five, and includes legumes and some related families. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its nitrogen-fixing abilities and the distinctive pod-like fruits. Its genus is Acacia, a large group of shrubs and trees found mainly in arid regions, known for their needle-like phyllodes and often for their ability to fix nitrogen through symbiotic bacteria. Its species is Acacia delphina, a specific type of acacia that is distinguished by its unique morphological features and ecological adaptations, typically found in specific habitats within its native range.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia delphina is primarily native to Western Australia. It is found in the southern and western regions of the state, particularly in the coastal and near-coastal areas. This species thrives in sandy soils and is commonly found in heathlands and open woodlands. It is well adapted to the dry and Mediterranean climate of the region. Acacia delphina plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia delphina was mainly introduced to areas with warm, dry climates and well-drained soils, often for ornamental purposes or as a source of timber. It is commonly found in regions of Australia, where it has been planted in gardens and along roadsides. The plant thrives in full sun and can tolerate drought conditions, making it adaptable to various environments. However, its introduction has sometimes led to ecological concerns due to its potential to become invasive in certain areas. It is important to monitor its spread to prevent negative impacts on native flora and fauna."
}
