{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia astringens",
    "plant_slug": "acacia-astringens",
    "plant_name_scientific": "acacia astringens",
    "intro": "Acacia astringens, commonly known as the white wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in summer. The plant is known for its ability to thrive in arid and semi-arid environments, making it drought-tolerant. Its wood is hard and durable, historically used by Indigenous Australians for tools and weapons. The plant also has medicinal properties, with some traditional uses involving its bark and leaves.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia astringens is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and Zimbabwe. It is commonly found in savanna and woodland habitats, often growing in well-drained soils. This species is well adapted to the dry and semi-arid climates of its native range. It plays an important ecological role by providing food and shelter for various wildlife species. Acacia astringens is also known for its medicinal properties and has been used traditionally by local communities.",
    "distribution_introduced_art_desc": "Acacia astringens was mainly introduced to areas with dry, warm climates and well-drained soils, often found in regions of Australia and parts of Southeast Asia. It is commonly used for its hardy nature and ability to thrive in arid environments. The plant is known for its small, spiny leaves and yellow flowers, making it a popular choice for ornamental purposes. Its introduction has sometimes led to it becoming invasive in certain regions outside its native range. Due to its adaptability, it is often planted in landscaping and reclamation projects."
}
