{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tropica",
    "plant_slug": "acacia-tropica",
    "plant_name_scientific": "acacia tropica",
    "intro": "Acacia tropica, commonly known as the tropical wattle, is a shrub or small tree native to parts of Southeast Asia. It is characterized by its feathery, bipinnate leaves and yellow flowers that bloom in clusters. The plant is adapted to tropical and subtropical climates, thriving in well-drained soils. It has a deep root system that helps it survive in dry conditions. Acacia tropica is often used in landscaping for its ornamental value and ability to withstand harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia tropica"
    },
    "taxonomy_art_desc": "Acacia tropica belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their primitive characteristics. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume family, which is distinguished by its characteristic fruit, the legume, and its nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their distinctive foliage and often used in traditional medicine. Its species is Acacia tropica, a specific type of acacia native to tropical regions, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tropica is primarily native to the Northern Territory and Queensland of Australia. It is commonly found in tropical and subtropical regions within these areas. This plant thrives in open woodlands, savannas, and along riverbanks. It is well adapted to the warm and often dry climate of its native habitat. Acacia tropica plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia tropica was mainly introduced to tropical and subtropical regions for its ornamental value and potential for soil stabilization. It is commonly found in areas with warm climates and well-drained soils, such as parts of Southeast Asia, Africa, and the Caribbean. The plant's rapid growth and ability to thrive in disturbed environments have led to its establishment in some non-native areas. However, it is considered invasive in certain regions due to its competitive nature and ability to outcompete native vegetation. Its introduction has raised concerns about ecological impacts and the need for management strategies."
}
