{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lespedleyi",
    "plant_slug": "acacia-lespedleyi",
    "plant_name_scientific": "acacia lespedleyi",
    "intro": "Acacia lespedleyi, commonly known as the silver wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that give it a delicate, fern-like appearance. The plant produces yellow flowers in clusters, which bloom in spring and attract pollinators such as bees and birds. Its bark is smooth and greyish-white, often peeling in thin layers. Acacia lespedleyi is adapted to dry conditions and is often found in coastal and sandy soils.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lespedleyi"
    },
    "taxonomy_art_desc": "Acacia lespedleyi belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of chlorophyll and the ability to perform photosynthesis. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their characteristic phyllodes and symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia lespedleyi, a specific type of acacia found in certain regions, distinguished by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lespedleyi is primarily native to Queensland. It is commonly found in the central and southern regions of the state. This plant typically grows in dry, open habitats such as woodlands and grasslands. It is well adapted to the arid and semi-arid conditions of Queensland. Acacia lespedleyi plays an important role in the local ecosystem and is often used in traditional land management practices.",
    "distribution_introduced_art_desc": "Acacia lespedleyi was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in the Eastern Cape and Western Cape provinces. This species is often used for soil stabilization and as a source of timber. However, it can compete with native vegetation and may become invasive in some areas. Its introduction has raised concerns among conservationists due to its potential ecological impact."
}
