{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cebil",
    "plant_slug": "acacia-cebil",
    "plant_name_scientific": "acacia cebil",
    "intro": "Acacia cebil, commonly known as the Cebil tree, is a species native to the Canary Islands. It is a small to medium-sized evergreen tree with a broad, spreading crown. The plant produces small, yellow flowers arranged in dense, globular clusters, which are typical of the Acacia genus. Its leaves are bipinnate, consisting of numerous small, oval-shaped leaflets. The Cebil tree is adapted to arid and coastal environments, making it resilient to drought and salt spray.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cebil is primarily native to South America, particularly in regions of Argentina, Bolivia, and Chile. It is commonly found in the dry and semi-arid areas of these countries, especially in the Andean foothills and surrounding steppe landscapes. This species thrives in well-drained soils and is often associated with shrublands and grasslands. Its distribution is also observed in parts of Peru and Ecuador, where it adapts to similar environmental conditions. Acacia cebil plays an important ecological role in these regions by providing habitat and food for various native fauna.",
    "distribution_introduced_art_desc": "Acacia cebil was mainly introduced to South America, particularly in regions of Argentina, Chile, and Peru. It was brought there for its ornamental value and potential for soil stabilization. The plant thrives in arid and semi-arid environments, making it suitable for reforestation and land rehabilitation projects. However, its introduction has raised concerns due to its potential to become invasive in certain ecosystems. It is now considered an important species in ecological restoration efforts in the region."
}
