{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cuthbertsonii",
    "plant_slug": "acacia-cuthbertsonii",
    "plant_name_scientific": "acacia cuthbertsonii",
    "intro": "Acacia cuthbertsonii, commonly known as the coastal wattle, is a shrub native to the coastal regions of southern Australia. It is characterized by its slender, often multi-branched stems and small, feathery leaves that are adapted to reduce water loss in arid environments. The plant produces yellow flowers in cylindrical spikes, which appear during the warmer months and attract a variety of pollinators. Its seeds are encased in hard pods that split open to release the seeds, aiding in its propagation. Acacia cuthbertsonii is well-suited to sandy soils and is often found in dune ecosystems along the coastline.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia cuthbertsonii"
    },
    "taxonomy_art_desc": "Acacia cuthbertsonii belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises ferns and their relatives, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of floral structures. Its order is Fabales, which consists of flowering plants that typically have leaves with a single vein and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive umbrella-shaped flower clusters and often used in traditional medicine. Its species is Acacia cuthbertsonii, a specific type of acacia found in certain regions of Australia, known for its ecological and potential medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cuthbertsonii is primarily native to the Northern Territory and Western Australia. This species is commonly found in arid and semi-arid regions within these areas. It typically grows in sandy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climatic conditions of its native range. It plays an important ecological role in supporting local wildlife and maintaining biodiversity.",
    "distribution_introduced_art_desc": "Acacia cuthbertsonii was mainly introduced to South Australia. It is commonly found in the lower Riverland and River Murray regions. This plant thrives in dry, sandy soils and is often seen along riverbanks and in open woodlands. It is valued for its hardy nature and ability to withstand drought conditions. The distribution of Acacia cuthbertsonii has expanded due to its use in land rehabilitation and as a windbreak."
}
