{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia auriculiformis",
    "plant_slug": "acacia-auriculiformis",
    "plant_name_scientific": "acacia auriculiformis",
    "intro": "Acacia auriculiformis, commonly known as the earleaf acacia, is a fast-growing leguminous tree native to Southeast Asia. It is characterized by its bipinnate leaves, which are often adorned with small, ear-like structures at the leaflets' bases. The plant produces yellowish-green flowers that are clustered in inflorescences, followed by flat, pod-like fruits containing several seeds. It thrives in tropical and subtropical climates and is often used for reforestation and soil stabilization due to its ability to fix nitrogen. Additionally, its wood and foliage have traditional uses in various parts of its native range.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia auriculiformis"
    },
    "taxonomy_art_desc": "Acacia auriculiformis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their primitive features and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many ancient and diverse species with a wide range of morphological adaptations. Its order is Fabales, which includes plants such as legumes and vetches, known for their ability to form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, which is characterized by pod fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive seed pods and often sharp thorns. Its species is Acacia auriculiformis, a tropical tree native to Southeast Asia, recognized for its heart-shaped leaves and its use in traditional medicine and as a source of timber.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Maluku",
        "New Guinea",
        "Northern Territory",
        "Queensland"
    ],
    "distribution_introduced": [
        "Andaman Is.",
        "Assam",
        "Bahamas",
        "Bangladesh",
        "Benin",
        "Borneo",
        "Cambodia",
        "Caroline Is.",
        "China Southeast",
        "Cook Is.",
        "DR Congo",
        "East Himalaya",
        "Florida",
        "Guinea",
        "Hawaii",
        "India",
        "Laos",
        "Leeward Is.",
        "Lesser Sunda Is.",
        "Malaya",
        "Mauritius",
        "Myanmar",
        "Nepal",
        "Nicobar Is.",
        "Nigeria",
        "Oman",
        "Pakistan",
        "Panamá",
        "Philippines",
        "Réunion",
        "Solomon Is.",
        "Sri Lanka",
        "Tanzania",
        "Trinidad-Tobago",
        "Vietnam",
        "West Himalaya",
        "Windward Is."
    ],
    "distribution_native_art_desc": "Acacia auriculiformis is primarily native to Maluku, New Guinea, Northern Territory, and Queensland. This species is commonly found in tropical and subtropical regions of these areas. It thrives in open woodlands, coastal areas, and disturbed sites. The plant is known for its adaptability to various soil types and climatic conditions. Its native range spans across parts of Indonesia, Papua New Guinea, and northern Australia.",
    "distribution_introduced_art_desc": "Acacia auriculiformis was mainly introduced to a wide range of tropical and subtropical regions across Asia, Africa, and the Pacific, including the Andaman Islands, Assam, Bahamas, Bangladesh, Benin, Borneo, Cambodia, Caroline Islands, China Southeast, Cook Islands, DR Congo, East Himalaya, Florida, Guinea, Hawaii, India, Laos, Leeward Islands, Lesser Sunda Islands, Malaya, Mauritius, Myanmar, Nepal, Nicobar Islands, Nigeria, Oman, Pakistan, Panama, Philippines, Réunion, Solomon Islands, Sri Lanka, Tanzania, Trinidad-Tobago, Vietnam, West Himalaya, and Windward Islands. It was primarily introduced for its fast-growing characteristics, making it useful for afforestation, soil stabilization, and as a source of timber and charcoal. The plant has become naturalized in many of these areas, often outcompeting native vegetation. Its introduction has had both ecological and economic impacts, depending on the region. Due to its adaptability, it has been widely cultivated in various agroforestry systems and reforestation programs."
}
