{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fulva",
    "plant_slug": "acacia-fulva",
    "plant_name_scientific": "acacia fulva",
    "intro": "Acacia fulva, commonly known as the golden wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, yellow flowers that bloom in late summer and early autumn. The plant has phyllodes, which are flattened leaf stalks that function as leaves, and it produces pods that contain seeds. Acacia fulva thrives in a variety of soil types but prefers well-drained soils and full sun. It is an important plant in Australian ecosystems and is also a symbol of the country.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia fulva"
    },
    "taxonomy_art_desc": "Acacia fulva belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which comprises a group of vascular plants that includes ferns and horsetails, known for their primitive vascular structures. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex flower structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals and stamens. Its family is Fabaceae, commonly known as the legume family, characterized by their distinctive pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine and as sources of timber. Its species is Acacia fulva, a specific type of acacia found in certain regions, recognized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia fulva is primarily native to New South Wales. It is commonly found in the eastern regions of the state, particularly in areas with sandy or gravelly soils. This species thrives in open woodlands and grasslands, often along riverbanks and in coastal areas. Acacia fulva is well adapted to the temperate climate of New South Wales, with its hardy nature allowing it to survive in various environmental conditions. It plays an important ecological role in supporting local wildlife and maintaining biodiversity in its native habitat.",
    "distribution_introduced_art_desc": "Acacia fulva was mainly introduced to areas with dry to semi-arid climates, particularly in regions with well-drained soils. It thrives in environments with moderate temperatures and low to moderate rainfall. This plant is commonly found in savannas, grasslands, and along riverbanks in its introduced range. Its ability to fix nitrogen makes it valuable for soil enrichment in degraded lands. However, it can become invasive in some ecosystems if not managed properly."
}
