{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia parvifoliolata",
    "plant_slug": "acacia-parvifoliolata",
    "plant_name_scientific": "acacia parvifoliolata",
    "intro": "Acacia parvifoliolata, commonly known as the narrow-leaf acacia, is a shrub or small tree native to Australia. It is characterized by its slender, often branched stems and bipinnate leaves composed of small, narrow leaflets. The plant produces yellow or golden flowers in globular or cylindrical clusters, which are highly attractive to pollinators. Its seeds are enclosed in woody pods and are adapted for dispersal by animals or through mechanical means. Acacia parvifoliolata is well-suited to arid and semi-arid environments, making it a hardy plant in dry climates.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia parvifoliolata"
    },
    "taxonomy_art_desc": "Acacia parvifoliolata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which comprises vascular plants that include ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have leaves with pinnate venation and include legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a group of shrubs and trees known for their distinctive leaf structures and often for their ability to fix nitrogen. Its species is Acacia parvifoliolata, a specific type of acacia known for its small leaves and is typically found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia parvifoliolata is primarily native to Queensland. It is found in the tropical and subtropical regions of the state. This plant typically grows in open woodlands and savanna-like habitats. It is well adapted to the warm and often dry climate of Queensland. Its distribution is largely confined to the eastern and central parts of the state.",
    "distribution_introduced_art_desc": "Acacia parvifoliolata was mainly introduced to South Africa as an ornamental plant due to its unique foliage and drought tolerance. It has since been cultivated in various regions with similar climates, including parts of Australia and the Mediterranean. The plant is often used in landscaping for its ability to thrive in poor soils and its low maintenance requirements. However, its spread has raised concerns about potential invasiveness in certain ecosystems. Despite its ornamental value, careful management is recommended to prevent unintended ecological impacts."
}
