{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lirellata subsp. lirellata",
    "plant_slug": "acacia-lirellata-subsp-lirellata",
    "plant_name_scientific": "acacia lirellata subsp. lirellata",
    "intro": "Acacia lirellata subsp. lirellata, commonly known as the slender wattle, is a shrub native to southern Australia. It is characterized by its narrow, linear leaves and yellow flowers that appear in globular heads. The plant thrives in well-drained soils and is often found in coastal and inland regions. It is valued for its ornamental appeal and is sometimes used in horticulture. The subspecies is distinguished by its more slender growth habit compared to other acacia species.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lirellata"
    },
    "taxonomy_art_desc": "Acacia lirellata subsp. lirellata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and algae, characterized by their complex cellular structures and ability to perform photosynthesis. Its class is Equisetopsida, which comprises vascular plants with a diverse range of forms, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide variety of morphological features. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a unique structure. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their acicular leaves and often spiny structures. Its species is Acacia lirellata, a specific type of acacia that is native to certain regions and is distinguished by its unique morphological and genetic traits.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lirellata subsp. lirellata is primarily native to Western Australia. It is commonly found in the southern and central regions of the state. This subspecies thrives in arid and semi-arid environments, often growing in sandy or rocky soils. It is typically found in open woodlands and shrublands. Its distribution is closely associated with the specific climatic and soil conditions of Western Australia.",
    "distribution_introduced_art_desc": "Acacia lirellata subsp. lirellata was mainly introduced to New Zealand. It was brought there as an ornamental plant due to its attractive foliage and ability to thrive in various conditions. However, it has since become invasive, outcompeting native species in certain regions. The plant is now considered a weed in some areas of New Zealand, posing a threat to biodiversity. Efforts are ongoing to manage its spread and control its impact on local ecosystems."
}
