{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia oraria",
    "plant_slug": "acacia-oraria",
    "plant_name_scientific": "acacia oraria",
    "intro": "Acacia oraria, commonly known as the slender acacia, is a shrub native to the arid regions of southern Africa. It is characterized by its slender, multi-branched stems and small, bipinnate leaves that reduce water loss. The plant produces yellow flowers in dense, globular clusters, which attract various pollinators such as bees and birds. Acacia oraria is adapted to harsh, dry environments and is often found in rocky or sandy soils. Its wood is lightweight and has been used traditionally for crafting and fuel.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia oraria"
    },
    "taxonomy_art_desc": "Acacia oraria belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of a complex life cycle involving both sexual and asexual reproduction. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and some flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and include legumes and other related families. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive foliage and often used in various ecological and economic contexts. Its species is Acacia oraria, a specific type of acacia native to certain regions of Australia, known for its ecological role and unique morphological features.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Jawa",
        "Lesser Sunda Is.",
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia oraria is primarily native to Jawa, Lesser Sunda Is., and Queensland. This species is commonly found in tropical and subtropical regions within these areas. It thrives in dry, open habitats such as woodlands and savannas. The plant is well adapted to the local climate and soil conditions of its native range. It plays an important ecological role in its native environment.",
    "distribution_introduced_art_desc": "Acacia oraria was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was originally brought there for ornamental purposes due to its attractive yellow flowers and hardy nature. However, it has since spread beyond cultivated areas, colonizing disturbed soils and roadside vegetation. Its rapid growth and ability to form dense thickets have led to competition with native plant species. Management efforts are ongoing to control its spread and mitigate its ecological impact."
}
