{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cornigera",
    "plant_slug": "acacia-cornigera",
    "plant_name_scientific": "acacia cornigera",
    "intro": "Acacia cornigera, commonly known as the horned acacia, is a flowering plant native to southern Africa. It is characterized by its distinctive, thorn-covered stems and small, compound leaves. The plant produces yellowish-green flowers that bloom in summer, attracting various pollinators. It thrives in arid and semi-arid environments, often growing on rocky soils. Acacia cornigera is also known for its ability to fix nitrogen, making it an important plant in soil enrichment.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cornigera is primarily native to the island of Socotra, which is located in the Arabian Sea off the coast of the Horn of Africa. This unique plant is found in the arid and semi-arid regions of Socotra, where it thrives in rocky and limestone soils. It is one of the many endemic species that make Socotra a biodiversity hotspot. The plant is well adapted to the harsh environmental conditions of its native habitat. Due to its restricted distribution, it is considered a rare and vulnerable species.",
    "distribution_introduced_art_desc": "Acacia cornigera was mainly introduced to areas with dry, arid climates where it can thrive in poor soil conditions. It is commonly found in regions of Australia, where it has been introduced for its ornamental value and ability to fix nitrogen. The plant is often used in reclamation projects due to its hardy nature and rapid growth. However, it can become invasive in some environments if not managed properly. Its introduction has had both ecological and economic impacts in the regions where it has been established."
}
