{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lunata",
    "plant_slug": "acacia-lunata",
    "plant_name_scientific": "acacia lunata",
    "intro": "Acacia lunata, commonly known as the moon acacia, is a flowering plant native to southern Africa. It is a small evergreen shrub that typically grows in rocky or sandy soils. The plant produces yellow flowers in clusters, which bloom during the cooler months. Its leaves are bipinnate, meaning they are divided into small, feathery segments. Acacia lunata is valued for its ornamental appeal and ability to thrive in arid environments.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia lunata"
    },
    "taxonomy_art_desc": "Acacia lunata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which consists of ferns and their allies, including horsetails, and is known for having vascular tissue. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by a wide range of floral structures. Its order is Fabales, which includes plants known for their legume fruits and nitrogen-fixing abilities through symbiotic bacteria. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive pod-like fruits and often nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive flattened or spiny leaves and often used in traditional medicine and as sources of timber. Its species is Acacia lunata, a specific type of acacia that is native to certain regions and is characterized by its unique morphological features and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lunata is primarily native to New South Wales. It is commonly found in the coastal and inland regions of the state. This plant thrives in sandy soils and is often seen in open woodlands and heathlands. It is well adapted to the temperate climate of New South Wales. Acacia lunata plays an important role in the local ecosystem by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia lunata was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in reclamation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its nitrogen-fixing properties, which improve soil fertility. Its rapid growth and drought tolerance make it a preferred choice for afforestation programs. However, its introduction has sometimes led to competition with native species in certain ecosystems."
}
