{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia subflexuosa subsp. capillata",
    "plant_slug": "acacia-subflexuosa-subsp-capillata",
    "plant_name_scientific": "acacia subflexuosa subsp. capillata",
    "intro": "Acacia subflexuosa subsp. capillata, commonly known as the silky wattle, is a shrub native to eastern Australia. It is characterized by its slender, often prostrate stems and delicate, feathery leaves that give it a soft, silky appearance. The plant produces yellow flowers in spikes, which bloom from late winter to early spring. It thrives in well-drained soils and is often found in coastal and sandy habitats. Due to its ornamental value and adaptability, it is cultivated in gardens and used in ecological restoration projects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia subflexuosa"
    },
    "taxonomy_art_desc": "Acacia subflexuosa subsp. capillata belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and horsetails. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is distinguished by their complex floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with fused petals and include legumes and other related families. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive phyllodes and often used in traditional medicine and as timber. Its species is Acacia subflexuosa, a specific type of acacia that includes the subspecies capillata, which is distinguished by its unique morphological features and habitat preferences.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia subflexuosa subsp. capillata is primarily native to Western Australia. It is commonly found in the southern regions of the state, particularly in the areas of the Mid-West and Geraldton regions. This subspecies thrives in sandy soils and is often associated with coastal and inland sandplain habitats. It is well adapted to the arid and semi-arid climates of its native range. The plant is an important component of the local vegetation in these regions.",
    "distribution_introduced_art_desc": "Acacia subflexuosa subsp. capillata was mainly introduced to South Africa, particularly in the Eastern Cape and Western Cape provinces. It is commonly found in coastal and mountainous regions where it thrives in well-drained soils. This subspecies is often used in landscaping due to its ornamental value and hardy nature. It has also been introduced to other parts of southern Africa, including Namibia and Zimbabwe. However, its spread is limited by its preference for specific climatic conditions."
}
