{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia macdonnelliensis subsp. teretifolia",
    "plant_slug": "acacia-macdonnelliensis-subsp-teretifolia",
    "plant_name_scientific": "acacia macdonnelliensis subsp. teretifolia",
    "intro": "Acacia macdonnelliensis subsp. teretifolia, commonly known as the narrow-leaf acacia, is a shrub or small tree native to arid and semi-arid regions of Australia. It is characterized by its slender, often drooping branches and small, phyllodes that are typically narrow and linear. The plant produces yellow globular flowers in late winter to early spring, which are clustered in dense, spherical inflorescences. It is adapted to low rainfall and nutrient-poor soils, making it a resilient component of desert ecosystems. The species is also valued for its role in stabilizing soil and providing habitat for native fauna.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia macdonnelliensis"
    },
    "taxonomy_art_desc": "Acacia macdonnelliensis subsp. teretifolia belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and clubmosses. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species such as roses and magnolias. Its order is Fabales, which consists of plants that typically have compound leaves and flowers with a distinctive structure. Its family is Fabaceae, commonly known as the legume family, characterized by the presence of pods and nitrogen-fixing abilities. Its genus is Acacia, a large genus of shrubs and trees known for their distinctive, often thorned appearance and nitrogen-fixing capabilities. Its species is Acacia macdonnelliensis, a specific type of acacia that is further divided into the subspecies teretifolia, which is distinguished by its unique leaf and stem morphology.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia macdonnelliensis subsp. teretifolia is primarily native to the Northern Territory and Western Australia. This subspecies is commonly found in arid and semi-arid regions of these areas. It thrives in sandy soils and is often seen in open woodlands and shrublands. The plant is well adapted to the harsh climate of its native range. It plays an important ecological role in its habitat by providing shelter and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia macdonnelliensis subsp. teretifolia was mainly introduced to South Australia as part of early botanical exploration and horticultural interest in the region. It is commonly found in sandy soils along the coast and in dunes, particularly in the southern parts of the state. The subspecies is valued for its hardy nature and ability to thrive in arid conditions, making it a popular choice for landscaping in coastal areas. It has also been introduced to parts of Western Australia, where it grows in similar environmental conditions. Due to its adaptability, it has become a noted component of the local flora in these regions."
}
