{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia gourmaensis",
    "plant_slug": "acacia-gourmaensis",
    "plant_name_scientific": "acacia gourmaensis",
    "intro": "Acacia gourmaensis, commonly known as the Gourma acacia, is a deciduous shrub or small tree native to the Sahel region of Africa. It is characterized by its slender, often spiny stems and bipinnate leaves that are typically shed during the dry season. The plant produces yellow globular flowers that bloom in summer, followed by flat, pod-like fruits containing seeds. It is adapted to arid and semi-arid environments, with deep roots that help it survive in poor soils. Acacia gourmaensis plays an important ecological role in stabilizing soils and providing habitat for various desert animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia gourmaensis is primarily native to the Sahel region of Africa, particularly in countries such as Mali, Niger, and Burkina Faso. It thrives in dry, savannah-like environments with seasonal rainfall. This species is commonly found in open woodlands and grasslands, often near water sources. It plays an important ecological role in stabilizing soil and providing habitat for various wildlife. Acacia gourmaensis is well adapted to arid conditions and can tolerate both drought and periodic flooding.",
    "distribution_introduced_art_desc": "Acacia gourmaensis was mainly introduced to regions with arid or semi-arid climates where it can thrive in poor soil conditions. It is commonly found in areas of Africa, particularly in countries like Niger, Chad, and Sudan. This plant is valued for its ability to prevent soil erosion and provide shade. Its introduction has helped in restoring degraded lands and supporting local ecosystems. Additionally, it serves as a source of firewood and has cultural significance in some communities."
}
