{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia fasciculifera",
    "plant_slug": "acacia-fasciculifera",
    "plant_name_scientific": "acacia fasciculifera",
    "intro": "Acacia fasciculifera, commonly known as the narrow-leaf wattle, is a shrub native to Australia. It is characterized by its slender, often multi-branched stems and small, feathery leaves. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It thrives in well-drained soils and is adapted to arid and semi-arid environments. Acacia fasciculifera is often used in landscaping for its ornamental value and drought tolerance.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia fasciculifera"
    },
    "taxonomy_art_desc": "Acacia fasciculifera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, roots, and leaves. Its class is Equisetopsida, which encompasses ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have compound leaves and flowers with a specific arrangement of petals. Its family is Fabaceae, commonly known as the legume family, characterized by pod fruits and nitrogen-fixing abilities through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees known for their acorn-like seed pods and often used in traditional medicine. Its species is Acacia fasciculifera, a specific type of acacia found in certain regions, distinguished by its unique foliage and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [
        "California"
    ],
    "distribution_native_art_desc": "Acacia fasciculifera is primarily native to Queensland. It is commonly found in the tropical and subtropical regions of the state. This species thrives in sandy soils and is often associated with coastal and inland dune environments. It plays an important role in stabilizing sand dunes and providing habitat for local wildlife. Acacia fasciculifera is well adapted to the harsh conditions of the Queensland landscape.",
    "distribution_introduced_art_desc": "Acacia fasciculifera was mainly introduced to California. It is commonly found in urban and suburban areas, particularly along roadsides and in disturbed soils. This plant is known for its ability to thrive in dry and coastal environments. Its rapid growth and adaptability have made it a common invasive species in the region. However, it can outcompete native plants and alter local ecosystems if left unchecked."
}
