{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia altiscandens",
    "plant_slug": "acacia-altiscandens",
    "plant_name_scientific": "acacia altiscandens",
    "intro": "Acacia altiscandens, commonly known as the narrow-leaf wattle, is a shrub native to southern Australia. It is characterized by its slender, zigzagging stems and bipinnate leaves composed of small, needle-like leaflets. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. It thrives in well-drained soils and is often found in coastal and semi-arid regions. Acacia altiscandens is valued for its ornamental appeal and is used in landscaping for its hardiness and low maintenance requirements.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia altiscandens is primarily native to southern Africa, specifically South Africa, Namibia, and Botswana. It is commonly found in arid and semi-arid regions, growing in sandy or rocky soils. This plant is well adapted to hot, dry climates and can thrive in areas with low rainfall. It is often seen in savanna and shrubland ecosystems. Its distribution is largely restricted to the southwestern and central parts of the African continent.",
    "distribution_introduced_art_desc": "Acacia altiscandens was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It was initially brought for its ability to thrive in a variety of soil conditions and its capacity to withstand harsh climates. However, it has since become an invasive species, outcompeting native vegetation in certain regions. Its rapid growth and ability to form dense thickets have led to concerns about its ecological impact. Despite its aesthetic value, management efforts are now focused on controlling its spread to protect local biodiversity."
}
