{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia glabriflora",
    "plant_slug": "acacia-glabriflora",
    "plant_name_scientific": "acacia glabriflora",
    "intro": "Acacia glabriflora, commonly known as the smooth-flowered acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often thornless stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow flowers in globular or cylindrical inflorescences, which are typically arranged in clusters. Acacia glabriflora is adapted to arid and semi-arid environments, making it a resilient species in harsh climates. It plays a role in local ecosystems by providing nectar for pollinators and habitat for various animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia glabriflora is primarily native to northern Australia, including regions of Western Australia, the Northern Territory, and Queensland. It is commonly found in arid and semi-arid environments, particularly in areas with sandy or rocky soils. This species thrives in coastal and inland areas, often growing in shrublands and woodlands. It is well adapted to the harsh conditions of the Australian outback, including high temperatures and low rainfall. Acacia glabriflora plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia glabriflora was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and along roadsides, thriving in sandy or gravelly soils. The plant is known for its ability to tolerate drought and poor soil conditions, which contributes to its successful establishment. It is often used for erosion control and as a source of fuelwood. However, its spread has raised concerns about its potential to invade native ecosystems."
}
