{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia numerosa",
    "plant_slug": "acacia-numerosa",
    "plant_name_scientific": "acacia numerosa",
    "intro": "Acacia numerosa, commonly known as the many-flowered acacia, is a shrub or small tree native to southern Africa. It is characterized by its compound leaves, which are often feathery and arranged in pairs. The plant produces yellow flowers in dense, spherical clusters, which are typical of the Acacia genus. It thrives in arid and semi-arid environments, showing adaptability to poor soils. The species is also valued for its ornamental appeal and is sometimes used in traditional medicine.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia numerosa is primarily native to eastern Australia, including the states of New South Wales, Queensland, and Victoria. It is commonly found in dry, sandy soils and is often associated with open woodlands and heathlands. This species thrives in regions with a Mediterranean climate, characterized by hot, dry summers and mild, wet winters. Acacia numerosa is well adapted to arid and semi-arid environments, making it a resilient component of local ecosystems. Its distribution is also influenced by soil type and availability of water, which limits its occurrence to specific habitats.",
    "distribution_introduced_art_desc": "Acacia numerosa was mainly introduced to New Zealand as an ornamental plant due to its attractive appearance and hardy nature. It has since spread beyond cultivated areas and is now considered a potential invasive species in certain regions. The plant thrives in a variety of soil types and is tolerant of both drought and poor soil conditions. Its rapid growth and ability to form dense thickets can lead to the displacement of native vegetation. Management efforts are ongoing to control its spread and mitigate its impact on local ecosystems."
}
