{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia ataxacantha",
    "plant_slug": "acacia-ataxacantha",
    "plant_name_scientific": "acacia ataxacantha",
    "intro": "Acacia ataxacantha, commonly known as the narrow-leaf wattle, is a small shrub native to arid and semi-arid regions of Australia. It is characterized by its slender, often twisted branches and phyllodes that are narrow and linear, typically ranging from 2 to 8 centimeters in length. The plant produces yellow flowers in late winter to early spring, which are clustered in dense, cylindrical inflorescences. Acacia ataxacantha is well adapted to harsh environments, with a deep root system that helps it survive in drought conditions. Its foliage is often used in traditional Aboriginal medicine, and it plays a role in providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia ataxacantha is primarily native to southern Africa, including countries such as South Africa, Namibia, Botswana, and parts of Zimbabwe. It is commonly found in grasslands, savannas, and rocky outcrops where it thrives in dry and semi-arid conditions. This plant is well adapted to the region's climate and is often part of the local vegetation in these areas. It is also occasionally found in coastal regions and along riverbanks. Its distribution is largely confined to the African continent, with limited occurrence in other regions.",
    "distribution_introduced_art_desc": "Acacia ataxacantha was mainly introduced to areas with warm, dry climates and well-drained soils, often as an ornamental or for erosion control. It is commonly found in regions of Australia, particularly in the arid and semi-arid zones of Western Australia and South Australia. The plant thrives in full sun and is drought-tolerant, making it suitable for landscaping in regions with limited water resources. Due to its rapid growth and ability to spread, it has become an invasive species in some areas outside its native range. Its introduction has raised concerns about its impact on local ecosystems and native plant communities."
}
