{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia densiflora",
    "plant_slug": "acacia-densiflora",
    "plant_name_scientific": "acacia densiflora",
    "intro": "Acacia densiflora, commonly known as the dense-flowered wattle, is a shrub or small tree native to Australia. It is characterized by its dense, feathery foliage and produces yellow flowers in clusters during the spring. The plant has phyllodes, which are flattened, leaf-like stems that perform photosynthesis. It thrives in well-drained soils and is often found in coastal and inland regions. Acacia densiflora is valued for its ornamental appeal and ability to withstand drought conditions.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia densiflora"
    },
    "taxonomy_art_desc": "Acacia densiflora belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses vascular plants with a wide range of morphological diversity, including ferns and flowering plants. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are often legumes, characterized by their ability to fix nitrogen through symbiotic relationships with bacteria. Its family is Fabaceae, commonly known as the legume or pea family, known for their distinctive pod fruits and nitrogen-fixing capabilities. Its genus is Acacia, a large group of shrubs and trees primarily found in arid and tropical regions, known for their phyllodes and often used in traditional medicine. Its species is Acacia densiflora, a specific type of acacia characterized by its dense flowering and adapted to grow in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia densiflora is primarily native to Western Australia. It is commonly found in the coastal regions and surrounding areas of the state. This species thrives in sandy soils and is often seen in heathlands and woodland communities. It is well adapted to the dry and warm climate of the region. Acacia densiflora plays an important role in the local ecosystem and is a characteristic plant of the Western Australian flora.",
    "distribution_introduced_art_desc": "Acacia densiflora was mainly introduced to South Africa for its ornamental value and potential for soil stabilization. It is commonly found in coastal and inland areas, particularly in the Western Cape and KwaZulu-Natal provinces. The plant thrives in well-drained soils and is often used in landscaping due to its hardy nature and attractive foliage. However, it has shown invasive tendencies in some regions, leading to concerns about its impact on native ecosystems. Its introduction has sparked debates on its ecological role and management strategies."
}
