{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia baueri var. aspera",
    "plant_slug": "acacia-baueri-var-aspera",
    "plant_name_scientific": "acacia baueri var. aspera",
    "intro": "Acacia baueri var. aspera, commonly known as the rough acacia, is a shrub or small tree native to southern Africa. It is characterized by its grayish-brown, fissured bark and compound leaves with small, stiff, acicular leaflets. The plant produces yellow globular flowers in summer, which are followed by flat, pod-like fruits containing edible seeds. It thrives in arid and semi-arid environments, often found in rocky soils and along riverbanks. The species is valued for its ornamental appeal and has some traditional uses in local communities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia baueri var. aspera is primarily native to the arid and semi-arid regions of southern Africa, including Namibia, Botswana, and parts of South Africa. This variety thrives in sandy soils and is commonly found in savannas and shrublands. It is well adapted to harsh environmental conditions, such as high temperatures and low rainfall. The plant is often used as a source of firewood and in traditional medicine. Its distribution is closely linked to the specific ecological zones where it can survive with minimal water.",
    "distribution_introduced_art_desc": "Acacia baueri var. aspera was mainly introduced to areas with well-drained soils and a warm, arid climate. It thrives in regions with low rainfall and full sun exposure. This plant is commonly found in coastal and inland sandy soils. Its introduction has been primarily for ornamental purposes and erosion control. However, it has also become invasive in some areas, outcompeting native vegetation."
}
