{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia viguieri",
    "plant_slug": "acacia-viguieri",
    "plant_name_scientific": "acacia viguieri",
    "intro": "Acacia viguieri, commonly known as the yellow acacia, is a small shrub native to southern Africa. It is characterized by its slender, often twisted branches and its clusters of small, yellow flowers that bloom in spring. The plant produces flat, bean-like pods that contain seeds, which are dispersed by wind. Acacia viguieri thrives in well-drained soils and is often found in rocky or coastal areas. It is valued for its ornamental appeal and its ability to withstand harsh environmental conditions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia viguieri is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It is commonly found in the Kalahari Desert and surrounding areas where the climate is dry and the soil is sandy or rocky. This plant thrives in environments with low rainfall and high temperatures, often growing along roadsides, riverbanks, and in open savannas. It is well adapted to harsh conditions, making it a resilient species in its native habitat. Acacia viguieri plays an important ecological role by providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia viguieri was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on sandy soils, particularly in the Western and Eastern Cape provinces. The plant is often used for soil stabilization due to its deep root system and ability to thrive in harsh conditions. However, it has also been reported to spread aggressively, potentially displacing native vegetation in some areas. Its introduction has raised concerns among conservationists due to its invasive potential in certain ecosystems."
}
