{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia velutina f. subinermis",
    "plant_slug": "acacia-velutina-f-subinermis",
    "plant_name_scientific": "acacia velutina f. subinermis",
    "intro": "Acacia velutina f. subinermis, commonly known as the silky acacia, is a flowering plant native to parts of Africa. It is characterized by its slender, woody stems and bipinnate leaves that are covered in fine, silky hairs. The plant produces yellow to golden spherical flower heads, which are clustered in dense, rounded inflorescences. It thrives in well-drained soils and is often found in savanna and woodland habitats. Due to its ornamental value, it is sometimes cultivated in gardens and landscapes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia velutina f. subinermis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and parts of South Africa. This subspecies thrives in sandy soils and is commonly found in shrublands and grasslands. It is well adapted to the harsh climatic conditions of its native habitat, including high temperatures and low rainfall. The plant plays an important ecological role by providing habitat and food for local wildlife. Its distribution is closely linked to the availability of suitable dryland environments.",
    "distribution_introduced_art_desc": "Acacia velutina f. subinermis was mainly introduced to South Africa, where it has become naturalized in certain regions. It is commonly found in coastal areas and on rocky outcrops, particularly in the Western Cape. This subspecies is known for its dense foliage and ability to thrive in arid conditions. Its introduction has led to its use in ornamental gardening and as a source of timber. However, it is also considered a potential invasive species in some local ecosystems."
}
