{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia kerryana",
    "plant_slug": "acacia-kerryana",
    "plant_name_scientific": "acacia kerryana",
    "intro": "Acacia kerryana, commonly known as the Kerry acacia, is a shrub native to the coastal regions of Western Australia. It is characterized by its slender, multi-branched stems and small, feathery leaves that are often covered in fine hairs. The plant produces yellow flowers in compact globular heads, which bloom during the warmer months. Acacia kerryana is adapted to sandy soils and is drought-tolerant, making it a hardy plant in coastal environments. It plays an important role in stabilizing dunes and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia kerryana"
    },
    "taxonomy_art_desc": "Acacia kerryana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of secondary cell walls and complex vascular systems. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns, horsetails, and their relatives, often exhibiting primitive features. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is known for its diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have a characteristic flower structure with a single carpel and is closely related to legumes. Its family is Fabaceae, commonly known as the legume or pea family, which includes plants with distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive phyllodes and ability to thrive in arid environments. Its species is Acacia kerryana, a specific type of acacia found in certain regions of Australia, characterized by its unique morphology and ecological adaptations.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia kerryana is primarily native to Western Australia. It is found in the southwestern region of the state, particularly in the area known as the Fitzgerald River National Park. This plant typically grows in sandy soils and is often found in open woodlands and heathlands. It is well adapted to the Mediterranean climate of the region, with dry summers and wet winters. Acacia kerryana is an important component of the local flora and is often used in ecological restoration projects.",
    "distribution_introduced_art_desc": "Acacia kerryana was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and ability to thrive in a variety of soil conditions. It has since become naturalized in certain regions, particularly in the North Island, where it can be found growing along roadsides and in disturbed areas. The plant's rapid growth and adaptability have led to concerns about its potential to invade native ecosystems. Despite its non-native status, it is sometimes used in reforestation projects due to its hardiness. However, its spread is closely monitored to prevent ecological imbalances."
}
