{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia lankaensis",
    "plant_slug": "acacia-lankaensis",
    "plant_name_scientific": "acacia lankaensis",
    "intro": "Acacia lankaensis, commonly known as the Sri Lankan acacia, is a shrub or small tree native to Sri Lanka. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing capabilities. The plant features bipinnate leaves and produces yellow floral clusters that attract pollinators. Its seeds are encased in a woody pod, and the plant is often found in dry, coastal areas. Acacia lankaensis is valued for its ecological role and has limited commercial use.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia lankaensis is primarily native to Sri Lanka. It is found in the wet zones of the island, particularly in the central and southern regions. This species thrives in tropical and subtropical climates with high humidity and well-drained soils. It is commonly seen in forested areas and along riverbanks. Acacia lankaensis plays an important ecological role in its native habitat.",
    "distribution_introduced_art_desc": "Acacia lankaensis was mainly introduced to South Asian countries such as Sri Lanka, India, and Bangladesh. It is commonly found in dry and semi-arid regions, particularly in degraded lands and along roadsides. The plant is valued for its ability to fix nitrogen and improve soil fertility, making it useful for land rehabilitation. It has also been introduced to parts of Africa and the Middle East for similar ecological and agricultural purposes. However, its introduction has raised concerns about its potential invasiveness in certain environments."
}
