{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia exsudans",
    "plant_slug": "acacia-exsudans",
    "plant_name_scientific": "acacia exsudans",
    "intro": "Acacia exsudans, commonly known as the gum acacia or wild acacia, is a shrub or small tree native to arid and semi-arid regions of Africa and the Middle East. It is characterized by its slender, often thorned branches and feathery, bipinnate leaves that are adapted to reduce water loss. The plant produces small, yellow flowers arranged in spherical clusters, followed by flat, woody pods containing seeds. It is well-known for exuding a sticky, resinous gum from its bark, which has been used traditionally for various purposes. Acacia exsudans plays an important ecological role in stabilizing sandy soils and providing habitat for desert wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia exsudans is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in savanna and shrubland habitats. This plant is well adapted to dry climates and can tolerate high temperatures and low rainfall. It plays an important ecological role by providing shelter and food for various wildlife species. Its distribution is also influenced by the availability of groundwater and soil conditions.",
    "distribution_introduced_art_desc": "Acacia exsudans was mainly introduced to South Africa, where it has become an invasive species in certain regions. It was initially brought in for its potential as a source of tannins and for its ability to fix nitrogen in the soil. However, its rapid growth and ability to outcompete native vegetation have led to ecological concerns. The plant thrives in disturbed soils and can spread quickly through seed dispersal by animals and wind. Its introduction has had significant impacts on local biodiversity and land management practices."
}
