{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia koa var. hawaiiensis",
    "plant_slug": "acacia-koa-var-hawaiiensis",
    "plant_name_scientific": "acacia koa var. hawaiiensis",
    "intro": "Acacia koa var. hawaiiensis, commonly known as the Hawaiian koa tree, is a native species of Hawaii characterized by its distinctive bipinnate leaves and fragrant, yellowish-orange flowers. It belongs to the Fabaceae family and is well adapted to the tropical climate of the Hawaiian Islands. The tree can grow up to 30 meters tall, with a straight trunk and a broad, spreading crown. Its bark is smooth and grayish, while its wood is highly valued for its strength and aesthetic qualities. The plant plays an important ecological role in the native forests of Hawaii.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia koa var. hawaiiensis is primarily native to the Hawaiian Islands, specifically the island of Hawaii. This plant is found in the wetter, more mesic to wet forest habitats of the island's highlands. It thrives in areas with consistent rainfall and well-drained soils. The species is part of the Acacia genus, which is native to various parts of the world, but this particular variety is endemic to Hawaii. Due to its limited distribution and ecological significance, it is considered a valuable component of Hawaii's native flora.",
    "distribution_introduced_art_desc": "Acacia koa var. hawaiiensis was mainly introduced to the Hawaiian Islands as an ornamental plant due to its aesthetic appeal and unique appearance. It was also used in traditional Hawaiian practices and for its valuable timber. However, its introduction has led to concerns about its potential invasiveness in native ecosystems. Despite its popularity, it is not widely cultivated outside of Hawaii. Its distribution remains primarily limited to the island of Hawaii."
}
