{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia hexaneura",
    "plant_slug": "acacia-hexaneura",
    "plant_name_scientific": "acacia hexaneura",
    "intro": "Acacia hexaneura, commonly known as the narrow-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its slender, often twisted branches and small, bipinnate leaves that are typically green with a slight blue or greyish tinge. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical inflorescences. Its seed pods are slender and straight, containing small, flat seeds. Acacia hexaneura is well adapted to arid and semi-arid environments, making it a resilient component of native Australian flora.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia hexaneura"
    },
    "taxonomy_art_desc": "Acacia hexaneura belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, which comprises ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with a wide range of morphological diversity. Its order is Fabales, which consists of flowering plants that are typically legumes, often having compound leaves and pods as fruits. Its family is Fabaceae, commonly known as the legume or bean family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their phyllodes and often used in traditional medicine and as sources of timber. Its species is Acacia hexaneura, a specific type of acacia found in certain regions, known for its unique morphology and ecological significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "South Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia hexaneura is primarily native to South Australia. It is commonly found in the arid and semi-arid regions of the state. This species thrives in sandy soils and is often seen along coastal dunes and inland scrublands. It plays an important role in stabilizing soil and providing habitat for native wildlife. Acacia hexaneura is well adapted to the harsh climatic conditions of South Australia.",
    "distribution_introduced_art_desc": "Acacia hexaneura was mainly introduced to South Africa as a potential source of timber and for its ability to thrive in arid conditions. It was also introduced for its use in soil stabilization and as a forage plant for livestock. However, it has since become invasive in some regions, outcompeting native vegetation and altering local ecosystems. Its rapid growth and adaptability have made it a challenge for land managers. Despite its ecological impact, it remains an important species in certain agricultural and environmental contexts."
}
