{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia domingensis",
    "plant_slug": "acacia-domingensis",
    "plant_name_scientific": "acacia domingensis",
    "intro": "Acacia domingensis, commonly known as the Dominican acacia, is a flowering plant native to the Caribbean, particularly the Dominican Republic. It is a small to medium-sized tree that can grow up to 10 meters in height, with a straight trunk and a rounded crown. The plant produces small, yellow flowers arranged in dense, globular clusters, which are typical of the Acacia genus. Its leaves are bipinnate, consisting of multiple pairs of small, feather-like leaflets. The tree is adapted to tropical climates and is often found in dry, open habitats.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia domingensis is primarily native to the Caribbean islands, particularly the Dominican Republic and Haiti. It is commonly found in dry, rocky areas and coastal regions. This species thrives in well-drained soils and is adapted to tropical and subtropical climates. It is often seen growing in open landscapes and along roadsides. Due to its hardy nature, it is also occasionally cultivated in other parts of the world.",
    "distribution_introduced_art_desc": "Acacia domingensis was mainly introduced to the Caribbean region, particularly in the islands of the Greater Antilles. It was brought there for its ornamental value due to its distinctive foliage and ability to thrive in tropical climates. The plant has since become naturalized in several areas, often growing along roadsides and in disturbed soils. Its introduction has raised concerns about its potential impact on native plant communities. Despite its beauty, it is considered an invasive species in some parts of its introduced range."
}
