{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia pseudoarabica",
    "plant_slug": "acacia-pseudoarabica",
    "plant_name_scientific": "acacia pseudoarabica",
    "intro": "Acacia pseudoarabica, commonly known as the false arabica acacia, is a species of flowering plant in the legume family Fabaceae. It is native to parts of Africa, particularly Ethiopia, and is characterized by its slender, branched stems and bipinnate leaves. The plant produces small, yellowish-green flowers that are clustered in spherical heads, followed by flat, pod-like fruits containing seeds. Acacia pseudoarabica is adapted to arid and semi-arid environments, showcasing drought resistance through its deep root system and reduced leaf surface area. It plays a role in local ecosystems by providing habitat and food for various insects and small animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia pseudoarabica is primarily native to the Horn of Africa, including countries such as Eritrea, Ethiopia, and Somalia. It is also found in parts of Sudan and the Arabian Peninsula. This plant thrives in arid and semi-arid environments, often growing in savannas and along rocky outcrops. It is well adapted to dry climates with poor soil conditions. Its distribution is closely linked to regions with a tropical or subtropical climate.",
    "distribution_introduced_art_desc": "Acacia pseudoarabica was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in regions of Africa, particularly in countries like Sudan, Eritrea, and Ethiopia. This plant is often used for its timber, as a source of fodder, and for its ability to stabilize soil in degraded landscapes. Its introduction has sometimes led to ecological concerns due to its potential to outcompete native species. Despite these challenges, it remains an important species in certain agroforestry systems."
}
