{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia acatlensis",
    "plant_slug": "acacia-acatlensis",
    "plant_name_scientific": "acacia acatlensis",
    "intro": "Acacia acatlensis, commonly known as the Mexican acacia, is a shrub or small tree native to Mexico and parts of Central America. It belongs to the Fabaceae family, which is characterized by its leguminous properties and nitrogen-fixing ability. The plant is distinguished by its slender, often thorned stems and bipinnate leaves that are typically small and feathery. Its yellow flowers are clustered in cylindrical inflorescences, and it produces small, woody pods containing seeds. Acacia acatlensis is often found in dry, rocky habitats and is adapted to arid environments.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia acatlensis is primarily native to the tropical and subtropical regions of Central America, including parts of Mexico, Belize, Guatemala, and Honduras. It is commonly found in dry forests, savannas, and along riverbanks in these areas. This plant thrives in well-drained soils and is often associated with disturbed or secondary growth habitats. It plays an important ecological role by providing food and shelter for various wildlife species. Due to its adaptability, it is also sometimes cultivated in ornamental gardens in the region.",
    "distribution_introduced_art_desc": "Acacia acatlensis was mainly introduced to areas with arid or semi-arid climates, where it can thrive in poor soil conditions. It is commonly found in regions of Mexico, particularly in the states of Oaxaca and Chiapas. This plant is often used for its hardy nature and ability to provide shade and erosion control. It has also been introduced to parts of Central America and the southern United States. Due to its adaptability, it has become an important species in reforestation and land stabilization efforts."
}
