{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia chrysothrix",
    "plant_slug": "acacia-chrysothrix",
    "plant_name_scientific": "acacia chrysothrix",
    "intro": "Acacia chrysothrix, commonly known as the golden wattle, is a shrub native to Australia. It is characterized by its feathery, yellowish-green foliage and produces small, yellow flowers that bloom in spring. The plant is part of the legume family, Fabaceae, and has a symbiotic relationship with nitrogen-fixing bacteria. Its distinctive appearance makes it a popular ornamental plant, and it plays a role in stabilizing soils in arid regions. The seeds are often used in traditional Aboriginal practices and for commercial purposes.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia chrysothrix is primarily native to eastern Australia, including regions in New South Wales and Queensland. It is commonly found in dry sclerophyll forests and woodland habitats. This species thrives in sandy or loamy soils and is often associated with coastal and inland areas. It plays an important ecological role by providing food and shelter for native wildlife. Acacia chrysothrix is well adapted to the seasonal rainfall patterns of its native range.",
    "distribution_introduced_art_desc": "Acacia chrysothrix was mainly introduced to areas with well-drained soils and moderate to high rainfall, typically in tropical and subtropical regions. It thrives in open landscapes such as savannas, grasslands, and disturbed sites. The plant is often found in coastal areas and can tolerate saline conditions. Its introduction has been associated with both ornamental horticulture and land rehabilitation projects. However, it has also become invasive in some regions, outcompeting native vegetation."
}
