{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia aspera",
    "plant_slug": "acacia-aspera",
    "plant_name_scientific": "acacia aspera",
    "intro": "Acacia aspera, commonly known as the rough acacia, is a shrub or small tree native to southern Africa. It is characterized by its slender, often spiny branches and compound leaves that are typically trifoliate. The plant produces yellow flowers arranged in dense, globular clusters, which are followed by flat, pod-like fruits. Acacia aspera thrives in arid and semi-arid environments, adapting well to poor soils and drought conditions. It is often used in traditional medicine and as a source of timber and fuelwood.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia aspera"
    },
    "taxonomy_art_desc": "Acacia aspera belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, which encompasses a group of vascular plants that includes ferns and horsetails, known for their complex vascular systems. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species and is characterized by their diverse floral structures. Its order is Fabales, which consists of flowering plants that typically have flowers with a distinctive structure and often include legumes and other plants with nitrogen-fixing capabilities. Its family is Fabaceae, commonly known as the legume or pea family, which is recognized for its distinctive fruit type and nitrogen-fixing ability through symbiotic bacteria. Its genus is Acacia, a large group of shrubs and trees commonly found in arid and tropical regions, known for their unique acorn-like pods and often used in traditional medicine. Its species is Acacia aspera, a specific type of acacia characterized by its rough, thorny stems and small, clustered leaves, commonly found in dry environments.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "New South Wales",
        "Victoria"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia aspera is primarily native to New South Wales and Victoria. It is commonly found in the dry sclerophyll forests and woodlands of these regions. The plant thrives in well-drained soils and is often associated with rocky or sandy habitats. It is an important component of the local flora, contributing to the biodiversity of the area. Its distribution is largely confined to the southeastern part of Australia.",
    "distribution_introduced_art_desc": "Acacia aspera was mainly introduced to regions with dry, warm climates where it can thrive in well-drained soils. It is commonly found in areas with low rainfall and high solar exposure, such as parts of Australia and the Mediterranean. This plant is often used for erosion control due to its deep root system and ability to fix nitrogen. It has also been introduced to other parts of the world as an ornamental or for land rehabilitation purposes. However, in some areas, it has become invasive, outcompeting native flora and altering local ecosystems."
}
