{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia myrtifolia f. normalis",
    "plant_slug": "acacia-myrtifolia-f-normalis",
    "plant_name_scientific": "acacia myrtifolia f. normalis",
    "intro": "Acacia myrtifolia f. normalis, commonly known as the common acacia, is a shrub or small tree native to parts of Africa and the Arabian Peninsula. It is characterized by its slender, often thornless branches and bipinnate leaves composed of small, ovate leaflets. The plant produces yellow to golden-green globular inflorescences, which are rich in nectar and attract various pollinators. It thrives in arid and semi-arid environments, showing adaptability to poor soils and drought conditions. The plant is often used in traditional medicine and as a source of timber and fuel.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia myrtifolia f. normalis is primarily native to southern Africa, specifically South Africa. It is found in the eastern and western regions of the country, including the coastal areas and parts of the inland. This plant thrives in sandy or rocky soils and is commonly found in coastal dune environments. It is well adapted to the arid and semi-arid climates of its native range. The species is also occasionally seen in neighboring countries such as Namibia and Botswana.",
    "distribution_introduced_art_desc": "Acacia myrtifolia f. normalis was mainly introduced to areas with a Mediterranean climate, characterized by mild, wet winters and hot, dry summers. It thrives in well-drained soils and is often found in coastal regions and rocky slopes. This plant is commonly used in horticulture for its ornamental value and ability to withstand drought conditions. It has been introduced to several regions outside its native range, including parts of California and South Africa. However, its introduction has raised concerns about its potential invasiveness in certain ecosystems."
}
