{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia stipulosa",
    "plant_slug": "acacia-stipulosa",
    "plant_name_scientific": "acacia stipulosa",
    "intro": "Acacia stipulosa, commonly known as the narrow-leaved wattle, is a shrub or small tree native to Australia. It is characterized by its feathery, bipinnate leaves that are typically narrow and green. The plant produces yellow flowers in late winter to early spring, which are clustered in cylindrical spikes. Its seeds are enclosed in long, slender pods that split open when mature. Acacia stipulosa is well adapted to arid and semi-arid environments, making it a resilient species in native Australian landscapes.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia stipulosa"
    },
    "taxonomy_art_desc": "Acacia stipulosa belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse morphological features. Its order is Fabales, which consists of flowering plants that typically have flowers with five petals and are often legumes. Its family is Fabaceae, commonly known as the legume or pea family, characterized by their distinctive pod fruits and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive foliage and often used in traditional medicine and as sources of timber. Its species is Acacia stipulosa, a specific type of acacia known for its small leaves and is commonly found in arid and semi-arid regions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia stipulosa is primarily native to the Northern Territory and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. Acacia stipulosa is well adapted to the harsh climatic conditions of its native range. It plays an important role in local ecosystems by providing habitat and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia stipulosa was mainly introduced to stabilize soil and prevent erosion in arid and semi-arid regions. It is commonly used in rehabilitation projects due to its ability to thrive in poor soil conditions. The plant is also valued for its drought tolerance and ability to fix nitrogen, improving soil fertility. Its introduction has helped in restoring degraded lands in several parts of Australia and Africa. However, it requires careful management to prevent it from becoming invasive in non-native environments."
}
