{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia platyphylla",
    "plant_slug": "acacia-platyphylla",
    "plant_name_scientific": "acacia platyphylla",
    "intro": "Acacia platyphylla, commonly known as the flat-leaf wattle, is a shrub or small tree native to Australia. It is characterized by its flat, narrow phyllodes that are often covered in a fine layer of white to greyish hairs. The plant produces yellow globular flower heads that appear in late summer to early autumn. It thrives in dry, sandy soils and is often found in coastal and inland regions. Acacia platyphylla is a hardy, drought-tolerant species that plays an important role in stabilizing soil and providing habitat for native wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia platyphylla is primarily native to southern Australia, including parts of New South Wales, Victoria, and South Australia. It is commonly found in dry, open habitats such as grasslands, woodlands, and rocky outcrops. This plant thrives in regions with a temperate to arid climate and well-drained soils. It is often associated with sandy or loamy soils and can tolerate drought conditions. Acacia platyphylla is an important component of the native flora in these areas, providing habitat and food for local wildlife.",
    "distribution_introduced_art_desc": "Acacia platyphylla was mainly introduced to South Africa for its ornamental value and ability to thrive in arid conditions. It is commonly found in regions with low rainfall and well-drained soils. The plant is often used in landscaping due to its attractive foliage and resilience to drought. However, it has also been reported to spread into natural habitats, raising concerns about its potential invasiveness. Its distribution is now expanding beyond its original cultivation areas."
}
