{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia retinodes var. oracia",
    "plant_slug": "acacia-retinodes-var-oracia",
    "plant_name_scientific": "acacia retinodes var. oracia",
    "intro": "Acacia retinodes var. oracia, commonly known as the Oracio acacia, is a shrub or small tree native to arid and semi-arid regions of southern Africa. It is characterized by its slender, often thornless branches and phyllodes that are typically narrow and linear. The plant produces small, yellow globular flowers arranged in dense, spherical inflorescences, which are highly attractive to pollinators. Its leaves are modified into phyllodes, a common adaptation in acacia species to reduce water loss in dry environments. The wood of this species is lightweight and durable, making it useful for various traditional and commercial applications.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia retinodes var. oracia is primarily native to northern Australia, including parts of Queensland and the Northern Territory. It is commonly found in arid and semi-arid regions, growing in sandy or rocky soils. This variety is well adapted to the harsh environmental conditions of the Australian outback. It is often seen in open woodlands and shrublands, where it forms part of the local vegetation. The plant plays an important ecological role in its native habitat, providing shelter and food for various wildlife species.",
    "distribution_introduced_art_desc": "Acacia retinodes var. oracia was mainly introduced to urban and suburban areas for its ornamental value and ability to thrive in disturbed soils. It is commonly used in landscaping due to its hardy nature and attractive foliage. The plant has been reported in several regions of Australia, particularly in Queensland and New South Wales. Its introduction has led to concerns about its potential to become invasive in certain environments. Despite its benefits, its spread requires careful management to prevent ecological disruption."
}
