{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia vomeriformis",
    "plant_slug": "acacia-vomeriformis",
    "plant_name_scientific": "acacia vomeriformis",
    "intro": "Acacia vomeriformis, commonly known as the narrow-leaf wattle, is a flowering plant native to Australia. It is a small to medium-sized shrub that typically grows in dry, sandy soils. The plant produces yellow flowers in spherical clusters, which bloom during the spring and summer seasons. Its leaves are narrow and linear, often arranged in a spiral pattern along the stems. Acacia vomeriformis is well adapted to arid environments and is often used in restoration projects due to its resilience and ability to stabilize soil.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia vomeriformis is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It thrives in sandy soils and is commonly found in shrublands and grasslands. This species is well adapted to drought conditions and can tolerate high temperatures. It plays an important ecological role by providing shelter and food for local wildlife. Its distribution is largely restricted to the central and western parts of the African continent.",
    "distribution_introduced_art_desc": "Acacia vomeriformis was mainly introduced to areas with well-drained soils and a warm, temperate climate, typically found in regions with mild winters and hot, dry summers. It thrives in open landscapes such as grasslands, rocky slopes, and disturbed sites where it can establish itself quickly. The plant is often used for erosion control due to its extensive root system and ability to tolerate poor soil conditions. Its introduction has been noted in parts of southern Europe and North America, where it has become naturalized in certain environments. However, it is considered an invasive species in some regions, outcompeting native vegetation and altering local ecosystems."
}
