{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia helmsiana",
    "plant_slug": "acacia-helmsiana",
    "plant_name_scientific": "acacia helmsiana",
    "intro": "Acacia helmsiana, commonly known as the silver wattle, is a small shrub or tree native to Western Australia. It is characterized by its feathery, bipinnate leaves that are covered in fine, silvery hairs, giving it a distinctive appearance. The plant produces yellow globular flower heads that bloom in spring, attracting a variety of pollinators. It thrives in well-drained soils and is often found in coastal and sandy environments. Acacia helmsiana is also valued for its ecological role in supporting local wildlife and its ornamental appeal in gardens.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia helmsiana"
    },
    "taxonomy_art_desc": "Acacia helmsiana belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes land plants and is characterized by the presence of true roots, stems, and leaves. Its class is Equisetopsida, a group that includes ferns and their allies, known for their vascular systems and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that typically have separate male and female reproductive structures. Its order is Fabales, which includes plants such as beans and peas, known for their symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume family, characterized by pods and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acicular leaves and often symbiotic relationships with nitrogen-fixing bacteria. Its species is Acacia helmsiana, a specific type of acacia found in certain regions, known for its ecological and possibly medicinal significance.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Northern Territory",
        "South Australia",
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia helmsiana is primarily native to the Northern Territory, South Australia, and Western Australia. This plant is commonly found in arid and semi-arid regions within these areas. It thrives in sandy or rocky soils and is often seen in shrublands and open woodlands. Acacia helmsiana is well adapted to the harsh climatic conditions of its native range. Its distribution reflects its ability to survive in low rainfall and high temperature environments.",
    "distribution_introduced_art_desc": "Acacia helmsiana was mainly introduced to New Zealand. It was brought there for its ornamental value and potential for soil stabilization. The plant has since spread beyond its original planting sites. It is now considered an environmental weed in some areas of New Zealand. Its distribution is primarily confined to the North Island, though it has been reported in parts of the South Island as well."
}
