{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia sieberiana subsp. vermoesenii",
    "plant_slug": "acacia-sieberiana-subsp-vermoesenii",
    "plant_name_scientific": "acacia sieberiana subsp. vermoesenii",
    "intro": "Acacia sieberiana subsp. vermoesenii, commonly known as the yellow acacia, is a shrub or small tree native to tropical and subtropical regions of Africa. It is characterized by its slender, often branching stems and bipinnate leaves composed of numerous small leaflets. The plant produces yellow to pale yellow flowers in globular clusters, which are followed by long, slender pods containing seeds. It is adapted to arid and semi-arid environments, often found in savannas and woodland areas. The species is valued for its ornamental appeal and has traditional uses in some African cultures.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia sieberiana subsp. vermoesenii is primarily native to the savannas and woodlands of eastern and southern Africa. It is found in countries such as Kenya, Tanzania, Uganda, and South Sudan. This subspecies thrives in regions with a tropical or subtropical climate. It commonly grows in open habitats with well-drained soils. Its distribution is closely associated with areas that have a distinct dry season and seasonal rainfall patterns.",
    "distribution_introduced_art_desc": "Acacia sieberiana subsp. vermoesenii was mainly introduced to areas with dry to semi-arid climates, where it thrives in well-drained soils. It is commonly found in savannas and woodland areas across sub-Saharan Africa. This subspecies is particularly adapted to regions with seasonal rainfall and can tolerate drought conditions. It is often used for soil stabilization and as a source of timber and fuelwood. Its introduction has been associated with both ecological benefits and potential invasiveness in certain environments."
}
