{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia adenantheroides",
    "plant_slug": "acacia-adenantheroides",
    "plant_name_scientific": "acacia adenantheroides",
    "intro": "Acacia adenantheroides, commonly known as the mimosa tree, is a deciduous shrub or small tree native to tropical and subtropical regions of Africa. It belongs to the legume family, Fabaceae, and is characterized by its bipinnate leaves that fold shut when touched, a trait known as thigmonastic response. The plant produces yellow globular flowers followed by flat, pod-like fruits that contain several seeds. It has adapted to arid environments through its deep root system and ability to fix nitrogen, making it an important species in ecological restoration.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia adenantheroides is primarily native to northern Australia, including regions of Queensland, the Northern Territory, and Western Australia. It is commonly found in arid and semi-arid environments, particularly in sandy soils. This species thrives in open woodlands and shrublands, often growing in association with other drought-tolerant plants. It is well adapted to harsh climatic conditions, including high temperatures and low rainfall. The plant plays an important ecological role in stabilizing soil and providing habitat for native wildlife.",
    "distribution_introduced_art_desc": "Acacia adenantheroides was mainly introduced to areas where it has been used for its hardy nature and ability to thrive in arid conditions. It is commonly found in regions with low rainfall and poor soil quality, making it a valuable plant for land rehabilitation. The distribution of this species has expanded due to its use in agroforestry and as a source of timber and fodder. It has been introduced to several parts of Africa, the Middle East, and South Asia. However, its spread has raised concerns about its potential to become an invasive species in some ecosystems."
}
