{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia tortilis var. pubescens",
    "plant_slug": "acacia-tortilis-var-pubescens",
    "plant_name_scientific": "acacia tortilis var. pubescens",
    "intro": "Acacia tortilis var. pubescens, commonly known as the umbrella thorn acacia, is a shrub or small tree native to arid and semi-arid regions of Africa. It is characterized by its distinctive umbrella-shaped crown formed by its branching pattern. The plant has phyllodes, which are flattened leaf stalks that perform the function of leaves. It produces yellow flowers in summer, followed by pod-like fruits containing seeds. This species is well adapted to harsh environments, exhibiting drought tolerance and nitrogen fixation capabilities.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia tortilis var. pubescens is primarily native to the Horn of Africa, including countries such as Eritrea, Ethiopia, and Somalia. It is also found in parts of the Arabian Peninsula, particularly in Yemen and Saudi Arabia. This plant thrives in arid and semi-arid environments, often growing in rocky or sandy soils. It is commonly found in savannas and along riverbanks in these regions. Its distribution is closely tied to areas with low rainfall and high temperatures.",
    "distribution_introduced_art_desc": "Acacia tortilis var. pubescens was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, such as parts of Africa and the Middle East. This plant is often used for its hardy nature and ability to stabilize soil in degraded landscapes. Its introduction has been primarily for ecological restoration and as a source of timber and fuelwood. The distribution of this species has expanded due to human activity and climate change."
}
