{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia reticulata",
    "plant_slug": "acacia-reticulata",
    "plant_name_scientific": "acacia reticulata",
    "intro": "Acacia reticulata, commonly known as the Indian acacia, is a deciduous shrub or small tree native to South and Southeast Asia. It is characterized by its compound leaves, which are often bipinnate and covered in fine hairs. The plant produces yellow, globular inflorescences that attract pollinators such as bees and birds. Its bark is rough and fissured, often exuding a milky sap when damaged. Acacia reticulata is adapted to arid and semi-arid environments, making it a hardy species in tropical and subtropical regions.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia reticulata is primarily native to Southeast Asia, including countries such as India, Sri Lanka, Myanmar, Thailand, and Indonesia. It is commonly found in tropical and subtropical regions, particularly in dry and semi-arid areas. This plant thrives in open woodlands, savannas, and along roadsides. It is well adapted to harsh environmental conditions and can tolerate poor soil quality. Acacia reticulata is also known for its nitrogen-fixing ability, which makes it an important plant in ecological restoration efforts.",
    "distribution_introduced_art_desc": "Acacia reticulata was mainly introduced to areas where it can thrive in tropical and subtropical climates, particularly in regions with well-drained soils. It is commonly found in parts of Southeast Asia, including countries like India, Sri Lanka, and Indonesia. The plant is often used for its hardy nature and ability to withstand drought conditions. Its introduction has been primarily for ornamental purposes and as a source of timber. However, in some regions, it has become an invasive species, outcompeting native vegetation."
}
