{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia cupeyensis",
    "plant_slug": "acacia-cupeyensis",
    "plant_name_scientific": "acacia cupeyensis",
    "intro": "Acacia cupeyensis, commonly known as the Cuban acacia, is a shrub native to Cuba and the Bahamas. It belongs to the Fabaceae family, which includes legumes, and is characterized by its compound leaves and yellow flowers. The plant has small, thorn-like structures that help protect it from herbivores. Its seeds are encased in a woody pod, and it is often found in dry, coastal areas. Acacia cupeyensis plays a role in stabilizing sandy soils and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia cupeyensis is primarily native to the Caribbean islands, particularly Cuba, Hispaniola, and the Bahamas. It is commonly found in dry, sandy soils in coastal areas and limestone formations. This species thrives in arid and semi-arid climates, often growing in open woodlands or along the edges of forests. Acacia cupeyensis is well adapted to the tropical and subtropical conditions of its native range. Its distribution is limited to specific regions where it plays a role in local ecosystems.",
    "distribution_introduced_art_desc": "Acacia cupeyensis was mainly introduced to the Caribbean region, particularly in the islands of Cuba and Hispaniola. It was brought there for its ornamental value and potential use in soil stabilization. The plant has adapted well to the tropical climate and is now found in various habitats, including coastal areas and disturbed soils. However, its introduction has raised concerns about its potential impact on native ecosystems. Despite its beauty, Acacia cupeyensis is considered an invasive species in some parts of its introduced range."
}
