{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia translucens var. typica",
    "plant_slug": "acacia-translucens-var-typica",
    "plant_name_scientific": "acacia translucens var. typica",
    "intro": "Acacia translucens var. typica, commonly known as the translucent acacia, is a shrub native to the arid regions of Australia. It is characterized by its slender, erect stems and small, yellow flowers that bloom in clusters. The leaves are bipinnate, consisting of numerous tiny, thread-like leaflets. This plant is adapted to survive in dry conditions, storing water in its stems and having a deep root system. It plays an important role in stabilizing soils and providing habitat for local wildlife.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia translucens var. typica is primarily native to the arid and semi-arid regions of southern Africa, particularly in countries such as Namibia, Botswana, and South Africa. It is commonly found in sandy soils and rocky outcrops, thriving in environments with low rainfall and high temperatures. This variety is often associated with shrubland and grassland ecosystems, where it plays a role in stabilizing soil and providing habitat for local wildlife. Its distribution is limited to specific ecological niches that support its growth and survival. Due to its specialized habitat requirements, it is not widely distributed beyond these regions.",
    "distribution_introduced_art_desc": "Acacia translucens var. typica was mainly introduced to regions with arid or semi-arid climates, where it thrives in well-drained soils. It is commonly found in areas with low rainfall and high temperatures, making it suitable for regions such as parts of Australia, South Africa, and the southwestern United States. This plant is often used for windbreaks and soil stabilization due to its deep root system and drought tolerance. It has also been introduced as an ornamental plant because of its distinctive yellow flowers and feathery foliage. However, in some areas, it has become invasive, outcompeting native vegetation and altering local ecosystems."
}
