{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia collegialis",
    "plant_slug": "acacia-collegialis",
    "plant_name_scientific": "acacia collegialis",
    "intro": "Acacia collegialis, commonly known as the white acacia, is a shrub native to parts of Australia. It is characterized by its slender, often multi-branched stems and small, feathery leaves that are typically grey-green in color. The plant produces yellow flowers in globular clusters, which are a key feature during its flowering season. Acacia collegialis is adapted to arid and semi-arid environments, making it resilient to drought conditions. It plays a role in stabilizing soils and providing habitat for various small animals and insects.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia collegialis"
    },
    "taxonomy_art_desc": "Acacia collegialis belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes all land plants and is characterized by the presence of true stems, leaves, and roots. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their primitive vascular structures and spore reproduction. Its subclass is Magnoliidae, a group of flowering plants that includes many economically important species with diverse floral structures. Its order is Fabales, which consists of flowering plants that are often legumes and have symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, characterized by pod fruits and often nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees known for their distinctive acorn-like seed pods and often used in traditional medicine. Its species is Acacia collegialis, a specific type of acacia found in certain regions, noted for its unique characteristics and ecological role.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Western Australia"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia collegialis is primarily native to Western Australia. It is commonly found in the sandy soils of the coastal regions and inland areas of the state. This species thrives in arid and semi-arid environments, often growing in shrublands and open woodlands. Its distribution is largely restricted to the southern and western parts of Western Australia. It plays an important ecological role in stabilizing soils and providing habitat for local wildlife.",
    "distribution_introduced_art_desc": "Acacia collegialis was mainly introduced to New Zealand as an ornamental plant due to its attractive foliage and drought tolerance. It has since spread beyond cultivated areas and is now considered a potential weed in some regions. The plant thrives in a variety of soil types but prefers well-drained conditions. It is commonly found in coastal and inland areas where it can establish itself along roadsides and disturbed sites. However, its invasive potential remains a topic of ongoing ecological study."
}
