{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia disparrima subsp. calidestris",
    "plant_slug": "acacia-disparrima-subsp-calidestris",
    "plant_name_scientific": "acacia disparrima subsp. calidestris",
    "intro": "Acacia disparrima subsp. calidestris, commonly known as the desert acacia, is a shrub native to arid and semi-arid regions of southern Africa. It is characterized by its small, elliptical leaves that are often reduced to spines, a feature that helps reduce water loss in its harsh environment. The plant produces yellow flowers in clusters, which attract pollinators such as bees and birds. Its seed pods are woody and contain small, angular seeds that are dispersed by wind. This subspecies is well adapted to dry conditions and is often used in traditional medicine and as a source of firewood.",
    "taxonomy": {
        "kingdom": "Plantae",
        "phylum": "Streptophyta",
        "class": "Equisetopsida",
        "subclass": "Magnoliidae",
        "order": "Fabales",
        "family": "Fabaceae",
        "genus": "Acacia",
        "species": "Acacia disparrima"
    },
    "taxonomy_art_desc": "Acacia disparrima subsp. calidestris belongs to the kingdom Plantae. Its phylum is Streptophyta, which includes green algae and land plants, characterized by their complex cellular structures and the presence of chlorophyll. Its class is Equisetopsida, a group that includes ferns and horsetails, known for their vascular systems and often ancient evolutionary origins. Its subclass is Magnoliidae, a diverse group of flowering plants that includes many economically important species, such as roses and magnolias. Its order is Fabales, which comprises plants with distinctive flowers and includes legumes, which often form symbiotic relationships with nitrogen-fixing bacteria. Its family is Fabaceae, commonly known as the legume or pea family, recognized for their fruit pods and nitrogen-fixing abilities. Its genus is Acacia, a large group of shrubs and trees native to Africa, Australia, and the Americas, known for their acacia-like features and often used in traditional medicine. Its species is Acacia disparrima, a specific type within the Acacia genus, which is further divided into subspecies, with subsp. calidestris being a variant adapted to specific environmental conditions.",
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [
        "Queensland"
    ],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia disparrima subsp. calidestris is primarily native to Queensland. It is found in the southern and central regions of the state. This subspecies typically grows in dry, sandy soils and is commonly found in open woodlands and grasslands. It is well adapted to the arid and semi-arid climates of Queensland. The plant plays an important role in the local ecosystem and is often used in landscaping due to its hardy nature.",
    "distribution_introduced_art_desc": "Acacia disparrima subsp. calidestris was mainly introduced to South Africa, particularly in the Western Cape Province. It is commonly found in fynbos vegetation, often growing on rocky slopes and in sandy soils. This subspecies is valued for its ornamental qualities and is sometimes cultivated in gardens. It has also been introduced to other regions with a Mediterranean climate, such as parts of California and Chile. However, its introduction outside its native range is limited due to specific environmental requirements."
}
