{
    "lastmod": "2025-6-7",
    "page_url": "",
    "page_title": "Acacia raddiana var. pubescens",
    "plant_slug": "acacia-raddiana-var-pubescens",
    "plant_name_scientific": "acacia raddiana var. pubescens",
    "intro": "Acacia raddiana var. pubescens, commonly known as the silky acacia, is a shrub or small tree native to parts of Africa. It is characterized by its slender, often twisted branches and its distinctive, feathery, yellow flowers that appear in clusters. The leaves are bipinnate, with small, hairless leaflets that give the plant a delicate appearance. It thrives in arid and semi-arid environments, often growing on rocky soils. The plant is notable for its ecological importance, providing nectar for pollinators and serving as a food source for various animals.",
    "taxonomy": {
        "kingdom": "",
        "phylum": "",
        "class": "",
        "subclass": "",
        "order": "",
        "family": "",
        "genus": "",
        "species": ""
    },
    "distribution-native": [
        "Afghanistan",
        "Albania",
        "Altay",
        "Amur",
        "Austria",
        "Baltic States",
        "Belarus",
        "Belgium",
        "Bulgaria",
        "Buryatiya",
        "Central European Russia",
        "Chita",
        "Czechia-Slovakia",
        "Denmark",
        "East European Russia",
        "East Himalaya",
        "Finland",
        "France",
        "Føroyar",
        "Germany",
        "Great Britain",
        "Greece",
        "Greenland",
        "Hungary",
        "Iceland",
        "Iran",
        "Iraq",
        "Ireland",
        "Irkutsk",
        "Italy",
        "Kamchatka",
        "Kazakhstan",
        "Khabarovsk",
        "Kirgizstan",
        "Krasnoyarsk",
        "Krym",
        "Kuril Is.",
        "Lebanon-Syria",
        "Magadan",
        "Mongolia",
        "Netherlands",
        "North Caucasus",
        "North European Russia",
        "Northwest European Russia",
        "Norway",
        "NW. Balkan Pen.",
        "Pakistan",
        "Poland",
        "Portugal",
        "Primorye",
        "Romania",
        "Sakhalin",
        "Sardegna",
        "Sicilia",
        "South European Russia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Tadzhikistan",
        "Transcaucasus",
        "Turkmenistan",
        "Tuva",
        "Türkey",
        "Türkey-in-Europe",
        "Ukraine",
        "Uzbekistan",
        "West Himalaya",
        "West Siberia",
        "Yakutiya"
    ],
    "distribution_native": [],
    "distribution_introduced": [],
    "distribution_native_art_desc": "Acacia raddiana var. pubescens is primarily native to the arid and semi-arid regions of southern Africa, including countries such as Namibia, Botswana, and parts of South Africa. It is commonly found in savannas, rocky outcrops, and sandy soils where it thrives in dry conditions. This variant is well adapted to the harsh climate of its native habitat, showing resilience to drought and high temperatures. It plays an important ecological role by providing shelter and food for local wildlife. Its distribution is largely confined to the southwestern and central regions of the African continent.",
    "distribution_introduced_art_desc": "Acacia raddiana var. pubescens was mainly introduced to areas with well-drained soils and moderate climates, particularly in regions where it is used for erosion control and as a source of timber. It thrives in open habitats such as savannas, grasslands, and rocky outcrops. The plant is often found in disturbed soils and can tolerate drought conditions, making it suitable for reclamation projects. Its introduction has been noted in parts of Africa, the Middle East, and some regions of Australia. Due to its adaptability, it has become naturalized in several locations outside its native range."
}
